[
    {
        "id": "30528575",
        "title": "Android Software Developer till Innovativt Bolag",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Har du erfarenhet av androidutveckling och söker en ny utmaning i kundnära projekt? Då ska du läsa vidare.\n\nOM TJÄNSTEN:\nI rollen som Android Software Developer kommer du att arbeta med plattformsnära komponenter och system som driver moderna infotainmentsystem för fordon. Du bidrar till Androids systemtjänster, ramverk och plattformsfunktioner och säkerställer prestanda, tillförlitlighet och smidig integration mellan hårdvara och applikationslager.\nDu kommer vidare att utveckla ny plattformsfunktionalitet i Java/Kotlin med integrerade inbyggda C++-komponenter. Du kommer även få delta i design- och kodgranskningar samt stötta CI/CD-pipelines. Samarbetet sker i kundprojekt och tvärfunktionella ingenjörsteam som bidrar både till funktionsutveckling och den långsiktiga utvecklingen av plattformen.\nDu kommer till exempel att:\nUtveckla och underhålla Android-funktioner för infotainment i fordon.\nImplementera samt utveckla funktioner i Java/Kotlin och integrera med inbyggda C++-lager.\nGenomföra design- och kodgranskningar av plattformskomponenter.\nStötta CI/CD-pipelines med Jenkins och upprätthålla tydlig dokumentation.\nBidra till Android OS-uppgraderingsprojekt och säkerställa kompatibilitet med hårdvara och applikationer.\nVI SÖKER DIG SOM:Har en högskole- eller universitetsutbildning inom datateknik, elektronik, mekatronik eller motsvarande.\nHar erfarenhet av Androidutveckling, gärna inom infotainmentsystem eller likvärdigt.\nBesitter kunskaper i Java och Kotlin.\nHar kunskaper inom Python för scripting och automation.\nÄr flytande i svenska och engelska då språken kommuniceras internt och externt.\n\nDet är meriterande om du har:\nErfarenhet av C++ för inbyggd integration.\nKunskap om infotainmentsystem för fordon och hybrida utvecklingsmiljöer.\nDokumenterad erfarenhet av Android-versionsuppgraderingar, API-förändringar, plattforms­migreringar och validering i fordons- eller inbyggda miljöer\n\n\nVidare kommer stor vikt att läggas vid personlig lämplighet där vi som person tror att du ser komplexa system som fulla av möjligheter och trivs med att arbeta praktiskt för att förstå hur varje del hänger ihop. Du håller dig uppdaterad inom ditt område och delar gärna med dig av din kunskap. Du uppskattar ansvar från start till mål och är bekväm med att ifrågasätta antaganden för att hitta smartare och mer effektiva lösningar. Vi tror även att du är kommunikativ och trivs i agilt projektarbete.\n\nÖ",
        "url": "https://pnty-apply.ponty-system.se/friday?id=4165&pnty_src=arbetsformedlingen",
        "published": "2026-01-27T16:48:15",
        "deadline": "2026-03-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30497442",
        "title": "Naturvetare/civilingenjör med intresse för datahantering och havet",
        "employer": "Sveriges Meteorologiska och Hydrologiska Institu",
        "location": "Göteborg",
        "description": "SMHI söker nu en engagerad medarbetare som vill bidra till hållbara och säkra oceanografiska dataflöden – från havet till internationella databaser. Hos oss får du kombinera teknik, havsmiljö och samarbete i ett uppdrag som gör skillnad.\n\nVid SMHIs avdelning Samhällsplanering finns gruppen Oceanografi som består av 19 medarbetare som arbetar med marina data och information kopplat till miljöövervakning, fysikalisk och kemisk oceanografi samt marinbiologi. Arbetet utförs genom uppdrag som ofta är knutna till havsmiljödirektivet, vattendirektivet eller liknande överenskommelser inom havs- och vattenmiljöområdet.\n\nGruppen ansvarar för stora delar av det oceanografiska dataflödet från insamling till export till internationella databaser. Detta med anledning av att SMHI är utsedd till nationellt oceanografiskt datacenter samt är datavärd inom oceanografi och marinbiologi på uppdrag av Havs- och vattenmyndigheten.\n\nOm tjänsten\n\nFör att stärka gruppens arbete med hantering av oceanografiska data söker vi nu en naturvetare/civilingenjör med kompetens inom datahantering och med intresse för det marina området. Du kommer att jobba tillsammans med våra experter för att utveckla verksamheten, bland annat för att möta nya krav på säkerhetsklassade data.\n\nTjänsten är inriktad mot förvaltning och etablering av processer som utvecklar och säkerställer en långsiktig och hållbar drift av de oceanografiska dataflödena med fokus på tillgänglighet och säkerhet. Det kan innebära systemutveckling, kvalitetskontroll, databashantering, visualisering med mera. Hos oss får du arbeta med hela kedjan från idé till slutgiltigt resultat.\n\nAnställningen kan komma att innebära placering i säkerhetsklass. En godkänd säkerhetsprövning med registerkontroll enligt säkerhetsskyddslagen (2018:585) är i så fall förutsättningar för anställning.\n\nOm dig\n\nVi söker dig som är naturvetare eller civilingenjör inom marin vetenskap eller systemutveckling/datahantering, alternativt med utbildning/erfarenhet som SMHI bedömer som likvärdig. Erfarenhet och teknisk kunskap inom programmering liksom modell- och/eller systemutveckling, samt kunskaper inom Python eller liknande språk är ett krav. Grundläggande kunskaper i svenska och engelska krävs och goda kunskaper är meriterande.\n\nDet är meriterande med:\n\n\n• Relevant arbetslivserfarenhet inom IT eller naturvetenskap\n• Längre erfarenhet av programmering, samt med koppling till marina data\n• Ämneskompetens inom marina vetenskaper\n• Licentiat eller doktorsgrad inom vad SMHI bedömer relevant område\n• Erfarenhet av arbete med stora datamängder och komplexa flöden\n• Erfarenhet av system för kvalitetskontroll av data\n• Kompetens inom systemarkitektur\n\nStor vikt kommer att läggas vid personliga egenskaper, och för att trivas och lyckas i rollen krävs god kommunikativ förmåga och ett strukturerat arbetssätt. Vi söker en person som uppskattar problemlösning och har en god analytisk förmåga som kan ta fram kreativa lösningar på de problem som vi ställs inför. Lösningar tas ofta fram i samarbete med kollegor och uppdragsgivare. Det är därmed viktigt att trivas i samarbetet med andra och att ha en förmåga att kunna förmedla kunskap och idéer. Arbetsuppgifterna kräver också ett strukturerat, självständigt och noggrant arbetssätt, men samtidigt med flexibiliteten av att saker kan ändras.\n\nVälkommen med din ansökan\n\nAnställningsform: Tillsvidareanställning\n\nPlaceringsort: Göteborg, nationella och internationella resor kan förekomma.\n\nSista ansökningsdag: Söndag 15 februari\n\nLäs mer om SMHI som arbetsplats och om vårt erbjudande här.\n\nSMHI är en svensk expertmyndighet med globalt perspektiv och en livsviktig uppgift i att förutse förändringar i väder, vatten och klimat. Med vetenskaplig grund och genom kunskap, forskning och tjänster bidrar vi till att öka hela samhällets hållbarhet. Varje dag, dygnet runt, året om.\n\nSMHI är en beredskapsmyndighet och som anställd kan du komma att krigsplaceras vid myndigheten.\n\nTänk på att de handlingar och uppgifter du skickar till SMHI genom din ansökan blir en allmän handling. Detta betyder att allt material i ansökan, inklusive bilagor, kan behöva lämnas ut till den som begär det om uppgifterna inte omfattas av sekretess enligt offentlighets- och sekretesslagen. Tänk på att i första hand skriva det som du bedömer är relevant i förhållande till kraven på tjänsten. Tänk på din integritet och undvik att lämna information som innehåller känsliga personuppgifter, uppgifter om din eller närståendes hälsa, politiska åsikter eller religiös övertygelse.",
        "url": "https://go.talentech.io/7zAhk",
        "published": "2026-01-20T16:22:44",
        "deadline": "2026-02-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30387039",
        "title": "Engineering Tools Specialist – COMOS",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Företagsbeskrivning\nAFRY erbjuder tjänster inom teknik, design, digitalisering och rådgivning. Vi är hängivna experter inom industri, energi- och infrastruktur, som skapar värde för kommande generationer. AFRY har en global räckvidd med djupa rötter i Norden. Tillsammans accelererar vi omställningen till ett mer hållbart samhälle.\n\nJobbeskrivning\nVill du arbeta med avancerade ingenjörsverktyg och vara med och driva digitaliseringen av industrin? AFRY stärker nu sitt team och söker en Engineering Tools Specialist – COMOS till våra industri- och anläggningsprojekt.\n \nOm rollen\nI rollen som Engineering Tools Specialist – COMOS hos AFRY arbetar du med Siemens COMOS, ett ingenjörs- och informationshanteringsverktyg för strukturerad hantering av tekniska anläggningsdata genom hela livscykeln, från design och projektering till drift och underhåll. COMOS används som central plattform inom branscher såsom processindustri, energi, kemi, pharma, olja & gas samt tillverkningsindustri och fungerar ofta som navet i ett integrerat systemlandskap.\n\nRollen har ett tydligt utvecklingsfokus och omfattar implementering, konfiguration och vidareutveckling av COMOS, inklusive datamodeller, systemintegrationer och informationsflöden, där du fungerar som teknisk expert och super user och stöttar projektteam och kunder genom hela anläggningens livscykel.\n \nDu kommer att:\nArbeta med COMOS-modellering, databasstruktur och objekthantering\nDelta i och driva COMOS-implementationer i projekt\nVidareutveckla COMOS genom konfiguration, anpassningar och tekniska lösningar\nArbeta med systemintegrationer mot andra verktyg och system (E3D, EPLAN, PCS7/PAA m.fl.)\nStötta discipliner såsom process, el, instrument och automation\n\n\nKvalifikationer\nVi söker dig som\nHar flerårig erfarenhet av arbete med COMOS (Siemens)\nHar bakgrund inom processindustri, energi, pharma, kemi eller liknande\nFörstår ingenjörsdata och dess användning genom hela anläggningens livscykel\nHar ett starkt tekniskt intresse och trivs i en utvecklingsnära roll\nHar programmeringskunskaper i C++, C#, .NET\nHar erfarenhet av systemintegrationer och arbete med XML-filer\nHar goda kunskaper i SQL och databashantering\nÄr strukturerad, lösningsorienterad och kommunikativ\nTalar och skriver svenska och engelska obehindrat\n\n\nYtterligare information\nVi erbjuder\nHos AFRY får du möjlighet att arbeta i tekniskt avancerade och multidisciplinära projekt med starkt fokus på innovation, digitalisering och hållbarhet. Vi erbjuder:\nSpännande uppdrag hos ledande industrikunder\nEn central specialistroll inom Engineering Tools och digitala plattformar\nGoda möjligheter till teknisk och professionell utveckling\nEn inkluderande företagskultur med engagerade och kunniga kollegor\nFlexibla arbetsformer och god balans mellan arbete och fritid\n \n\nVälkommen med din ansökan, sista ansökningsdag är 2026-02-23\n\n\n\n \nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen\n \n \n\nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000104632075-engineering-tools-specialist-comos?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-12-17T09:30:34",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30551123",
        "title": "Experienced Software Engineer",
        "employer": "L&T Technology Services Sverige Filial",
        "location": "Göteborg",
        "description": "L&T Technology Services Limited (LTTS) is a global leader in Engineering and R&D (ER&D) services.\nWe are hiring in Solna, Sweden!\nWould you like to join a team with innovation, teamwork and entrepreneurship as the fundamental platform?\nWe are looking for experienced Software Engineers for the Automotive Industry\nRole Overview:\nThe Software Engineer is responsible for designing, implementing, and testing software components for the Tachography system. Engineers should have development skills in CAN, Diagnostics, language embedded C. This role ensures compliance with safety-critical standards, coding guidelines, and project requirements while contributing to high-quality, maintainable software\nKey Responsibilities\n1. Design & Implementation\nTranslate software requirements into detailed design and code.\nImplement new features and enhancements on the commonized code base.\nFollow SRE coding guidelines, best practices, and MISRA compliance for safety-critical software.\nMaintain clean, modular, and reusable code adhering to industry standards.\n\n2. Static Code Analysis\nPerform static code analysis.\nAddress all code quality issues and ensure compliance with coding standards.\n\n3. Unit Testing & Coverage\nDevelop and execute unit test cases for individual software components.\nGenerate and review MC/DC coverage reports to ensure completeness.\nAutomate unit tests where possible.\n\n4. Integration Support\nCollaborate with Integration Test Engineers to ensure smooth module integration.\nResolve defects identified during integration and qualification testing.\n\n5. Documentation & Traceability\nMaintain traceability between requirements, design, implementation, and test artifacts.\nUpdate design documents and code comments for clarity and maintainability.\n\n6. Collaboration\nWork closely with Software Architect, System Engineers, and Test Teams.\nParticipate in design reviews and provide feedback for improvements.\n\nRequired Skills & Qualifications\nBachelor of Engineering\n4+ years of experience in embedded software development or safety-critical systems.\nStrong programming skills in C.\nKnowledge of real-time operating systems, embedded systems, and safety-critical standards.\nFamiliarity with static analysis tools, unit testing frameworks, and CI/CD pipelines.\nExcellent problem-solving, documentation, and communication skills.\n\nAdditional Skills:\n MCAL layer embedded C developer\nwith detailed understanding of serial, UART and IO code and debugging\nhands on with clear understanding of HW-SW interface including electrical aspects and debugging.\nUnderstanding of code flow from FreeRTOS to lower layers.",
        "url": null,
        "published": "2026-02-02T12:45:45",
        "deadline": "2026-03-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30540107",
        "title": "Senior Embedded Software Engineer",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "Mid- Senior Embedded Software Engineer with Android, C++ and Python as their main language as well us an understanding of system architecture.\nTeam works with Build configuration, Android version bring up and SW complexity reduction\nTo be successful in this role, your experience must include: \n\t•\tEmbedded Software Development of complex software products using C++ and Python.\n\t•\tEmbedded OS or Linux experience.\n\t•\tDevelopment within android platform\n\t•\tWorking experience in a CI environment.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n\t•\tCoordinate and communicate with the CI teams to enable the new hardware support quickly and smoothly.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n \nWe'd also prefer if you have: \n\t•\tA Driver’s license (B-level) will also be ideal.\n\t•\tExperience from Automotive Infotainment domain\n\t•\tTest automation experience using Pytest\n\t•\tPrevious working experience with android uplift",
        "url": null,
        "published": "2026-01-29T16:57:00",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30537509",
        "title": "Senior DevOps Engineer",
        "employer": "Goismo AB",
        "location": "Göteborg",
        "description": "DevOps Engineer\nWe are hiring a DevOps Engineer to build, automate, and manage scalable cloud infrastructure and CI/CD pipelines for modern applications.\nResponsibilities:\nDesign and maintain CI/CD pipelines\nManage cloud infrastructure and deployments\nAutomate provisioning using IaC tools\nMonitor system performance and reliability\n\nRequirements:\nExperience with AWS/Azure/GCP\nStrong knowledge of Docker and Kubernetes\nCI/CD tools (GitHub Actions, GitLab CI, Jenkins)\nScripting with Bash/Python",
        "url": "http://www.goismo.com",
        "published": "2026-01-29T12:44:30",
        "deadline": "2026-06-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30531933",
        "title": "Embedded Software Engineer (Android, C++ & Python)",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for an Embedded Software Engineer to join an automotive environment focused on embedded Android platform development. You will work close to the system architecture and contribute to build configuration, Android version bring-up, and reducing software complexity across the platform.\nJob DescriptionDevelop embedded software for complex products using C++ and Python\nWork with build configuration and support Android version bring-up (uplift)\nContribute to software complexity reduction initiatives across the platform\nDevelop, improve, test, and maintain the hardware platform enablement\nWork in a CI environment to ensure stable and efficient deliveries\nCoordinate with CI teams to enable new hardware support quickly and smoothly\nRequirementsExperience in embedded software development of complex products using C++ and Python\nExperience with embedded OS and/or Linux\nDevelopment experience within the Android platform\nHands-on experience working in a CI environment\nExperience with development, testing, and maintenance related to new hardware platform enablement\nNice to haveExperience from the automotive infotainment domain\nTest automation experience using Pytest\nPrevious experience with Android uplift\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7130849-embedded-software-engineer-android-c-python/applications/new?promotion=1811983-arbetsformedlingen",
        "published": "2026-01-28T13:16:05",
        "deadline": "2026-02-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511370",
        "title": "AI Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced AI Engineer to join our team.\nKey Responsibilities:\nBuild and deploy LLM-powered agents for business process automation (e.g., using LangChain, AutoGen, OpenAI).\nImplement Retrieval-Augmented Generation (RAG) pipelines integrating with internal knowledge sources (e.g., Confluence, Google Drive).\nDevelop multi-step reasoning chains, function calling, and agent memory for complex workflows.\nIntegrate agents with third-party APIs (Salesforce, GitHub, Jira, Slack, etc.).\nDefine best practices around prompt engineering, tool usage, and secure API communication.\nCollaborate with cross-functional teams to understand and prioritize automation opportunities.\nTrack AI reliability, hallucination risks, and ethical use across deployed solutions.\nDesign evaluation strategies for agent performance, reliability, and business impact.\nSupport fine-tuning or embedding optimization to improve agent accuracy and task alignment.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\nStrong software engineering background- Python a must; experience with Bash, JavaScript or Golang is a plus.\nHands-on experience with LLM frameworks (LangChain, LlamaIndex) and APIs (OpenAI, Gemini, Claude).\nProficient in integrating external APIs using REST/GraphQL and managing agent workflows.\nComfortable with cloud platforms (preferably GCP/Vertex AI or Azure OpenAI) and containerized environments.\nExperience with RAG, semantic search, vector databases (e.g., Pinecone, FAISS), and prompt templating.\nStrong understanding of security, privacy, and responsible AI practices.\nCurious, experimental, and fast learner with excellent communication skills in English. \nFamiliarity with orchestration frameworks (e.g., CrewAI, MetaGPT, AutoGen) is a strong advantage.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2026-01-23T11:18:10",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511336",
        "title": "Machine Learning Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Machine Learning Engineer to join our team.\nKey Responsibilities:\nEstablish MLOps best practices and patterns for scalable ML deployment.\nDesign and build reproducible ML pipelines and model-serving infrastructure.\nManage and automate CI/CD for ML using GitHub Actions or Azure DevOps.\nOperate in cloud-first environments (GCP, Azure, AWS), using tools like Vertex AI, DBT, Airflow, or Kubeflow.\nImplement observability (model monitoring, drift detection) and infrastructure-as-code (Terraform, Helm).\nCollaborate with Data Scientists, Engineers, and Analysts to move models from notebooks to production.\nEnsure ML workflows align with data governance, security, and compliance standards.\nContribute to LLM-based model serving and fine-tuning pipelines where applicable.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\n4+ years of experience in ML engineering or MLOps in production settings.\nProficient in Python (OOP, testing, clean code, package management).\nExperienced in cloud platforms - GCP, Azure, AWS.\nExperienced with AWS services for ML deployment and infrastructure management, including SageMaker, CloudWatch, and IAM.\nExperience developing RESTful APIs using FastAPI for model serving and inference endpoints, including integration with CI/CD and auth middleware.\nHands-on with CI/CD pipelines, Containerization (Docker, Kubernetes), Infrastructure as Code (Terraform, ArgoCD, etc.), MLFlow, DBT, and Airflow.\nExperience in monitoring/observability strategies for production ML systems, including latency tracking, drift detection, and model version health using Prometheus, Grafana, or Vertex AI Model Monitoring.\nStrong skills in SQL, data modeling, and scalable data pipelines.\nAble to work in agile, cross-functional teams with clear communication and ownership mindset.\nStrong analytical problem-solving skills and love for clean, maintainable systems.\nCurious, experimental, and fast learner with excellent communication skills in English.\nExperience with large language models and LLMOps pipelines is a plus.\nWorking knowledge aligned with GCP/AWS ML certification standards (Vertex AI, IAM, Dataflow) is a plus.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2026-01-23T11:17:30",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30494782",
        "title": "Data Engineer",
        "employer": "Aurobay Sweden AB",
        "location": "Göteborg",
        "description": "Aurobay is part of Horse Powertrain Limited – an independent new powertrain solutions business, with over 125 years of heritage from Renault and Geely. We develop and produce world-class hybrid and combustion engines and transmissions to move our industry forward, offering many different paths to net zero. This role is employed by Aurobay Sweden AB and is based in Sweden, with occasional travel possible to Horse Powertrain’s other sites.\n\n\nWhy join us?\nAt Aurobay, a division of Horse Powertrain, you’ll have opportunities to grow your career while making a difference. This is a dynamic, international environment, staffed by caring and collaborative people. If you’re ready to create excellence with us, you’ll be appreciated and rewarded.\n\n\nWhat we’re looking for\n- A proven track record of Built data platforms on Azure with Databricks and Delta Lake &\nDelivered reusable ingestion and transformation pipelines for multiple data sources.\n\n\n- Experience of implemented data governance controls in a hub-and-spoke or data mesh\narchitecture & Migrated on-prem or siloed data solutions into a centralized cloud\necosystem.\n\n\n- Experience Tuned Spark workloads for performance and scalability & Supported self-\nservice analytics teams with platform capabilities and curated datasets.\n\n\n- Outstanding Proficient with Databricks (Notebooks, Delta Lake, MLflow, Jobs) & Spark\nprogramming using Python (PySpark) or Scala.\n\n\n-Strong Data orchestration using Azure Data Factory, Databricks Workflows, or similar\nskills & CI/CD for data projects (Azure DevOps/GitHub Actions), coupled with a\ncollaborative mindset\n\n\n-Excellent written and spoken English\n\n\nEqual opportunities employer\nAs a company, we are committed to equal opportunities, and recruit people based on their competencies and qualifications. We encourage candidates from underrepresented groups to apply for our job vacancies. If you believe you have the skills and passion to excel in this role, we would love to hear from you. Let’s explore the possibilities together.\n\n\nHow to apply\nDeadline to submit your application is 5th of Feb but the selection process will be running continuously. Please note that due to data regulations, we do not accept applications via email.\nAurobay Sweden is part of Horse Powertrain Ltd - a global leader in powertrain solutions. Learn more at http://www.horse-powertrain.com/\nQuestions concerning trade union:\nUnionen: Ordf Joakim Dahlin, joakim.dahlin@aurobay.com, +46 734 630 172\nLedarna: Ordf Håkan Modigh, hakan.modigh@aurobay.com,+46 733 333 801\nAkademikerna: Ordf. Fredrik Fantenberg, fredrik.fantenberg@aurobay.com, +46 728 889 790\nIF Metall: Ordf Marko Borg Peltonen, marko.borg.peltonen@aurobay.com, +46 733 333 764",
        "url": "https://careers.aurobay.com/jobs/7065571-data-engineer/369f0a46-b07e-4e57-904c-1b8cd79449f2",
        "published": "2026-01-20T11:50:25",
        "deadline": "2026-02-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30448408",
        "title": "Senior Mainframe Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Senior Mainframe Developer – \nWe are looking for a Senior Mainframe Developer to work with Umeå Order & Logistics legacy solutions. The role focuses on maintaining, optimizing, and modernizing mainframe systems as part of our digitalization journey.\nRole Description\nAs a Senior Mainframe Developer, you will:\nManage, maintain, and optimize mainframe computer systems to ensure efficient, stable, and reliable operations.\n\n\nWork closely with a team of IT professionals to support business-critical applications and provide technical expertise in mainframe technologies.\n\n\nMaintain and enhance legacy applications and actively contribute to the organization’s digitalization and modernization initiatives.\n\n\nCollaborate with cross-functional teams to understand requirements and provide technical input for mainframe-based solutions, influencing solution design both within and beyond stable teams.\n\n\nAnalyze application performance and identify opportunities for optimization and improvement.\n\n\nEnsure adherence to coding standards, best practices, and security guidelines in application development and maintenance.\n\n\nModernize legacy applications by integrating mainframe systems with other IT infrastructure components.\n\n\nStay up to date with industry trends and emerging mainframe technologies.\n\n\nContribute to the Chapter team by sharing best practices, mentoring colleagues, and actively participating in knowledge-sharing initiatives.\n\nRequired Skills & Experience\nStrong proficiency in mainframe programming languages and tools such as:\nCOBOL, JCL, VSAM, ISPF, SDSF, MQ, CICS, PL/I, OPCE, Assembler, or equivalent\nExperience with mainframe databases and data management systems such as DB2 or IMS\n\n\nProven experience in modernizing legacy mainframe environments using relevant tools and techniques\n\n\nStrong analytical and problem-solving skills with the ability to diagnose and resolve complex technical issues\n\n\nStrong communication and interpersonal skills, with the ability to collaborate effectively with stakeholders at all levels",
        "url": null,
        "published": "2026-01-09T00:53:50",
        "deadline": "2026-06-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30418080",
        "title": "ServiceNow Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Key Responsibilities\nDesign, develop, and implement solutions on the ServiceNow platform, with a primary focus on the CSM module.\n\n\nCustomize and configure ServiceNow components including forms, workflows, business rules, client scripts, UI policies, UI actions, and notifications.\n\n\nDevelop and manage REST and SOAP integrations with external systems.\n\n\nAnalyze business requirements and translate them into effective technical solutions.\n\n\nTroubleshoot issues, perform root-cause analysis, and deliver timely fixes.\n\n\nCollaborate with cross-functional teams to ensure smooth implementation and continuous improvement of ServiceNow applications.\n\n\nFollow best practices for ServiceNow development, documentation, and version control.\n\nRequired Experience & Skills\n3–6+ years of hands-on experience in ServiceNow development.\n\n\nStrong expertise in the CSM (Customer Service Management) module – configuration, case management, workflows, portals, and integrations.\n\n\nPractical experience with REST and SOAP APIs and building integrations with ServiceNow.\n\n\nStrong understanding of JavaScript, Glide APIs, Flow Designer, IntegrationHub, and ServiceNow platform capabilities.\n\n\nAbility to work independently as well as in collaborative team environments.\n\n\nGood communication and problem-solving skills.\n\nNice-to-Have\nServiceNow certifications such as CSA, CAD, CIS-CSM, or relevant module certifications.\n\n\nExperience working in Agile/Scrum environments.\n\n\nKnowledge of ITIL processes.",
        "url": null,
        "published": "2025-12-22T21:56:00",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357035",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-12-09T21:47:50",
        "deadline": "2026-05-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30306504",
        "title": "Junior AI Systems Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Systems Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking Systems Engineers to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nBased in Gothenburg, we're a compact, high-caliber team evolving Entropia Universe, a long-standing MMO built around a real-cash economy. We care about end-to-end ownership, fast execution, and ego-free collaboration, and we're looking for someone who wants to build seriously, move quickly, and help define the future of MMO games.\nWe value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Junior AI Systems Engineer, you will:\nBuild and integrate intelligent systems into Entropia Universe\nWork with automation, AI, and agentic frameworks to create new in-game behaviors and tools\nHelp optimize our CI/CD and runtime pipelines for performance and quality\nContribute to core systems engineering (C++ and related infrastructure)\nUse AI heavily in your own workflow to move faster and smarter\nTake pride and ownership of your work all the way through to the end user\nThis is a general engineering role, not tied to a single fixed team.\nYou: \nMaster's degree in Computer Science or a similar field, with strong grades preferred\nHuge interest in AI is crucial: you follow new models, tools, and trends and ideally build with them in your spare time\nComfortable with C++ 20; Python is a strong plus.\nStrong interest in:\nAI and agentic frameworks\nSystems engineering and creating great games\nAutomation and building intelligent systems\nProblem solving\nDatabases (SQL and NoSQL) and data-intensive systems\nBasic networking concepts and distributed systems\nContainerization and tooling such as Docker\nPassion for games and how AI can change the video game industry\nLow ego, end-to-end ownership, clear communication.\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field\nA few years of experience within the field\nCreative thinker with a passion for games and a drive to innovate within the gaming space\nProficiency in C++\nProficiency in Python is a strong plus\nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks\nKnowledge of game development principles and methodologies\nProblem-solving and communication skills\nBeing flexible and able to work with a larger technical ecosystem.\n\nWhy Join Mindark: \nWork on a live, large-scale MMO with a real-cash economy\nWork with cutting-edge systems and AI tooling that are still rare in the MMO space\nHigh-impact role in a small, focused team\nCompetitive compensation and plenty of room to grow in the new era of AI\nStrong support and mentorship from highly talented colleagues.\n\nThe opportunities are endless.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: Gothenburg, Sweden (hybrid, ~2 days/week in office)",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-11-26T09:09:10",
        "deadline": "2026-03-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30440064",
        "title": "HIL Developer (Hardware-in-the-Loop) -  Göteborg",
        "employer": "Veritaz AB",
        "location": null,
        "description": "We are looking for highly skilled HIL Developers to support one of our clients within automotive software development. You will work in an advanced environment developing and validating software for AD/ADAS, protective safety systems, and vehicle motion control.\nThe role focuses on developing, maintaining, and improving HIL test environments and CI pipelines, ensuring high availability, stability, and performance of the test infrastructure used by multiple software development teams.\nKey Responsibilities\nHIL Development & Test Infrastructure\nDesign, develop, and update HIL rig solutions based on product team requirements.\nCommission new test rigs and integrate hardware and software components.\nMaintain and continuously improve HIL environments to ensure stability and availability.\nPerform fault tracing and root cause analysis across hardware, software, and infrastructure.\n\nAutomation & CI/CD\nDevelop automation solutions supporting CI pipelines and system test teams.\nImprove CI pipeline performance, reliability, and metrics visualization.\nAct as first-line triage for CI environment disturbances.\nSupport system test automation across multiple product teams.\n\nDocumentation & Collaboration\nMaintain accurate documentation of HIL rigs, configurations, and updates.\nCollaborate closely with software developers, system testers, and CI teams.\nIndependently drive improvements and contribute to continuous optimization initiatives.\n\nRequired Competence & Experience\nHIL & Automotive Testing\nProven experience in HIL development using:\ndSPACE\nVector CANoe\nStrong background in automotive electrical architecture and embedded systems.\nExperience with automotive diagnostic and communication protocols:\nCAN\nLIN\nEthernet\n\nProgramming & Tooling\nProgramming experience in Python, CAPL, and C\nExperience with MATLAB/Simulink\nFamiliarity with Git, command-line tools, and SSH\n\nCI/CD & Automation\nExperience working with CI infrastructure, including:\nPipelines\nDashboards\nMonitoring and metrics\nExperience in test automation frameworks (e.g. Robot Framework) is a plus.\n\nWays of Working & Soft Skills\nStrong automotive domain knowledge combined with excellent communication skills.\nComfortable working in Agile development environments.\nAbility to work independently, drive improvements, and perform structured analysis.\nStrong collaboration skills across cross-functional teams.\n\nLocation :  Göteborg",
        "url": "https://airtable.com/appWFSx6BGg1FmqQh/shre6DE5SpaxhDAWu",
        "published": "2026-01-07T12:32:15",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30517383",
        "title": "FPGA developer & Designer",
        "employer": "Cubane Solutions AB",
        "location": "Göteborg",
        "description": "We are looking for an FPGA developer and an FPGA designer, or two who can take on both roles.  \nIts a long term assignment starting in April.\nA large part of the work takes place on site at the customer's premises, so you should live in/near Gothenburg.\nSwedish or EU citizenship is a requirement. \n\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": null,
        "published": "2026-02-03T11:22:55",
        "deadline": "2026-03-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30466704",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2026-02-01T00:00:00",
        "deadline": "2026-07-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30513928",
        "title": "Software Developer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world's leading manufacturers. Due to our continued growth, we are now recruiting for a Software Developer – Android Automotive, to strengthen our team in Gothenburg.\nThe role\nWe offer you the chance to work in a small cross functional team, with high focus on quality and continuous improvements. Together with your colleagues you will develop and enhance the Navigation functionality in the car to give the end user great experience. \nThe development is done in full stack environment using C++, and the Android tool set. You will use the latest tools and technologies available and collaborate with partners and other teams to deliver state-of-the-art software. You will also test the features by implementing automatic test cases that run in the CI environment.\n In our team we are also involved in testing and trouble shooting in real vehicles which gives interesting real-life insight in our products.\nMain responsibilities'\nYou have a M.Sc. or a B.Sc. within Electronics, Software Engineering or similar with 5 years of relevant work experience from software development using. C++, Python, Java etc. \nYou have experience in Android platform development; Continuous Integration and you are familiar with Agile methods. \nYou have good English skills in both written and spoken form. \n\n\n﻿Knowledge / Experience \nExperience in development in Android automotive – Platform development \nExperience from Automotive Infotainment \nExperience in working Navigation or positioning area \nA valid driver’s license, B-level. \n\nIf you are passionate about bringing innovation to the projects, you work on then we would love to hear from you.\nTata Technologies: Engineering a better world. \nTata Technologies would like to thank all applicants for their interest; each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date, it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2026-01-23T15:05:45",
        "deadline": "2026-02-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30513864",
        "title": "Software Developer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world's leading manufacturers. Due to our continued growth, we are now recruiting for a skilled Software Developer (Android Automotive), to strengthen our team in Gothenburg.  \nThe role: \nWe offer you to work in a small cross functional team, with high focus on quality and continuous improvements. The team is focused on Media Center, Navigation and Voice Control. \nMain responsibilities\nTogether with your colleagues you will develop and enhance the functionality in the car to give the end user a great experience.  \nYou will design and develop touch-based user interfaces to control various parts of the vehicle. \nThe development is done in full stack environment using Java/Kotlin, Python and the Android tool set.\nYou will use the latest tools and technologies available and collaborate with partners and other teams to deliver state-of-the-art software. Automated testing is central to the project so you should have good knowledge of software testing, test driven development and the tools commonly used to implement them in Android development. \nIn our team we are also involved in testing and trouble shooting in real vehicles which gives interesting real-life insight in our products. \n\nKnowledge / Experience \nYou have a M.Sc. or a B.Sc. within Electronics, Software Engineering or similar and you have several years’ experience of Android app development and have good knowledge in Android Java, Kotlin and Android Studio. \nYou will bring experience in AOSP and the AOSP build system, and you are familiar with modern app architectural patterns (MVP, MVVM, layered architecture, refactoring)  \nYou have a good knowledge of Android testing frameworks (Junit, Espresso, Mockito) and you have experience in Continuous Integration. \nYou have good English skills, both written and spoken. \nPreferably, you have a valid driver’s license, B-level  \n\nDesirable\n\tExperience in development in Android automotive  \n\tExperience from Automotive Infotainment \n\nIf you are passionate about bringing innovation to the projects, you work on then we would love to hear from you.\nTata Technologies: Engineering a better world. \nTata Technologies would like to thank all applicants for their interest; each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date, it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2026-01-23T14:56:40",
        "deadline": "2026-02-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30456501",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid!\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n\nC\n\n\nC#\n\n\nC++\n\n\nJava\n\n\nPython\n\n\nGit\n\n\nMatlab\n\n\nVi önskar att du som mjukvaruutvecklare hos oss har: \n\nEn högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n\n\nGenuint teknikintresse\n\n\nMinst 2 eller fler års erfarenhet som mjukvaruutvecklare\n\n\nFörmåga att kommunicera på både svenska och engelska i tal och skrift.\n\n\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 13 februari. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare/applications/new?promotion=1783409-arbetsformedlingen",
        "published": "2026-01-12T10:42:49",
        "deadline": "2026-02-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30456453",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n\nC\n\n\nC#\n\n\nC++\n\n\nJava\n\n\nPython\n\n\nGit\n\n\nMatlab\n\n\nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n\nEn högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n\n\nMinst 5 eller fler års erfarenhet som mjukvaruutvecklare\n\n\nFörmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n\n\nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 13 februari. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg/applications/new?promotion=1783374-arbetsformedlingen",
        "published": "2026-01-12T10:37:39",
        "deadline": "2026-02-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30545273",
        "title": "Firmware Engineer",
        "employer": "Elektron Music Machines Mav AB",
        "location": "Göteborg",
        "description": "Elektron builds state-of-the-art electronic music instruments with deep functionality and exceptional sonic capabilities. With a track record of iconic products such as the Machinedrum, Octatrack and Digitakt, Elektron has become uniquely positioned in the artist and producer community.\nWe’re now expanding our team, to push the boundaries of music creation and meet customer demand!\nWith small teams, flat hierarchy, and high emphasis on creativity, Elektron gives room for every idea to be heard! Joining the Elektron team means being trusted in your abilities.\nDo you want to be a part of the team that creates the best electronic music instruments in the world?\nRole Description\nWe are currently looking for a full-time Firmware Engineer to expand the R&D team. As a firmware engineer at Elektron you will work with the complete software design chain; from product ideas, through prototype stages, to released firmwares and updates in future releases.\nThe embedded software team is responsible for all the programmable aspects of the instruments, ranging from digital logic to high level data management. We develop software for products to come, and we continue to improve the software long after they have been released.\nOur instruments have multi-threading real-time operating systems, and may be composed of multiple micro-controllers and digital signal processors. You will be working at the application level, but you are required to interface the operating system at a lower level.\nYou are passionate about writing code which is reliable as well as efficient. You are comfortable working with a large existing codebase. You are self-motivated and have strong problem solving capabilities.\nThis is an on-site position based in Gothenburg, Sweden.\nRequired skills & experience\nMaster of Science in Computer Science, Electrical Engineering, or similar experience.\nSeveral years of experience with C++.\nSome experience with Python.\nExtensive embedded systems design knowledge.\nGood knowledge about multi-threaded real-time systems.\nGreat problem-solving skills.\nExperience with software architecture and knows how to write maintainable systems.\nKnows Git inside-out and is well familiar with code review.\nGood knowledge of algorithms and data structures.\nA structured way of working, using version control, issue trackers and similar tools.\nSeveral years of working experience in a similar field.\nFluent spoken and written English.\n\nValued skills\nKnowledge in Rust, Digital Signal Processing, USB communication.\nExperience with production testing and a drive for testability.\nExperience with major real-time operating systems such as FreeRTOS, Zephyr etc.\nLow level ARM A/M architecture and ISA knowledge.\nInterest in music instruments (preferably making music).\n\nWhat we offer\nA dynamic and multicultural workplace where you have the opportunity to make a real impact and take ownership. At Elektron, you’ll experience great team spirit and a warm atmosphere, with music at the heart of everything we do. You’ll work closely with all departments and gain a broad understanding of the company, opening doors for professional development and long-term growth. Along the way, you’ll enjoy regular social events, fresh fruit, free parking, a wellness benefit, and more — all backed by the security of a collective agreement.\nStart: As soon as possible, by agreement\nScope: Full-time, permanent position\nLocation: Banehagsliden 5, Gothenburg\nWe usually get back to applicants within 14 days, but due to a high volume of applications, the response time may sometimes be longer — but rest assured, you haven’t been forgotten, and we promise to reach out as soon as we can.\nGreetings from Elektron!",
        "url": "https://careers.elektron.se/jobs/6147177-firmware-engineer",
        "published": "2026-01-30T14:58:35",
        "deadline": "2026-05-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30534097",
        "title": "ADAS Embedded Developer",
        "employer": "Nexer Engineering AB",
        "location": "Göteborg",
        "description": "The future of mobility is evolving, and so are we at Nexer Engineering in Gothenburg.\nAre you motivated by tackling complex technical challenges and eager to contribute to the future of intelligent and safe vehicles? We are strengthening our embedded community, and we’re looking for someone who wants to be part of it. Together, we stay at the forefront, create innovative solutions for our clients, grow our skills, and have a lot of fun along the way!\nAbout Nexer Engineering in Gothenburg\nWithin Nexer Engineering, we collaborate with industry‑leading companies and specialize in product development and advanced engineering. Many of our assignments are within the automotive industry, where ADAS and future mobility play a central role. We cover competence areas ranging from embedded systems to low‑level, hardware‑near software development and sensor‑based technologies.\nAbout the role\nWe hire for the long term, and we’re looking for someone who wants to grow with us. And while we’re particularly interested in someone with a strong interest in ADAS, you will also, over time, have the flexibility to take on other embedded assignments - such as connectivity, platform and middleware development, or classic embedded programming in other industries.\nIn embedded development and ADAS‑related assignments, you will contribute to the development of next‑generation vehicle technologies. Depending on your background and ambitions, your work may involve areas such as:\nsoftware development for ADAS and sensor‑based systems\nembedded C/C++ development\nworking with radar, lidar, cameras, or other perception technologies\nreal‑time environments and safety‑critical systems\nalgorithmic functions, platform development, or low‑level hardware‑near software\n\nWe believe you have:\nExperience in ADAS and AUTOSAR\nExperience in embedded systems\nStrong programming skills in Embedded C (C++ is meritorious)\nExperience from automotive or similar technical domains\nAt least a B.Sc. in Computer Science, Electrical Engineering or a related field\n\nApplication\nDo you recognize yourself in the description above and feel that Nexer sounds like the right place for you? Then we’re really looking forward to reading your application!\nPlease note that we do not accept applications via e‑mail due to GDPR regulations.\nNexer as an employer\nIf you work at Nexer, you get a bold and entrepreneurial employer with an international presence. We take pride in leading the digital revolution and being at the forefront of technology, always with an agile and forward-looking approach. With us, you get unique opportunities to dream big, act smart and develop. As a family-owned company, we own our strategy and invest in long-term goals, and we encourage employee involvement and ideas. In addition, we offer a flexible work policy, where it’s possible to work remotely when it suits you and your assignment.\nOur culture\nOur vision is Promising future – it’s important for us to make a difference and contribute to a better future. We are committed to our customers and have a sincere concern for each other. We embrace diversity and believe that people with different backgrounds and experiences make our work and our company better. We value innovation and the will to develop and take the next step, onwards and upwards. And most importantly – we have fun at work!",
        "url": "https://nexergroup.teamtailor.com/jobs/7128006-adas-embedded-developer",
        "published": "2026-01-29T16:50:50",
        "deadline": "2026-03-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511866",
        "title": "Software Engineer to Rebl Industries",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Rebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries\r\n\r\nThe logistics industry is facing its biggest technical revolution. Would you like to be a part of it?\n\nJoin the team that’s redefining industrial automation\nRebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries.\n\nWhat you will do\nAs a Software Engineer at Rebl you help build the technical foundation for the next generation of robotic coworkers in warehouse and logistics environments. You work on the development of our core systems and applications, in close collaboration with our automation engineers and AI specialists. Your work spans backend, frontend, algorithms, AI models and integrations with our automation platform. You contribute to both new development and support while taking an active part in the ongoing evolution of our products.\n\nWhat we’re looking for \nWe are looking for several developers and believe in the combination of different competences and experience, specialists and generalists alike. You bring some of the following experience to the team:\n\n• A university degree, BSc or MSc, in computer science, software engineering, mechatronics or a related technical field.\n• Minimum 5+ years of professional experience in software engineering within a relevant industry.\n• Proven experience with designing, developing and maintaining backend and/or frontend applications using C#, Python, C++ and Typescript.\n• Knowledge of CI/CD pipelines in GitHub and are comfortable with application containerization.\n• Experience in digital twins solutions and IoT frameworks.\n• Proficiency developing REST APIs, database structures and integrations between systems.\n• Experience with 3D engines, building visualization applications.\n• Familiarity with working on algorithms and AI modules for motion planning, object recognition and classification.\n• Experience building, training and integrating AI models such as SAM and SAM2 for vision and automation use cases.\n• You have developed annotation tools along with training and classification strategies for neural networks.\n\nYour mindset \nYou have a broad technical mindset and enjoy moving between backend, frontend and different languages. You are curious, hands on and proactive. You like turning ideas into early solutions. You take ownership, communicate clearly and enjoy collaborating across disciplines. You thrive in a scaling environment where speed matters, structure evolves and every engineer has real influence. You thrive in environments where experimentation is encouraged and where tech meets the physical world. Most of all, you want to build, influence and see tangible results from your work.\n\nWhy Rebl Industries\nAt Rebl Industries, you join a sharp, driven and supportive team where your work has immediate effect. You help define the future of robotic automation — not in theory, but in real industrial use. Your ideas shape both the product and the company as we scale new markets and new levels of performance.\n\nApply now!\nIn this recruitment process Rebl Industries collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Marcus Hultberg on +46 72 366 49 43. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=307546&ref=platsbanken",
        "published": "2026-01-23T12:03:14",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30508840",
        "title": "Lead Engineer",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "Stakeholder Relationship\nPython, dSpace AutomationDesk\nHIL systems, real-time simulation, dSPACE toolchain (AutomationDesk)\nCI/CD, software testing, CAN & Automotive Ethernet\nKnowledge of Electric Motors, Power Electronics, Traction Batteries\nMiddleware & SW platform development\nElectric propulsion simulation\nVehicle-level verification & test automation\nCore/Domain development & testing",
        "url": null,
        "published": "2026-01-22T17:28:10",
        "deadline": "2026-02-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30508683",
        "title": "Technical Lead",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "B.Sc. or M.Sc. in Electronics, Software, Mechatronics or other equivalent education\nExperience of developing software algorithms and specifications\nExperience of Unit testing, HIL or SIL (Boxcar) testing, \nKnowledge in AUTOSAR\nFluent in English (written and spoken)\nProgramming skills in C, C++ and Python are meritorious\nStrong knowledge of Diagnostics and Software Download. (ISO 14229)\nKnowledge of Automotive Communication Protocols (CAN/LIN/ETH)\nKnowledge in Automotive Functional Safety Standard ISO26262 is meritorious",
        "url": null,
        "published": "2026-01-22T16:47:20",
        "deadline": "2026-02-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30481760",
        "title": "System Engineer",
        "employer": "L&T Technology Services Sverige Filial",
        "location": "Göteborg",
        "description": "L&T Technology Services Limited (LTTS) is a global leader in Engineering and R&D (ER&D) services.\nWe are hiring in Solna, Sweden!\nWould you like to join a team with innovation, teamwork and entrepreneurship as the fundamental platform?\nWe are looking for experienced System Engineers for the Automotive Industry.\nRequirements for the role:\nRequirements Elicitation & Analysis\nshould have worked on ASPICE based system engineering activities or must have exposure to it.\nGather and analyze system-level requirements from stakeholders, standards, and regulations.\nEnsure requirements address functional, performance, safety, and security aspects.\nRequirements Specification\nDocument System Requirements Specification (SyRS) in compliance with standards (e.g., ISO 26262 for automotive).\nDefine interfaces and interactions between hardware, software, and external systems.\n\n\n\nSoft Skills\nStrong analytical and problem‑solving skills.\nExcellent communication and documentation abilities.\nAbility to work independently and collaborate in cross-functional environments.\n\nEducation \nBachelor’s or Master’s degree in Electrical, Electronics, Computer Science, Automotive, or related field.\n\nWe believe you enjoy to work in teams, interact with people and have great communication skills. You are able to encourage, coach and develop to drive change and implementation in your surroundings.\nInterviews will be held continuously. To apply, please send in your application documents to the email address: LTTS.Sweden@Ltts.com.\nEnter the reference \"System Engineer\" in your application",
        "url": null,
        "published": "2026-01-16T14:02:50",
        "deadline": "2026-02-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30469653",
        "title": "Senior Embedded Rust Engineer",
        "employer": "Knowit AB (Publ)",
        "location": "Göteborg",
        "description": "Are you passionate about building high-performance embedded systems using Rust? Do you enjoy solving complex technical challenges and influencing both architecture and implementation? If so, you might be exactly who we’re looking for.\nAt Knowit Connectivity, you will work with skilled engineers on advanced automotive, mobility and connected-system projects. Together with our clients’ R&D teams, we create next-generation solutions that enable safer, smarter and more sustainable technology.\nWhat You’ll Do\nAs a Senior Embedded Rust Engineer, you will play a key role in designing and developing software for performance-critical and safety-critical embedded systems. You will contribute to architectural decisions, drive technical improvements, and ensure high-quality deliveries together with your team.\nYour responsibilities include:\n\nDeveloping robust and efficient embedded software, primarily in Rust (occasionally C/C++)\n\n\nWorking close to hardware, performing debugging, measurement and analysis using oscilloscopes, analyzers, and similar tools\n\n\nContributing to next-generation automotive platforms such as ADAS, connectivity, infotainment or electrification\n\n\nApplying automotive standards (ASPICE, AUTOSAR) and working with communication protocols such as CAN, J1939, and other serial interfaces\n\n\nDesigning for safety, reliability, and long-term maintainability\n\n\nCollaborating in cross-functional agile teams with engineers, architects, and stakeholders\n\n\nChallenging technical solutions and driving continuous improvement\n\nWhat We’re Looking For\nWe are looking for an experienced embedded engineer with strong technical depth and a passion for modern, safe system development.\nYou have:\n\nA degree in computer science, electrical engineering or similar\n\n\nSeveral years of experience in embedded systems development\n\n\nProven experience with Rust, or deep C/C++ experience and a strong drive to work primarily in Rust\n\n\nUnderstanding of low-level programming, RTOS/Linux/QNX environments, memory management and performance optimization\n\n\nExperience with automotive or other safety-critical products\n\n\nSkills in Python or similar scripting languages\n\n\nCuriosity, initiative and a willingness to learn and challenge assumptions\n\n\nExperience with Vector tools and other automotive lab equipment is a strong plus.\nFluency in English is required; Swedish is meritorious.\nWhy Knowit?\nAt Knowit, you will join a team that values technical excellence, collaboration and continuous learning. We offer an environment where you can influence, grow and work on impactful projects.\nWhat we offer:\n\nChallenging and meaningful projects shaping the future of mobility and connectivity\n\n\nA culture where engineering, knowledge sharing and teamwork are central\n\n\nContinuous learning through training, mentorship and internal competence networks\n\n\nA healthy work-life balance and a supportive, open culture\n\n\nStrong sustainability values and a long-term commitment to society\n\n\nCollective agreement and competitive benefits\n\nReady to Join Us?\nIf you want to work with advanced embedded technology and modern Rust-based development — and contribute to solutions used in millions of vehicles worldwide — we’d love to hear from you.\nSend us your application and tell us why you’d be a great fit for the role.",
        "url": "https://careersweden.knowit.se/jobs/7049288-senior-embedded-rust-engineer/applications/new?promotion=1788688-arbetsformedlingen",
        "published": "2026-01-14T11:53:41",
        "deadline": "2026-07-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465837",
        "title": "Senior Java Developer for Team Air Content-Dynamic Content (AC-DC)",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Senior Java Developer in the AC-DC team!\nThe Role\nOur work is driven by integration with a multitude of provider systems, ranging from traditional Global Distribution Systems (GDSs) like Sabre and Amadeus to Low-Cost Carriers (LCCs) and the cutting-edge New Distribution Capability (NDC). With NDC, we are at the forefront of an industry transformation, where airlines are offering their content directly through the NDC protocol, bypassing third-party systems.\nIn essence, the Air Content domain is both vast and diverse, encompassing everything from customer searches on price comparison sites to the intricacies of pricing, booking, ticketing, and post-booking functionalities. We consider Air Content to be the engine that propels our business forward.\nAs a Senior Java Developer on our Air Content team, you will be an integral part of a dynamic and forward-thinking group that powers the core of our business. You will have the opportunity to work on challenging projects, collaborate with cross-functional teams, and shape the future of our Air Content offerings. If you're passionate about Java development, and thrive in a collaborative, innovative environment, this role is perfect for you.\nKey Responsibilities\n\nDesign, develop, and maintain Java-based applications that are central to our Air Content platform.\n\n\nCollaborate with cross-functional teams to implement new features and enhancements.\n\n\nOptimize and improve the performance, reliability, and scalability of our Air Content systems.\n\n\nTroubleshoot and resolve complex technical issues related to our flight booking and management processes.\n\n\nContribute to the integration efforts with a variety of provider systems, including GDSs, LCCs, and NDC.\n\n\nEnsure code quality and adherence to best practices, standards, and guidelines.\n\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\n\n\nProven experience as a Java Developer, with a strong grasp of Java.\n\n\nFamiliarity with RESTful web services and API development.\n\n\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\n\n\nStrong problem-solving skills and the ability to work independently and collaboratively.\n\n\nExcellent communication skills to interact effectively with team members and stakeholders.\n\n\nPassion for the travel industry and a keen interest in keeping up with industry trends\n\nOur Stack\nJava, MySQL, MemSQL, Artemis, Kafka, as well as Atlassian tools, Git Jenkins, Docker Kubernetes, Linux, Mac OS, IntelliJ.\nOf course, you don't have to be familiar with all of our tech stack. We will support you in your journey with us and help you grow.\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\n\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\n\nA note from the Hiring Team\nDue to the upcoming Christmas holidays, our Hiring Team will be taking a short break. We will begin reviewing applications and reaching out to candidates for the first steps in the new year, starting around week 2 (January 7th).\nWe look forward to connecting with you then!",
        "url": "https://etraveligroup.teamtailor.com/jobs/6917181-senior-java-developer-for-team-air-content-dynamic-content-ac-dc/applications/new?promotion=1786946-arbetsformedlingen",
        "published": "2026-01-13T15:29:11",
        "deadline": "2026-07-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30461764",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2026-01-13T08:58:50",
        "deadline": "2026-03-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30447454",
        "title": "Software Developer C++",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "As a C++ Software Engineer at Capgemini Engineering, you will contribute to the development of advanced software solutions for innovative and high-performance systems. Whether you are early in your career or an experienced professional, you will work closely with industry leaders to design and implement solutions that deliver reliability, efficiency, and great user experiences.\nIn this role you will play a key role in: \nDesign and develop embedded software solutions in C++ for complex systems\nImplement and test system-level functionalities with a focus on quality and performance\nCollaborate in agile teams to deliver high-quality software aligned with best practices\nSupport troubleshooting and integration during deployment phases\n\nYour profile\nMinimum 4 years of experience in C/C++ and system software design\nFamiliarity with embedded systems architecture and agile methodologies\nHands-on experience with Unix/Linux environments, GIT, CI tools, and test automation\nExperience from the automotive industry\nFluency in English; Swedish language skills are highly meriting\n\n﻿Note: For this position you need to have a valid Swedish work permit and/or Swedish residency.\nWhat we believe you will enjoy about working here \nInnovative Environment: With us, you'll have the opportunity to work with the latest technology and be part of a dynamic team that loves creating value through innovation.\nCareer Development: We care about your future and offer development programs and certifications in the latest technologies, so you can grow and become the best version of yourself.\nFlexible Work: We understand that life is more than just work. That's why we offer opportunities for remote work and flexible hours to help you feel good and thrive.\nTeam Spirit: We're like one big family with a strong sense of team spirit. By living our core values—courage, passion, teamwork, and entrepreneurship—we create a work environment where everyone can feel at home.\nApplication\nThe assignment is based in Gothenburg. \nAs part of our recruitment process, identity verification or background checks may occasionally be conducted.",
        "url": "https://www.capgemini.com/se-en/jobs/374612-en_US+sap_btp/",
        "published": "2026-01-08T15:55:35",
        "deadline": "2026-02-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30403197",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-12-19T10:34:15",
        "deadline": "2026-06-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30343343",
        "title": "Technical Developer - Machine Learning",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are looking for a number of new Technical Developers who want to join our team of highly skilled and passionate engineers.\n\nCOME JOIN US - We are looking for a number of curious people!\n\nSmart Eye’s algorithm teams are looking for experienced Machine Learning Engineers who are interested in developing our computer vision and machine learning solutions.\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-center of Gothenburg, with convenient access by bus, bike, tram, boat, and car. And on top of that; the best coffee in town! \n\nWork description\n\nYou will be part of one of Smart Eye's algorithm development teams responsible for development in key areas such as head- and eye-tracking, attentiveness and drowsiness, face identification and interior sensing for our Automotive Cabin and Driving Monitoring product. We work in an international environment with colleagues in Boston (US) and Cairo (Egypt). \n\nWe are building safety features in novel technology that will significantly improve road safety and will transform our transportation experiences. Safety features such as determining people’s seating locations in a vehicle, if they are wearing seat belts, and detection of left-behind children, as well as features that enhance comfort, wellness, and entertainment by detecting occupants’ emotions and gestures. \n\nDevelopment activities range from early-stage prototyping to porting and deployment to a wide set of automotive embedded platforms. And you will be responsible for the complete chain of development activities including protocols for data collection, network architecture, training of networks, exploratory data analysis and visualization, but also integration into and validation of the model in the production software.\n\nWe solve these challenging problems utilizing state-of-the-art algorithms in the fields of image processing, the latest machine learning techniques, mathematics and accelerated computing.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance. \n\n\n\n\n\n\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg) \n\n\r\n​ Must-have-skills:\n\n\n - \nUniversity degree within Engineering context preferably Physics, Mathematics, Computer Science, Software Engineering or similar.\n\n\n - \n3+ years of software development experience.\n\n\n - \nExperience using end-to-end development (design, planning, evaluation, deployment) of a machine learning based system.\n\n\n - \n2+ year of work experience in C++ and Python development.\n\n\n - \nStrong communication and team collaboration skills.\n\n\nGood-to-have-skills:\n\n\n - Experience with optimizing Deep Learning model architectures and inference runtimes (ex. Tensorflow, Tensorflow Lite, PyTorch).\n\n - Experience in one or more fields of image processing or graphics programming.\n\n - Experience with CI/CD (Continuous Integration and Deployment).\n\n - Experience with developing software for the Automotive industry.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment. \n\n\n - You're able to work independently in an environment that changes rapidly.\n\n - Exhibit a positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers or other teams within Smart Eye.\n\n - Possess strong analytical, creative skills with a strong interest in new technologies.\n\n\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/290562/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-12-05T13:03:13",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30333490",
        "title": "Software Configuration and Release Manager",
        "employer": "Danda AB",
        "location": "Göteborg",
        "description": "We are looking for a skilled and proactive Software Configuration and Release Manager to join our core software platforms, a centre of excellence teams, developing the next generation products solutions with cutting edge technology within the automotive domain.\nThis position plays a key role in managing the end-to-end software integration, configuration, and release process for our core systems central physical ECU, which integrates three logical ECU stacks: Linux and Adaptive AUTOSAR deployed onto service-oriented SoC, and the Classic AUTOSAR onto signal-oriented SoC.\nBeneath service-oriented platforms, a QNX Host OS is deployed on top of hypervised HW resources. At the base, we run our boot software and HW near software components and configurations.\nAs part of our software delivery organization, you will work closely with domain architects, system engineers, software developers, and test teams to ensure stable, documented, traceable, and repeatable software builds and releases across different variants and platforms.\nWho are we?\nThe mission of Software Platforms within Computational Software Infrastructure (CSI) is to provide best in class embedded software platform & technologies, that enable’s software-driven transport solutions for Volvo. We believe in “Software-Defined Everything” and strive to be in the forefront. We foster teamwork and collaboration with continuous improvement mind-set.\nWe are responsible for the complete life cycle, from strategy to maintenance of the on-board SW platforms.\nWho are you?\nYou are a structured, detail-oriented engineer who thrives in complex embedded software environments. You understand the importance of consistency, traceability, and automation in the software development lifecycle, and you are driven by building reliable release pipelines and configuration baselines. You enjoy working collaboratively in cross-functional teams, and you take ownership of processes that ensure quality and compliance in every software release.\nYou’re aware of multi-layered software stacks and understand the nuances of integrating software components across Boot Software, Hypervisor, Software Download and Deployment orchestration, Linux, Adaptive AUTOSAR, Classic AUTOSAR platforms in safety-critical systems.\nYou are an Experienced Software Leader with a passion for automotive software development and baseline management and a deep understanding of dependencies between people and diligence, when it comes to time tracking and revision management. Your expertise lies in software configuration and CI/CD development, and you have a track record of successfully designing and implementing software solutions for automotive ECUs.\nYou thrive in a collaborative environment where you can improve development teams, by monitoring and drive regression testing, and govern bug fixes, and create and maintain the department release baseline. You will be a person that takes pride in proper release documentation and being an interface for information sharing of what content different software releases support.\nYour strong analytical and problem-solving skills enable you to make critical decisions and drive collaboration with other trains, to align time plans, and branch outs. software platform development processes.\nResponsibilities:\n Own and manage the software configuration and release management process for the core central ECU, consisting of Linux, Adaptive AUTOSAR, and Classic AUTOSAR logical ECUs.\n Define and maintain software versioning schemes, configuration baselines, and release strategies.\n Drive automation in build, integration, and packaging processes using industry-standard CI/CD tools.\n Coordinate and manage software branching, merging, and integration strategies across multiple software domains and suppliers.\n Ensure traceability of all software artifacts in accordance with automotive safety and cybersecurity standards (e.g., ASPICE, ISO 26262, ISO/SAE 21434).\n Maintain and manage configuration management tools (e.g., Git, GitLab, Jenkins, Artifactory).\n Ensure proper tagging, documentation, and release notes for all software deliveries.\n Facilitate regular release readiness reviews with cross-functional teams.\n Troubleshoot and resolve build/integration issues together with development and system teams.\n Collaborate with Product Owners and Product Managers to align release schedules with program milestones and vehicle development timelines.\n \nRequirements\n Bachelor’s or Master’s degree in Software Engineering, Computer Science, Electrical Engineering, or related field.\n 5+ years of experience in software configuration and release management within the automotive or embedded systems domain.\n Solid experience with Linux, Adaptive AUTOSAR, and Classic AUTOSAR software stacks.\n Deep understanding of Git-based workflows, CI/CD pipelines, and software version control principles.\n Hands-on experience with tools like Jenkins, Artifactory, GitLab, Bitbucket, and Yocto (preferred).\n Strong grasp of embedded build systems and toolchains for cross-compilation.\n Familiarity with ASPICE, ISO 26262, and software compliance requirements in the automotive industry.\n Excellent communication and organizational skills, with the ability to collaborate effectively across international and interdisciplinary teams.\n Experience working in agile software development environments.",
        "url": "https://jobb.danda.se/jobs/6875171-software-configuration-and-release-manager?promotion=1739752-arbetsformedlingen",
        "published": "2025-12-03T11:46:52",
        "deadline": "2026-05-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30312056",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-11-27T10:17:25",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30544945",
        "title": "Lärare i Teknikämnen och Artificiell Intelligens (AI)",
        "employer": "Amerikanska Gymnasiet i Sverige AB",
        "location": "Göteborg",
        "description": "Om Amerikanska Gymnasiet\nAmerikanska Gymnasiet grundades utifrån en stark pedagogisk idé. Vår ledstjärna är att ”vi arbetar för att våra elever och medarbetare ska nå sin fulla potential”. Vi arbetar därför med både kunskapsutveckling och personlig utveckling. Vår kultur kännetecknas av tydliga spelregler med omtanke. Vi kallar det ”Ramar och Kramar”. Skolverksamheten organiseras så att eleverna förbereds för en internationell arbetsmarknad i en snabbt föränderlig värld, i vår logotype kan man därför läsa “Get ready for the world”.\nAllt som sker på skolan utgår från våra fyra grundvärderingar: Courage, Kindness, Knowledge & Curiosity och Grit. I klassrum och i korridor så kännetecknas möten mellan elever och personal av beteenden som härleds från dessa. Vi arbetar elevnära och sätter alltid elevernas bästa i första rummet.\nOm Amerikanska Gymnasiet, Göteborg\nPå Lindholmen, granne med Karlatornet, ligger vår nybyggda skola där vi flyttade in hösten 2024. På skolan går cirka 590 elever som studerar på Natur-, Teknik-, Ekonomi- eller det Samhällsvetenskapliga programmet. Undervisningen bedrivs på både svenska och engelska av ett kompetent och drivet lärarlag med en stark gemenskap.\nOm rollen\nVi söker nu två engagerade tekniklärare som vill vara med och utveckla teknikundervisningen på skolan. Vi söker dig som kan undervisa i något av följande ämnen; Artificiell Intelligens (AI), Dator och nätverksteknik, Webbutveckling, Programmering eller Teknik. Du kommer ansvara för att planera, genomföra, bedöma och utvärdera din egen undervisning. Du förväntas leda lektionerna utifrån vår pedagogiska struktur, vilket du kommer få handledning i. Du kommer att arbeta nära tillsammans med ett engagerat och sammansvetsat lärarlag, där samarbete och kollegialt lärande är en självklar del av vardagen. Du kommer att undervisa i en digital miljö med digitala läromedel i kombination med traditionell litteratur. Undervisningen sker på både svenska och engelska. I tjänsten ingår också mentorskap för en klass.  \nTjänsten är en tillsvidareanställning på deltid eller heltid, med en inledande provanställning på 6 månader. Omfattningen beror på vilka ämnen som det blir aktuellt att undervisa i. Startdatum snarast eller enligt överenskommelse. \nDin profil\nFör tjänsten krävs en svensk lärarlegitimation och erfarenhet av undervisning, samt behörighet att undervisa teknikämnen, såsom; Artificiell Intelligens (AI), Dator och nätverksteknik, Webbutveckling, Programmering eller Teknik. Du har ett stort engagemang för undervisning och vill vara med och utveckla verksamheten tillsammans med ett starkt team av medarbetare och du delar vår pedagogiska syn:\nhttps://www.amerikanskagymnasiet.se/om-skolan/tankar-om-skola/. \nVi söker dig som leder i linje utifrån vår devis “Ramar & Kramar”, som innebär ett tydligt ledarskap och tydliga spelregler i kombination med en stark omsorg om varje elev. Med hjälp av din energi, lyhördhet och uthållighet har du lätt för att engagera och skapa delaktighet mot gemensamt satta mål. Teamwork och transparens är ledord.\nDu förväntas ha god kommunikation på både svenska och engelska, i både tal och skrift. Du har förmågan att använda ett brett spektra av digitala läromedel och du har en stabil digital kompetens. \nStor vikt kommer att läggas vid personlig lämplighet.\nAnsökan\nSista ansökningsdag: 28 februari 2026.\nIntervjuer sker löpande och tillsättning av tjänsten kan ske innan ansökningstiden har gått ut.\nVar vänlig bifoga din svenska lärarlegitimation och behörighetsförteckning i din ansökan.\nKontaktuppgifter\nBiträdande rektor Evelina Löfnertz, evelina.lofnertz@amerikanskagymnasiet.se",
        "url": "https://amerikanskagymnasiet.teamtailor.com/jobs/7134878-larare-i-teknikamnen-och-artificiell-intelligens-ai/applications/new?promotion=1816560-arbetsformedlingen",
        "published": "2026-01-30T14:24:09",
        "deadline": "2026-07-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30492694",
        "title": "SoMe-specialist",
        "employer": "Mild Media AB",
        "location": "Göteborg",
        "description": "SoMe-specialist med helhetsansvar\n– strategi, paid och innehåll som driver affär\nÄr du den som testar nya redigeringseffekter innan de ens börjar trenda? Som gillar att kombinera kreativt innehåll med tydliga mål, data och affärsresultat? Som vill äga hela kundresan i sociala medier – från idé till analys?\nDå tror vi att du kan vara helt rätt för oss.\nPå Mild söker vi nu en SoMe-specialist som vill äga och utveckla våra kunders närvaro i sociala medier. Det här är en bred roll för dig som gillar kombinationen av strategi, paid och hands on-produktion – och som förstår hur sociala medier bidrar till tillväxt, varumärke och affär.\n\n\nRollen i korthet\nDet här är inte en roll med ett smalt fokus. Vi söker dig som vill:\n- Ta ett tydligt helhetsansvar för kunders sociala kanaler.\n- Arbeta både med paid social och organiskt innehåll.\n- Själv komma på, skapa och optimera innehåll.\n- Förstå hur sociala medier samspelar med övrig digital marknadsföring.\n- Vara rådgivande, proaktiv och nära kunden\n\n\nDet här kommer du att göra\nSociala medier – helheten\n- Ansvara för flera kunders sociala kanaler, från strategi till publicering.\n- Ta fram SoMe-strategier, contentplaner och taktiker.\n- Vara kundens naturliga kontakt i frågor som rör sociala medier.\n\n\nInnehåll & organiskt\nTa fram idéer, format och vinklar som fungerar i flödet.\nSkapa och redigera innehåll själv – främst foto och video anpassat för mobil.\nJobba med tempo, storytelling, hooks och formatval.\nPublicera, schemalägga och optimera innehåll löpande.\n\n\nPaid social (och gärna lite mer)\n- Arbeta hands on med paid social (exempelvis Meta Ads och TikTok Ads).\n- Testa, analysera, optimera och skala det som fungerar.\n- Förstå samspelet mellan kreativt material och annonsering.\n- Stort plus om du även har erfarenhet av SEM / Google Ads och vill jobba kanalöverskridande.\n\n\nAnalys & utveckling\n- Följa upp resultat och dra insikter som leder arbetet framåt.\n- Tänka i målgrupper, beteenden och communities – inte bara räckvidd.\n- Bidra till att utveckla vårt erbjudande och arbetssätt inom SoMe.\n\n\nDet här tror vi att du har med dig\n- Erfarenhet av att arbeta med sociala medier i en professionell kontext, gärna från byrå.\n- Stark förståelse för paid social och hur innehåll driver effekt.\n- Förmåga och vilja att själv skapa content – idé, produktion och redigering.\n- Vana att jobba i relevanta verktyg för redigering, publicering och annonsering.\n- God känsla för foto, video, copy, tempo och storytelling.\n- Förståelse för hur sociala medier kopplas till affärsmål och tillväxt.\n- Ett strukturerat arbetssätt kombinerat med kreativ höjd.\n- Nyfikenhet på nya format, trender, verktyg och AI.\n- B-körkort\n\n\nExtra plus om du även:\n- Har erfarenhet av SEM / Google Ads.\n- Har haft kundansvar eller arbetat nära kunder tidigare.\n\n\nVarför Mild?\nHos oss jobbar du i ett team med spets inom SEO, SEM, SoMe, CRO, content och strategi. Vi tror på samarbete, transparens och att göra saker ordentligt – utan att göra dem krångliga.\nHär får du:\n- En roll med stort förtroende och mycket eget ansvar.\n- Kollegor som delar med sig, utmanar och vill framåt.\n- Kunder som vill framåt och uppskattar proaktiv rådgivning.\n- Möjlighet att påverka både kundresultat och hur vi jobbar.\n- En vardag där kreativitet och affär går hand i hand.\nVår ambition är enkel:\nDu ska ha kul, utvecklas och känna att det du gör faktiskt spelar roll.\n\n\nÄr det dig vi beskriver? \nSkicka in ditt CV och några rader om dig själv. Har du exempel på konton, kampanjer eller innehåll du jobbat med, dela gärna det också. \nVi intervjuar löpande.\nVälkommen med din ansökan!",
        "url": "https://jobb.mild.se/jobs/7067281-some-specialist-med-helhetsansvar",
        "published": "2026-01-20T08:41:55",
        "deadline": "2026-02-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30396942",
        "title": "Data Engineer - AWS, Data Warehousing & Analytics",
        "employer": "Creditsafe i Sverige AB",
        "location": "Göteborg",
        "description": "Om tjänsten:\nI rollen som Data Engineer kommer du att arbeta med att utveckla och optimera affärskritiska SQL-queries samt bygga och förbättra våra dbt-modeller, inklusive mart-, staging-, core- och snapshot-modeller. Du får möjlighet att designa datamodeller som hanterar både historisk och aktuell data, samt implementera och optimera Airflow-DAGs för schemalagda jobb.\nDu kommer att ansvara för hantering av releaser, migreringar och rollback-skript samt felsöka dataproblem och utföra root cause analysis. En viktig del av arbetet är att samarbeta nära verksamheten för att översätta krav till lösningar.\nVidare kommer du att utveckla och implementera ETL-processer från skandinaviska dataleverantörer, vilket innebär att du får en central roll i att säkerställa att våra datalösningar är både tillförlitliga och effektiva.\nVi söker dig som har:\n\n·         Mycket goda kunskaper i avancerad SQL: CTEs (WITH), Window functions (ROW_NUMBER, RANK, LAG, LEAD m.fl.), Komplexa JOINs, subqueries och aggregeringar\n\n\n·         Praktisk erfarenhet av dbt (Data Build Tool): Models, tests, snapshots och materializations\n\n\n·         God förståelse för datamodellering: Data Vault (Hub/Link/Satellite), Star/Snowflake schema, hantering av historik (SCD Type 2)\n\n\n·         Vana att arbeta med Git\n\n\n·         Stark problemlösningsförmåga och god analytisk förmåga\n\n\n·         Mycket goda kunskaper i Python\n\n\n·         Erfarenhet av release- och versionshantering i databasmiljö\n\n\n·         Kunskap om verktyg för kodkvalitet (SQLFluff, Ruff)\n\n\n·         Flytande svenska och engelska i tal och skrift krävs. Vårt arbete sker tvärs över koncernen med internationella kollegor och engelska fungerar som det dagliga koncernspråket.\n\n\nMeriterande:\n\n·         Fördjupad kunskap inom AWS (S3, Glue, IAM, VPC)\n\n\n·         Avancerad dbt-användning (macros, custom tests, packages)\n\n\n·         Erfarenhet av prestandaoptimering i stora datamängder\n\n\n·         Bakgrund inom kredit-, risk- eller inkasso branschen\n\n\n·         Vana att arbeta med Cursor som verktyg\n\n\n·         Erfarenhet av xslt-stylesheets\n\n\n·         Erfarenhet av jq  \n\n\n·         Erfarenhet av Apache Airflow\n\n\n·         Erfarenhet av Amazon Redshift:\n\n\nCreditsafe gör just nu en stor satsning inom AI för att både effektivisera vårt arbete och höja datakvaliteten. Därför är det meriterande om du har erfarenhet av eller intresse för AI inom databashantering och dataanalys.\nVi erbjuder dig\nCreditsafe är ett globalt kreditupplysningsföretag som ger dig en tydlig bild över det ekonomiska läget och vilken risk ditt företag ställs inför. Vi samlar information från en mängd officiella källor, däribland skandinaviska myndigheter.\nCreditsafe är så mycket mer än bara en vanlig arbetsplats. Vi kan skryta om träning på arbetstid, kortare arbetsdagar under sommaren, fina kontorslokaler i Gårda, flexibilitet och spännande konferensresor. Men det vi är allra mest stolta över hos oss på Creditsafe är vår personal! Vi är otroligt stolta över energin och gemenskapen som finns bland våra kollegor - det är något att skryta om! \nÖvrig information:\n\n·         Tillsvidareanställning som föregås av sex månaders provanställning\n\n\n·         Arbetet är på heltid\n\n\n·         Hybrid arbetsplats\n\n\n·         Fast månadslön\n\n\n·         Start enligt överenskommelse\n\n\n \nEftersom intervjuer sker löpande hoppas vi att du skickar in din ansökan så snart som möjligt!",
        "url": "https://jobb.creditsafe.se/jobs/6944932-data-engineer-aws-data-warehousing-analytics?promotion=1759757-arbetsformedlingen",
        "published": "2025-12-18T13:40:54",
        "deadline": "2026-06-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30559900",
        "title": "Global Clinical Operations Program Director",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you passionate about science and have extensive knowledge within the pharmaceutical industry? Are you also experienced in clinical operations and project management? We are now recruiting a Global Clinical Operations Program Director (GPD) to the BioPharmaceuticals Clinical Operations function for Late-Stage Development Cardiovascular, Renal and Metabolic therapy area in R&D to support our vibrant portfolio. This role will be based at AstraZeneca's dynamic R&D site in Gothenburg (SE). \n\n \n\nThe role of a GPD requires global collaboration and leadership. The span of responsibilities is broad and may support one or several products depending on their size and complexity. The products supported will be in Phase 3 development or already commercially available, but the program may include studies in all phases of drug development. This position will focus on projects in the metabolic space, e.g. weight management.\n\n \n\nThe GPD is responsible for oversight of a program of global studies, covering all clinical development deliverables (including aspects of quality, budget, time, resource and risk). The role also involves integrating design, feasibility, and operational planning to ensure clinical drug development programs are aligned with priorities and strategy. The GPD will provide input and support to the Senior GPD in preparation for governance interactions. The GPD may act as the lead for cross-functional teams in delivery of clinical activities assigned.\n\n \n\nAccountabilities:\n\nAs a GPD, you will be leading cross-functional teams of experts in the planning and delivery of a defined clinical program of studies and/or clinical activities to scope, quality, budget, time; managing resources and risk on behalf of the Senior GPD.\n\nThe GPD may manage improvement or change projects within clinical operations or span multiple business areas. You will be an early adopter of new ways of working and acting as ambassador for change when leading teams, also embracing artificial intelligence.\n\nThe role includes leadership and project management of non-drug project work, e.g. functional and cross-functional improvement initiatives, and you will also contribute to initiatives as Subject Matter Expert.\n\nIn the role of GPD, you are expected to be able to work independently and be comfortable prioritizing the work for yourself and your team to meet business objectives. You will also mentor and support people's development as appropriate.\n\n \n\n \n\nEssential Skills/Experience:\n\n * \n\nUniversity degree, preferably in medical or biological sciences or discipline associated with clinical research (Advanced degree is preferred)\n * \n\nAt least 10 years' experience from within the pharmaceutical industry or similar large multinational organization\n * \n\nAt least 8 years' experience of clinical development / drug development process in various phases of development and therapy areas\n * \n\nProven knowledge of Clinical operations in the metabolic space, e.g. weight management, especially of investment decisions and clinical trial program design development, including governance interactions. Experience in planning, start-up, and oversight of clinical trials.\n * \n\nProven knowledge of project management tools and processes\n * \n\nExperience from leading clinical projects and deliverables or similar expertise from other areas of drug development (such as pharmaceutical development).\n * \n\nProven leadership promoting motivation and empowerment of others to accomplish individual, team and organizational objectives\n * \n\nSkilled & experienced in change management\n * \n\nAbility to look for, and champion, more efficient and effective methods/processes of delivering Clinical Development focusing on key performance metrics around reliability, productivity, cost and quality\n * \n\nExcellent written and verbal communication skills in English\n * \n\nExcellent negotiation, collaboration and interpersonal skills with ability to work effectively with others at all levels of the organization\n * \n\nDemonstrated ability to set and manage priorities, resources, performance targets and project initiatives in a regional and local environment\n * \n\nIntegrity and high ethical standards\n * \n\nAdaptability\n\n \n\n \n\nDesirable Skills/Experience:\n\n * \n\nProject management certification is desirable but not mandatory\n * \n\nRegulatory submission experience\n * \n\nAbility to mentor, develop and educate staff\n\n \n\nAt AstraZeneca, we are committed to making a difference by fusing data and technology with the latest scientific innovations to achieve breakthroughs. Our inclusive environment encourages collaboration with academia, biotechs, and industry partners to create the greatest impact on disease. We harness digital, data science & AI to fast-forward our research, ensuring that our work born in a lab can make a real difference in patients' lives across the world.\n\n \n\nJoin us on this exciting journey! Apply now to be part of a team that makes a bigger impact on patients' lives.\n\n \n\nSo, what's next?\n\nWe welcome your application, no later than 15 Feb 2026. We will review applications and interview suitable candidates on an ongoing basis.",
        "url": "https://www.aplitrak.com/?adid=ZWxlb25vci5laHJtYW4uODk4MzEuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-02-03T15:48:55",
        "deadline": "2026-02-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30555529",
        "title": "Doctoral student in physics-guided foundation model for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided, data-driven foundation models for multivariate time-series in safety-critical systems, with a primary focus on automotive applications. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering, a joint department of Chalmers and the University of Gothenburg. Our internationally visible research, strong industry links and diverse environment create a collaborative setting where ideas grow into real impact. \n\nAt the Division of Computing Science, we advance secure and trustworthy software and systems, spanning foundations, programming languages, tools and practical methods that help shape dependable digital infrastructures. \n\nThis project is a collaboration between AIXLab@Chalmers and Volvo Group. You will join us at AIXLab, where we focus on developing usable AI solutions that are applicable in real-world settings. You will work closely with engineers and researchers at Volvo Group, with direct access to industrial datasets, simulation environments, and real validation workflows.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. Here, foundation models refer to reusable, pretrained time-series models that can be adapted across vehicles, driving conditions, and tasks. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other safety-critical domains such as healthcare. \n\nConcretely, the research will focus on multivariate vehicle time series such as CAN signals, sensor streams, and simulated state trajectories, with models that integrate physical structure (e.g. dynamics, constraints, conservation laws) into large neural architectures. Physics guidance may include explicit system constraints, inductive biases in model architectures, hybrid simulation learning loops, or loss formulations that encode physical consistency. The work combines forecasting, representation learning, and scenario generation under safety and reliability constraints. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nWe are particularly interested in candidates who enjoy working at the intersection of theory, data, and real-world systems, and who are comfortable with imperfect, noisy, and safety-constrained data.\n\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent\n• Strong written and verbal communication skills in English\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch)\n• Strong engineering maturity, including experience with large-scale GPU or cluster-based training, reproducible experiment pipelines, versioned datasets, and systematic evaluation\n• Ability to formulate research questions, run empirical studies at scale\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Academic research and publications\n\nWhat you will do\n\n• Take advanced courses within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n• By the end of the PhD, the candidate is expected to have developed reusable modeling frameworks for safety-critical time-series data. The work should result in publications in top-tier machine learning or applied AI venues and contributions that influence industrial validation pipelines\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start\n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years\n• A starting salary of 34,550 SEK per month (valid from May 25, 2025)\n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn\n\nWhat we offer \nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about working at Chalmers, benefits  for employees, Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg and doctoral studies at Chalmers here.  \n\nApplication procedure\nThe application should be written in English and attached as PDF-files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself\n• A brief motivation as to why you are interested in this position\n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than March 3rd 2026\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nyinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nsecarl@chalmers.se\n\nWe look forward to your application! \nChalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14579&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2026-02-03T09:17:35",
        "deadline": "2026-03-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30550460",
        "title": "Product Cybersecurity Engineer",
        "employer": "Coretura AB",
        "location": "Göteborg",
        "description": "Join the Revolution in Commercial Vehicle Tech at Coretura!\nWe’re redefining how automotive software is built. As a joint venture between Volvo Group and Daimler Truck, Coretura blends startup speed with industry strength—and we’re all-in on AI.\nAs a Product Cybersecurity Engineer, you’ll play a critical role in securing next-generation commercial vehicle platforms. You’ll work across embedded systems, automotive hardware, and software layers to ensure robust protection against evolving threats. From cryptography and secure boot to system-level security, your expertise will help us deliver safe, reliable, and future-ready solutions. \n What you’ll do\nYou’ll be at the forefront of implementing security measures across the product lifecycle. Your work will span multiple domains, ensuring compliance with industry standards and enabling secure innovation.\nYou will:\n\nDefine and implement embedded security solutions for automotive systems \n\n\nEstablish Secure Boot and Root of Trust mechanisms \n\n\nIntegrate HSM/TPM and cryptographic accelerators for secure key storage\n\n\nApply best practices for physical tamper detection and secure diagnostics \n\n\nEnsure OTA update security and manage secure debug interfaces (e.g., JTAG lock/authentication)\n\n\nSupport system-level security controls for hypervisors and OS in embedded environments \n\n\nCollaborate across teams to embed security in ECU/BSP-level engineering workflows\n\n\n What you bring\nWe’re looking for someone who thrives in hands-on engineering, enjoys collaboration, and is passionate about cybersecurity.\nYou have:\n\nAt least 4 years of experience in embedded security or related fields\n\n\nBachelor’s degree in a relevant engineering discipline (Master’s degree preferred)\n\n\nStrong programming skills in C/C++ with secure coding best practices\n\n\nPractical experience with symmetric/asymmetric cryptography, digital signatures, hashing, and encryption\n\n\nKnowledge of automotive communication protocols (CAN, LIN, Ethernet) and secure stacks like Autosar SecOC, TLS, IPsec, MACsec\n\n\nExperience with threat modeling, TARA, and integrating security throughout the product lifecycle\n\n\nIt’s a plus if you also bring:\n\nExposure to cloud integration and modern security monitoring tools\n\n\nFamiliarity with ISO-26262 functional safety standards\n\n\nUnderstanding of incident response and vulnerability management\n\n\nExperience with QNX, Linux, or Android-based platforms\n\n\n \nWhy Coretura? \nAt Coretura, you’ll be empowered to make a real impact. We value initiative, ownership, and a proactive mindset. You’ll have the freedom to drive projects forward, contribute ideas, and help shape the future of commercial vehicle technology. Our lean, innovative team is always learning and adapting—your contributions will truly matter. \n Next steps \nReady to build the future of commercial vehicles?  We review applications on a continuous basis—so don’t wait to submit yours! \n Questions? \nDon’t hesitate to reach out to frida.greve@coretura.com if you have any questions.\nPlease note we do not accept any applications via email.",
        "url": "https://career.coretura.com/jobs/6879950-product-cybersecurity-engineer/applications/new?promotion=1818598-arbetsformedlingen",
        "published": "2026-02-02T11:27:54",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30549671",
        "title": "Scientific Informatics Lead",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have expertise in, and passion for developing and deploying digital innovation to accelerate drug development in the pharmaceutical industry? Join AstraZeneca and use your expertise to implement data driven & AI approaches and help deliver life-changing medicines to patients worldwide. This isn't just a role, it's your opportunity to transform the future of medicine and improve millions of lives. \n\n \n\nWhat we do \n\nAstraZeneca is a global, science-driven BioPharmaceutical business and our innovative medicines are used by millions of patients worldwide. Ultimately, our aim is to work towards a cure for some of the world's most complex diseases. Whether that's by shaping the patient ecosystem and focusing on outcomes, or by progressing potential medicines and accelerating their launch. \n\nPharmaceutical Sciences at AstraZeneca delivers the therapies of the future through scientific leadership in drug delivery, design of synthetic routes, and manufacturing of Active Pharmaceutical Ingredients and drug products. In essence, we are working \"from molecule to medicine\" to develop medicines for our patients today and tomorrow. \n\nThe Predictive Science, Digital, and Automation (PSDA) department leads the digital transformation of Pharmaceutical Sciences to drive innovation, optimize drug development, and enable data- and predict-first driven decisions. We develop and apply computational chemistry, machine learning (ML), and Artificial Intelligence (AI) methodologies - coupled with user centric informatics for seamless data capture, integration, insight, and prediction. This is coupled with strong leadership and expertise to advance lab and process automation all to accelerate projects. \n\n \n\nThe role \n\nWe are seeking a Scientific Informatics Lead to champion our scientific informatics execution across Pharmaceutical Sciences. This role is based at our R&D site in Gothenburg, Sweden, and combines both leadership and hands on development that bridges experimental science and digital innovation. You will lead the development of future agentic AI workflows ensuring we unlock the full value of our scientific data and drive our strategic goals of increased productivity and speed within our drug projects. \n\n \n\nYou will collaborate with world-class scientists, IT and data teams to: \n\n * \n\nLead and/or contribute towards the vision, roadmap and implementation of digital , lab automation and AI solutions enabling scientific productivity and scientific knowledge management. \n * \n\nUse your experience of working with data to embed best practices, ensuring data capture, management, and analysis are fully integrated with scientific and digital workflows. \n * \n\nBe a strong leader in a community of informaticians and digital champions, raising digital and AI literacy across the scientific organisation. \n * \n\nPartner on the development and deployment of next-generation digital tools, such as laboratory automation systems, FAIR data products, and an agentic AI infrastructure. \n * \n\nCollaborate with Predictive Science teams to ensure all informatics solutions are analytics-ready and drive robust data pipelines for AI/ML applications. \n * \n\nAct as an influential voice for digital transformation within Pharmaceutical Sciences \n\n \n\nExpected background for the role \n\n * \n\nGraduate or postgraduate degree in natural sciences (chemistry, biology, or related), data science, or other relevant discipline. \n * \n\nProven track record in scientific informatics (cheminformatics, bioinformatics or lab automation) \n * \n\nDemonstrated experience and/or leadership of working within a scientific environment but with a passion to develop and learn new informatics, data and AI skills OR an experienced data / computer scientist with a desire to work in close partnership with lab-based scientists. \n * \n\nExcellent written and verbal communication, business analysis, and consultancy skills. \n * \n\nBasic skills in high level programming or data-lake/database tools (e.g. Snowflake or similar cloud platform) \n\n \n\nWhy AstraZeneca \n\nAt AstraZeneca, we turn ideas into life changing medicines and strive to continuously meet the unmet needs of patients worldwide. Working here means being entrepreneurial, thinking big, and working together to make the impossible a reality. Ultimately, it's more than a job. We know that our work impacts people with serious conditions, many of whom have no other alternatives. That's what drives us - the potential to impact over one billion patients worldwide. \n\n \n\nSo, what's next? \n\nAre you already imagining yourself joining us? Good, because we can't wait to hear from you! \n\nWelcome with your application; CV and cover letter, no later 15 February, 2026.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy4zNTA0My4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-02-02T10:23:06",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30549646",
        "title": "Predictive Science - Product Team Lead",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have the expertise and passion to harness predictive science and AI for drug product development in the pharmaceutical industry? Do you want to lead a team of experts and use your expertise to shape and implement groundbreaking methodologies, accelerate digital innovation, and help deliver life-changing medicines to patients worldwide. This isn't just a role, it's your opportunity to transform the future of medicine and improve millions of lives.\n \n\nWhat we do \n\nAstraZeneca is a global, science-driven BioPharmaceutical business and our innovative medicines are used by millions of patients worldwide. Ultimately, our aim is to work towards a cure for some of the world's most complex diseases. Whether that's by shaping the patient ecosystem and focusing on outcomes, or by progressing potential medicines and accelerating their launch. \n\nPharmaceutical Sciences at AstraZeneca delivers the therapies of the future through scientific leadership in drug delivery, design of synthetic routes, and manufacturing of Active Pharmaceutical Ingredients and drug products. In essence, we are working \"from molecule to medicine\" to develop medicines for our patients today and tomorrow. \n\nThe Predictive Science, Digitisation, and Automation (PSDA) department leads Pharmaceutical Sciences' digital transformation to drive innovation, optimize drug development, and enable datadriven decisions. We develop and apply computational chemistry, machine learning (ML), and Artificial Intelligence (AI) methodologies - coupled with usercentric informatics for seamless data capture, integration, and insight - and scale laboratory and process automation all to accelerate projects. \n\n \n\nThe role \n\nAs a Predictive Science - Product Team Lead, you will set the strategic vision and operational direction for a team of data scientists, computational chemists, and machine learning experts that are focused on solid-state, materials and formulation modelling for drug project support. You will work at the intersection of leading and developing highly skilled scientists, driving technology, and building a bridge between scientific ambitions and drug project impact. This role is located at our strategic R&D site in Gothenburg, Sweden.\n\n \n\nYour core responsibilities will include: \n\n * \n\nShape and deliver the product AI/ML and modelling strategy for Pharm Sci aligned to predictfirst objectives. \n * \n\nLead, develop, and coach a cross-skilled team fostering a culture of scientific excellence and empowering them to identify and deliver the tools of the future. \n * \n\nAct as a key member of the PSDA leadership team, helping set vision, direction, and priorities for the department-ensuring we operate as one to deliver integrated solutions to the business. \n * \n\nPartner with scientists, business leaders, IT, data, and automation teams to identify and prioritise opportunities for digital & AI transformation-translating scientific challenges into actionable digital programmes and projects. \n * \n\nChampion FAIR data and digital best practice, promoting data-driven culture and continuous improvement in data management, system interoperability, and automation adoption. \n * \n\nRepresent the team and function at cross-functional forums and externally, sharing best practices and AstraZeneca's vision for scientific digitalisation. \n\n \n\nExpected background for the role \n\n * \n\nMaster's or advanced degree in Natural Sciences, Computer Science, Engineering, or related discipline, with experience in leadership roles in a scientific environment \n * \n\nSeveral years of industrial experience in the field of drug design, pharmaceutical chemistry, or drug development \n * \n\nExperience leading scientific projects, communities of practice, and/or external collaborations. \n * \n\nDemonstrated ability to lead and coach direct reports for enhanced individual and team performance and development. \n * \n\nExcellent strategic thinking, communication, and stakeholder management skills-with the ability to influence scientific, data, and technical partners across the organisation. \n * \n\nDemonstrated external scientific reputation (e.g. via an internationally recognized publication track record) \n\n \n\nWhy AstraZeneca \nAt AstraZeneca, we turn ideas into life changing medicines and strive to continuously meet the unmet needs of patients worldwide. Working here means being entrepreneurial, thinking big, and working together to make the impossible a reality. Ultimately, it's more than a job. We know that our work impacts people with serious conditions, many of whom have no other alternatives. That's what drives us - the potential to impact over one billion patients worldwide. \n\n \n\nSo, what's next? \nWe look forward to your application, submit your CV and cover letter to lead the future of informatics and digitisation at AstraZeneca. Please submit your application no later than 15 February.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy40NTA1Ni4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-02-02T10:21:55",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30549635",
        "title": "Experienced Scientist in Digital Chemistry",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have the expertise and passion for developing and deploying Computational Chemistry and Artificial Intelligence (AI) methodologies for drug development in the pharmaceutical industry? Join AstraZeneca and use your expertise to implement groundbreaking methodologies, accelerate digital innovation, and help deliver life-changing medicines to patients worldwide. This isn't just a role, it's your opportunity to transform the future of medicine and improve millions of lives.! \n\n \n\nWhat we do \n\nAstraZeneca is a global, science-driven BioPharmaceutical business and our innovative medicines are used by millions of patients worldwide. Ultimately, our aim is to work towards a cure for some of the world's most complex diseases. Whether that's by shaping the patient ecosystem and focusing on outcomes, or by progressing potential medicines and accelerating their launch. \n\nPharmaceutical Sciences at AstraZeneca delivers the therapies of the future through scientific leadership in drug delivery, design of synthetic routes, and manufacturing of Active Pharmaceutical Ingredients and drug products. In essence, we are working \"from molecule to medicine\" to develop medicines for our patients today and tomorrow. \n\nThe Predictive Science, Digital, and Automation (PSDA) department leads the digital transformation of Pharmaceutical Sciences to drive innovation, optimize drug development, and enable data- and predict-first driven decisions. We develop and apply computational chemistry, machine learning (ML), and Artificial Intelligence (AI) methodologies - coupled with user centric informatics for seamless data capture, integration, insight, and prediction. This is coupled with strong leadership and expertise to advance lab and process automation all to accelerate projects. \n\n \n\nThe role \n\nWe now have an exciting opportunity for a Principal Scientist in digital chemistry based at our strategic R&D site in Gothenburg, Sweden. \n\nFor this role we are looking for an experienced computational chemist and ML expert with detailed knowledge of organic synthesis, and chemical reactivity. The ideal candidate demonstrates several years of industrial experience in the pharmaceutical industry and an internationally recognised publication track-record at the interface of quantum chemistry and ML workflow implementation with demonstrated impact on drug design and development. \n\nIn this role you will collaboratively lead our method development efforts on the interface of advanced data-driven machine learning models and computational chemistry to advance synthesis prediction, chemical route design, chemical stability assessment and formulation development. You will work closely with drug development projects and contribute with expert modelling support, addressing the diverse challenges arising in drug development projects. You will also contribute to deliver on and design our strategic positioning of computational chemistry and AI across our function to drive our predict first transformation. \n\n \n\nTypical responsibilities in this role \n\n \n\n * \n\nIdeation, development, and application of a combination of machine learning and mechanistic modelling workflows to predict and elucidate chemical reactivity and catalysis, physical chemical behaviour, or chemical stability of drug molecules and formulations thereof \n * \n\nSupport drug project campaigns with expert insights on chemical synthesis, reactivity, stability, and catalysis \n * \n\nCo-develop our group's strategic developments in the field of machine learning, AI for chemistry, and computational chemistry for predictive science in drug development \n * \n\nCollaborate across functions and together with leading experimental scientists, digitisation specialists, and IT to drive digital chemistry forward \n\n \n\nExpected background for the role \n\n * \n\nPhD in computational chemistry or equivalent \n * \n\nExpert knowledge in organic synthesis, physical and theoretical chemistry \n * \n\nInternational recognised track record of applying and developing methodologies in molecular modelling and machine learning for druglike molecules \n * \n\nSeveral years of industrial experience in the field of drug design, pharmaceutical chemistry, or drug development \n * \n\nExperience in applying and developing predictive and ML methodologies in the area(s) of chemical reactivity, analytical chemistry, catalysis, (retro-)synthesis, and/or chemistry automation \n * \n\nExperience in the field of high-performance computing, cheminformatics, and scientific programming \n * \n\nExcellent communication skills, written and spoken; self-motivated team player \n\n \n\n \n\nWhy AstraZeneca \n\nAt AstraZeneca, we turn ideas into life changing medicines and strive to continuously meet the unmet needs of patients worldwide. Working here means being entrepreneurial, thinking big, and working together to make the impossible a reality. \n\nUltimately, it's more than a job. We know that our work impacts people with serious conditions, many of whom have no other alternatives. That's what drives us - the potential to impact over one billion patients worldwide. \n\n \n\nSo, what's next? \n\nAre you already imagining yourself joining us? Good, because we can't wait to hear from you! \n\nWelcome with your application; CV and cover letter, no later 15 February, 2026.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy4xOTUzNi4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-02-02T10:20:45",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30549611",
        "title": "Experienced Principal AI Scientist in Chemistry",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have the expertise and passion to harness Artificial Intelligence (AI) for drug development in the pharmaceutical industry? Join AstraZeneca and use your expertise to implement groundbreaking methodologies, accelerate digital innovation, and help deliver life-changing medicines to patients worldwide. This isn't just a role, it's your opportunity to transform the future of medicine and improve millions of lives. \n\n \n\nWhat we do \n\nAstraZeneca is a global, science-driven BioPharmaceutical business and our innovative medicines are used by millions of patients worldwide. Ultimately, our aim is to work towards a cure for some of the world's most complex diseases. Whether that's by shaping the patient ecosystem and focusing on outcomes, or by progressing potential medicines and accelerating their launch. \n\nPharmaceutical Sciences at AstraZeneca delivers the therapies of the future through scientific leadership in drug delivery, design of synthetic routes, and manufacturing of Active Pharmaceutical Ingredients and drug products. In essence, we are working \"from molecule to medicine\" to develop medicines for our patients today and tomorrow. \n\nThe Predictive Science, Digital, and Automation (PSDA) department leads the digital transformation of Pharmaceutical Sciences to drive innovation, optimize drug development, and enable data- and predict-first driven decisions. We develop and apply computational chemistry, machine learning (ML), and Artificial Intelligence (AI) methodologies - coupled with user centric informatics for seamless data capture, integration, insight, and prediction. This is coupled with strong leadership and expertise to advance lab and process automation all to accelerate projects. \n\n \n\nThe role \n\nWe are now seeking for a Principal AI scientist to join our team in Gothenburg, Sweden. This role will be at the heart of driving agentic AI and cross-departmental digital transformation within Pharmaceutical Sciences. \n\nWe are looking for a candidate who is experienced in deploying graph based deep learning and/or agentic AI systems in chemistry, drug delivery and formulation science and is skilled at harnessing and connecting scientific knowledge from complex data. The ideal candidate will have demonstrated success embedding AI solutions within scientific teams, working collaboratively across departments, and navigating a landscape rich in existing and evolving digital platforms. \n\nYou'll leverage your expertise to develop and lead our efforts in implementing agentic AI solutions into predict-first driven drug development workflows, bridge experimental and data science, and work with automation specialists to implement self-learning lab concepts. You will help shape our approach to leveraging AI models, designing orchestration and prompt engineering strategies, and collaborate to ensure we are at the forefront of fundamental AI developments. \n\n \n\nYour core responsibilities will include: \n\n * \n\nLead the design and implementation of agentic AI systems to facilitate scientific discovery and drive productivity. \n * \n\nDeliver agentic AI and generative AI based solutions for drug development tasks \n * \n\nEmbed within and collaborate across scientific, digitisation, and IT teams to ensure that AI-driven solutions are both impactful and well-integrated into current workflows. \n * \n\nRepresent the group internally and externally, sharing insights on how best to deploy agentic AI to unlock data-driven value within R&D. \n * \n\nFoster a scientific culture that connects lab innovation with advanced computational methods leading to a predict first mindset in early drug development \n * \n\nCollaborate internally & externally to pursue the development of foundation models for Chemistry, Manufacturing and Control (CMC) \n\n \n\nEssential requirements for the role: \n\n * \n\nPhD in natural sciences \n * \n\nSeveral years of industrial experience in the field of drug design, pharmaceutical chemistry, or drug development \n * \n\nExpert knowledge in using generative AI applied to drug design and development (e.g. Graph ML and representation learning; agentic AI and orchestration; Scientific data integration) \n * \n\nDomain knowledge in computational chemistry, chemical informatics, and/or laboratory and data workflows preferred \n * \n\nExcellent communication skills, written and spoken; self-motivated team player \n * \n\nExperience in project leadership \n * \n\nDemonstrated System-level design and platform thinking \n * \n\nDemonstrated external reputation (e.g. via internationally recognised publication track record) \n\n \n\nWhy AstraZeneca \n\nAt AstraZeneca, we turn ideas into life changing medicines and strive to continuously meet the unmet needs of patients worldwide. Working here means being entrepreneurial, thinking big, and working together to make the impossible a reality. Ultimately, it's more than a job. We know that our work impacts people with serious conditions, many of whom have no other alternatives. That's what drives us - the potential to impact over one billion patients worldwide. \n\n \n\nSo, what's next? \n\nAre you already imagining yourself joining us? Good, because we can't wait to hear from you! Welcome with your application; CV and cover letter, no later 15 February, 2026.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy4yNzM3MS4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-02-02T10:19:45",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30549609",
        "title": "Automation Project Leader and Business Analyst",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have expertise in, and passion for developing and deploying lab automation to accelerate drug development in the pharmaceutical industry? Join AstraZeneca and use your expertise to implement transformative automated methodologies closely integrated with data driven & AI approaches and help deliver life-changing medicines to patients worldwide. This isn't just a role, it's your opportunity to transform the future of medicine and improve millions of lives. \n \n\nWhat we do \n\nAstraZeneca is a global, science-driven BioPharmaceutical business and our innovative medicines are used by millions of patients worldwide. Ultimately, our aim is to work towards a cure for some of the world's most complex diseases. Whether that's by shaping the patient ecosystem and focusing on outcomes, or by progressing potential medicines and accelerating their launch. \n\nPharmaceutical Sciences at AstraZeneca delivers the therapies of the future through scientific leadership in drug delivery, design of synthetic routes, and manufacturing of Active Pharmaceutical Ingredients and drug products. In essence, we are working \"from molecule to medicine\" to develop medicines for our patients today and tomorrow. \n\nThe Predictive Science, Digital, and Automation (PSDA) department leads the digital transformation of Pharmaceutical Sciences to drive innovation, optimize drug development, and enable data- and predict-first driven decisions. We develop and apply computational chemistry, machine learning (ML), and Artificial Intelligence (AI) methodologies - coupled with user centric informatics for seamless data capture, integration, insight, and prediction. This is coupled with strong leadership and expertise to advance lab and process automation all to accelerate projects. \n\n \n\nThe role \n\nWe're looking for a highly skilled and motivated Automation Project Leader and Business Analyst to join our Automation Team within Predictive Science, Digital and Automation (PSDA) in Gothenburg, Sweden. \n\nYou will work across Pharmaceutical Sciences, join a newly formed, highly collaborative team, and lead business analysis and project management to deliver automation solutions that drive efficiency and speed in drug development projects. Our work spans the early phases of drug development, from pre-clinical into clinical. \n\nTo succeed in this role, you need a solid understanding of the drug development process and strong technical knowledge of lab automation, preferably in a life science environment. You must have excellent written and verbal communication skills, with the ability to engage and collaborate across boundaries, a positive problem-solving attitude, and a strong delivery focus. \n\nThis is a business analysis/project management role where you will work collaboratively with many colleagues, leading and driving the implementation of automated workflows. You know how to lead and motivate others to deliver results. You will get the opportunity to influence and contribute to the progression of automation and drive the efficiency and scientific development within the field of pharmaceutical science at AstraZeneca. \n\n \n\nRequired qualifications, Skills and Experience: \n\n * \n\nUniversity degree (PhD) in a relevant discipline, preferable with industry experience \n * \n\nSolid knowledge of laboratory automation in life science \n * \n\nDocumented experience of business analysis and/or project management \n * \n\nGood knowledge of the drug development process \n * \n\nReadiness to champion and drive automation \n * \n\nStrong ambition to develop yourself and others \n\n \n\nIf you also have experience in one or more of the following areas - great! \n\n * \n\nExperience of pharmaceutical development \n * \n\nKnowledge and experience of end-to-end automated integrated workflows \n * \n\nSkilled in programming of lab automation software \n * \n\nTrack record of driving scientific projects, publications \n * \n\nKnowledge and experience of working according to GxP \n\n \n\nAstraZeneca is one of the world's most exciting bio-pharmaceutical companies. From scientists to sales, lab techs to legal, we're on a mission to turn ideas into life-changing medicines that improve patients' lives and benefit society. We need great people who share our passion for science and have the drive and determination to meet the unmet needs of patients around the world. \n\n \n\nSo, what's next? \n\nIf you are interested, apply now! We encourage you to send your application (CV and cover letter) as soon as possible, since interviews will be held continuously, but no later than 15 February, 2026.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy4zMTI4NS4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-02-02T10:18:46",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30549555",
        "title": "Scientist - Automation, Assay, Profiling & Cell Sciences",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you excited about science, technology, and learning new lab skills? Do you enjoy solving problems, working with innovative equipment, and making a real impact in drug discovery? \n\n \n\nJoin us as a Scientist in the Assay, Profiling & Cell Sciences team within Discovery Sciences, based at the AstraZeneca R&D site in Gothenburg, Sweden. This is a fantastic opportunity to grow your career in a supportive environment while working with cutting-edge laboratory automation. \n\n \n\nWhat you'll do? \n\nIn this hands-on lab role, you'll work closely with experienced scientists and automation specialists who will help you grow your technical expertise. You'll contribute to generating high quality in vitro pharmacology data and help keep our automated systems running smoothly. \n\n \n\nYou'll be involved in: \n\n * \n\nRunning and supporting lab automation - helping operate robotic systems, liquid handlers, and plate readers that drive high throughput experiments\n\n * \n\nLearning and applying workflow execution - following established protocols to set up assays, handle samples, and collect data\n\n * \n\nDeveloping practical coding skills - assisting with simple scripts for instruments and data handling \n\n * \n\nImproving how we work - sharing observations, helping troubleshoot day-to-day issues, and contributing to a culture of continuous improvement \n\n * \n\nCollaborating across teams - working with colleagues across Discovery Sciences, CVRM, and R&I to support a wide range of drug discovery projects\n\n \n\nThis role is perfect if you are curious, hands-on, and eager to expand your technical skills while contributing directly to scientific progress. \n\n \n\nEssential requirements for the role:\n\n * \n\nA BSc or MSc in engineering, biotechnology, molecular biology, or a related field \n\n * \n\nExperience in working with laboratory automation and liquid handling systems (from studies, internships, or industry) \n\n * \n\nExperience in programming/scripting for lab tools \n\n * \n\nA collaborative mindset and strong communication skills \n\n * \n\nEnthusiasm for solving problems and developing new skills \n\n \n\nDesirable requirements for the role:\n\n * \n\nExperience in cell biology, biochemistry, molecular biology or in vitro pharmacology \n\n * \n\nExperience with automated systems, robotics, or scheduling software \n\n * \n\nExperience with LIMS/ELN systems \n\n * \n\nInterest in AI/ML for workflow or data optimisation \n\n \n\nWhy AstraZeneca? \n\nAt AstraZeneca, you'll join a community that celebrates curiosity and encourages bold thinking. We use digital tools, automation, and AI to accelerate our discoveries and push boundaries. You'll have opportunities to learn, grow, and contribute to lifechanging medicines. \n\n \n\nWhat's next? \n\nIf you're ready to kickstart your automation and discovery sciences career - apply today! The last application date is February 15, 2026. \n\nFor more information, contact hiring manager Cecilia Boreström at cecilia.borestrom1@astrazeneca.com.",
        "url": "https://www.aplitrak.com/?adid=a2Fyb2xpbmEuemluZ21hcmsuODM2OTkuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-02-02T10:12:35",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 100
    },
    {
        "id": "30540233",
        "title": "Senior AI Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "Are you passionate about building intelligent, data-driven systems that create real business value? We are looking for Senior AI Engineers who want to work with applied AI as part of modern cloud and data platforms.\nWhat You’ll Do\n• Build and deploy AI-enabled solutions that run in production • Integrate machine learning into backend and cloud-based systems • Collaborate with software, data, and platform engineers • Operationalize AI using MLOps and CI/CD practices • Ensure scalability, reliability, and monitoring of AI solutions\nWhat We Are Looking For\n• 7+ years of experience in software, data, or AI-related roles • Hands-on experience with applied machine learning • Strong skills in Python and data processing • Experience with AWS and/or Azure • Understanding of deploying and operating AI in production • Fluent English, spoken and written\nNice to Have\n• Experience with Databricks, Spark, or similar platforms • Background in automotive, industrial, or enterprise systems • Experience with predictive, optimization, or automation use cases\nWhy Work With Us?\nAt Explipro, you will work with leading companies in automotive and industrial domains, helping move AI from ideas into real-world systems. We offer long-term assignments, modern technology stacks, and a culture built on trust, collaboration, and technical excellence.\nReady to make AI part of real systems? Apply now.",
        "url": "https://career.explipro.com/jobs/7138467-senior-ai-engineer/applications/new?promotion=1814901-arbetsformedlingen",
        "published": "2026-01-29T17:41:19",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 80
    },
    {
        "id": "30537576",
        "title": "CMC Capability Business Analyst",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you motivated to simplify and elevate user experiences in Early Science? Do you turn complex scientific needs into clear, testable IT requirements and understand the life sciences R&D landscape? Do your strengths span modern technology capabilities, from data pipelines and analytics to change management and agile delivery, with a product mindset focused on measurable outcomes? If so, this could be the role for you. We're seeking a CMC Capability Business Analyst to join our IT Early Science team in Gothenburg, Sweden.\n\n \n\nAbout AstraZeneca\nAstraZeneca is a global, innovation‑driven biopharmaceutical company focused on discovering, developing, and commercializing medicines for some of the world's most serious diseases. We're an inclusive, collaborative workplace where you're empowered to push the boundaries of science and grow through lifelong learning, making a meaningful impact for patients and society.\n\n \n\nAbout R&D IT and the CMC Capability\nWe're building the digital, AI, and data capabilities that power AstraZeneca's transformation, giving you the space to explore, develop, and thrive, supported by leaders who coach and invest in your growth. In Early Science, our scientists run complex experiments to advance drug discovery and development. Within this, the Chemistry, Manufacturing & Controls (CMC) capability digitizes key activities across small molecules and biologics, partnering with Research and Operations to ensure new products are safe, consistent, and ready for patients. We shape the technology and data roadmap, align to AstraZeneca's FAIR data strategy, and deliver reusable data products on a modern stack.\n\n \n\nWhat you'll do\nYou'll partner with scientific and technical teams to connect the \"why\" to the \"how,\" aligning solutions to strategy and platforms while detailing functional design from the user perspective. Typical responsibilities include discovery workshops and workflow mapping; translating scientific needs into clear, testable requirements and business cases; shaping delivery options with R&D IT Platforms and vendors; defining user journeys and functional designs; contributing to PI Planning and backlog refinement; enabling data‑informed decisions and FAIR data products; and keeping stakeholders aligned while managing scope and trade‑offs.\n\nEssential requirements\n\n * Strong communication and influencing skills across diverse stakeholder groups.\n * Proven ability to translate scientific needs into clear IT requirements for delivery teams.\n * Familiarity with agile practices and a product, user‑focused mindset.\n * Experience with data pipelines and modern analytics.\n * Experience in change management and process improvement.\n * Proficiency with collaboration and process tools such as JIRA and Confluence, and understanding of Git and CI/CD.\n * Exposure to wireframing/prototyping tools (e.g., Axure, Balsamiq, Figma).\n\nDesirable requirements\n\n * Understanding of life sciences R&D, ideally within CMC or adjacent domains.\n * Knowledge of modern technology capabilities across data platforms, integration patterns, and cloud services.\n * Familiarity with FAIR data principles and data product concepts.\n * Scrum Master or Project Management certification.\n\n \n\nWhy join us?\nThis is a pivotal moment as we scale digital, data, and AI across R&D. You'll help build the partnerships, platforms, and ways of working that accelerate science with speed and quality, making a tangible difference for patients worldwide.\n\n \n\nPlease submit your CV and cover letter by 20 February 2026",
        "url": "https://www.aplitrak.com/?adid=Y2ZhbGsuNzY3NjguMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-01-29T12:52:26",
        "deadline": "2026-02-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 90
    },
    {
        "id": "30517419",
        "title": "Solution Architect",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\r\n\r\nWhat you will do\nAs a Global Solution Architect, you will be part of VFS which, in partnership with the Volvo Group brands, is facilitating the development of common Services platforms that are supporting Volvo Group’s expansion.\nDesigning solutions compliant with the CAST model (Common Architecture, Shared Technology) allows VFS to create scalable, cost-effective global solutions while giving Volvo Group brands the ability to deliver high value to their customers and employees.\nYou will also provide guidance and ensure adherence to best practices, standards, and target architecture as per the VFS Design Authority process.\nAs an IT solution architect, you will work in a cross-functional team to understand the project/product scope, objectives, and business value. You will engage with external vendors to evaluate COTS (Commercial Off-The-Shelf) solutions to define which solutions are in line with our long-term technology roadmap and business strategy.\nYou will collaborate with UI/UX designers, front-end and back-end developers, and QA engineers to ensure the quality and performance of IT solutions is top-notch.\n\nYour future team\nYou will report directly to the Global Solution Architecture Chapter Lead within VFS D&IT and will be assigned to a stable, global cross-functional team. Digital and IT is the engine of the VFS business, and we continue our strategic journey to further improve performance and to deliver the best customer experience in the industry.  In this exciting environment, we are focused on Digital Innovation to meet the demands of our customers in an increasingly digitalized world. \nIn many of our markets, VFS has won the Great Place to Work award, where Great Work is done. By interacting with each other as an on-site business, we build relationships, which allow us to work together more efficiently and form stronger bonds with our colleagues and customers. The preferred location is Gothenburg, Sweden. \n\nWho are you?\n\nDo you dream big? We do too, and we are excited to grow together. In this role, we believe it is the right mindset that will make a difference at VFS. If you, besides your genuine interest in working with people in Transforming Together, also have a positive, service-oriented, and collaborative mindset, and take a proactive approach to handling all responsibilities, idea generation, and recommendations for productivity and efficiency - then we would welcome you to apply for this role.  \n\n\nQualifications likely required to be successful in this role include:\n•    A bachelor’s degree in computer science, software engineering, or a related field.\n•    Open minded and creative thinker to address complex challenges (using Design Thinking).\n•    Excellent communication, collaboration, and problem-solving skills. English fluency is mandatory.\n•    Acting as a mentor, providing technical guidance to development/stable teams.\n•    Automotive and/or financial banking industry experience is good to have.\n•    Enterprise Azure Architecture (Senior Level)\n5+ years designing enterprise-scale solutions on Microsoft Azure, including multi-region deployments, high availability and disaster recovery, identity and access management, networking, and security controls.\nDeep understanding of Azure services, including computing, storage, networking, databases, security, DevOps, and AI.\n•    Integration & API Architecture\nStrong experience in designing and governing APIs and integrations using REST, event-driven, and asynchronous patterns, with hands-on knowledge of Azure Integration Services (Service Bus, Event Grid, Logic Apps, Azure Functions).\n•    Cloud-Native Application Design\nProven ability to architect cloud-native solutions using microservices, containers (AKS), serverless architectures, and API gateways, applying scalability, performance, and reliability best practices.\n•    DevOps & Automation\nExperience with CI/CD pipelines, Infrastructure as Code (Bicep, ARM, or Terraform), and observability/monitoring to ensure solutions are reliable, secure, and operable in production.\n•    Security, Compliance & Architecture Governance\nExperience designing secure, compliant solutions in regulated environments (financial services preferred), working within formal architecture governance models and applying security-by-design and zero-trust principles.\n•    Certifications (Good to have)\nAZ-104: Microsoft Certified: Azure Administrator Associate\nAZ-400: Designing and Implementing Microsoft DevOps Solutions\nAZ-500: Microsoft Azure Security Technologies\n\nReady for the next move?\n\nIf you want to make a real impact in your career, Volvo Financial Services is where you want to be.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43926807",
        "published": "2026-01-26T09:25:06",
        "deadline": "2026-02-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511893",
        "title": "Automation Engineer to Rebl Industries",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Rebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries\r\n\r\nAre you an automation engineer who loves robotics, thrives in hands-on problem solving and wants to help scale the next generation of AI-powered automation? \n\nJoin the team that’s redefining industrial automation\nRebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries\n\nWhat you will do\nAs an Automation Engineer at Rebl, you turn cutting-edge technology into reliable automation. You’ll build and integrate control systems, tune robot performance, test and validate installations, as well as ensure our solutions run smoothly in demanding operational environments. You’ll collaborate closely with mechanical, electrical and software engineers – from early concepts to deployment and continuous improvement as systems scale across customer sites.\n\nWhat we’re looking for\n\n• Post-secondary education in Automation, Mechatronics, Robotics, or a related engineering field (university degree or vocational/technical school)\n• Minimum 5+ years of professional experience in automation, mechatronics or similar engineering roles\n• Proven experience designing, implementing and commissioning automation systems in real-world environments\n• Strong PLC programming skills (Siemens TIA Portal preferred) and hands-on control system knowledge\n• Experience integrating sensors, actuators and mechatronic components into cohesive systems\n• Proficiency in Python for automation, data communication, or system integration\n• Familiarity with CAD and simulation tools to support mechanical and system design\n• Ability to troubleshoot complex systems, optimize performance, and ensure reliable operation in production\n• A proactive problem-solving mentality with the ability to work independently and drive projects forward\n\nYour mindset\nYou’re pragmatic, curious and energized by solving real-world automation challenges. You move fluidly between design, implementation and hands-on testing. You take ownership, communicate clearly and enjoy collaborating across disciplines. You thrive in a scaling environment where speed matters, structure evolves and every engineer has real influence. Most importantly, you want to build things that work – in production, at scale, with measurable impact.\n\nWhy Rebl Industries\nAt Rebl Industries, you join a sharp, driven and supportive team where your work has immediate effect. You help define the future of robotic automation — not in theory, but in real industrial use. Your ideas shape both the product and the company as we scale to new markets and new levels of performance.\n\nApply now!\nIn this recruitment process Rebl Industries collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Talent Advisor Marcus Hultberg at +46 723 66 49 43 or marcus.hultberg@mpyascitech.com. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=307549&ref=platsbanken",
        "published": "2026-01-23T12:03:45",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30510906",
        "title": "Data Platform Architect and Tech Lead",
        "employer": "Wallenius Wilhelmsen Ocean As, Filial Sverige",
        "location": "Göteborg",
        "description": "Purpose of the role \n\n\nThe Data Platform Architect and Tech Lead is a hybrid role with both design and hands-on responsibilities. The idea is to nurse and evolve the data platform into a robust, scalable and futureproof rig that can meet whatever is coming. This is an important piece of the puzzle to, in an accountable way, deliver streams of data from everywhere to anywhere possible, and hence a cornerstone to our digital strategy needed to deliver the business outcomes we want and need. \nResponsibilities \n\n\nOwning the Data Platform, which in this context means the chain of components (in data subscriptions) the data flows through and not the data themselves  \nOversee specifically the Microsoft release “train” within the data space, but also follow into general Data and AI trends \n\n\n\nMaintain an internal roadmap for addressing forced changes and improvement opportunities. \n\n\n\nPlan and drive platform component changes when needed.    \n\n\n\nSuggest and implement resilience measures according to Business appetite \n\n\n\nCollaborate with the wider enterprise architect team to standardize and drive synergies \n\n\n\nOptimize resource tuning for both cost and performance \n\n\n\nOwn and execute on recommendations from Azure Advisory  \n\n\n\nCollaborate with Engineers to define data architecture standards. \n\n\n\nImplement monitoring tools, alarming and self-healing capabilities \n\n\n\nTroubleshoot and resolve platform component issues. \n\n\n\nRequired Experience \n\n\n• Advanced degree in Technology, Engineering, Computer Science, or related field preferred \n\n\n• Demonstrable track record of designing and handling reference architecture preferable from Microsoft \n\n\n• At least 5+ years in a Data Engineer Role or similar hands-on experiences",
        "url": "https://careers.walleniuswilhelmsen.com/careers-home/jobs/15056?lang=en-us",
        "published": "2026-01-23T10:43:00",
        "deadline": "2026-02-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30442985",
        "title": "Group Operations Manager",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "Lead and manage global end‑user support services across both remote and onsite channels, ensuring a seamless, high‑quality experience for employees worldwide. This role drives operational excellence for the Global Service Desk—delivering multilingual, multichannel 24×7 support—and oversees Field Service operations, including onsite assistance, IMAC projects, and Hardware Asset Management. The focus is on achieving SLA and CSAT targets, optimizing processes through ITIL and ServiceNow, fostering collaboration between resolver teams, and advancing automation and AI initiatives toward a zero‑touch support model, while maintaining compliance, safety, and superior user experience across all touchpoints.\n\n\nKey Responsibilities:\n \n·      Global & Onsite Operations Leadership: Oversee day‑to‑day operations for the Global Service Desk (L1/L2) and Field Service teams, including workforce planning, shift governance, onsite dispatch, and technician scheduling across multiple geographies. \n·      Multichannel & In‑Person Support: Deliver seamless end‑user support through phone, email, self‑service portal, chat, mobile app, virtual agent, and onsite walk‑up/floor assistance. \n·      Process & Platform Excellence: Ensure ITIL‑aligned workflows and ServiceNow execution for incident, request, IMAC, and asset management; maintain accurate ticket data and CMDB updates. \n·      Performance Management: Monitor and improve SLA attainment, CSAT, First Contact Resolution, backlog aging, reassignment counts, first‑time‑fix rates, and revisit ratios. \n·      Knowledge & Quality: Drive knowledge management and standard work practices; maintain high‑value KB articles and enablement programs for both desk and field teams. \n·      Automation & Innovation: Virtual agent adoption, and automation initiatives to progress toward zero‑touch support while enhancing user experience. \n·      Hardware Asset Management (HAM): Govern asset lifecycle integrity, inventory accuracy, audits, and logistics for loan equipment and IMAC projects. \n·      Collaboration & Escalation: Coordinate handoffs and swarming with resolver groups (applications, infrastructure, UAM) to ensure timely resolution and ownership. \n·      Stakeholder Engagement & Communication: Provide clear updates on service performance, outages, and improvement plans; deliver executive‑level support where required. \n·      Financial & Vendor Oversight: Manage budgets, sourcing, and vendor performance for both service desk and field operations.\n\n\n\n\nRequired Skills & Qualifications:\nEducation & Experience\nBachelor’s degree in IT, Computer Science Engineering, or related field (or equivalent experience).\n10–15+ years in IT service operations, including: \nManaging large, multi-site Global Service Desk teams.\nLeading Field Service/Onsite support and Hardware Asset Management.\nMinimum 7–10 years in leadership roles with proven ability to manage geographically distributed teams.\n\nTechnical Expertise\nStrong knowledge of ITIL (v3/v4) frameworks and ITSM best practices.\nHands-on experience with ServiceNow (incident, request, IMAC, CMDB, HAM modules).\nFamiliarity with omni-channel support (phone, email, self-service, chat, virtual agent) and onsite support processes.\nProficiency in asset lifecycle management, inventory control, and IMAC project delivery.\n\nCertifications (Preferred)\nITIL Foundation (Intermediate modules a plus).\nCloud Certifications in (MS/AWS/Google).\nNetwork for hardware troubleshooting.\nPrince2/SIAM Certification \n\nCore Skills\nLeadership & People Management: Ability to coach, motivate, and manage diverse teams across multiple geographies.\nOperational Excellence: Strong analytical skills for SLA, CSAT, FCR, backlog, and performance metrics.\nCommunication: Clear, concise communication for stakeholders and end users; crisis communication during outages.\nProblem Solving & Innovation: Drive automation, AI adoption, and continuous improvement initiatives.\nCollaboration: Work effectively with resolver groups, vendors, and cross-functional teams.",
        "url": null,
        "published": "2026-01-07T21:35:40",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30439013",
        "title": "Senior Machine Learning Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Role Description:\nThe Data Scientist Chapter is located in Sweden (Gothenburg and Eskilstuna), and France (Lyon). The Machine Learning Engineer position will be located in Gothenburg.\n\n\n \n\n\nAs a “Machine Learning Engineer” with us, you will:\n\n\n \n\n\nCollaborate with diverse, international teams focused on delivering value to customers and stakeholders.\nTake a holistic approach to data science, machine learning and AI. From understanding business needs to industrializing solutions and enabling continuous improvement.\nApply your expertise across different areas and domains within Volvo Group, spanning from trucks, buses, construction equipment, to energy solutions, autonomous technologies, financial services, and more.\nMaster key aspects of data science, machine learning and AI, including mathematical statistics, computer science, cloud architecture, LLMs, and relevant programming languages.\nMoreover, candidates are expected to be familiar with aspects concerning security, governance, and regulatory requirements.\nTake lead in designing, implementing and owning lifecycle management (CI/CD, Ops) of data science, machine learning, and AI products.\nExcel in communication with colleagues and collaborators worldwide, fluently in English and preferably in a local language.\n\n\nMeriting Competencies:\n\n\n \nPrevious experience of managing and owning data science, machine learning, AI products.\nIndustrialization and commercialization of the above products in regulated environments.\nManaging and leading practitioner communities.\nAdvanced academic achievements.\nWho are you?\nThe right candidate should be able to think and act strategically, operate, and implement change tactically, and effectively deal with ambiguity and manage change priorities in a business-focused, fact-based, and collaborative way to achieve real impact. This role requires solid communication skills and a passion for leading, inspiring, and co-creation together with other members of the product team.\n\n\nTo achieve our goals, we collaborate within and across teams. We nurture open dialogue and collective work to create a sense of unity and trust. We also build a work environment where diversity in expertise, opinion, and culture is valued.\n\n\nAbout the Data Function:\nOur 'Data' function is a vibrant, international community with 900+ members across seven countries. We collaborate closely with various divisions, business areas, and group functions within the Volvo Group to foster an environment where ideas flourish, and goals are achieved collaboratively.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=25273&company=volvoinfor&st=13ADC5F9DB9946647A54FD886066BA740BB3C6E4",
        "published": "2026-01-07T10:39:25",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30419371",
        "title": "CQR Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour Role\nWe are looking for an CQR Engineer for our pharmaceutical projects in Gothenburg (compliance, quality & regulatory).\nIn this role you will play a key role in:\n• Work towards diverse goals depending on the client's specific needs\n• Driving and supporting our clients in achieving their quality and regulatory objectives\n• Collaborate and support pharmaceutical clients to deliver patient-focused, compliant, and efficient solutions\nYour Profile\n• Degree in pharmacy or engineering\n• Understanding of Quality Systems and GMP and related activities to Investigational Medicinal Product (IMP)\n• Experience of documentation, deviations, changes, and other quality and compliance decisions in the development projects.\n• Experience preferably within a pharmaceutical manufacturing organization is desirable\n• Comprehensive understanding of EU pharmaceutical regulations, encompassing product registration, manufacturing processes, and compliance with EMA guidelines and GxP quality standard\nWhat we believe you will enjoy about working here\n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance.\n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities.\n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nApplication\nAs part of our recruitment process, identity verification or background checks may occasionally be conducted.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://career5.successfactors.eu/sfcareer/jobreqcareerpvt?jobId=384113&company=capgemitecP3&st=66F098DD95D20A45878A7C89014B4A8868E84670",
        "published": "2025-12-23T10:13:30",
        "deadline": "2026-03-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30406272",
        "title": "Doctoral student in number theory or harmonic analysis",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "We are looking for one Doctoral student at the divison of Algebra and Geometry. The research project will be at the interface of number theory and harmonic analysis and will be conducted within the research group of Simon Rydin Myerson.\n\nAbout us \nThe Department of Mathematical Sciences at the Chalmers University of Technology and the University of Gothenburg has about 200 employees and is the largest department of mathematics in Sweden. We have an international environment with frequent exchanges with other universities around the world. We provide a friendly, creative, and supportive atmosphere with a steady flow of international guests. Equality and diversity are substantial foundations in all our activities. We work actively to be a parent-friendly organization.\n\nAt the Division of Algebra and Geometry we conduct research in areas such as algebraic geometry, complex geometry, number theory, mathematical physics and the mathematics of AI.\n\nAbout the research project  \nMany open questions in number theory, such as the Manin-Peyre conjecture, concern Diophantine equations. Even certain questions in harmonic analysis and PDE can be understood as Diophantine problems.\n\nThis project will use analytic techniques to study problems concerning polynomials in (algebraic or rational) integers. An extension or alternative is to use these Diophantine techniques to tackle problems in harmonic analysis or PDE, especially spectral multiplier estimates on compact manifolds and nilmanifolds.\n\nThe doctoral student could establish existence of solutions using modern forms of the Birch-Davenport circle method, or prove upper bounds using the sieve or determinant methods. Systems of equations with differing degrees, and cubic equations in three integer variables, are current frontiers in this area.\n\nAs a Doctoral student you will be part of an international research environment while you expand your knowledge of the field and write your thesis. This gives opportunities for many inspiring conversations, a lot of autonomous work and some travel. You are expected to develop your own ideas and communicate scientific results orally as well as in written form. In addition, the position will normally include 20% departmental work, mostly teaching duties\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in mathematics or a related field.\n• You will need strong written and verbal communication skills in English.\n• The project requires knowledge in either number theory, harmonic analysis, or algebraic geometry. It is advantageous to have knowledge in all of these fields.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of mathematics .\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing. \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours.\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n• The expected starting date is September 2026, or as agreed. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than 23 February 2026   \n\nFor questions, please contact:  \nName: Daniel Persson, Head of unit\nEmail: daniel.persson@chalmers.se\n\nName: Anders Södergren, Director of graduate studies\nEmail: andesod@chalmers.se\n\nName: Simon Myerson, Project leader\nEmail: myerson@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14507&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T13:52:24",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30361762",
        "title": "Senior Data Architect",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Description:\n\n\nWe are looking for a senior data architect who will work in a BI & Analytics area called Parts Sales within Volvo Trucks.\n\n\nThis person should be able to understand business stakeholders and translate their needs into technical solutions.\n\n\nCandidate must have\n\n\n• Demonstrated experience as a Data Architect handling architectural responsibilities on large-scale implementations.\n• Deep expertise in Azure Data Services, Databricks, and related cloud technologies & tool ecosystem.\n• Advanced proficiency in data modeling techniques, including relational, dimensional, NoSQL & GraphDB models.\n• Strong knowledge of API design, event-driven architectures, and streaming platforms (e.g., Kafka).\n• Familiarity with AI/ML integration, enabling seamless incorporation of AI models into enterprise workflows.\n• Hands-on experience with CI/CD pipelines, Azure DevOps, and infrastructure automation.\n• Skilled in SQL, Python, and PySpark for data engineering and architectural validation.\n• Solid understanding of data governance frameworks, GDPR compliance, and cloud security best practices.\n• Excellent stakeholder management and communication skills.\n• Ability to produce wireframes, architectural diagrams, and comprehensive documentation for governance and review processes.",
        "url": "https://www.clicktohire.se/",
        "published": "2025-12-10T21:46:10",
        "deadline": "2026-05-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357030",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-12-09T21:47:00",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357033",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-12-09T21:46:15",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30351764",
        "title": "Data Specialist at Kognic",
        "employer": "Kognic AB",
        "location": "Göteborg",
        "description": "About Kognic\nKognic helps car manufacturers & suppliers develop self-driving vehicles. Our software merges and visualizes sensor data from vehicles that is analyzed and labeled by people, turning raw data into valuable input for autonomous machines. We are on an exciting path towards profitability and are actively building marketing momentum as we achieve product-market-distribution fit across our target markets. That's why we need you!\nThe role\nIn the role of Data Specialist, you will work closely with leading automotive customers at the forefront of autonomous driving and AD/ADAS perception model development. As the technical expert within the account team, you will play a key role in ensuring the delivery of high-quality training data for these models.\nYou will own the technical setup of each project, serving as the central point for data quality, workflow optimization, customer onboarding, and technical communication. The role blends deep domain expertise in autonomous driving with hands-on involvement in data and annotation workflows, as well as strong cross-functional collaboration both internally and with customers.\nExamples of topics our team addresses include: determining the level of detail required in ground-truth annotations to deliver reliable system KPIs and support safety validation. As well as advising clients on how the objective of building safe autonomous vehicles translates to perception system KPI requirements, as well as annotation context, content, and quality.\nWe are looking for you!\nWe're looking for someone who ticks the following boxes:\n Bachelor’s degree in a relevant field (Computer Science, Data Science, Information Systems, Automotive engineering, Machine learning)\n 5+ years of experience in data quality or related fields, with a focus on AD/ADAS perception systems Expertise in AD/ADAS perception use cases (sensor modalities, annotation requirements, dataset design) to achieve specific system objectives\n Hands-on experience in machine learning for AD/ADAS, with a strong grasp of how annotated data impacts model training, system performance, and safety compliance.\n Deep understanding of data annotation workflows and quality assurance for training perception models in autonomous driving applications.\n \n Experience using Python and working in databases (SQL) or similar languages\n Experience in customer interactions (conducting technical demos, data analysis, addressing customer-specific needs) Strong communication skills, translating complex technical concepts for cross-functional teams\n Ability to manage multiple projects, ensuring high productivity while maintaining data quality standards.\n \n  Why Kognic?\nWe are in it to win, and have a lot of fun while doing it! To be part of Kognic is to be part of a purpose-driven company with strong values where we, together, create what Kognic will be tomorrow. Besides working with around 100 talented and humble people from many different nationalities, in a fun and creative environment, we also have many other great benefits!\n Working in the exciting field of AI and playing an important part in the world’s next great technological leap\n A hybrid work model and an employer that prioritises life-work balance\n Lots of team and office events, parental pay, salary exchange, great health benefits, order your own computer, place your own pension - to name a few\n  \nFrom our early days as a pure start-up to our current life as a scale-up, we work in a dynamic environment, which means that every day might be different from the next, but that is exactly how we want it. Kognicians all have a strong desire to explore uncharted territory and a willingness to constantly be learning.\nJoin us\nWe recommend that you submit your application as soon as possible since we select and perform interviews continuously. We do not require any cover letter but ask you to share your resume and answer a couple of questions in the application\nYou are more than welcome to have a look at our career website to read more about our recruiting process. If you have any questions regarding the position, please contact our Hiring Manager, Sara Roth (sara.roth@kognic.com) \n About Kognic\nKognic was conceived in the curious minds of Daniel Langkilde and Oscar Petersson, two engineering students, who dared to dream big and help machines make sense of our messy, chaotic, and unstructured world. Kognic's pioneering dataset management solution helps companies accelerate the development of high-performing and trusted AI products, focusing on bringing the most advanced driver-assistance systems (ADAS) and autonomous driving (AD) to market.",
        "url": "https://careers.kognic.com/jobs/6897649-data-specialist-at-kognic?promotion=1746012-arbetsformedlingen",
        "published": "2025-12-08T18:16:12",
        "deadline": "2026-05-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30558953",
        "title": "Senior Software engineer, Scientific Informatics",
        "employer": "EPAM Systems (Nordic) AB",
        "location": "Göteborg",
        "description": "Our client, a leading global pharmaceutical company, is seeking a highly skilled and motivated Bioinformatics Scientist to join their international research organization, driving innovation across multiple therapeutic areas. In this role, you will design, evaluate, and optimize computational methods for large-scale next-generation sequencing (NGS) analysis, contributing directly to discovery and development programs. You will build robust, production-grade bioinformatics workflows for high-performance computing (HPC) clusters and cloud environments, collaborating closely with biologists, data scientists, and domain experts across Oncology, Immunology, Infectious Diseases & Vaccines, Neuroscience, and Pharmacokinetics.\n\n\nResponsibilities\nDevelop, benchmark, and optimize computational methods to analyze diverse NGS datasets\nBuild and maintain scalable, automated bioinformatics pipelines for HPC and cloud-based execution\nPartner with interdisciplinary scientific teams to translate research needs into reproducible analytical workflows\nEvaluate and implement new algorithms, tools, and computational strategies to enhance data processing capabilities\nProduce clear technical documentation, reports, and scientific deliverables\n\nRequirements\nPhD with 1+ year of experience in bioinformatics, or MSc with 5+ years of relevant experience\nHands-on experience in processing NGS datasets (WGS, WES, RNA-seq, ChIP-seq, ATAC-seq, single-cell, etc.)\nPractical experience with workflow/pipeline scripting languages (e.g., Nextflow)\nStrong understanding of computational methods for alignment, assembly, variant detection, enrichment, or related genomics applications\nFamiliarity with common bioinformatics file formats (FASTA, FASTQ, BAM, VCF, etc.)\nProficiency in Python, R, or C++ within a Unix/Linux environment\nExperience with high-performance computing clusters and cloud computing platforms\nAbility to independently troubleshoot using documentation, GitHub, and online resources\nProven scientific publication record\nStrong collaboration, communication, and interpersonal skills\nExcellent written and spoken English (B2 level or higher)\n\nNice to have\nExperience with containerization technologies, such as Docker or Singularity\nExperience in applying or optimizing machine learning tools within a bioinformatics context\n\nWe offer/Benefits\nCONTINUOUS UPSKILLING, LEARNING & DEVELOPMENT\nDiversity of tasks and projects\nAssessment center for objective review of competency level\nPersonal development plan\nMentoring programs and leadership development\nCertification and professional development support\nAccess to learning platforms including more than 2,500 internal courses and the LinkedIn Learning library with 20,000+ courses\nEnglish courses taught by certified teachers\n\nCORPORATE BENEFITS\nExtra leave days\nReferral bonuses\n\nCOMPENSATION PACKAGE\nCompetitive compensation paid in USD\nRegular salary and performance reviews\n\nMEDICAL & HEALTHCARE\nPrivate health insurance\nWell-being events\n\nWORKING ENVIRONMENT\nRecreation areas and kitchens\nTea, coffee, and snacks\nWell-being events\nSports equipment and game consoles\nIT Equipment\nMicrosoft's Software Assurance Home Use Program (HUP)\n\nEPAM is a leading global provider of digital platform engineering and development services. We are committed to having a positive impact on our customers, our employees, and our communities. We embrace a dynamic and inclusive culture. Here you will collaborate with multi-national teams, contribute to a myriad of innovative projects that deliver the most creative and cutting-edge solutions, and have an opportunity to continuously learn and grow. No matter where you are located, you will join a dedicated, creative, and diverse community that will help you discover your fullest potential.\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://careers.epam.com/en/vacancy/python-scientific-informatics-engineer-bltlxqlul84uy67ingp_en",
        "published": "2026-02-03T14:23:15",
        "deadline": "2026-03-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465971",
        "title": "Data Scientist",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Data Scientist in the Data, Science & Research team!\nThe Role\nOur Data Science and Research (DSR) team creates and delivers data pipelines and machine learning based solutions towards internal stakeholders. We process billions of requests daily to enable sophisticated prediction pipelines within revenue estimation, conversion analysis and pricing automation. We develop and maintain advanced data-processing and training pipelines to improve the speed and precision of our solutions and deliver them in a highly scalable and resilient environment. You will be joining an experienced team of 14 Data Scientists, Machine Learning Engineers, Data Engineers and Operations Engineers building our products from end to end.\nWe are in search of a Data Scientist with the ability to work in an energetic and interactive environment. You must be a self-starter with a strong foundation in statistics and machine learning and as part of our team work closely with our machine learning engineers, data engineers and business stakeholders.\nMain tasks\nWork closely with stakeholders to understand business problems, define clear objectives and translate their concerns, suggestions and ideas into testable hypotheses and quantifiable metrics.\nPerforming statistical analyses and visualizations to understand the structure, patterns, anomalies and quality of data.\nClean, transform and prepare large and complex datasets for model training. You'll also identify and engineer relevant features to improve model accuracy and efficiency.\nDesign, build and train robust machine learning models using appropriate algorithms and techniques. This includes experimenting with different architectures and hyperparameters to optimize performance for specific business needs.\nWork with Machine Learning, Data and Operations Engineers to deploy the final model into production. This includes performing AB tests to measure and evaluate the models performance on real world data.\nExplain model results and statistical findings clearly to both technical and non-technical stakeholders deriving actionable insights.\n\n\n\nLearning Curve\nIn this role you will be using the best selection of tools and processes in the Data Science domain. You will be working within our ML platform providing automation and standardisation for analytical and exploratory work but also productionising and providing inference to business users and systems. Further, the role will enable you to learn even more about creating, developing and implementing standards for ML modelling and deepen your knowledge about ML concepts and frameworks. \nRequirements\nUniversity degree in a STEM discipline\n2 years of professional or other comparable exceptional experience like a PhD in a related field\nStrong analytical and quantitative skills\nProficiency in python including numerical and visualisation libraries like pandas or polars and matplotlib\nExperience in data analytics, exploration and modelling using jupyter or marimo\nExpertise in writing complex and optimised SQL queries for data extraction and manipulation\nFamiliarity with version control (git) and the ability to navigate and work in larger code bases\nUnderstanding and experience in working with ML modelling and tuning frameworks like sklearn, lightgbm, pytorch\nFamiliarity with LLM based solutions like RAG systems including orchestration and evaluation tooling like langchain or langfuse\nExposure to implementing orchestrated training pipelines using model management using airflow and mflow\nExposure to prediction service technologies, development practices like CI/CD and model monitoring and alerting practices will be a meritorious\n\n\n\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.",
        "url": "https://etraveligroup.teamtailor.com/jobs/6894374-data-scientist",
        "published": "2026-01-13T15:42:25",
        "deadline": "2026-03-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30406685",
        "title": "Doctoral student in discrete optimization and computational complexity",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "We are looking for a Doctoral student to become part of our team at the Division of Applied Mathematics and Statistics at the Department of Mathematical Sciences. Under the supervision of Malin Rau, you will  contribute to impactful research in optimization.  \n\nAbout us \nThe department of Mathematical Sciences has about 200 employees and is the largest department of mathematics in Sweden. The department has three scientific divisions: Algebra and Geometry, Analysis and Probability Theory, and Applied Mathematics and Statistics and conducts successful research in pure and applied mathematics and mathematical statistics in a wide range of research areas. We have an international environment with frequent exchanges with other universities around the world. The department provides a friendly, creative, and supportive atmosphere with a steady flow of international guests. We strive to offer an environment where you can combine world-leading research and teaching with a good work-life balance. \n\nAt the division of Applied Mathematics and Statistics we conduct research within the theory and implementation of biomathematics, biostatistics, spatial modeling, differential equations, Bayesian inference, large-scale computational methods, bioinformatics, data science, machine learning, optimisation, numerical methods.\n\nPlease read more about the position and our department on our dedicated webpage.\n\nAbout the research project  \nThe project is in the field of optimization, and in particular the project focuses on the design of approximation algorithms for multi-dimensional packing and scheduling problems. The position offers the opportunity to contribute to the theoretical foundations of discrete optimization and explore applications in combinatorial problem-solving.\n\nWho we are looking for\n\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in mathematics, or applied mathematics, or computer science. Alternatively, you expect to complete such a degree by September 1, 2026.\n• You will need strong written and verbal communication skills in English \n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience in some of the following areas: programming, optimization.\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Mathematics or Applied Mathematics and Statistics  \n• Develop your own scientific concepts and communicate the results of your research verbally and in writing \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours \n\nContract terms  \n\n• The Doctoral student position is fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV (max 2 pages) \n\nPersonal letter (max 2 page) \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note:\n\nThe applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Reference contact information will be requested after interviews conducted between March 9 and March 20, 2026.\n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than February 23, 2026   \n\nFor questions, please contact:  \nDr Malin Rau (main supervisor)\n\nDr Irina Pettersson (head of unit, Applied Mathematics and Statistics)\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\n Chalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14478&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T14:15:24",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30406624",
        "title": "Doctoral student in Cancer Bioinformatics",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join the Computing Disease Evolution in Cancer (CODEc) group, led by Dr Eszter Lakatos within the Division of Applied Mathematics and Statistics and persue exciting research. As a Doctoral student, you will combine mathematical modelling and bioinformatics to uncover the key factors behind cancer development.\n\nAbout us \nThe department of Mathematical Sciences has about 200 employees and is the largest department of mathematics in Sweden. The department has three scientific divisions: Algebra and Geometry, Analysis and Probability Theory, and Applied Mathematics and Statistics and conducts successful research in pure and applied mathematics and mathematical statistics in a wide range of research areas. We have an international environment with frequent exchanges with other universities around the world. The department provides a friendly, creative, and supportive atmosphere with a steady flow of international guests. We strive to offer an environment where you can combine world-leading research and teaching with a good work-life balance. \n\nAt the division of Applied Mathematics and Statistics we conduct research within the theory and implementation of biomathematics, biostatistics, spatial modeling, differential equations, Bayesian inference, large-scale computational methods, bioinformatics, data science, machine learning, optimisation, numerical methods.\n\nPlease read more about the position and our department on our dedicated webpage.\n\nAbout the research project  \nIn the CODEc group, we conduct interdisciplinary research into cancer genomics and evolution. We develop novel mathematical and bioinformatic methods to uncover the key factors behind cancer evolution from next generation sequencing data. In this project, you will work on how the genetics of cancer influence its detection by the immune system. You will combine a mechanistic model and bioinformatic analysis of public datasets to derive a score for quantifying cancer immunogenicity. You can find out more about the research here: https://elakatos.github.io/\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Applied Mathematics, Bioengineering, Bioinformatics or in a related topic, or expect to complete such a degree by September 1, 2026.\n• You will need strong written and verbal communication skills in English \n• A successful candidate must have strong quantitive and coding skills.\n• Personal competences in accordance with the requirements profile including specification (e.g. social skills, meaning that you enjoy collaborating with others) \n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Previous experience (courses or project work) in one or several of the following areas: bioinformatics, mathematical modelling, genomics, systems biology.\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Applied Mathematics and Statistics or Bioscience\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours \n\nContract terms  \n\n• The Doctoral student position is fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV (max 2 pages) \n\nPersonal letter (max 2 page) \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note:\n\nThe applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Reference contact information will be requested after interviews conducted between March 9 and March 20, 2026.\n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than February 23, 2026   \n\nFor questions, please contact:  \nDr Eszter Lakatos (main supervisor)\n\nDr Irina Pettersson (head of unit, Applied Mathematics and Statistics)\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14509&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T14:13:04",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    }
]