[
    {
        "id": "30481962",
        "title": "Utveckling av affärssystem i .NET, HTML5 och C++ i centrala Göteborg",
        "employer": "Noventus Systems AB",
        "location": "Göteborg",
        "description": "Om dig\nVi söker en kompetent och ansvarstagande medarbetare som kan jobba både i grupp och självständigt där också kundkontakter är en viktig del i arbetet.\nVi tror att en lämplig bakgrund för dig som söker är någon form av högskoleutbildning inom programutveckling och datorteknik.\nDin utbildning\nHögskole- eller universitetsutbildning inom Data eller IT alternativt motsvarande arbetslivserfarenhet.\n\nDina arbetsuppgifter\nNoventus önskar stärka upp sitt utvecklingsteam med ytterligare medarbetare. Din roll kommer att innebära utvecklings- och kvalitetsarbeten avseende Noventus standardprogramvara Epix samt kundspecifika uppdrag.\nDu får arbeta under ordnade former med flexibel arbetstid och reglerade villkor avseende ersättning för support och övertidsarbete. Vi tillämpar hybridarbete med viss möjlighet till arbete på distans, men med huvudsaklig arbetsplats på vårt kontor i centrala Göteborg.\nNoventus har en platt organisation, där den anställde arbetar under eget ansvar och har stor möjlighet att påverka.\nVi erbjuder ett utvecklande och varierat arbete där projektledning, systemdesign, programmering, test, installation, utbildning, dokumentation och support ingår. Noventus utvecklingsarbeten genomförs som projekt. Beroende på projektens storlek och omfattning kan arbetsuppgifterna variera.\nHuvudsaklig utvecklingsmiljö är Visual Studio med .NET, C# samt HTML5 som huvudsakliga programspråk och bibliotek. Noventus använder branschpraxisramverk så som React men arbetar huvudsakligen med egenutvecklade komponenter. Erfarenhet av C++ och Microsoft SQL Server är meriterande då arbete med detta också förekommer.\nOm Noventus\nNoventus är ett innovativt företag som utvecklat programvara i världsklass i mer än 40 år. Vi förser våra kunder med allt från rena standardlösningar till kundanpassade system. Idag utvecklar Noventus främst programvara för affärs- och lagersystem samt 3PL-lösningar.\nVåra kunder finns inom flera olika branscher, däribland livsmedels- och grossistföretag. Ytterligare detaljer om vårt företag, kunder och produkter finner du på vår hemsida.\nNoventus kontor ligger centralt beläget i Göteborg med goda möjligheter att använda kollektivtrafik.\nSom anställd på Noventus kommer den mesta arbetstiden att spenderas på kontoret. Resor i tjänsten kan förekomma i samband med kundmöten, driftstart av systemleverans samt utbildning. B-körkort är en fördel men inget absolut krav för tjänsten.\nDin ansökan\nAnsök via epost till arbetsgivarens mejl enligt denna annons. Bifoga CV samt betyg från högskola eller universitet och om möjligt även gymnasiebetyg.",
        "url": null,
        "published": "2026-01-16T14:11:15",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30482687",
        "title": "C++ Software Developer (Android Automotive)",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nJoin a cross-functional team building a next-generation infotainment system based on Android Automotive. You will be part of a quality-focused environment with continuous improvements, working closely with other teams and partners to deliver a great end-user experience. The focus area is Navigation and Positioning, including testing and troubleshooting in real vehicles.\nJob DescriptionDevelop and enhance navigation functionality to deliver a high-quality in-car user experience.\nWork in a small, cross-functional team with a strong focus on quality and continuous improvements.\nContribute in a full-stack development environment using C++ and the Android toolset.\nImplement automated test cases and validate features in a CI environment.\nSupport testing and troubleshooting in real vehicles in collaboration with the team.\nRequirementsB.Sc. or M.Sc. in Electronics, Software Engineering, or a similar field.\n5 years of relevant software development experience using C++, Python, Java, or similar.\nExperience in Android platform development.\nExperience with Continuous Integration.\nFamiliarity with Agile methods.\nGood English skills, written and spoken.\nNice to haveExperience in Android Automotive platform development.\nExperience in automotive infotainment.\nExperience working with navigation or positioning.\nValid driver’s license (B).\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7063414-c-software-developer-android-automotive/applications/new?promotion=1793853-arbetsformedlingen",
        "published": "2026-01-16T14:44:10",
        "deadline": "2026-01-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30482654",
        "title": "Senior Android Automotive Developer",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for a Software Developer with strong Android expertise to join an automotive infotainment initiative. You will be part of a small cross-functional team working with Media Center, Navigation, and Voice Control—building user-centric in-car experiences with a clear focus on quality and continuous improvement.\nJob DescriptionCollaborate in a small cross-functional team with a strong focus on quality and continuous improvements.\nDevelop and enhance in-car functionality to deliver a great end-user experience.\nDesign and implement touch-based user interfaces to control different parts of the vehicle.\nWork in a full-stack environment using Java/Kotlin, Python, and the Android toolset.\nContribute to automated testing, test-driven development, and CI-supported delivery.\nParticipate in testing and troubleshooting in real vehicles.\nRequirementsSeveral years of experience in Android app development.\nStrong skills in Android Java, Kotlin, and Android Studio.\nExperience with AOSP and the AOSP build system.\nFamiliarity with modern app architectural patterns (e.g., MVP, MVVM, layered architecture) and refactoring.\nGood knowledge of Android testing frameworks (JUnit, Espresso, Mockito).\nExperience working with Continuous Integration.\nGood English skills, written and spoken.\nB driver’s license.\nNice to haveExperience developing for Android Automotive.\nExperience within automotive infotainment.\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7063421-senior-android-automotive-developer/applications/new?promotion=1793845-arbetsformedlingen",
        "published": "2026-01-16T14:42:17",
        "deadline": "2026-01-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30482316",
        "title": "C++ Software Developer Android Automotive",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for a C++ Software Developer to join a cross-functional team building next-generation in-car infotainment based on Android Automotive. You will be part of a quality-focused environment where continuous improvement, modern tooling, and close collaboration with other teams and partners are central. The focus area is Navigation and Positioning—features that directly impact the end-user driving experience.\nJob DescriptionWork in a small cross-functional team with a strong focus on quality and continuous improvements.\nDevelop and enhance navigation functionality to deliver an excellent end-user experience.\nContribute in a full-stack development environment using C++ and the Android toolset.\nImplement automated test cases and support testing in a CI environment.\nParticipate in testing and troubleshooting in real vehicles.\nCollaborate with partners and other teams to deliver state-of-the-art software.\nRequirementsB.Sc. or M.Sc. in Electronics, Software Engineering, or a similar field.\n5 years of relevant software development experience using C++, Python, Java, or similar.\nExperience in Android platform development.\nExperience working with Continuous Integration (CI).\nFamiliarity with Agile methods.\nProfessional English skills, written and spoken.\nNice to haveExperience with Android Automotive platform development.\nExperience in automotive infotainment.\nExperience working with navigation or positioning.\nValid driver’s license (B).\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7065565-c-software-developer-android-automotive/applications/new?promotion=1793757-arbetsformedlingen",
        "published": "2026-01-16T14:23:21",
        "deadline": "2026-01-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30448408",
        "title": "Senior Mainframe Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Senior Mainframe Developer – \nWe are looking for a Senior Mainframe Developer to work with Umeå Order & Logistics legacy solutions. The role focuses on maintaining, optimizing, and modernizing mainframe systems as part of our digitalization journey.\nRole Description\nAs a Senior Mainframe Developer, you will:\nManage, maintain, and optimize mainframe computer systems to ensure efficient, stable, and reliable operations.\n\n\nWork closely with a team of IT professionals to support business-critical applications and provide technical expertise in mainframe technologies.\n\n\nMaintain and enhance legacy applications and actively contribute to the organization’s digitalization and modernization initiatives.\n\n\nCollaborate with cross-functional teams to understand requirements and provide technical input for mainframe-based solutions, influencing solution design both within and beyond stable teams.\n\n\nAnalyze application performance and identify opportunities for optimization and improvement.\n\n\nEnsure adherence to coding standards, best practices, and security guidelines in application development and maintenance.\n\n\nModernize legacy applications by integrating mainframe systems with other IT infrastructure components.\n\n\nStay up to date with industry trends and emerging mainframe technologies.\n\n\nContribute to the Chapter team by sharing best practices, mentoring colleagues, and actively participating in knowledge-sharing initiatives.\n\nRequired Skills & Experience\nStrong proficiency in mainframe programming languages and tools such as:\nCOBOL, JCL, VSAM, ISPF, SDSF, MQ, CICS, PL/I, OPCE, Assembler, or equivalent\nExperience with mainframe databases and data management systems such as DB2 or IMS\n\n\nProven experience in modernizing legacy mainframe environments using relevant tools and techniques\n\n\nStrong analytical and problem-solving skills with the ability to diagnose and resolve complex technical issues\n\n\nStrong communication and interpersonal skills, with the ability to collaborate effectively with stakeholders at all levels",
        "url": null,
        "published": "2026-01-09T00:53:50",
        "deadline": "2026-06-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30420899",
        "title": "Technical Manager",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "CAE Engineer\nSenior CAE Engineer: \n·      Experience within Vehicle Engineering. \n·      Full Vehicle impact simulations\n·      Pedestrian Head Impact as per ECE/FMVSS & EURONCAP\n·      Occupant Head Impact analysis\n·      Body / BIW / Closures Durability Analysis \n·      Road Load Durability\n·      Powertrain durability\n·      Design Optimization\n \nMain responsibilities:\n·      Initiate, Lead and perform simulations. \n·      Support Design teams in developing technical solutions to fulfill requirements. \n·      Analyze and evaluate system solutions and propose changes improvements. \n·      Several years of Experience in CAE is a must. \n·      Perform simulations/analyses based on instructions or day-to-day guided work verified by upper levels. \n·      Provide design input for less complex components or systems. \n \nRequired qualifications:\n·      M.Sc. in mechanical engineering or similar education/experience\n·      Several years of analysis experience, using LS-Dyna, ANSA. \n·      VCC experience",
        "url": null,
        "published": "2025-12-23T13:12:50",
        "deadline": "2026-01-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30418080",
        "title": "ServiceNow Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Key Responsibilities\nDesign, develop, and implement solutions on the ServiceNow platform, with a primary focus on the CSM module.\n\n\nCustomize and configure ServiceNow components including forms, workflows, business rules, client scripts, UI policies, UI actions, and notifications.\n\n\nDevelop and manage REST and SOAP integrations with external systems.\n\n\nAnalyze business requirements and translate them into effective technical solutions.\n\n\nTroubleshoot issues, perform root-cause analysis, and deliver timely fixes.\n\n\nCollaborate with cross-functional teams to ensure smooth implementation and continuous improvement of ServiceNow applications.\n\n\nFollow best practices for ServiceNow development, documentation, and version control.\n\nRequired Experience & Skills\n3–6+ years of hands-on experience in ServiceNow development.\n\n\nStrong expertise in the CSM (Customer Service Management) module – configuration, case management, workflows, portals, and integrations.\n\n\nPractical experience with REST and SOAP APIs and building integrations with ServiceNow.\n\n\nStrong understanding of JavaScript, Glide APIs, Flow Designer, IntegrationHub, and ServiceNow platform capabilities.\n\n\nAbility to work independently as well as in collaborative team environments.\n\n\nGood communication and problem-solving skills.\n\nNice-to-Have\nServiceNow certifications such as CSA, CAD, CIS-CSM, or relevant module certifications.\n\n\nExperience working in Agile/Scrum environments.\n\n\nKnowledge of ITIL processes.",
        "url": null,
        "published": "2025-12-22T21:56:00",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357035",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-12-09T21:47:50",
        "deadline": "2026-05-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307403",
        "title": "Experienced Software Engineer",
        "employer": "Burt Intelligence AB",
        "location": "Göteborg",
        "description": "Overview\nWe are expanding our Tech team and are looking for an experienced software engineer to join us. If you want to work with smart and ambitious people, international customers, large datasets and solve valuable problems in a small and efficient team; Burt is for you.\nYou \nYou are an experienced developer who enjoys solving real problems, understanding complex systems and getting things done. You’re comfortable exploring unfamiliar code and figuring things out independently, but also enjoy collaborating with others to move projects forward. We believe programming is a craftsmanship that can be applied across languages and platforms. You share that mindset and can pick up new technologies as needed. We primarily work with Git, Ruby, Python, Java, AWS, SQL, and TypeScript, but value your ability to learn and reason about systems more than experience with specific tools. You have a few years of experience building and maintaining software products and take pride in writing clean, reliable code. You’re pragmatic, curious, and motivated by making an impact rather than following strict processes. We’re looking for someone based close to Gothenburg. The position is semi-remote, with regular collaboration both online and in person.\nThe team\nWe are a small and efficient team, which means we can avoid bureaucracy and get things done. Everyone in the team matters and has a direct impact on our customers. We constantly strive to get better and value everyone's ideas. We are a result oriented team, promoting a culture where freedom and responsibility go hand in hand.\nThe role\nYou will work cross functionally with product, success, and sales solving our current customer needs and building out our solutions.\nYou will participate in maintaining and improving our ETL platform. Customer data is spread out over hundreds of different systems, in various formats, accessed in a variety of ways. Data is downloaded, aggregated, normalised and combined into a single source of truth.\nYou will also participate in building the many products we provide on top of the data. Reporting, anomaly detection and forecasting are a few examples of areas you might be involved in. \nAbout Burt\nBurt is a Software-as-a-Service (SaaS) company headquartered in New York, USA with our Tech team based in Gothenburg, Sweden. We have some of the world's largest media companies on our list of customers, including Paramount, Nexstar, Yahoo, Ziff Davis, Hearst, Tripadvisor, and Vox Media.\nOur core product empowers media ad sales and operations to make quick, confident decisions by giving our customers a single point of access to explore, analyze and share insights from their advertising business.",
        "url": "https://career.burtintelligence.com/jobs/6719235-experienced-software-engineer?promotion=1729918-arbetsformedlingen",
        "published": "2025-11-26T10:19:33",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307021",
        "title": "System Engineer for Automotive Android Platform",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to shape the foundation of next-generation in-vehicle experiences – and see your system engineering expertise come alive in real machines – this could be your next step. We’re looking for a System Engineer who enjoys working between hardware and software, defining system requirements, and helping teams build world-class infotainment and operator-interface solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems.\nYour roleAs a System Engineer, you will play an important role in defining and integrating complex infotainment systems. You’ll work where hardware, the Android platform and customer requirements meet, making sure everything fits together into a reliable, well-performing system.\nYou will define system architecture and technical requirements, coordinate integration across hardware and software, and support teams with system-level knowledge throughout the development process. You’ll work closely with developers, testers and customers to ensure high-quality, user-friendly solutions for marine and industrial applications.\nThis is a hands-on role where you will influence design, drive integration and turn technical requirements into production-ready systems.\nResponsibilities Define system architecture and technical requirements for infotainment ECUs and integrated systems based on customer and supplier needs\n Coordinate integration between hardware, the Android platform and middleware components\n Analyze and solve system-level issues across hardware and software\n Work closely with developers, testers and customers to secure high-quality, user-focused solutions\n Maintain system documentation and interface specifications\n Key qualifications Strong system thinking and the ability to understand complex technical setups\n Good understanding of infotainment systems and ECU architecture\n Experience with system-level design and integration in embedded environments\n Familiarity with Android/AOSP and Linux-based systems\n Knowledge of automotive communication protocols such as Ethernet, CAN and GMSL\n Ability to read logs, debug system-level issues and suggest solutions\n Fluent in English \n Who you are\nYou see complex systems as full of possibilities and enjoy working hands-on to understand how each part connects. You stay current in your field and willingly share your knowledge with others. You appreciate having responsibility from start to finish and are comfortable challenging assumptions to find smarter and more efficient solutions. With a solid understanding of both hardware and software, and how they interact, you bring clarity, solve problems and help turn ideas into reliable real-world systems.\nHow to applySubmit your application today and feel free to reach out to David Andersson at david.andersson2@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6831015-system-engineer-for-automotive-android-platform?promotion=1729748-arbetsformedlingen",
        "published": "2025-11-26T09:37:22",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30306504",
        "title": "Junior AI Systems Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Systems Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking Systems Engineers to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nBased in Gothenburg, we're a compact, high-caliber team evolving Entropia Universe, a long-standing MMO built around a real-cash economy. We care about end-to-end ownership, fast execution, and ego-free collaboration, and we're looking for someone who wants to build seriously, move quickly, and help define the future of MMO games.\nWe value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Junior AI Systems Engineer, you will:\nBuild and integrate intelligent systems into Entropia Universe\nWork with automation, AI, and agentic frameworks to create new in-game behaviors and tools\nHelp optimize our CI/CD and runtime pipelines for performance and quality\nContribute to core systems engineering (C++ and related infrastructure)\nUse AI heavily in your own workflow to move faster and smarter\nTake pride and ownership of your work all the way through to the end user\nThis is a general engineering role, not tied to a single fixed team.\nYou: \nMaster's degree in Computer Science or a similar field, with strong grades preferred\nHuge interest in AI is crucial: you follow new models, tools, and trends and ideally build with them in your spare time\nComfortable with C++ 20; Python is a strong plus.\nStrong interest in:\nAI and agentic frameworks\nSystems engineering and creating great games\nAutomation and building intelligent systems\nProblem solving\nDatabases (SQL and NoSQL) and data-intensive systems\nBasic networking concepts and distributed systems\nContainerization and tooling such as Docker\nPassion for games and how AI can change the video game industry\nLow ego, end-to-end ownership, clear communication.\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field\nA few years of experience within the field\nCreative thinker with a passion for games and a drive to innovate within the gaming space\nProficiency in C++\nProficiency in Python is a strong plus\nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks\nKnowledge of game development principles and methodologies\nProblem-solving and communication skills\nBeing flexible and able to work with a larger technical ecosystem.\n\nWhy Join Mindark: \nWork on a live, large-scale MMO with a real-cash economy\nWork with cutting-edge systems and AI tooling that are still rare in the MMO space\nHigh-impact role in a small, focused team\nCompetitive compensation and plenty of room to grow in the new era of AI\nStrong support and mentorship from highly talented colleagues.\n\nThe opportunities are endless.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: Gothenburg, Sweden (hybrid, ~2 days/week in office)",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-11-26T09:09:10",
        "deadline": "2026-03-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30092160",
        "title": "Machine Learning Engineer - Computer Vision",
        "employer": "Repli5 AB",
        "location": "Göteborg",
        "description": "The Role: We're looking for an experienced Machine Learning Engineer with a deep background in computer vision and generative AI. You’ll be part of a team developing systems that generate realistic, diverse, and highly controllable synthetic image data using state-of-the-art tools like Stable Diffusion, LoRA, and ControlNet. Your work will directly impact the performance and robustness of real-world AI systems—from self-driving cars to defense robotics.\nWhat You’ll Do\n Develop and fine-tune generative AI pipelines (e.g., Stable Diffusion, ControlNet, LoRA) for synthetic image generation.\n Design and implement machine learning workflows to generate structured, photorealistic datasets.\n Collaborate with 3D artists and simulation engineers to align ML models with physical environments and sensor setups.\n Work closely with customers in automotive, robotics, and aerospace to deliver tailored datasets.\n Optimize generation systems for scalability, quality, and speed using tools like ComfyUI or custom pipelines.\n \nYou Should Have\n MSc or PhD in Computer Vision, Machine Learning, or related field.\n 3+ years of hands-on experience with deep learning frameworks (e.g., PyTorch, TensorFlow).\n Experience working with generative AI models (especially diffusion-based models).\n Familiarity with tools like LoRA, ControlNet, ComfyUI, or custom workflows around Stable Diffusion.\n Strong understanding of synthetic data generation and its role in training perception systems.\n A track record of deploying ML systems in domains like automotive, robotics, defense, or manufacturing.\n \nNice to Have\n Experience working with 3D simulation pipelines or sensor modeling (e.g., depth, LiDAR, segmentation).\n Contributions to open-source ML/gen AI tools or custom diffusion model training.\n Enjoying reading research papers\n A problem solving intellect and a team player spirit\n Knowledge of synthetic-to-real domain adaptation techniques.\n Experience in startup environments or working directly with enterprise R&D teams.\n A positive can-do attitude",
        "url": "https://repli5.teamtailor.com/jobs/6544271-machine-learning-engineer-computer-vision?promotion=1650650-arbetsformedlingen",
        "published": "2025-10-01T10:35:02",
        "deadline": "2026-03-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30440064",
        "title": "HIL Developer (Hardware-in-the-Loop) -  Göteborg",
        "employer": "Veritaz AB",
        "location": null,
        "description": "We are looking for highly skilled HIL Developers to support one of our clients within automotive software development. You will work in an advanced environment developing and validating software for AD/ADAS, protective safety systems, and vehicle motion control.\nThe role focuses on developing, maintaining, and improving HIL test environments and CI pipelines, ensuring high availability, stability, and performance of the test infrastructure used by multiple software development teams.\nKey Responsibilities\nHIL Development & Test Infrastructure\nDesign, develop, and update HIL rig solutions based on product team requirements.\nCommission new test rigs and integrate hardware and software components.\nMaintain and continuously improve HIL environments to ensure stability and availability.\nPerform fault tracing and root cause analysis across hardware, software, and infrastructure.\n\nAutomation & CI/CD\nDevelop automation solutions supporting CI pipelines and system test teams.\nImprove CI pipeline performance, reliability, and metrics visualization.\nAct as first-line triage for CI environment disturbances.\nSupport system test automation across multiple product teams.\n\nDocumentation & Collaboration\nMaintain accurate documentation of HIL rigs, configurations, and updates.\nCollaborate closely with software developers, system testers, and CI teams.\nIndependently drive improvements and contribute to continuous optimization initiatives.\n\nRequired Competence & Experience\nHIL & Automotive Testing\nProven experience in HIL development using:\ndSPACE\nVector CANoe\nStrong background in automotive electrical architecture and embedded systems.\nExperience with automotive diagnostic and communication protocols:\nCAN\nLIN\nEthernet\n\nProgramming & Tooling\nProgramming experience in Python, CAPL, and C\nExperience with MATLAB/Simulink\nFamiliarity with Git, command-line tools, and SSH\n\nCI/CD & Automation\nExperience working with CI infrastructure, including:\nPipelines\nDashboards\nMonitoring and metrics\nExperience in test automation frameworks (e.g. Robot Framework) is a plus.\n\nWays of Working & Soft Skills\nStrong automotive domain knowledge combined with excellent communication skills.\nComfortable working in Agile development environments.\nAbility to work independently, drive improvements, and perform structured analysis.\nStrong collaboration skills across cross-functional teams.\n\nLocation :  Göteborg",
        "url": "https://airtable.com/appWFSx6BGg1FmqQh/shre6DE5SpaxhDAWu",
        "published": "2026-01-07T12:32:15",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30456501",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid!\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n\nC\n\n\nC#\n\n\nC++\n\n\nJava\n\n\nPython\n\n\nGit\n\n\nMatlab\n\n\nVi önskar att du som mjukvaruutvecklare hos oss har: \n\nEn högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n\n\nGenuint teknikintresse\n\n\nMinst 2 eller fler års erfarenhet som mjukvaruutvecklare\n\n\nFörmåga att kommunicera på både svenska och engelska i tal och skrift.\n\n\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 13 februari. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare/applications/new?promotion=1783409-arbetsformedlingen",
        "published": "2026-01-12T10:42:49",
        "deadline": "2026-02-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30456453",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n\nC\n\n\nC#\n\n\nC++\n\n\nJava\n\n\nPython\n\n\nGit\n\n\nMatlab\n\n\nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n\nEn högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n\n\nMinst 5 eller fler års erfarenhet som mjukvaruutvecklare\n\n\nFörmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n\n\nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 13 februari. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg/applications/new?promotion=1783374-arbetsformedlingen",
        "published": "2026-01-12T10:37:39",
        "deadline": "2026-02-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30383955",
        "title": "Hårdvarunära Mjukvaruutvecklare sökes till Lafayette AB",
        "employer": "Lafayette AB",
        "location": "Göteborg",
        "description": "Bolaget grundades 1961 och var det svenska bolag som var först ut med privatradio. Lafayette har idag en framskjuten position inom tillverkning av utrustning som främst används av jägare eller naturälskande människor. \nTillsammans med våra dotterbolag VMAC AB samt Lafayette Oy utvecklar, tillverkar och säljer vi produkter såsom kommunikationsradio, spårningsutrustning som främst används för att spåra jakthundar eller boskap med en egenutvecklad mjukvaruplattform, samt att vi utvecklar och tillverkar ljuddämpare och pannlampor.\nVåra kunder befinner sig i nuläget främst i Norden men vi kommer i framtiden att etablera oss på nya marknader, först och främst inom EU.\nKoncernen har idag sitt huvudkontor i Göteborg samt ett finskt säljbolag som är beläget strax utanför Helsingfors. Tillverkning och utveckling sker även i orterna Vilhelmina och Shenzhen i Kina. Omsättning för bolagen är cirka 45 MSEK med ett 12 anställda.\nLafayette söker nu dig som vill bidra med din tekniska kompetens genom att arbeta med utveckling och underhåll av företagets GPS-produkter genom mjukvaruutveckling. Du kommer att programmera i C/C++ för att utveckla och underhålla mjukvara som integrerar med hårdvaran i våra produkter. Samtidigt kommer du att få engagera dig i projekt med förbättringsarbeten och det finns goda möjligheter att ta egna initiativ till utvecklingsprojekt för att förbättra produkternas funktioner.\nVi är ett växande företag med starkt fokus på kvalitet och innovation. Du kommer att ingå i ett team och bli en del av ett litet och familjärt företag med stora utvecklingsmöjligheter. Här får du goda förutsättningar att påverka vägen framåt för bolaget som är i tillväxtfas. Arbetet utförs på plats i Göteborg och är förlagt till kontorsarbetstider.\nArbetsuppgifterProgrammering i C/C++ för utveckling och underhåll av produkternas mjukvara\nDelta i samt driva egna förbättringsprojekt av GPS-produkterna\nFölja upp och kontrollera produkternas funktioner\nIngå i utvecklingsteamet och samarbeta kring produktutvecklingen\nKvalifikationerHar goda kunskaper och erfarenhet av kodning i C/C++\nKörkort\nRelevant utbildning\nMinst 3 års yrkeserfarenhet eller motsvarande\nHar kunskaper inom GPS, telekom eller radioteknik\nHar goda kunskaper i svenska och engelska både i tal och skrift då dessa språk används i det dagliga arbetet \n\n\n\nMeriterande om du har· Arbetslivserfarenhet av hårdvarunära utveckling inom GPS, telekom eller radioteknik\n· Har kunskaper om serverkommunikation\n· Har kunskaper om Arm - och Pic-processorer som används i produkterna \nPersonliga egenskaper· Kommunikativ\n· God samarbetsförmåga\n· Noggrann och strukturerad\n· Självständig och ansvarstagande\n· Problemlösande\nVi erbjuder· En dynamisk arbetsplats med engagerade kollegor\n· Möjlighet att påverka och utvecklas i rollen\n· Konkurrenskraftig lön och förmåner\n· Trevligt kontor och moderna lokaler\nSkicka din ansökan med CV och personligt brev till patrik@lafayette.se senast den 15 oktober 2025. Urval sker löpande och anställnings sker efter överenskommelse. Vid frågor kontakta Patrik Johansson, 0702269000",
        "url": null,
        "published": "2025-12-16T14:36:45",
        "deadline": "2026-02-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30485071",
        "title": "Embedded Software Application Engineer @ Thermal Management",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nWho are we?\nThe Vehicle Motion & Thermal Management Technology stream leads and develops complete vehicle motion-, energy- and thermal control solutions for Safe, Sustainable and Efficient transportation.\n\nOur technology scope is broad and involves advanced mechatronic systems related to motion and optimization of energy in our vehicles.\n\nThermal Management is a department within Vehicle Technology responsible for developing, delivering, and maintaining an optimized complete thermal management system. This is including cab climate and vehicle cooling & heating systems for ICE, BEV, and Fuel cell vehicles within the Volvo Group. We are responsible for the thermal management platform from cradle to grave, both Hardware and Software. The teams within thermal management are located in Gothenburg and Bangalore and have close cooperation with the sites Greensboro and Lyon. To succeed we need to understand the final customer needs and apply our knowledge to develop technical concepts and solutions that satisfy customer and business needs.\n\nWe are now looking for a self-driven specialist Embedded Software Engineer to strengthen our team, Thermal Supply Product & SW. Our team is responsible for the design and development of the application SW, controlling the complete thermal management system, and the calibration and tuning of it. Meaning that we are responsible for Refrigerant loop and the Coolant loop functionality covering all sites and truck brands (among more) within the Volvo Group.\nWhat will you do?\nAs an Embedded SW Engineer you plan your work according to the agile SAFE principals together with your team. The main responsibility of the team is the development of the Coolant Loop and Refrigerant loop Controller, acting as a central enabler in the thermal management system, realizing functionality that has clear customer impact. Within the role you will work with both new development towards future feature/function growth and with maintenance improving the system already on the market. You will have the opportunity to collaborate a lot with many surrounding teams within and outside of our direct organization. Today we have a very close collaboration with EMOB, testing facilities, testing teams, workshops, and more. \nWho are we looking for?\n\nWe believe you are a person who is driven, business-oriented and innovative. You are interested to solve problems in a structured and effective way. You are a person with a genuine interest in technology as well as people. You feel accountable for the tasks you take on. You are self-motivated by driving changes in a complex environment.\nWe also think you have:\n  *  An open mindset to learn & grow. Share your knowledge with others\n  *  Good networking skills on a local and global basis and you have an ability to understand and accept cultural differences\n  *  Good communication and presenting skills both in text and verbally (English) \n\nRelevant Experience:\n  *  Master’s Degree in Computer, Electrical/Electronic or similar\n  *  5-10 years of Embedded SW development experience\n  *  Great problem-solving skills\n  *  A very stable base in Control Theory\n  *  Experience in SW verification\n  *  Experience of functional verification and system tuning/calibration \n\nMeritoriousto have:\n  *  C or CE Truck Driving License\n  *  Knowledge of Automotive Thermal management system\n  *  Experience in SIL/MIL/HIL testing\n  *  Experience in Matlab, Simulink, TargetLink, Jenkins, Embedded Coder, C, C++, Python\n  *  Knowledge in planning, performing, and analyzing results from rig or vehicle testing\n\nReady for the next move?\nJoin us in our mission to create a better tomorrow! The applications will be screened continuously, so don’t miss your chance to be part of this exciting journey. Apply now!\nFor questions about the process, contact Smita Shree, Talent Acquisition Partner, at smita.shree@volvo.com\nHiring manager: Sebastian Palm, sebastian.palm@volvo.com                                                       \nLast application date: 19th Jan'2026\nPlease note: This ad is valid for more than one positions.  \nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43909662",
        "published": "2026-01-17T17:25:06",
        "deadline": "2026-01-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30481760",
        "title": "System Engineer",
        "employer": "L&T Technology Services Sverige Filial",
        "location": "Göteborg",
        "description": "L&T Technology Services Limited (LTTS) is a global leader in Engineering and R&D (ER&D) services.\nWe are hiring in Solna, Sweden!\nWould you like to join a team with innovation, teamwork and entrepreneurship as the fundamental platform?\nWe are looking for experienced System Engineers for the Automotive Industry.\nRequirements for the role:\nRequirements Elicitation & Analysis\nshould have worked on ASPICE based system engineering activities or must have exposure to it.\nGather and analyze system-level requirements from stakeholders, standards, and regulations.\nEnsure requirements address functional, performance, safety, and security aspects.\nRequirements Specification\nDocument System Requirements Specification (SyRS) in compliance with standards (e.g., ISO 26262 for automotive).\nDefine interfaces and interactions between hardware, software, and external systems.\n\n\n\nSoft Skills\nStrong analytical and problem‑solving skills.\nExcellent communication and documentation abilities.\nAbility to work independently and collaborate in cross-functional environments.\n\nEducation \nBachelor’s or Master’s degree in Electrical, Electronics, Computer Science, Automotive, or related field.\n\nWe believe you enjoy to work in teams, interact with people and have great communication skills. You are able to encourage, coach and develop to drive change and implementation in your surroundings.\nInterviews will be held continuously. To apply, please send in your application documents to the email address: LTTS.Sweden@Ltts.com.\nEnter the reference \"System Engineer\" in your application",
        "url": null,
        "published": "2026-01-16T14:02:50",
        "deadline": "2026-02-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30473053",
        "title": "Software Engineer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Software Engineer to strengthen our team in Gothenburg.\nResponsibilities\nDevelopment and maintenance of an automation framework for verification of advanced driver assistance systems and sensors such as radar, lidar, and camera.\nDevelopment and maintenance of data visualization tools to present test results and metrics effectively.\nManage and utilize databases to store and retrieve test data efficiently.\nMonitor automated tests, analyze results, and report defects.\nProvide training and support to stakeholders on test automation tools and processes.\nSupport users in fault-tracing test setups.\n\nBackground / Experience\nExcellent Python programming skills with an object‑oriented approach.\nAbility to think in systems and processes, understanding how components interact within a larger framework.\nExperience working in HIL and SIL environments with knowledge of various simulation tools.\nExperience working with Grafana or other visualization tools.\nExperience with Linux.\nKnowledge of Pytest.\nProactive, self‑driven, and strong communication skills.\n\nMeritourius\nBackground in the automotive domain.\nExperience with UDS, XCP, and HDF logging.\nExperience with dSPACE HIL software and CANoe.\nExperience managing containerized applications.\nExperience configuring and maintaining Jenkins / Zuul.\nShell scripting skills.\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2026-01-15T08:09:35",
        "deadline": "2026-01-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30469653",
        "title": "Senior Embedded Rust Engineer",
        "employer": "Knowit AB (Publ)",
        "location": "Göteborg",
        "description": "Are you passionate about building high-performance embedded systems using Rust? Do you enjoy solving complex technical challenges and influencing both architecture and implementation? If so, you might be exactly who we’re looking for.\nAt Knowit Connectivity, you will work with skilled engineers on advanced automotive, mobility and connected-system projects. Together with our clients’ R&D teams, we create next-generation solutions that enable safer, smarter and more sustainable technology.\nWhat You’ll Do\nAs a Senior Embedded Rust Engineer, you will play a key role in designing and developing software for performance-critical and safety-critical embedded systems. You will contribute to architectural decisions, drive technical improvements, and ensure high-quality deliveries together with your team.\nYour responsibilities include:\n\nDeveloping robust and efficient embedded software, primarily in Rust (occasionally C/C++)\n\n\nWorking close to hardware, performing debugging, measurement and analysis using oscilloscopes, analyzers, and similar tools\n\n\nContributing to next-generation automotive platforms such as ADAS, connectivity, infotainment or electrification\n\n\nApplying automotive standards (ASPICE, AUTOSAR) and working with communication protocols such as CAN, J1939, and other serial interfaces\n\n\nDesigning for safety, reliability, and long-term maintainability\n\n\nCollaborating in cross-functional agile teams with engineers, architects, and stakeholders\n\n\nChallenging technical solutions and driving continuous improvement\n\nWhat We’re Looking For\nWe are looking for an experienced embedded engineer with strong technical depth and a passion for modern, safe system development.\nYou have:\n\nA degree in computer science, electrical engineering or similar\n\n\nSeveral years of experience in embedded systems development\n\n\nProven experience with Rust, or deep C/C++ experience and a strong drive to work primarily in Rust\n\n\nUnderstanding of low-level programming, RTOS/Linux/QNX environments, memory management and performance optimization\n\n\nExperience with automotive or other safety-critical products\n\n\nSkills in Python or similar scripting languages\n\n\nCuriosity, initiative and a willingness to learn and challenge assumptions\n\n\nExperience with Vector tools and other automotive lab equipment is a strong plus.\nFluency in English is required; Swedish is meritorious.\nWhy Knowit?\nAt Knowit, you will join a team that values technical excellence, collaboration and continuous learning. We offer an environment where you can influence, grow and work on impactful projects.\nWhat we offer:\n\nChallenging and meaningful projects shaping the future of mobility and connectivity\n\n\nA culture where engineering, knowledge sharing and teamwork are central\n\n\nContinuous learning through training, mentorship and internal competence networks\n\n\nA healthy work-life balance and a supportive, open culture\n\n\nStrong sustainability values and a long-term commitment to society\n\n\nCollective agreement and competitive benefits\n\nReady to Join Us?\nIf you want to work with advanced embedded technology and modern Rust-based development — and contribute to solutions used in millions of vehicles worldwide — we’d love to hear from you.\nSend us your application and tell us why you’d be a great fit for the role.",
        "url": "https://careersweden.knowit.se/jobs/7049288-senior-embedded-rust-engineer/applications/new?promotion=1788688-arbetsformedlingen",
        "published": "2026-01-14T11:53:41",
        "deadline": "2026-07-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465837",
        "title": "Senior Java Developer for Team Air Content-Dynamic Content (AC-DC)",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Senior Java Developer in the AC-DC team!\nThe Role\nOur work is driven by integration with a multitude of provider systems, ranging from traditional Global Distribution Systems (GDSs) like Sabre and Amadeus to Low-Cost Carriers (LCCs) and the cutting-edge New Distribution Capability (NDC). With NDC, we are at the forefront of an industry transformation, where airlines are offering their content directly through the NDC protocol, bypassing third-party systems.\nIn essence, the Air Content domain is both vast and diverse, encompassing everything from customer searches on price comparison sites to the intricacies of pricing, booking, ticketing, and post-booking functionalities. We consider Air Content to be the engine that propels our business forward.\nAs a Senior Java Developer on our Air Content team, you will be an integral part of a dynamic and forward-thinking group that powers the core of our business. You will have the opportunity to work on challenging projects, collaborate with cross-functional teams, and shape the future of our Air Content offerings. If you're passionate about Java development, and thrive in a collaborative, innovative environment, this role is perfect for you.\nKey Responsibilities\n\nDesign, develop, and maintain Java-based applications that are central to our Air Content platform.\n\n\nCollaborate with cross-functional teams to implement new features and enhancements.\n\n\nOptimize and improve the performance, reliability, and scalability of our Air Content systems.\n\n\nTroubleshoot and resolve complex technical issues related to our flight booking and management processes.\n\n\nContribute to the integration efforts with a variety of provider systems, including GDSs, LCCs, and NDC.\n\n\nEnsure code quality and adherence to best practices, standards, and guidelines.\n\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\n\n\nProven experience as a Java Developer, with a strong grasp of Java.\n\n\nFamiliarity with RESTful web services and API development.\n\n\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\n\n\nStrong problem-solving skills and the ability to work independently and collaboratively.\n\n\nExcellent communication skills to interact effectively with team members and stakeholders.\n\n\nPassion for the travel industry and a keen interest in keeping up with industry trends\n\nOur Stack\nJava, MySQL, MemSQL, Artemis, Kafka, as well as Atlassian tools, Git Jenkins, Docker Kubernetes, Linux, Mac OS, IntelliJ.\nOf course, you don't have to be familiar with all of our tech stack. We will support you in your journey with us and help you grow.\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\n\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\n\nA note from the Hiring Team\nDue to the upcoming Christmas holidays, our Hiring Team will be taking a short break. We will begin reviewing applications and reaching out to candidates for the first steps in the new year, starting around week 2 (January 7th).\nWe look forward to connecting with you then!",
        "url": "https://etraveligroup.teamtailor.com/jobs/6917181-senior-java-developer-for-team-air-content-dynamic-content-ac-dc/applications/new?promotion=1786946-arbetsformedlingen",
        "published": "2026-01-13T15:29:11",
        "deadline": "2026-07-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465808",
        "title": "DevOps Engineer - Sigma Technology Systems",
        "employer": "Sigma Technology Information AB",
        "location": "Göteborg",
        "description": "Jobbeskrivning\nWe are looking for a DevOps Engineer to join our team and help build, maintain, and improve scalable, secure, and reliable systems.\nIn this role, you will work closely with development teams to streamline CI/CD pipelines, improve cloud infrastructure, and support modern DevOps ways of working.\nKey responsibilities\n\nDesign, implement, and maintain CI/CD pipelines\n\n\nManage and optimize cloud and on-prem infrastructure\n\n\nAutomate deployments, monitoring, and operations\n\n\nCollaborate with developers to improve reliability and performance\n\n\n \nBaskunskaper\n \n\nExperience with DevOps, CI/CD, and automation\n\n\nKnowledge of cloud platforms (e.g. Azure, AWS, or GCP)\n\n\nExperience with containers, scripting, and infrastructure as code\n\n\nA collaborative mindset and strong problem-solving skills\n\n\n \nVi erbjuder\n \n\nChallenging assignments with modern technologies\n\n\nA collaborative and knowledge-driven environment\n\n\nOpportunities for growth and development",
        "url": "https://sigma.se/sv/position/?id=profiler-positions-7676",
        "published": "2026-01-13T15:28:04",
        "deadline": "2026-01-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30461764",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2026-01-13T08:58:50",
        "deadline": "2026-03-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30447454",
        "title": "Software Developer C++",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "As a C++ Software Engineer at Capgemini Engineering, you will contribute to the development of advanced software solutions for innovative and high-performance systems. Whether you are early in your career or an experienced professional, you will work closely with industry leaders to design and implement solutions that deliver reliability, efficiency, and great user experiences.\nIn this role you will play a key role in: \nDesign and develop embedded software solutions in C++ for complex systems\nImplement and test system-level functionalities with a focus on quality and performance\nCollaborate in agile teams to deliver high-quality software aligned with best practices\nSupport troubleshooting and integration during deployment phases\n\nYour profile\nMinimum 4 years of experience in C/C++ and system software design\nFamiliarity with embedded systems architecture and agile methodologies\nHands-on experience with Unix/Linux environments, GIT, CI tools, and test automation\nExperience from the automotive industry\nFluency in English; Swedish language skills are highly meriting\n\n﻿Note: For this position you need to have a valid Swedish work permit and/or Swedish residency.\nWhat we believe you will enjoy about working here \nInnovative Environment: With us, you'll have the opportunity to work with the latest technology and be part of a dynamic team that loves creating value through innovation.\nCareer Development: We care about your future and offer development programs and certifications in the latest technologies, so you can grow and become the best version of yourself.\nFlexible Work: We understand that life is more than just work. That's why we offer opportunities for remote work and flexible hours to help you feel good and thrive.\nTeam Spirit: We're like one big family with a strong sense of team spirit. By living our core values—courage, passion, teamwork, and entrepreneurship—we create a work environment where everyone can feel at home.\nApplication\nThe assignment is based in Gothenburg. \nAs part of our recruitment process, identity verification or background checks may occasionally be conducted.",
        "url": "https://www.capgemini.com/se-en/jobs/374612-en_US+sap_btp/",
        "published": "2026-01-08T15:55:35",
        "deadline": "2026-02-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30403197",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-12-19T10:34:15",
        "deadline": "2026-06-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30343343",
        "title": "Technical Developer - Machine Learning",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are looking for a number of new Technical Developers who want to join our team of highly skilled and passionate engineers.\n\nCOME JOIN US - We are looking for a number of curious people!\n\nSmart Eye’s algorithm teams are looking for experienced Machine Learning Engineers who are interested in developing our computer vision and machine learning solutions.\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-center of Gothenburg, with convenient access by bus, bike, tram, boat, and car. And on top of that; the best coffee in town! \n\nWork description\n\nYou will be part of one of Smart Eye's algorithm development teams responsible for development in key areas such as head- and eye-tracking, attentiveness and drowsiness, face identification and interior sensing for our Automotive Cabin and Driving Monitoring product. We work in an international environment with colleagues in Boston (US) and Cairo (Egypt). \n\nWe are building safety features in novel technology that will significantly improve road safety and will transform our transportation experiences. Safety features such as determining people’s seating locations in a vehicle, if they are wearing seat belts, and detection of left-behind children, as well as features that enhance comfort, wellness, and entertainment by detecting occupants’ emotions and gestures. \n\nDevelopment activities range from early-stage prototyping to porting and deployment to a wide set of automotive embedded platforms. And you will be responsible for the complete chain of development activities including protocols for data collection, network architecture, training of networks, exploratory data analysis and visualization, but also integration into and validation of the model in the production software.\n\nWe solve these challenging problems utilizing state-of-the-art algorithms in the fields of image processing, the latest machine learning techniques, mathematics and accelerated computing.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance. \n\n\n\n\n\n\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg) \n\n\r\n​ Must-have-skills:\n\n\n - \nUniversity degree within Engineering context preferably Physics, Mathematics, Computer Science, Software Engineering or similar.\n\n\n - \n3+ years of software development experience.\n\n\n - \nExperience using end-to-end development (design, planning, evaluation, deployment) of a machine learning based system.\n\n\n - \n2+ year of work experience in C++ and Python development.\n\n\n - \nStrong communication and team collaboration skills.\n\n\nGood-to-have-skills:\n\n\n - Experience with optimizing Deep Learning model architectures and inference runtimes (ex. Tensorflow, Tensorflow Lite, PyTorch).\n\n - Experience in one or more fields of image processing or graphics programming.\n\n - Experience with CI/CD (Continuous Integration and Deployment).\n\n - Experience with developing software for the Automotive industry.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment. \n\n\n - You're able to work independently in an environment that changes rapidly.\n\n - Exhibit a positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers or other teams within Smart Eye.\n\n - Possess strong analytical, creative skills with a strong interest in new technologies.\n\n\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/290562/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-12-05T13:03:13",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30337069",
        "title": "Senior Embedded Software Engineer",
        "employer": "Sensrad AB",
        "location": "Göteborg",
        "description": "About Sensrad \nAt Sensrad we build and develop one of the world’s most advanced radar sensors. Our sensor provides measurements of its surroundings containing thousands of four-dimensional detections in each frame, delivering a much more complete description of the environment than any of our competitors manages to do. This, in combination with the fact that radar works in any weather and light conditions, has sparked great interest among customers. We supply a variety of verticals ranging from heavy vehicles and drones to static installations, surveilling high-value infrastructure, and intelligent traffic management. Today, we have customers in all these areas located all over the world. \nCurrently, we are looking for a Senior Software Engineer to join our team and help us continue pushing the boundaries of software-defined radar technology. As part of Sensrad, you will have the opportunity to work with cutting-edge embedded sensor software, solving complex real-world problems across multiple industries. Your expertise will directly contribute to delivering safer, smarter, and more efficient solutions for our global customer base. \nWhat You’ll Do \nRoll up your sleeves and work across the full software stack — from Dockerized environments to real-time optimization of cutting-edge signal processing algorithms — as we fine-tune our next-generation radar systems. \nWrite rock-solid code for multiple platforms (ARC, x86, Arm) and make sure it performs where it matters most — in real-world embedded environments. \nSupport our global customers and help them succeed with our technology. \nTake charge of software release processes and ensure we ship robust, high-quality systems on schedule. \nWho You Are \nYou probably hold an M.Sc. in Computer Engineering, Electrical Engineering, or a related field. \nYou bring solid experience in C/C++, Rust, Git, GitHub-based CI/CD, and Linux. \nYou have a thorough understanding of operating system concepts, memory management, and embedded systems. \nYou know how to use tools such as GDB and OpenOCD to debug embedded systems. \nYou hold a valid Swedish driving license (Category B). \nYou’re ready to travel to meet customers, partners, or just to get hands-on with real-world setups. \nWhat We Offer \nA dynamic, flexible environment where you can shape your role based on your skills, interests, and ambitions. \nThe chance to work at the very edge of sensor technology — contributing to safer, smarter, and more autonomous mobility worldwide. \nAn open, innovative culture where learning, growth, and having fun are part of the job. \nIf you’re ready to build the radar systems that others said weren’t possible — we want to hear from you. \nApply now and join Sensrad. Let’s redefine what radar can do. \nHow to apply \nPlease submit the following information: \n CV \n  Degree transcripts \n  Personal letter; introduce yourself, describe your previous relevant experience and your future goals. \n  Contact information for two references. \n  Submit your application no later than December 31. \n \nApply for this position via the career portal at career.sensrad.com.",
        "url": "https://career.sensrad.com/jobs/6879902-senior-embedded-software-engineer?promotion=1741131-arbetsformedlingen",
        "published": "2025-12-04T09:58:13",
        "deadline": "2026-05-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30333490",
        "title": "Software Configuration and Release Manager",
        "employer": "Danda AB",
        "location": "Göteborg",
        "description": "We are looking for a skilled and proactive Software Configuration and Release Manager to join our core software platforms, a centre of excellence teams, developing the next generation products solutions with cutting edge technology within the automotive domain.\nThis position plays a key role in managing the end-to-end software integration, configuration, and release process for our core systems central physical ECU, which integrates three logical ECU stacks: Linux and Adaptive AUTOSAR deployed onto service-oriented SoC, and the Classic AUTOSAR onto signal-oriented SoC.\nBeneath service-oriented platforms, a QNX Host OS is deployed on top of hypervised HW resources. At the base, we run our boot software and HW near software components and configurations.\nAs part of our software delivery organization, you will work closely with domain architects, system engineers, software developers, and test teams to ensure stable, documented, traceable, and repeatable software builds and releases across different variants and platforms.\nWho are we?\nThe mission of Software Platforms within Computational Software Infrastructure (CSI) is to provide best in class embedded software platform & technologies, that enable’s software-driven transport solutions for Volvo. We believe in “Software-Defined Everything” and strive to be in the forefront. We foster teamwork and collaboration with continuous improvement mind-set.\nWe are responsible for the complete life cycle, from strategy to maintenance of the on-board SW platforms.\nWho are you?\nYou are a structured, detail-oriented engineer who thrives in complex embedded software environments. You understand the importance of consistency, traceability, and automation in the software development lifecycle, and you are driven by building reliable release pipelines and configuration baselines. You enjoy working collaboratively in cross-functional teams, and you take ownership of processes that ensure quality and compliance in every software release.\nYou’re aware of multi-layered software stacks and understand the nuances of integrating software components across Boot Software, Hypervisor, Software Download and Deployment orchestration, Linux, Adaptive AUTOSAR, Classic AUTOSAR platforms in safety-critical systems.\nYou are an Experienced Software Leader with a passion for automotive software development and baseline management and a deep understanding of dependencies between people and diligence, when it comes to time tracking and revision management. Your expertise lies in software configuration and CI/CD development, and you have a track record of successfully designing and implementing software solutions for automotive ECUs.\nYou thrive in a collaborative environment where you can improve development teams, by monitoring and drive regression testing, and govern bug fixes, and create and maintain the department release baseline. You will be a person that takes pride in proper release documentation and being an interface for information sharing of what content different software releases support.\nYour strong analytical and problem-solving skills enable you to make critical decisions and drive collaboration with other trains, to align time plans, and branch outs. software platform development processes.\nResponsibilities:\n Own and manage the software configuration and release management process for the core central ECU, consisting of Linux, Adaptive AUTOSAR, and Classic AUTOSAR logical ECUs.\n Define and maintain software versioning schemes, configuration baselines, and release strategies.\n Drive automation in build, integration, and packaging processes using industry-standard CI/CD tools.\n Coordinate and manage software branching, merging, and integration strategies across multiple software domains and suppliers.\n Ensure traceability of all software artifacts in accordance with automotive safety and cybersecurity standards (e.g., ASPICE, ISO 26262, ISO/SAE 21434).\n Maintain and manage configuration management tools (e.g., Git, GitLab, Jenkins, Artifactory).\n Ensure proper tagging, documentation, and release notes for all software deliveries.\n Facilitate regular release readiness reviews with cross-functional teams.\n Troubleshoot and resolve build/integration issues together with development and system teams.\n Collaborate with Product Owners and Product Managers to align release schedules with program milestones and vehicle development timelines.\n \nRequirements\n Bachelor’s or Master’s degree in Software Engineering, Computer Science, Electrical Engineering, or related field.\n 5+ years of experience in software configuration and release management within the automotive or embedded systems domain.\n Solid experience with Linux, Adaptive AUTOSAR, and Classic AUTOSAR software stacks.\n Deep understanding of Git-based workflows, CI/CD pipelines, and software version control principles.\n Hands-on experience with tools like Jenkins, Artifactory, GitLab, Bitbucket, and Yocto (preferred).\n Strong grasp of embedded build systems and toolchains for cross-compilation.\n Familiarity with ASPICE, ISO 26262, and software compliance requirements in the automotive industry.\n Excellent communication and organizational skills, with the ability to collaborate effectively across international and interdisciplinary teams.\n Experience working in agile software development environments.",
        "url": "https://jobb.danda.se/jobs/6875171-software-configuration-and-release-manager?promotion=1739752-arbetsformedlingen",
        "published": "2025-12-03T11:46:52",
        "deadline": "2026-05-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30312056",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-11-27T10:17:25",
        "deadline": "2026-01-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307060",
        "title": "Android Platform Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to build the Android platform foundation for next-generation infotainment systems – and see your work run in real machines – this could be your next step. We’re looking for an Android Platform Developer who brings more than just coding skills. At CPAC Systems, we know that your background, interests and experiences shape how you solve problems – and that mix is what drives innovation here. When you approach challenges from new angles, you help us find smarter solutions that make life easier for our customers.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems.\nYour roleAs an Android Platform Developer, you will work on platform-level components that power modern automotive infotainment systems. You’ll contribute to Android system services, frameworks and platform features, ensuring performance, reliability and smooth integration across hardware and application layers.\nIn this role, you will implement new platform functionality in Java/Kotlin, integrate native C++ components, participate in design and code reviews, and support CI/CD pipelines. You will collaborate closely with customer projects and cross-functional engineering teams, contributing to both feature development and long-term platform evolution.\nYou will also be a key part of Android OS upgrade projects, making sure platform components migrate cleanly between versions and remain compatible with automotive hardware, APIs and system constraints.\nThis is a hands-on development role for someone who enjoys digging into AOSP internals, solving complex problems and shaping the backbone of the entire Android system.\nWhat you will do• Develop and maintain Android platform components for automotive infotainment • Implement features using Java/Kotlin and integrate with native C++ layers • Drive development of assigned Android platform work packages • Perform design and code reviews for platform components • Support CI/CD pipelines using Jenkins and maintain clear documentation • Collaborate closely with customer projects and cross-functional engineering teams • Lead or contribute to Android OS upgrade projects, securing compatibility with hardware and applications\nKey qualifications• Strong experience in Android and AOSP platform development • Proficiency in Java and Kotlin (C++ for native integration is a plus) • Familiarity with Python for scripting and automation • Experience with Jenkins and CI/CD workflows • Knowledge of automotive infotainment systems and hybrid development environments • Proven experience with Android version upgrades, API changes, platform migrations and validation in automotive or embedded settings • Fluency in English, written and spoken\nWho you areYou see complex systems as full of possibilities and enjoy working hands-on to understand how each part connects. You stay current in your field and willingly share your knowledge with others. You appreciate having responsibility from start to finish and are comfortable challenging assumptions to find smarter and more efficient solutions. With a solid understanding of both hardware and software, and how they interact, you bring clarity, solve problems and help turn ideas into reliable real-world systems.\nHow to applySubmit your application today and feel free to reach out to R&D Manager David Andersson at david.andersson2@cpacsystems.se if you have any questions regarding the job.",
        "url": "https://careers.cpacsystems.se/jobs/6832158-android-platform-developer?promotion=1729765-arbetsformedlingen",
        "published": "2025-11-26T09:40:42",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30396942",
        "title": "Data Engineer - AWS, Data Warehousing & Analytics",
        "employer": "Creditsafe i Sverige AB",
        "location": "Göteborg",
        "description": "Om tjänsten:\nI rollen som Data Engineer kommer du att arbeta med att utveckla och optimera affärskritiska SQL-queries samt bygga och förbättra våra dbt-modeller, inklusive mart-, staging-, core- och snapshot-modeller. Du får möjlighet att designa datamodeller som hanterar både historisk och aktuell data, samt implementera och optimera Airflow-DAGs för schemalagda jobb.\nDu kommer att ansvara för hantering av releaser, migreringar och rollback-skript samt felsöka dataproblem och utföra root cause analysis. En viktig del av arbetet är att samarbeta nära verksamheten för att översätta krav till lösningar.\nVidare kommer du att utveckla och implementera ETL-processer från skandinaviska dataleverantörer, vilket innebär att du får en central roll i att säkerställa att våra datalösningar är både tillförlitliga och effektiva.\nVi söker dig som har:\n\n·         Mycket goda kunskaper i avancerad SQL: CTEs (WITH), Window functions (ROW_NUMBER, RANK, LAG, LEAD m.fl.), Komplexa JOINs, subqueries och aggregeringar\n\n\n·         Praktisk erfarenhet av dbt (Data Build Tool): Models, tests, snapshots och materializations\n\n\n·         God förståelse för datamodellering: Data Vault (Hub/Link/Satellite), Star/Snowflake schema, hantering av historik (SCD Type 2)\n\n\n·         Vana att arbeta med Git\n\n\n·         Stark problemlösningsförmåga och god analytisk förmåga\n\n\n·         Mycket goda kunskaper i Python\n\n\n·         Erfarenhet av release- och versionshantering i databasmiljö\n\n\n·         Kunskap om verktyg för kodkvalitet (SQLFluff, Ruff)\n\n\n·         Flytande svenska och engelska i tal och skrift krävs. Vårt arbete sker tvärs över koncernen med internationella kollegor och engelska fungerar som det dagliga koncernspråket.\n\n\nMeriterande:\n\n·         Fördjupad kunskap inom AWS (S3, Glue, IAM, VPC)\n\n\n·         Avancerad dbt-användning (macros, custom tests, packages)\n\n\n·         Erfarenhet av prestandaoptimering i stora datamängder\n\n\n·         Bakgrund inom kredit-, risk- eller inkasso branschen\n\n\n·         Vana att arbeta med Cursor som verktyg\n\n\n·         Erfarenhet av xslt-stylesheets\n\n\n·         Erfarenhet av jq  \n\n\n·         Erfarenhet av Apache Airflow\n\n\n·         Erfarenhet av Amazon Redshift:\n\n\nCreditsafe gör just nu en stor satsning inom AI för att både effektivisera vårt arbete och höja datakvaliteten. Därför är det meriterande om du har erfarenhet av eller intresse för AI inom databashantering och dataanalys.\nVi erbjuder dig\nCreditsafe är ett globalt kreditupplysningsföretag som ger dig en tydlig bild över det ekonomiska läget och vilken risk ditt företag ställs inför. Vi samlar information från en mängd officiella källor, däribland skandinaviska myndigheter.\nCreditsafe är så mycket mer än bara en vanlig arbetsplats. Vi kan skryta om träning på arbetstid, kortare arbetsdagar under sommaren, fina kontorslokaler i Gårda, flexibilitet och spännande konferensresor. Men det vi är allra mest stolta över hos oss på Creditsafe är vår personal! Vi är otroligt stolta över energin och gemenskapen som finns bland våra kollegor - det är något att skryta om! \nÖvrig information:\n\n·         Tillsvidareanställning som föregås av sex månaders provanställning\n\n\n·         Arbetet är på heltid\n\n\n·         Hybrid arbetsplats\n\n\n·         Fast månadslön\n\n\n·         Start enligt överenskommelse\n\n\n \nEftersom intervjuer sker löpande hoppas vi att du skickar in din ansökan så snart som möjligt!",
        "url": "https://jobb.creditsafe.se/jobs/6944932-data-engineer-aws-data-warehousing-analytics?promotion=1759757-arbetsformedlingen",
        "published": "2025-12-18T13:40:54",
        "deadline": "2026-06-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30476616",
        "title": "Principal Research AI Engineer - Center for AI",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Lead the next wave of AI Innovation \nJoin AstraZeneca's Center for AI and push the boundaries of what's possible. We combine cutting-edge science with advanced AI to accelerate discoveries and deliver life-changing medicines. Here, you'll work with visionary minds, explore bold ideas, and shape the future of healthcare through technology. Innovation starts with you. \n \n\nThe role is to bridge cutting-edge AI research and production engineering, enabling scientific breakthroughs through robust, scalable, and sustainable research infrastructure. This position provides strategic technical leadership in building the platforms, tools, and practices that accelerate AI-driven scientific discovery while championing sustainability and engineering excellence across AstraZeneca's R&D and Science functions. \n \n\nKey Accountabilities \n\nResearch Engineering Leadership \n\n * Provide technical vision and leadership for research engineering initiatives that enable scientists and researchers to rapidly experiment, iterate, and scale AI solutions from concept to production \n\n * Design and implement research infrastructure, frameworks, and tooling that bridge the gap between exploratory research and enterprise deployment, ensuring reproducibility, scalability, and compliance \n\n * Mentor research engineers and collaborate closely with research scientists to establish best practices that maintain scientific rigor while accelerating the path from research to impact \n \n\nSustainable AI Research Infrastructure \n\n * Lead the definition and implementation of sustainability strategies for AI research workloads, establishing metrics, monitoring frameworks, and optimization practices to minimize environmental impact without compromising scientific quality \n\n * Architect efficient distributed computing solutions for large-scale model training and experimentation across cloud and on-premises infrastructure, optimizing for both performance and energy efficiency \n\n * Drive innovation in resource utilization, experiment tracking, and computational efficiency to reduce costs and carbon footprint of research activities \n \n\nResearch-to-Production Excellence \n\n * Own the research engineering standards and practices within AI for Science, developing comprehensive documentation, reusable components, and automation that enable seamless transition from research prototypes to production systems \n\n * Partner with research teams, infrastructure groups, MLOps teams, and external collaborators to create robust pipelines that support the full research lifecycle from hypothesis to validated, deployable solutions \n\n * Accelerate scientific discovery by implementing DevOps, GitOps, and MLOps automation tailored to research workflows, reducing friction and manual intervention while maintaining experimental flexibility \n\nInnovation and Scientific Enablement \n\n * Identify and evaluate emerging research engineering methodologies, tools, and technologies that enhance both scientific capability and operational sustainability \n\n * Lead initiatives to improve reproducibility, experiment management, and collaboration across distributed research teams \n\n * Foster a culture of innovation that balances scientific exploration with engineering discipline, enabling researchers to focus on discovery while maintaining production-quality standards \n \n\nEssential Skills and Experience \n\n * PhD in Computer Science, Engineering, or a relevant scientific field, or Master's degree with significant experience in research engineering or applied research roles \n\n * Demonstrated track record of building research infrastructure and tooling that has enabled scientific teams to achieve measurable impact \n\n * Extensive experience establishing research engineering best practices, including experiment tracking, reproducibility frameworks, and research-to-production workflows \n\n * Expertise in automating research workflows and the machine learning lifecycle, with focus on enabling rapid experimentation and iteration \n\n * Advanced proficiency in Python and the scientific computing ecosystem (NumPy, Pandas, SciPy, etc.), with understanding of how researchers use these tools \n\n * Expert-level experience with PyTorch or similar frameworks, including implementing custom architectures and optimizing training workflows \n\n * Demonstrable Experience with DDP, FSDP and multi-node training. \n\n * Strong background with modern DevOps practices including GitHub/GitLab, CI/CD pipelines, and infrastructure-as-code applied to research environments \n\n * Experience with running workloads as containers, container orchestration, cloud and on-prem workloads. \n\n * Demonstrated ability to collaborate effectively with research scientists, translating research needs into robust engineering solutions",
        "url": "https://www.aplitrak.com/?adid=bWlrYWVsYS5qYWhyZXNrb2cuMDA0ODkuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-01-15T15:02:04",
        "deadline": "2026-01-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30470657",
        "title": "Senior Scientist Integrated Bioanalysis, Immunoassay Specialist",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "About Discovery Bioanalysis \n\nDiscovery Bioanalysis (DxBA) is a global department within Integrated Bioanalysis, Clinical Pharmacology & Safety Sciences, supporting AstraZeneca's portfolio from early discovery through clinical development. The team applies advanced analytical technologies, including immunoassay, quantitative LC-MS, flow cytometry, multi-omics, and spatial biology to generate high-confidence datasets for decision-making at key project milestones. \n\nDiscovery Bioanalysis is responsible for developing and implementing bioanalytical strategies, ensuring robust and reliable data to guide candidate selection and program progression. Working closely with cross-functional project-teams, the group provides comprehensive support across discovery, preclinical, and clinical phases, contributing to the advancement of therapies for complex diseases. \n\n \n\nAbout the role \n\nThis is an opportunity for a motivated immunoassay expert to join our Integrated Bioanalysis (IBA) team in Gothenburg (Sweden) as a Senior Scientist. \n\nAs part of the Discovery Bioanalysis Team, you will develop and validate bespoke immunoassays to assess pharmacokinetics and target engagement biomarkers across diverse therapeutic modalities. The role involves designing, executing, and transferring complex assays using advanced instrumentation to support discovery, preclinical and clinical studies. You will ensure assays are fit for purpose to meet their intended context of use & will collaborate with internal and external partners, reviewing and analyzing data; and troubleshooting assay performance. As a Subject Matter Expert, you will be responsible for enhancing the IBA reputation for scientific excellence by presenting at internal and external meetings, and publishing manuscripts. \n\nAlongside the core laboratory role you will have the opportunity as a Discovery Bioanalytical lead to work within a dynamic cross-functional team in a matrixed environment, defining and executing on tailored & focused project-specific bioanalytical strategies supporting decision-making and advancing the pipeline. You will work in close partnership with key stakeholders across the business, input to project strategy and delivery, managing expectations whilst interfacing with experienced and highly skilled bioanalytical scientist colleagues or our partnered labs. You will have the opportunity to influence decisions from early discovery through late-stage development and have an immediate and lasting impact to our diverse pipeline. \n\n \n\nEssential requirements: \n\n * \n\nPhD or MSc (1-3 years' experience), or BSc (3+ years' experience) in immunology, molecular biology, or related field with significant relevant experience. \n * \n\nProven expertise as a subject matter expert in ligand-binding immunoassay techniques (expert level for MSD plus one of: Gyrolab, Simoa, SMC-Pro, NULISA, Ella). \n * \n\nDemonstrated experience in leading bioanalytical project strategy. \n * \n\nExperience developing robust, state-of-the-art assays for bioanalytical characterization of pharmacokinetics in preclinical and clinical studies, including complex large molecule bioanalysis (e.g., multi-specific antibodies, T cell engagers). \n * \n\nExpertise in target engagement and occupancy biomarker assay development, including fit-for-purpose approaches. \n * \n\nDemonstrated experience with total and free assay development to support dose modelling. \n * \n\nBioanalytical support for non-GLP IND-enabling studies, including assay qualification and tech transfer for GxP-like and GxP studies. \n * \n\nAbility to independently design, execute, and troubleshoot assays. \n * \n\nProficient in data analysis using Softmax Pro and MSD Workbench. \n * \n\nMaintain high-quality documentation in electronic lab notebooks and prepare technical reports for regulatory submissions. \n * \n\nInterpret complex datasets for key project decisions as part of cross-functional, multi-platform teams. \n * \n\nEffective collaboration in a matrix environment and presentation of findings to scientific and management audiences. \n * \n\nAgile and adaptable, able to manage multiple projects in a fast-paced setting. \n * \n\nStrong publication record, communication, and organizational skills; proven accountability and teamwork. \n\n \n\nDesirable for the role: \n\n * \n\nExperience implementing AI and automation in laboratory and data workflows. \n * \n\nExperience with ultrasensitive immunoassay platforms (e.g., Simoa, SMC-Pro, NULISA). \n * \n\nExperience across additional analytical platforms (e.g., spatial, circulatory, molecular technologies such as imaging, cytometry, PCR). \n * \n\nBackground in developing and executing multiplexed immunoassays on Luminex. \n * \n\nPrevious involvement in pharmaceutical research with comprehensive understanding of drug discovery phases and related bioanalytical requirements. \n * \n\nBasic coding skills for laboratory and data automation. \n\n \n\nWhen we put unexpected teams in the same room, we unleash bold thinking with the power to inspire life-changing medicines. In-person working gives us the platform we need to connect, work at pace and challenge perceptions. That's why we work, on average, a minimum of four days per week from the office. But that doesn't mean we're not flexible. We balance the expectation of being in the office while respecting individual flexibility. Join us in our unique and ambitious world. \n\n \n\nReady to make an impact? \n\nAre you ready to make a meaningful and lasting difference? Apply today and join us in our mission to push the boundaries of science and transform medicine. Please submit your application; CV and cover letter, between 15 January 2026 and 28 February 2026.",
        "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy41ODAyNC4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2026-01-14T14:00:04",
        "deadline": "2026-01-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30449437",
        "title": "Modelling and Simulation PK/PD Expert",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you a passionate individual with expertise in mathematical modelling and pharmacokinetics-pharmacodynamics (PK/PD)? Do you want to contribute to the development of future treatments for cardiovascular, renal, and metabolic diseases? If so, we invite you to join our Modelling & Simulation team within the Early Cardiovascular, Renal and Metabolism (CVRM) therapeutic area at AstraZeneca. This position is based at our dynamic R&D site in Gothenburg, Sweden. \n\n \n\nAccountabilities: \n\nAs a Modelling and Simulation PK/PD expert, you will play a key role in shaping project strategies and driving critical decisions across our drug discovery portfolio. You will actively influence drug project teams, guiding the selection of targets, molecules, optimal dosing strategies, patient populations, and overall development pathways. \n\nYou will have the opportunity to design and oversee the execution of complex studies in preclinical disease models, applying advanced mathematical modelling approaches to deliver impactful PK/PD and translational insights. Your expertise will enable you to synthesize data from multiple sources, predict human pharmacokinetics and pharmacodynamics, and influence the definition of efficacious exposure and dosing regimens. \n\nIn this role, you will present and defend your quantitative assessments and recommendations to internal governance and senior stakeholders, shaping critical decisions at the highest levels. You will also provide scientific leadership by initiating and leading strategic DMPK and PK/PD innovation projects, fostering collaboration across disciplines, and representing AstraZeneca's modelling expertise both internally and within the broader scientific community. \n\n \n\nEssential Skills/Experience: \n\n * \n\nPhD in pharmacokinetics, pharmacology, mathematics, or related field, with a focus on model-based PK/PD approaches, preferably in a preclinical/translational setting \n\n * \n\nIndustry or academic experience in exposure-response modelling (PK/PD, NLME, PBPK and/or QSP) including hands-on experience with scriptable modelling softwares (e.g., Phoenix, R, Matlab, Python, Monolix, NONMEM) \n\n * \n\nDemonstrated scientific leadership through a publication track record in relevant area \n\n * \n\nExcellent interpersonal skills and the ability to work in cross-functional teams \n\n * \n\nExcellent communication skills in English, both verbal and written \n\n \n\nDesirable Skills/Experience: \n\n * \n\nExperience in pharmaceutical research and development \n\n * \n\nExperience in defining quantitative modelling strategies across various therapeutic modalities (e.g., small molecules, oligonucleotides, peptides, proteins, antibodies or cell/gene therapy) \n * \n\nExperience applying AI/machine learning to research workflows, including data curation, PK/PD or translational modeling\n * \n\nExperience in PBPK modelling (e.g. Simcyp or PK-Sim) \n\n \n\nAt AstraZeneca, we are driven by results and use our unique blend of science and commercial knowledge to spot opportunities and drive outcomes. We are part of an expansive healthcare ecosystem that connects key players across the entire patient journey. Our patient-first approach informs every decision we make. We are committed to your development and believe that your best is better here. Join us and be part of a global team filled with the smartest minds. \n\n \n\nReady to make your mark? Apply now and be a part of our journey to redefine the future of healthcare! Welcome with your application no later than January 25th, 2026.",
        "url": "https://www.aplitrak.com/?adid=ZWxlb25vci5laHJtYW4uMDIyNzQuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-01-09T09:32:24",
        "deadline": "2026-01-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30442985",
        "title": "Group Operations Manager",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "Lead and manage global end‑user support services across both remote and onsite channels, ensuring a seamless, high‑quality experience for employees worldwide. This role drives operational excellence for the Global Service Desk—delivering multilingual, multichannel 24×7 support—and oversees Field Service operations, including onsite assistance, IMAC projects, and Hardware Asset Management. The focus is on achieving SLA and CSAT targets, optimizing processes through ITIL and ServiceNow, fostering collaboration between resolver teams, and advancing automation and AI initiatives toward a zero‑touch support model, while maintaining compliance, safety, and superior user experience across all touchpoints.\n\n\nKey Responsibilities:\n \n·      Global & Onsite Operations Leadership: Oversee day‑to‑day operations for the Global Service Desk (L1/L2) and Field Service teams, including workforce planning, shift governance, onsite dispatch, and technician scheduling across multiple geographies. \n·      Multichannel & In‑Person Support: Deliver seamless end‑user support through phone, email, self‑service portal, chat, mobile app, virtual agent, and onsite walk‑up/floor assistance. \n·      Process & Platform Excellence: Ensure ITIL‑aligned workflows and ServiceNow execution for incident, request, IMAC, and asset management; maintain accurate ticket data and CMDB updates. \n·      Performance Management: Monitor and improve SLA attainment, CSAT, First Contact Resolution, backlog aging, reassignment counts, first‑time‑fix rates, and revisit ratios. \n·      Knowledge & Quality: Drive knowledge management and standard work practices; maintain high‑value KB articles and enablement programs for both desk and field teams. \n·      Automation & Innovation: Virtual agent adoption, and automation initiatives to progress toward zero‑touch support while enhancing user experience. \n·      Hardware Asset Management (HAM): Govern asset lifecycle integrity, inventory accuracy, audits, and logistics for loan equipment and IMAC projects. \n·      Collaboration & Escalation: Coordinate handoffs and swarming with resolver groups (applications, infrastructure, UAM) to ensure timely resolution and ownership. \n·      Stakeholder Engagement & Communication: Provide clear updates on service performance, outages, and improvement plans; deliver executive‑level support where required. \n·      Financial & Vendor Oversight: Manage budgets, sourcing, and vendor performance for both service desk and field operations.\n\n\n\n\nRequired Skills & Qualifications:\nEducation & Experience\nBachelor’s degree in IT, Computer Science Engineering, or related field (or equivalent experience).\n10–15+ years in IT service operations, including: \nManaging large, multi-site Global Service Desk teams.\nLeading Field Service/Onsite support and Hardware Asset Management.\nMinimum 7–10 years in leadership roles with proven ability to manage geographically distributed teams.\n\nTechnical Expertise\nStrong knowledge of ITIL (v3/v4) frameworks and ITSM best practices.\nHands-on experience with ServiceNow (incident, request, IMAC, CMDB, HAM modules).\nFamiliarity with omni-channel support (phone, email, self-service, chat, virtual agent) and onsite support processes.\nProficiency in asset lifecycle management, inventory control, and IMAC project delivery.\n\nCertifications (Preferred)\nITIL Foundation (Intermediate modules a plus).\nCloud Certifications in (MS/AWS/Google).\nNetwork for hardware troubleshooting.\nPrince2/SIAM Certification \n\nCore Skills\nLeadership & People Management: Ability to coach, motivate, and manage diverse teams across multiple geographies.\nOperational Excellence: Strong analytical skills for SLA, CSAT, FCR, backlog, and performance metrics.\nCommunication: Clear, concise communication for stakeholders and end users; crisis communication during outages.\nProblem Solving & Innovation: Drive automation, AI adoption, and continuous improvement initiatives.\nCollaboration: Work effectively with resolver groups, vendors, and cross-functional teams.",
        "url": null,
        "published": "2026-01-07T21:35:40",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30439013",
        "title": "Senior Machine Learning Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Role Description:\nThe Data Scientist Chapter is located in Sweden (Gothenburg and Eskilstuna), and France (Lyon). The Machine Learning Engineer position will be located in Gothenburg.\n\n\n \n\n\nAs a “Machine Learning Engineer” with us, you will:\n\n\n \n\n\nCollaborate with diverse, international teams focused on delivering value to customers and stakeholders.\nTake a holistic approach to data science, machine learning and AI. From understanding business needs to industrializing solutions and enabling continuous improvement.\nApply your expertise across different areas and domains within Volvo Group, spanning from trucks, buses, construction equipment, to energy solutions, autonomous technologies, financial services, and more.\nMaster key aspects of data science, machine learning and AI, including mathematical statistics, computer science, cloud architecture, LLMs, and relevant programming languages.\nMoreover, candidates are expected to be familiar with aspects concerning security, governance, and regulatory requirements.\nTake lead in designing, implementing and owning lifecycle management (CI/CD, Ops) of data science, machine learning, and AI products.\nExcel in communication with colleagues and collaborators worldwide, fluently in English and preferably in a local language.\n\n\nMeriting Competencies:\n\n\n \nPrevious experience of managing and owning data science, machine learning, AI products.\nIndustrialization and commercialization of the above products in regulated environments.\nManaging and leading practitioner communities.\nAdvanced academic achievements.\nWho are you?\nThe right candidate should be able to think and act strategically, operate, and implement change tactically, and effectively deal with ambiguity and manage change priorities in a business-focused, fact-based, and collaborative way to achieve real impact. This role requires solid communication skills and a passion for leading, inspiring, and co-creation together with other members of the product team.\n\n\nTo achieve our goals, we collaborate within and across teams. We nurture open dialogue and collective work to create a sense of unity and trust. We also build a work environment where diversity in expertise, opinion, and culture is valued.\n\n\nAbout the Data Function:\nOur 'Data' function is a vibrant, international community with 900+ members across seven countries. We collaborate closely with various divisions, business areas, and group functions within the Volvo Group to foster an environment where ideas flourish, and goals are achieved collaboratively.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=25273&company=volvoinfor&st=13ADC5F9DB9946647A54FD886066BA740BB3C6E4",
        "published": "2026-01-07T10:39:25",
        "deadline": "2026-02-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30419371",
        "title": "CQR Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour Role\nWe are looking for an CQR Engineer for our pharmaceutical projects in Gothenburg (compliance, quality & regulatory).\nIn this role you will play a key role in:\n• Work towards diverse goals depending on the client's specific needs\n• Driving and supporting our clients in achieving their quality and regulatory objectives\n• Collaborate and support pharmaceutical clients to deliver patient-focused, compliant, and efficient solutions\nYour Profile\n• Degree in pharmacy or engineering\n• Understanding of Quality Systems and GMP and related activities to Investigational Medicinal Product (IMP)\n• Experience of documentation, deviations, changes, and other quality and compliance decisions in the development projects.\n• Experience preferably within a pharmaceutical manufacturing organization is desirable\n• Comprehensive understanding of EU pharmaceutical regulations, encompassing product registration, manufacturing processes, and compliance with EMA guidelines and GxP quality standard\nWhat we believe you will enjoy about working here\n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance.\n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities.\n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nApplication\nAs part of our recruitment process, identity verification or background checks may occasionally be conducted.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://career5.successfactors.eu/sfcareer/jobreqcareerpvt?jobId=384113&company=capgemitecP3&st=66F098DD95D20A45878A7C89014B4A8868E84670",
        "published": "2025-12-23T10:13:30",
        "deadline": "2026-03-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30406272",
        "title": "Doctoral student in number theory or harmonic analysis",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "We are looking for one Doctoral student at the divison of Algebra and Geometry. The research project will be at the interface of number theory and harmonic analysis and will be conducted within the research group of Simon Rydin Myerson.\n\nAbout us \nThe Department of Mathematical Sciences at the Chalmers University of Technology and the University of Gothenburg has about 200 employees and is the largest department of mathematics in Sweden. We have an international environment with frequent exchanges with other universities around the world. We provide a friendly, creative, and supportive atmosphere with a steady flow of international guests. Equality and diversity are substantial foundations in all our activities. We work actively to be a parent-friendly organization.\n\nAt the Division of Algebra and Geometry we conduct research in areas such as algebraic geometry, complex geometry, number theory, mathematical physics and the mathematics of AI.\n\nAbout the research project  \nMany open questions in number theory, such as the Manin-Peyre conjecture, concern Diophantine equations. Even certain questions in harmonic analysis and PDE can be understood as Diophantine problems.\n\nThis project will use analytic techniques to study problems concerning polynomials in (algebraic or rational) integers. An extension or alternative is to use these Diophantine techniques to tackle problems in harmonic analysis or PDE, especially spectral multiplier estimates on compact manifolds and nilmanifolds.\n\nThe doctoral student could establish existence of solutions using modern forms of the Birch-Davenport circle method, or prove upper bounds using the sieve or determinant methods. Systems of equations with differing degrees, and cubic equations in three integer variables, are current frontiers in this area.\n\nAs a Doctoral student you will be part of an international research environment while you expand your knowledge of the field and write your thesis. This gives opportunities for many inspiring conversations, a lot of autonomous work and some travel. You are expected to develop your own ideas and communicate scientific results orally as well as in written form. In addition, the position will normally include 20% departmental work, mostly teaching duties\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in mathematics or a related field.\n• You will need strong written and verbal communication skills in English.\n• The project requires knowledge in either number theory, harmonic analysis, or algebraic geometry. It is advantageous to have knowledge in all of these fields.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of mathematics .\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing. \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours.\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n• The expected starting date is September 2026, or as agreed. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than 23 February 2026   \n\nFor questions, please contact:  \nName: Daniel Persson, Head of unit\nEmail: daniel.persson@chalmers.se\n\nName: Anders Södergren, Director of graduate studies\nEmail: andesod@chalmers.se\n\nName: Simon Myerson, Project leader\nEmail: myerson@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14507&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T13:52:24",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30361762",
        "title": "Senior Data Architect",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Description:\n\n\nWe are looking for a senior data architect who will work in a BI & Analytics area called Parts Sales within Volvo Trucks.\n\n\nThis person should be able to understand business stakeholders and translate their needs into technical solutions.\n\n\nCandidate must have\n\n\n• Demonstrated experience as a Data Architect handling architectural responsibilities on large-scale implementations.\n• Deep expertise in Azure Data Services, Databricks, and related cloud technologies & tool ecosystem.\n• Advanced proficiency in data modeling techniques, including relational, dimensional, NoSQL & GraphDB models.\n• Strong knowledge of API design, event-driven architectures, and streaming platforms (e.g., Kafka).\n• Familiarity with AI/ML integration, enabling seamless incorporation of AI models into enterprise workflows.\n• Hands-on experience with CI/CD pipelines, Azure DevOps, and infrastructure automation.\n• Skilled in SQL, Python, and PySpark for data engineering and architectural validation.\n• Solid understanding of data governance frameworks, GDPR compliance, and cloud security best practices.\n• Excellent stakeholder management and communication skills.\n• Ability to produce wireframes, architectural diagrams, and comprehensive documentation for governance and review processes.",
        "url": "https://www.clicktohire.se/",
        "published": "2025-12-10T21:46:10",
        "deadline": "2026-05-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357030",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-12-09T21:47:00",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357033",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-12-09T21:46:15",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30351764",
        "title": "Data Specialist at Kognic",
        "employer": "Kognic AB",
        "location": "Göteborg",
        "description": "About Kognic\nKognic helps car manufacturers & suppliers develop self-driving vehicles. Our software merges and visualizes sensor data from vehicles that is analyzed and labeled by people, turning raw data into valuable input for autonomous machines. We are on an exciting path towards profitability and are actively building marketing momentum as we achieve product-market-distribution fit across our target markets. That's why we need you!\nThe role\nIn the role of Data Specialist, you will work closely with leading automotive customers at the forefront of autonomous driving and AD/ADAS perception model development. As the technical expert within the account team, you will play a key role in ensuring the delivery of high-quality training data for these models.\nYou will own the technical setup of each project, serving as the central point for data quality, workflow optimization, customer onboarding, and technical communication. The role blends deep domain expertise in autonomous driving with hands-on involvement in data and annotation workflows, as well as strong cross-functional collaboration both internally and with customers.\nExamples of topics our team addresses include: determining the level of detail required in ground-truth annotations to deliver reliable system KPIs and support safety validation. As well as advising clients on how the objective of building safe autonomous vehicles translates to perception system KPI requirements, as well as annotation context, content, and quality.\nWe are looking for you!\nWe're looking for someone who ticks the following boxes:\n Bachelor’s degree in a relevant field (Computer Science, Data Science, Information Systems, Automotive engineering, Machine learning)\n 5+ years of experience in data quality or related fields, with a focus on AD/ADAS perception systems Expertise in AD/ADAS perception use cases (sensor modalities, annotation requirements, dataset design) to achieve specific system objectives\n Hands-on experience in machine learning for AD/ADAS, with a strong grasp of how annotated data impacts model training, system performance, and safety compliance.\n Deep understanding of data annotation workflows and quality assurance for training perception models in autonomous driving applications.\n \n Experience using Python and working in databases (SQL) or similar languages\n Experience in customer interactions (conducting technical demos, data analysis, addressing customer-specific needs) Strong communication skills, translating complex technical concepts for cross-functional teams\n Ability to manage multiple projects, ensuring high productivity while maintaining data quality standards.\n \n  Why Kognic?\nWe are in it to win, and have a lot of fun while doing it! To be part of Kognic is to be part of a purpose-driven company with strong values where we, together, create what Kognic will be tomorrow. Besides working with around 100 talented and humble people from many different nationalities, in a fun and creative environment, we also have many other great benefits!\n Working in the exciting field of AI and playing an important part in the world’s next great technological leap\n A hybrid work model and an employer that prioritises life-work balance\n Lots of team and office events, parental pay, salary exchange, great health benefits, order your own computer, place your own pension - to name a few\n  \nFrom our early days as a pure start-up to our current life as a scale-up, we work in a dynamic environment, which means that every day might be different from the next, but that is exactly how we want it. Kognicians all have a strong desire to explore uncharted territory and a willingness to constantly be learning.\nJoin us\nWe recommend that you submit your application as soon as possible since we select and perform interviews continuously. We do not require any cover letter but ask you to share your resume and answer a couple of questions in the application\nYou are more than welcome to have a look at our career website to read more about our recruiting process. If you have any questions regarding the position, please contact our Hiring Manager, Sara Roth (sara.roth@kognic.com) \n About Kognic\nKognic was conceived in the curious minds of Daniel Langkilde and Oscar Petersson, two engineering students, who dared to dream big and help machines make sense of our messy, chaotic, and unstructured world. Kognic's pioneering dataset management solution helps companies accelerate the development of high-performing and trusted AI products, focusing on bringing the most advanced driver-assistance systems (ADAS) and autonomous driving (AD) to market.",
        "url": "https://careers.kognic.com/jobs/6897649-data-specialist-at-kognic?promotion=1746012-arbetsformedlingen",
        "published": "2025-12-08T18:16:12",
        "deadline": "2026-05-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465971",
        "title": "Data Scientist",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Data Scientist in the Data, Science & Research team!\nThe Role\nOur Data Science and Research (DSR) team creates and delivers data pipelines and machine learning based solutions towards internal stakeholders. We process billions of requests daily to enable sophisticated prediction pipelines within revenue estimation, conversion analysis and pricing automation. We develop and maintain advanced data-processing and training pipelines to improve the speed and precision of our solutions and deliver them in a highly scalable and resilient environment. You will be joining an experienced team of 14 Data Scientists, Machine Learning Engineers, Data Engineers and Operations Engineers building our products from end to end.\nWe are in search of a Data Scientist with the ability to work in an energetic and interactive environment. You must be a self-starter with a strong foundation in statistics and machine learning and as part of our team work closely with our machine learning engineers, data engineers and business stakeholders.\nMain tasks\nWork closely with stakeholders to understand business problems, define clear objectives and translate their concerns, suggestions and ideas into testable hypotheses and quantifiable metrics.\nPerforming statistical analyses and visualizations to understand the structure, patterns, anomalies and quality of data.\nClean, transform and prepare large and complex datasets for model training. You'll also identify and engineer relevant features to improve model accuracy and efficiency.\nDesign, build and train robust machine learning models using appropriate algorithms and techniques. This includes experimenting with different architectures and hyperparameters to optimize performance for specific business needs.\nWork with Machine Learning, Data and Operations Engineers to deploy the final model into production. This includes performing AB tests to measure and evaluate the models performance on real world data.\nExplain model results and statistical findings clearly to both technical and non-technical stakeholders deriving actionable insights.\n\n\n\nLearning Curve\nIn this role you will be using the best selection of tools and processes in the Data Science domain. You will be working within our ML platform providing automation and standardisation for analytical and exploratory work but also productionising and providing inference to business users and systems. Further, the role will enable you to learn even more about creating, developing and implementing standards for ML modelling and deepen your knowledge about ML concepts and frameworks. \nRequirements\nUniversity degree in a STEM discipline\n2 years of professional or other comparable exceptional experience like a PhD in a related field\nStrong analytical and quantitative skills\nProficiency in python including numerical and visualisation libraries like pandas or polars and matplotlib\nExperience in data analytics, exploration and modelling using jupyter or marimo\nExpertise in writing complex and optimised SQL queries for data extraction and manipulation\nFamiliarity with version control (git) and the ability to navigate and work in larger code bases\nUnderstanding and experience in working with ML modelling and tuning frameworks like sklearn, lightgbm, pytorch\nFamiliarity with LLM based solutions like RAG systems including orchestration and evaluation tooling like langchain or langfuse\nExposure to implementing orchestrated training pipelines using model management using airflow and mflow\nExposure to prediction service technologies, development practices like CI/CD and model monitoring and alerting practices will be a meritorious\n\n\n\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.",
        "url": "https://etraveligroup.teamtailor.com/jobs/6894374-data-scientist",
        "published": "2026-01-13T15:42:25",
        "deadline": "2026-03-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30406685",
        "title": "Doctoral student in discrete optimization and computational complexity",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "We are looking for a Doctoral student to become part of our team at the Division of Applied Mathematics and Statistics at the Department of Mathematical Sciences. Under the supervision of Malin Rau, you will  contribute to impactful research in optimization.  \n\nAbout us \nThe department of Mathematical Sciences has about 200 employees and is the largest department of mathematics in Sweden. The department has three scientific divisions: Algebra and Geometry, Analysis and Probability Theory, and Applied Mathematics and Statistics and conducts successful research in pure and applied mathematics and mathematical statistics in a wide range of research areas. We have an international environment with frequent exchanges with other universities around the world. The department provides a friendly, creative, and supportive atmosphere with a steady flow of international guests. We strive to offer an environment where you can combine world-leading research and teaching with a good work-life balance. \n\nAt the division of Applied Mathematics and Statistics we conduct research within the theory and implementation of biomathematics, biostatistics, spatial modeling, differential equations, Bayesian inference, large-scale computational methods, bioinformatics, data science, machine learning, optimisation, numerical methods.\n\nPlease read more about the position and our department on our dedicated webpage.\n\nAbout the research project  \nThe project is in the field of optimization, and in particular the project focuses on the design of approximation algorithms for multi-dimensional packing and scheduling problems. The position offers the opportunity to contribute to the theoretical foundations of discrete optimization and explore applications in combinatorial problem-solving.\n\nWho we are looking for\n\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in mathematics, or applied mathematics, or computer science. Alternatively, you expect to complete such a degree by September 1, 2026.\n• You will need strong written and verbal communication skills in English \n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience in some of the following areas: programming, optimization.\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Mathematics or Applied Mathematics and Statistics  \n• Develop your own scientific concepts and communicate the results of your research verbally and in writing \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours \n\nContract terms  \n\n• The Doctoral student position is fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV (max 2 pages) \n\nPersonal letter (max 2 page) \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note:\n\nThe applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Reference contact information will be requested after interviews conducted between March 9 and March 20, 2026.\n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than February 23, 2026   \n\nFor questions, please contact:  \nDr Malin Rau (main supervisor)\n\nDr Irina Pettersson (head of unit, Applied Mathematics and Statistics)\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\n Chalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14478&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T14:15:24",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30406624",
        "title": "Doctoral student in Cancer Bioinformatics",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join the Computing Disease Evolution in Cancer (CODEc) group, led by Dr Eszter Lakatos within the Division of Applied Mathematics and Statistics and persue exciting research. As a Doctoral student, you will combine mathematical modelling and bioinformatics to uncover the key factors behind cancer development.\n\nAbout us \nThe department of Mathematical Sciences has about 200 employees and is the largest department of mathematics in Sweden. The department has three scientific divisions: Algebra and Geometry, Analysis and Probability Theory, and Applied Mathematics and Statistics and conducts successful research in pure and applied mathematics and mathematical statistics in a wide range of research areas. We have an international environment with frequent exchanges with other universities around the world. The department provides a friendly, creative, and supportive atmosphere with a steady flow of international guests. We strive to offer an environment where you can combine world-leading research and teaching with a good work-life balance. \n\nAt the division of Applied Mathematics and Statistics we conduct research within the theory and implementation of biomathematics, biostatistics, spatial modeling, differential equations, Bayesian inference, large-scale computational methods, bioinformatics, data science, machine learning, optimisation, numerical methods.\n\nPlease read more about the position and our department on our dedicated webpage.\n\nAbout the research project  \nIn the CODEc group, we conduct interdisciplinary research into cancer genomics and evolution. We develop novel mathematical and bioinformatic methods to uncover the key factors behind cancer evolution from next generation sequencing data. In this project, you will work on how the genetics of cancer influence its detection by the immune system. You will combine a mechanistic model and bioinformatic analysis of public datasets to derive a score for quantifying cancer immunogenicity. You can find out more about the research here: https://elakatos.github.io/\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Applied Mathematics, Bioengineering, Bioinformatics or in a related topic, or expect to complete such a degree by September 1, 2026.\n• You will need strong written and verbal communication skills in English \n• A successful candidate must have strong quantitive and coding skills.\n• Personal competences in accordance with the requirements profile including specification (e.g. social skills, meaning that you enjoy collaborating with others) \n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Previous experience (courses or project work) in one or several of the following areas: bioinformatics, mathematical modelling, genomics, systems biology.\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Applied Mathematics and Statistics or Bioscience\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing \n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hours \n\nContract terms  \n\n• The Doctoral student position is fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV (max 2 pages) \n\nPersonal letter (max 2 page) \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note:\n\nThe applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Reference contact information will be requested after interviews conducted between March 9 and March 20, 2026.\n\nNote that you do not need an acceptance letter from the supervisor. TOEFL/IELTS is not a requirement, and the English proficiency is typically documented by a master's thesis or other reports written in English.\n\nWe welcome your application no later than February 23, 2026   \n\nFor questions, please contact:  \nDr Eszter Lakatos (main supervisor)\n\nDr Irina Pettersson (head of unit, Applied Mathematics and Statistics)\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14509&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-12-19T14:13:04",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30468738",
        "title": "Data Scientist",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "The Data Analyst will play a key role in strengthening the bridge between the Cyber Defense Center (CDC) and the broader business. This position is developing and implementing analytics capabilities that aim to turn cybersecurity data into business insights – enabling us to build metrics, narratives and visual reports that guide strategic decisions throughout the organization.\n\n\n \n\n\nMain Responsibilities:\n•  Contribute to the end-to-end implementation of Business Intelligence (BI) solutions – from data integration and modeling to visualization and storytelling.\n•  Prepare, transform, and analyze data across the Azure-based analytics platform (including data lake, pipelines, and modeling environments).\n•  Design, maintain, and improve BI dashboards and reports that clearly communicate cybersecurity and operational performance.\n•  Collaborate with senior team members and other CDC teams (e.g., Security Operations, Threat Hunting, Engineering) to define analytics use cases and integrate diverse data sources.\n•  Identify patterns, trends, and anomalies in data to support decision-making and enhance cybersecurity operations.\n•  Ensure data quality, consistency, and documentation across all analytics processes.\n•  Contribute to the automation and scalability of reporting and analytics pipelines.\n•  Apply visual storytelling to present complex data in a clear and impactful way.\n\n\nWho are you?\nQualifications:\n•  Bachelor’s or Master’s degree in Data Science, Computer Science, Information Systems, or a related field.\n•  2+ years of experience as a Data Analyst or in a similar role, with hands-on involvement in end-to-end business intelligence development.\n•  Practical experience working with cloud-based analytics environments, preferably Azure, including data lakes, pipelines, and data modeling components.\n•  Experience in designing and building business intelligence dashboards, preferably using Power BI or similar visualization tools.\n•  Understanding of data extraction, transformation, and loading (ETL) processes and best practices for managing datasets.\n•  Proficiency in Python, R, or other scripting languages for data analytics.\n•  Ability to translate analytical results into clear visual insights and narratives for diverse audiences.\n•  Excellent analytical thinking, problem-solving, and attention to detail.\n•  Strong collaboration and communication skills, with the ability to work effectively with both technical and non-technical stakeholders.\n\n\n \n\n\n \n\n\n“In some countries and for specific positions within Volvo Group Digital & IT, background checks may be required, in accordance with local laws & regulations. If this is applicable to the role you have applied for, you will be informed.”\n\n\n\n\nJoin us on our transformation journey to the digital future   \n\n\n\n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=25831&company=volvoinfor&st=6DC8AB6D554C85C686C5FC7EAB4916AC540012EE",
        "published": "2026-01-14T10:25:35",
        "deadline": "2026-01-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30454363",
        "title": "Manager VFS Business Control",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\r\n\r\nWhat you will do\nAs a Manager VFS Business Control, you will guide the department in achieving its goals and support the professional development of our global network of finance professionals.\nYour starting point will be to, together with your colleagues at VFS and in the broad cross-functional network at the Volvo Group, take responsibilities in the following areas: \n•    Mentors global HQ, and local market analysts on topics such as pricing, modeling, and professional development\n•    Provides leadership in ongoing development of the VFS Finance Academy and supports the effort to ensure that all VFS finance professionals receive appropriate training \n•    Supports management of global planning process throughout the year, including monthly short-term forecasts and annual budget\n•    Assists in governing key VFS models, such as match funding, credit reserves, and pro forma pricing\n•    Monitors local market pricing assumptions, including risk and servicing cost factors\n•    Supports finance function in developing executive information, reporting, and measurements for financial and non-financial data\n•    Performs ad hoc reporting and analysis in support of the CFO, Chief Credit Officer, SVP Communications, etc. \n•    Works effectively in a small and focused team with exposure to international markets and senior management\n•    Facilitate transformation in the Global HQ finance function by implementing dashboard technology and RPA solutions\n•    Travels internationally (10% or less)\n•    Models The Volvo Way and ensures The Code of Conduct is followed\n•    Other duties and projects may be assigned\n\nYour future team\nYou will report directly to the Director VFS Business Control. In VFS, we demonstrate a clear vision to continue Transforming Together, a global mindset and a proven track record of successfully developing people, teams, culture, and leadership. \nIn many of our markets, VFS has won the Great Place To Work award, where Great Work is done. By interacting with each other as an on-site business, we build relationships, which allow us to work together more efficiently and form stronger bonds with our colleagues and customers. This position is located in Gothenburg, Sweden.\n\nWho are you?\n\nDo you dream big? We do too, and we are excited to grow together. In this role, we believe it is the right mindset that will make a difference at VFS. If you, besides your genuine interest in working with people in Transforming Together, also have a positive, service-oriented, and collaborative mindset, and take a proactive approach to handling all responsibilities, idea generation, and recommendations for productivity and efficiency, then we would welcome you to apply for this role.   \nWe believe the successful candidate has strong analytical and problem-solving skills with the ability to draw conclusions from large amounts of information, ability to understand team and corporate objectives, demonstrates superior verbal and interpersonal communication skills as well as ability in handling confidential information and working with a high level of integrity and ethics.\n\nQualifications likely required to be successful in this role include:\n•    BS/BA in Finance/Accounting or related field is required. CPA and/or MBA preferred.\n•    Minimum of 7 years of progressive experience in business control; experience in the financial services industry is advantageous\n•    Multi-national corporate work experience strongly preferred \n•    Proven leadership competency, preferably including successful managerial experience\n•    Innovative problem solving coupled with strong analytical and quantitative abilities\n•    Demonstrated ability to achieve goals with minimum supervision\n•    Proficient in MS Office, with advanced knowledge in Excel and PowerPoint\n•    Familiarity with Hyperion Essbase, data visualization tools, and RPA technology is considered an asset\n•    Fluency in reading, writing, and speaking English; additional languages a plus \n•    Outstanding verbal and written communication skills with exposure to various business settings\n•    Integrity and unquestionable ethics \n•    Multicultural awareness \n\nReady for the next move?\n\nIf you want to make a real impact in your career, Volvo Financial Services is where you want to be. We look forward to meeting you. \nEmerson Silva Ghisleri, Director VFS Business Control, +46 739029905\nSandra Smith, Senior P&C Business Partner, +46 73 9028867\nLast Application Date: January 19th",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43892329",
        "published": "2026-01-11T09:25:04",
        "deadline": "2026-01-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]