[
    {
        "id": "30018797",
        "title": "Software Developer",
        "employer": "SCALINQ AB",
        "location": "Göteborg",
        "description": "SCALINQ is looking for a hands-on Software Developer to build the tools that advance quantum technology. In this vital role, you will develop our operational backbone by automating systems, improving infrastructure, and creating UIs. Your work will directly empower our teams and accelerate our growth. Ready to solve unique challenges? Join us and help build the future of quantum computing!\nRequired Skills:\nMaster's degree (M.Sc.) in Software Engineering, Computer Science, or a similar field\nA minimum of 4 years' professional experience in an industrial environment\nExtensive experience in setting up, maintaining, and actively improving IT environments\nProven, hands-on experience in machine automation\nStrong background in developing application-specific user interfaces and experiences (UI/UX)\nExperience leading projects, with responsibility for budgets, milestones, and deliverables\n\nAbout us: SCALINQ is a prominent player in the growing field of quantum computing. Our core focus is the development of state-of-the-art cryogenic hardware. All our products are classified as enabling hardware and are vital for the overall performance of a quantum computer. This could be your opportunity to play a key role in unlocking the full potential of a new tech era while structuring the financial backbone of the company.\nThe Team: At SCALINQ, diversity and inclusion are at the core of who we are. Our greatest strength lies in the people who shape our company, each contributing their unique skills and perspectives. Together, we blend cutting-edge research expertise with traditional engineering practices to develop innovative and commercially viable solutions. Joining our team means being part of a dynamic environment where every contribution matters.\nBe part of a dynamic environment where your ideas and contributions truly make a difference.\nWhat we offer: At SCALINQ, you’ll join a fast-moving, multicultural team at the forefront of a cutting-edge industry. We offer healthcare benefits, continuous learning opportunities, and an inspiring, modern workspace built for collaboration and innovation.\nThis is a place where driven individuals thrive—where you’re empowered to grow, take initiative, and explore new directions, all while working toward shared goals. Here, you have the opportunity to be truly smart—to think critically, solve complex problems, and make a real impact. Whether you choose to specialize or broaden your expertise, you’ll have the freedom to shape your path and contribute to something bigger.\nIn a rapidly changing world, we move with purpose—and we’re looking for others who do too. Ready to push boundaries with us? Let’s go!\nJoin Us: If you think it sounds like fun please, apply by sending your resume and a cover letter. Mark your application with SOFTWARE DEV.\nLet’s explore the quantum future together!",
        "url": "https://www.careers-page.com/scalinq/job/939X5YXY",
        "published": "2025-09-11T16:20:40",
        "deadline": "2025-10-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30011536",
        "title": "Cyber Security Engineer to Alps Alpine!",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Alps Alpine is looking for a Cyber Security Lead to join their team in Gothenburg. In this role, you will take the lead in ensuring high-quality cybersecurity processes in global automotive projects. This is a unique opportunity to work with innovative vehicle electronics and drive future developments in a truly international environment.\n\n\n\nABOUT THE COMPANY\n\nAlps Alpine is one of the world’s leading manufacturers of electronic components for computers, communications, and automotive electronics. The company is also a market leader in high-performance mobile electronic solutions. Founded in 1948, Alps Alpine is unique as the only manufacturer specializing in mobile multimedia, offering integrated system solutions within digital entertainment, security, and navigation.\n\nThe Swedish branch focuses on vehicle electronics, with products in speakers and sound, infotainment, and radar solutions.\n\nABOUT THE POSITION\n\nWe are now looking for a Cyber Security Engineer to join Alps Alpine in Gothenburg. The company delivers customized products to the global automotive industry. Each product is managed as part of a global project that follows the entire product lifecycle.\n\nAs Cyber Security Engineer, you are responsible for ensuring that all activities and artifacts related to cybersecurity are completed on time, with high quality, and with successful outcomes. You will work closely with the Swedish project teams, supporting them with cybersecurity-related matters – the level of involvement depending on the knowledge within each specific project. The role also requires you, when needed, to demand that the development center in Asia completes cybersecurity-related tasks on time and with the right quality.\n\nYou will not carry out all cybersecurity work yourself but will instead coordinate and lead the efforts together with Cyber Security Managers and Engineers in other development centers as well as on the customer side.\n\nYOUR PROFILE\nRelevant university degree in software engineering or equivalent.\nAt least 2 years of work experience in cybersecurity and software development.\nExperience from the automotive industry and its regulations.\nFluent in English, both spoken and written.\n\n\nTo be successful in this role, we believe you are a strong team player with excellent collaboration skills. You have great communication abilities, can work independently, take initiative, and assume full ownership of your work. You are also eager to learn and develop within the company.\n\nABOUT THE EMPLOYMENT\nType of employment: Full-time, direct recruitment to Alps Alpine\nStart date: As soon as possible\nLocation: Gothenburg\nContact person: Stina Högström\nSalary: Fixed monthly salary\n\nABOUT FRIDAY\n\nBy being a partner to our clients and candidates, we strive to find the best match for both parties. We achieve this by really getting to know our clients and candidate’s needs! Of course, we will ensure that requirements and skillsets match. But above all, we focus on the importance to find harmony between values ​​and corporate culture which both candidate and client considers optimal.\n\nOur passion is to help people to the right position, workplace and context within the IT and Technology field. That's also the reason to why we founded Friday, with the aim to help you find the job that gives you that Friday feeling – every day! We mainly focus on young engineers who either are at the beginning of their career or soon graduating from university within the IT/Tech field. Our belief is that people reach their fullest potential when looking forward to going to work each morning. \"Friday - everyday\", how about that?",
        "url": "https://pnty-apply.ponty-system.se/friday?id=3602&pnty_src=arbetsformedlingen",
        "published": "2025-09-10T11:48:25",
        "deadline": "2025-10-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29984060",
        "title": "Linux och Cloud Native entusiast",
        "employer": "Combitech AB",
        "location": "Göteborg",
        "description": "Vi söker Linux och Cloud Native entusiaster till Combitech i Göteborg. Hos oss får du möjlighet att växa i en företagskultur som uppmuntrar både professionell och personlig utveckling samt anställningstrygghet och balans i livet. Som medarbetare på Combitech i Göteborg är du med och utvecklar framtidens digitaliseringslösningar för industri och samhälle. \n\n \n\n \n\nDin roll som utvecklare \n\nDu kommer att vara en del av ett team som tillsammans utvecklar mjukvarulösningar för datainsamling, datalagring, analys, automation, AI samt flera typer av visualiseringar. Lösningarna teamet bygger används i stora projekt inom t.ex. offentlig verksamhet, försvar, processindustri och industri 4.0. Målet är ofta att kunderna (baserat på data) ska få djupare insikt i sin verksamhet och därigenom automatisera och effektivisera sina processer. Teknik- och komponent-stacken baseras ofta från olika Open Source Communities, så som CNCF, som vi kompletterar med egenutvecklade applikationer. Designen byggs enligt Cloud Native principer som drar nytta av molnteknologins styrkor såsom skalbarhet och flexibilitet. \n\n \n\nVåra uppdrag innebär att man bygger moderna system för att skapa lösningar som är innovativa och framtidssäkra för våra uppdragsgivare. Vi jobbar både med infrastruktur och applikationsutveckling vilket gör att våra medarbetare får både en bredd och djup inom olika relevanta mjukvaruteknologier. Exempel på ramverk, verktyg och tekniker som används är Docker, Kubernetes och Helm som grund vilka kompletteras med t.ex. Kafka, Quarkus med NodeJS och React. Programmeringsspråk som oftast används är TypeScript, Python, Java och Go. \n\n \n\n \n\nVem är du?\n\nVi söker dig som är kreativ och drivs av att ligga i teknikens framkant vad gäller verktyg och koncept. Du har ett stort intresse for FOSS (t.ex. CNCF, LF) och följer med i dess nyheter och diskussioner. Vi ser gärna att du är en daglig användare av Linux sedan något år tillbaka (antingen från skolan, tidigare tjänst eller fritiden). Som person trivs du med att vara en lagspelare i ett effektivt team som hjälper kunderna att skapa nya möjligheter. \n\nLämplig utbildningsprofil är Civilingenjör eller Högskoleingenjör med inriktning i Datateknik eller Informationsteknik eller annan Civilingenjör/Universitetsutbildning med inriktning inom programvaruutveckling och IT infrastruktur. \n\nVi välkomnar både erfarna ingenjörer och ingenjörer som är i början av sin karriär. \n\nUrval sker löpande. Vi ser fram emot din ansökan! \n\n \n\n \n\nKom och gör skillnad\n\nVi tror att man gör ett bättre jobb om man kan fokusera på rätt saker, därför gör vi det lätt att kombinera jobbet med vardagen. Vi satsar på våra medarbetare, de utgör kärnan, hjärnan och hjärtat i vår verksamhet. Dessutom står vi på en stadig grund av högteknologi, forskning och anställningstrygghet med försvars- och säkerhetskoncernen Saab som ägare.\n\n \n\nFör oss handlar det om hållbarhet - vi vill bli branschens mest hållbara företag; och för att vara ett hållbart företag i en hållbar framtid behöver vi investera i våra medarbetare. För oss är din återhämtning, dina utvecklingsmöjligheter och din trygghet lika viktigt som företagets framgång - utan våra medarbetare står vi stilla.\n\n \n\nVill du veta mer om hur det är att arbeta hos oss? Kolla in våra karriärsidor!\n\n \n\nKontaktperson/ Rekryterande chef: Ingvar Andersson ingvar.andersson (@) combitech.com",
        "url": "https://www.aplitrak.com/?adid=am9sc3Nvbi4xMjE0Ny4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-09-03T14:09:45",
        "deadline": "2025-10-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 99
    },
    {
        "id": "29983430",
        "title": "Senior DevOps Engineer",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "About this role \nWe are now looking for a Senior DevOps Engineer for our organization, someone with a deep interest in infrastructure and enabling fast feedback loops for developers by developing continuous integration capabilities. You will belong to a small and passionate team responsible for developing our infrastructure and related technology stack for on premise and cloud deployments; the foundation for our video analytics platform that thousands of cameras across the world are connected to. \nSome of the technologies we use: \n Go and C++ \n  Kubernetes, OpenShift and Docker \n  Kafka, Redis, MongoDB and Postgres \n  Elastic and Grafana \n  Git, CircleCI and ArgoCD \n \nOur company culture is based on freedom and responsibility. For us that means you will be given extensive freedom to make strategic technical decisions while meeting our ambitious standards and making decisions in a responsible way. You will be located at our headquarters in Gothenburg where we are a team with a lot of positive energy and a strong sense of community. \nWho we think you are \nTo be successful in this role, we expect you will bring experience of working with product development and/or solutions that leverage physical or cloud infrastructure. Experience with on premise deployments is a plus. You also need a good understanding of organizational aspects of software development and of how to collaborate efficiently with others. \nRequirements \n At least 4 years of experience working with infrastructure and tooling for applications with high performance requirements. \n  Strong knowledge of multiple of the technologies we use, e.g., OpenShift, Kubernetes, databases and messaging systems. Kubernetes administrator certificate is a plus. \n  Linux administrator knowledge, e.g., knowledge in kernels, different distributions etc. \n  General interest and knowledge in security. \n  A strong desire to collaborate with others and to contribute to team success. \n  Great understanding of both Windows and Linux build environments and toolchains. \n  Excellent communication and organization skills and great personal initiative and drive, with an ability to understand the requirements of different stakeholders, keeping things organized, and making things happen. \n  Proficiency in English. Swedish is a plus but not a requirement. \n  A degree in computer science or software engineering. Alternatively, a combination of other relevant education (formal or self-taught) and experience. \n \n\nAbout Irisity \nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alert, leading to reduced crime rates and increased safety without any negative effects on personal privacy. \nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 90+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. \nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history. \nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds. \nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. Read more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6394507-senior-devops-engineer?promotion=1612570-arbetsformedlingen",
        "published": "2025-09-03T13:10:25",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29954426",
        "title": "Erfaren systemutvecklare inom mjukvaruutveckling",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Syntronic är en ledande design- och utvecklingspartner inom avancerade tekniklösningar. \nVi är stolta över att vara i framkant av teknologisk innovation och söker nu en erfaren systemutvecklare inom mjukvaruutveckling till vårt team i Göteborg.\nSom systemutvecklare hos oss:\nKommer du att vara involverad i allt från design, programmering, testning och implementation av mjukvarulösningar. Du får möjlighet att arbeta med varierande uppdrag hos olika kunder. \nVi använder moderna programmeringsspråk och ramverk såsom C#, Java, Python, .NET, och vi värdesätter erfarenhet av både SQL-databaser. \n Vad vi söker hos dig som systemutvecklare:\n Högskole- eller civilingenjörsutbildning inom mjukvaruutveckling, systemutveckling, IT eller liknande\n Minst 5 års erfarenhet av systemutveckling och mjukvaruutveckling, med djup kunskap inom något eller flera programmeringsspråk (t.ex. C#, Java, Python, .NET)\n Erfarenhet av agil utveckling, Scrum, eller liknande metoder\n Erfarenhet av molntjänster som AWS, Azure, eller Google Cloud är ett stort plus\n Kommunicerar flytande på svenska och engelska, i tal och skrift.\n \nVi letar inte efter en perfekt lista av kvalifikationer, utan efter rätt person som vill utvecklas tillsammans med oss och våra kunder. \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 25 september. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354308-erfaren-systemutvecklare-inom-mjukvaruutveckling?promotion=1602557-arbetsformedlingen",
        "published": "2025-08-27T10:01:55",
        "deadline": "2025-09-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29806984",
        "title": "DevOps Engineer",
        "employer": "Opera Sweden AB",
        "location": "Göteborg",
        "description": "Opera Sweden is looking for a DevOps Engineer with a passion for learning and technology to join our team in Gothenburg where you get to build great products together with our best engineers. Experimenting with new technology is in our DNA and our collaborative team is constantly trying to find better ways to build quality products. In the current project we have chosen to go with AWS and invested a lot in SaaS and CI/CD. You will be working in a supportive team with an agile workflow. Together with the rest of the engineering team you will be part of design reviews, sprint planning, weekly sprints and delivery. The team is currently located in Gothenburg in a cozy office in the city center.\nRole & Responsibilities:\nSupport the engineering team when it comes to tools, CI and CD\nBuild monitoring and reporting for the project\nSet up the framework for incident management and recovery\nCooperate with the development team to build the SDLC framework for the project\nCreate a release plan with the management team and developers\nMaintain existing infrastructure and create new solutions\nAdvocate DevOps best practices in the organization\n\nJob Requirements:\nBS or MS in Computer Science or equivalent degree\nAt least 2 years of recent employment in a DevOps role in the enterprise environment\nSolid knowledge of AWS is a must\nExperience with deployment and delivery of web and generic server applications\nAbility to build the infrastructure from scratch\nFamiliarity with mainstream CI/CD and SaaS: Docker, Jenkins, Kubernetes, Terraform\nExperience with load balancing and CDN, administration of Linux systems\nFluent in English\n\nAn Ideal Candidate’s Profile:\nFamiliar with monitoring tools such as Grafana, Loki, Prometheus\nClose-to-expert knowledge of git, experience with python, shell scripting and high availability systems\nCurrently living in Gothenburg or willing to relocate\n\nWhat’s on Offer:\nFlat organizational structure with short decision-making processes that boost your creativity and drive\nA team of experienced and supportive individuals that fosters a friendly work atmosphere\nProfessional skill development\nA diverse and inclusive workplace\nSmart working technology",
        "url": "https://jobs.opera.com/jobs/6060392-devops-engineer",
        "published": "2025-07-02T12:29:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787419",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-06-24T07:59:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784165",
        "title": "Java-utvecklare till innovativt företag",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Bli en del av Yoin Technologies, ett ungt och snabbväxande techbolag som erbjuder IT-tjänster. Vi söker en engagerad systemutvecklare med kunskaper inom Java. Kom och bli en del av vårt team.\n\nDitt jobb på Yoin Technologies\n\nDitt främsta uppdrag blir att assistera kunder och ta deras tekniska miljöer till nästa nivå. Beroende på din erfarenhetsnivå kommer du antingen hantera uppdateringar och vidareutveckling av kunders miljöer eller få ett större ansvar och sköta processen när kunden byter från en klassisk driftsmiljö till en modernare cloud/azure-miljö. Oavsett vilken del av processen du tar dig an kommer du att stötta kundens utvecklingsteam med best practices för deployment, migrering av applikationer och tjänster samt miljöuppsättning.\n\nDå Yoin Technologies bedriver inkubatorverksamhet kan du se fram emot en hel del spännande projekt. Genom sina breda kunskaper och sitt stora nätverk gör man det möjligt för drivna entreprenörer att förverkliga sina idéer. Här blir du en viktig pusselbit i arbetet med att testa gångbarheten och ta fram prototyper för att se om idén har bärkraft. \n\nI dagsläget består Yoin Technologies av 20 stycken erfarna utvecklare och du kommer jobba tätt ihop med alla. Vilket team du jobbar i beror på projektet, men målet är att alltid arbeta i ett team om minst 3-4 personer som tillsammans jobbar mot samma projekt och kund. \nFrån start kommer några av dina närmsta kollegor bli Marcus, Peter och Fredrik.\n\nÄr det här du?\n\nFör att lyckas i den här rollen har du minst en 3-årig akademisk utbildning och 5 års erfarenhet inom utveckling i Java efter examen. Du behöver också behärska svenska flytande i tal och skrift.\n\nPå Yoin Technologies är vi övertygade om att en stark laganda och samarbete är nyckeln till framgång. Som systemutvecklare hos oss kommer du att vara en del av en engagerad och hjälpsam grupp som stöttar varandra. Vi tror på din förmåga att vara självgående och ta egna initiativ. Här får du inte bara möjlighet att utveckla dina tekniska färdigheter, utan också vara en del av en trivsam arbetsmiljö där vi värdesätter arbetsglädje och social sammanhållning.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Yoin Technologies. Det är viktigt att klargöra att rollen är för Yoin Technologies och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:33",
        "deadline": "2025-09-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784180",
        "title": "Erfaren systemutvecklare inom IT och industri",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa effektiva stöd för industriella processer. Här tar du hjälp av dina kunskaper i .NET och din förståelse för systemintegration för att identifiera behov och fastställa kravspecifikationer. Du deltar i allt ifrån tekniska förstudier, design, utveckling och installation till support, underhåll och vidareutveckling samt förvaltning av mjukvara för effektiv produktion. I stora drag kan man säga att du kommer jobba med både systemering och programmering.\n\nI ditt arbete får du uppbackning av kollegor som Olle, Björn, Martin, Robert, Elisabeth och Helena.\n\nÄr det här du?\n\nFör att passa i rollen behöver du ha en civilingenjör/högskoleingenjörsexamen och minst fem års erfarenhet av utveckling och leverans av IT-lösningar inom kritisk drift. Du får gärna ha känsla för både .NET, SQL Server och Oracle Server. Om du dessutom förstår det här med systemintegration och kan tillämpa olika datautbytesmetoder är det ett stort plus.\n\nDitt engagemang och stora intresse för teknik är vad som sporrar dig att hitta nya lösningar och effektiva stöd. Det är bra om du har lätt för att kommunicera, interagera med andra och känner igen dig i egenskaper som kundorienterad och lösningsorienterad Känner du dig dessutom som en kreativ person med förmågan att vara analytisk och ha ett öga för detaljer så har du hamnat rätt.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Prevas. Det är viktigt att klargöra att rollen är för Prevas och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:31",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661571",
        "title": "Verification Engineer HIL - Göteborg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Är du en metodisk och nyfiken ingenjör med passion för problemlösning och HIL-verifiering? Nu har du chansen att bli en del av ett högteknologiskt team hos vår kund inom fordonsindustrin, där du får arbeta i framkant med framtidens styrsystem och testmiljöer.\nOm uppdraget: I rollen som Verification Engineer HIL kommer du att arbeta med utveckling och underhåll av HIL-simuleringsmiljöer, skriva testspecifikationer, skapa testfall samt genomföra och analysera tester. Du kommer att samarbeta tätt med funktionsutvecklare och bli en nyckelperson i att säkerställa kvaliteten i fordonets dynamiksystem.\nKravprofil:\n- Civilingenjörsexamen inom elektronik, mekatronik, mekanik eller fysik - Erfarenhet av modellbaserad utveckling och verifiering - Grundläggande kunskap om HIL-hårdvara - God kännedom om dSPACE-verktyg: ControlDesk, AutomationDesk, MotionDesk/Aurelion och ASM - Erfarenhet av CI/CD-processer, gärna med Jenkins - Kunskaper i Python och Matlab/Simulink \nMeriterande:\n- Erfarenhet av att sätta upp CI/CD-flöden i Jenkins - Fordonsdynamikkompetens - Erfarenhet av simulering av mekatroniska/pneumatiska system",
        "url": "https://careers.progalaxy.se/jobs/5858126-verification-engineer-hil-goteborg?promotion=1447500-arbetsformedlingen",
        "published": "2025-04-28T13:20:15",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29701269",
        "title": "Lead Developer Dynamics 365 Customer Engagement",
        "employer": "Fellowmind Sweden AB",
        "location": "Malmö",
        "description": "Forma framtidens kundupplevelser tillsammans med oss på Fellowmind \nHär är chansen för dig som är redo att ta nästa kliv i din karriär som utvecklare – och samtidigt vara med och sätta din prägel på den tekniska standarden för hur framtidens digitala kundlösningar ser ut! Hos oss på Fellowmind får du en ledande roll i ett sammanhang där teknik och mänsklighet går hand i hand. Vi söker nu en Lead Developer inom Dynamics 365 CE som brinner för kvalitet, innovation och att inspirera andra! \nDin roll hos oss \nSom Lead Developer är du mer än en teknisk specialist – du är en vägvisare! Du är med och formar riktningen för hur vi bygger, utvecklar och levererar våra lösningar inom Dynamics 365 CE. En del av ditt uppdrag blir att säkerställa vår tekniska kompetens och var ett nav för kunskapsdelning, kvalitetssäkring och inspiration för våra utvecklare. \nDu kommer bland annat att: \n Jobba i teknikens framkant – särskilt inom Power Platform och Dynamics 365 CE. \n  Leda interna utvecklarforum – en kreativ samlingsplats för inspiration, idéutbyte och kompetenshöjning. \n  Granska kodbaser och leveranser för att säkra kvalitet, hållbarhet och skalbarhet. \n  Coacha kollegor genom code reviews, teknisk vägledning och mentorskap. \n  Samverka med arkitekter och andra experter i tvärfunktionella projekt – ibland leder du själv, ibland bidrar du i teamet.\n \nTekniken vi älskar att jobba med \nHos oss är tekniken ett medel för att skapa verkligt värde. Vi jobbar bland annat med: \n Power Platform (Power Automate, Power Apps) \n  JavaScript/TypeScript \n  C#.NET (t.ex. plugins, Custom APIs) \n  Power Apps Component Framework \n  React \n  Azure DevOps och CI/CD-pipelines\n Vi tror att du  Har gedigen erfarenhet av utveckling inom Dynamics 365 CE och Microsofts molnbaserade ekosystem - troligen 5 år eller mer. \n  Brinner för struktur, arkitektur och kod av hög kvalitet. \n  Är nyfiken och pedagogisk – du trivs med att både lära och lära ut. \n  Vill kombinera teknik med ansvar och samarbete – du gillar att se helheten.\n Vad vi erbjuder \nSom en ledande europeisk Microsoftpartner är Fellowmind en arbetsplats där tekniken får ett mänskligt ansikte. Vi tror på att digital transformation börjar med relationer – och att de bästa lösningarna föds i samarbetet mellan människor. Här får du en roll med verklig påverkan, i en kultur som präglas av: \n Always personal – Vi bygger relationer på äkta engagemang. \n  Better together – Vi tror på kraften i samarbete. \n  Act with courage – Vi vågar tänka nytt och utmana gamla sanningar. \n  Serious about fun – Vi kombinerar hög leveranskvalitet med en arbetsmiljö där du trivs, växer och skrattar.\n \nLägg därtill att vi i höstas blev utsedda till Sveriges Bästa Arbetsgivare vilket vi ser som ett kvitto på att vi gör mycket rätt – och vi kommer alltid att fortsätta arbeta för att vara en plats där alla ska må bra och känna sig hemma. \nDet praktiska  Omfattning: Heltid \n  Placering: Något av våra centrala kontor i Malmö, Göteborg, Stockholm, Jönköping eller Halmstad \n  Start: Snarast – men vi anpassar oss efter din kalender\n \nRedo att leda vägen för tekniken – och samtidigt göra skillnad för både kunder och kollegor? -Sök redan idag!",
        "url": "https://career.fellowmind.se/jobs/5927477-lead-developer-dynamics-365-customer-engagement?promotion=1468872-arbetsformedlingen",
        "published": "2025-05-14T09:30:15",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30047682",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAt AFRY, we develop and deliver cutting-edge solutions for vehicles, systems, functions, and attributes to clients in the automotive industry. Our customers include both established OEMs, innovative startups, and Tier 1 system suppliers.\nWe are currently seeking experienced software developers who are passionate about shaping the next generation of infotainment systems based on Google’s Android Automotive OS.\nAs an Android Automotive Software Developer, you will work on software development across both application and native layers of the Android stack for infotainment systems. You will collaborate closely with UX designers and other stakeholders to define a seamless, end-to-end user experience. You’ll be part of a team with full responsibility—from design and architecture to documentation, development, verification, and validation. At AFRY, you’ll also have the opportunity to contribute actively to innovation by generating new ideas and solutions.\n\n\nQualifications\n\nWe are looking for candidates with the following background and skills:\n\nM.Sc. in Software Engineering or equivalent experience gained through years of professional practice\nSolid experience in Android application and platform development, including work with AOSP and the AOSP build system\nFamiliarity with modern app architectural patterns such as MVP, MVVM, and layered architecture\nExperience working with automotive communication buses\nStrong programming skills in Android Java, C++, and Python\nGood knowledge of Android testing frameworks such as JUnit, Espresso, and Mockito\nExcellent command of English, both written and spoken\nMandatory qualifications:\nProven experience working with a Swedish OEM within the automotive industry\nCurrently residing in Sweden today\n\nMeritorious qualifications:\n\nExperience in Embedded Linux development\nFamiliarity with Continuous Integration (CI) tools and workflows\nDevOps\nPossession of a Swedish B-class driving license\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: October 2025\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000082865365-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-09-19T10:29:11",
        "deadline": "2025-10-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30030358",
        "title": "Software Developer to Saab Air Traffic Management",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Saab is a place where teamwork makes things fly. Literally. Join us and experience our supportive and friendly workplace. \n\nYour role\n\nAs part of the development team, you will collaborate closely with other developers and systems engineers in the design and development of Air Traffic Management systems. You will design, implement, test and document software that will be used in our integrated ATC suite (I-ATS). \n\nThe main tasks are:\n\n * \n\nProposing and implementing software architecture and designs based on requirements and/or customer needs as part of a product development team\n * \n\nSupporting test engineers with software development of test automation frameworks\n * \n\nWriting well-structured, testable, efficient, and maintainable full-stack code\n * \n\nCollaborating and adding value through participation in peer code reviews, providing comments and suggestions\n * \n\nTailoring and deploying software tools, processes and metrics\n * \n\nParticipate in project work with colleagues in different parts of the world \n\nYour profile \n\nRequired skills:\n\n * \n\nMinimum Bachelor's degree in software engineering, mathematical or science-based subject or equivalent working experience\n * \n\n5-7 years' work experience as a developer\n * \n\nExcellent communication skills in English, verbal and written\n * \n\nGreat collaboration skills\n * \n\nProficient in C++ \n\nDesired skills:\n\n * \n\nExperience in complex software systems with agile development methodologies\n * \n\nAviation interest\n * \n\nQt experience \n\nWelcome to a workplace with inspiring challenges where the meeting between competence and personality builds the foundation for our success. We look forward to receive your application as soon as possible.\n\n This position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply. \n\nWhat you will be a part of\n\nExplore a wealth of possibilities. Take on challenges, create smart inventions, and grow beyond. This is a place for curious minds, brave pioneers, and everyone in between. Together, we achieve the extraordinary, each bringing our unique perspectives. Your part matters. \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,100 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n Saab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here. \n\nIf you are interested in what benefits you can take part of as an employee at Saab in Sweden, you can read more about them here. \n\nKindly observe that this is an ongoing recruitment process and that the position might be filled before the closing date of the advertisement.",
        "url": "https://www.aplitrak.com/?adid=YS5vc3RlcmJlcmcuNjAyMjUuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-09-15T16:39:11",
        "deadline": "2025-09-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30019231",
        "title": "Technical Training Developer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": ".\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n Is your passion making people understand how our trucks work? Do you want to develop our dealer network? Then you can be the one we are looking for!\nWhat do we do?\nTechnical Training contribute to the work with developing and supporting the Service Market and Retail business at Volvo Trucks. At Volvo Trucks Technical Training we develop and deliver training solutions for our dealer network, having the workshop technicians as our main target group. Our technical training offer includes both face-to-face training courses as well as online learning solutions.\n We cooperate with a global network of technical trainers to reach the technicians in a classroom environment, through the train-the-trainer concept. The global trainer network is also involved in our training development projects. Together we all get an opportunity to work with the very latest technology and products within the truck industry.\n Many technicians in the dealer network work with both Volvo Trucks and Renault Trucks. Therefore, we cooperate closely with the Technical Training team at Renault Trucks in Lyon. \nOther partners are:\n  *  Sales Areas and Market Companies\n  *  The Volvo Trucks Product Management and other head office functions\n  *  Group Trucks Technology\n\n We are now looking for a Technical Training Developer to extend the Technical Training team.\nWhat will you do?\nAs a Technical Training Developer you will develop instructor led training courses as well as online training solutions. Both established and new methods and tools will be used. \n You will act as a trainer when handing over the training solutions to our market companies. This mainly takes place in the Training Centre in Gothenburg but you may also deliver training in other Volvo locations around the world.\n All your work will be done in close cooperation with your colleagues at Technical Training, with other  technical experts within the company and with our global trainer network.\n Together with the rest of the team you will be a key player when continuously improving our way of working with technical training. \n\nQualifications\n  *  University degree in relevant field, or equivalent experience\n  *  Genuine interest in and a good understanding of trucks, truck systems and components.\n  *  Experience from and interest in communication and knowledge transfer.\n  *  Experience from structuring and simplifying technical information from various sources.\n  *  Excellent presentation skills in English\n  *  Excellent technical writing skills in English\n  *  Skilled in using Office 365 applications\n  *  Team player with a positive and solution-oriented attitude\n\n It’s a plus if you have:\n  *  Workshop experience\n  *  Truck driver license\n\n The position is based in Gothenburg. Occasional travelling will be required.\n At Volvo Trucks we are actively working to establish groupings that will take maximum advantage of the strength inherent in differences in knowledge, experience, age, gender and nationality, etc. We find that well balanced working teams increases group dynamics, creativity and new approaches to solutions.\nFor further information, please contact:\nMarcus Olsson, Director Technical Training\nMarcus.p.olsson@volvo.com\n\n\nWe value your data privacy and therefore do not accept applications via mail. \nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n At Volvo Trucks you will be part of leading the way towards a sustainable transport industry. For nearly a century we have been innovating for people – to make life easier, better and safer. Driving progress is our promise to customers, to the industry and to society. At Volvo Trucks we share a curiosity to learn, we work with passion and we embrace change to stay ahead. Join us, together we move the world we want to live in.\r\n\r\n.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43647064",
        "published": "2025-09-11T19:25:15",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29954294",
        "title": "Software Developer / Mjukvaruutvecklare C++",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "På Syntronic i Göteborg vill vi stärka våra positioner inom elektronik, radiokonstruktion och inbyggda system. På Syntronic utmanar vi alltid gränserna för vad som är tekniskt möjligt. \nSom mjukvaruutvecklare hos oss får du möjlighet att utvecklas i en internationell miljö tillsammans med kompetenta kollegor som alla brinner för att finna nya tekniska lösningar!\nArbetsuppgifter som mjukvaruutvecklare:\nSom mjukvaruutvecklare hos oss kommer du att få arbeta med utmanande projekt åt världsledande företag och vi efterfrågar mjukvaruingenjörer med trygghet i C++ och intresse för större komplexa system/applikationer.\nDina arbetsuppgifter som mjukvaruutvecklare innehåller alla steg inom SW Design och problemlösning, i kanske för dig nya tekniska tillämpningar, och där du använder den erfarenhet du har i att metodiskt utveckla mjukvaruarkitektur och robusta applikationer/plattformar med tillhörande testramverk. \nDu har med din erfarenhet möjlighet att forma din roll och utveckla dig tillsammans med dina kollegor såväl lokalt som globalt. Hos oss är alla viktiga och nycklar för att bidra till att driva projekten framåt och att vi gör kunden nöjd! \nVi söker mjukvaruutvecklare som:\n Har en civilingenjörsutbildning inom Elektro, Data, IT, Teknisk fysik eller motsvarande\n Har genomfört kommersiella kundprojekt inom inbyggda system som mjukvarukonstruktör\n Har gedigen erfarenhet i C++\n Har erfarenhet av agila utvecklingsmetoder och continuous integration\n Har minst 5 års erfarenhet inom mjukvaruutveckling\n Behärskar svenska och engelska flytande i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nPersonliga egenskaper\nSom person värderar du struktur, planering samt ordning och reda utan att förlora din kreativa sida. Du är samarbetsvillig, social och kommunikativ då arbetet förutsätter mycket samarbete internt såväl med kunder.\nVidare är du en person som bidrar med energi och driv till arbetsplatsen där du ständigt arbetar för att utvecklas och komma framåt. Du har ett genuint teknikintresse och lockas av att arbeta för ett teknikintensivt bolag som hela tiden utvecklas.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 25 september. Vi arbetar med löpande urval. \nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/3755754-software-developer-mjukvaruutvecklare-c?promotion=1602477-arbetsformedlingen",
        "published": "2025-08-27T09:45:25",
        "deadline": "2025-09-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29943074",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-08-25T09:05:40",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29975201",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 25 september.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1609697-arbetsformedlingen",
        "published": "2025-09-02T07:47:16",
        "deadline": "2025-09-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29954309",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \n Vi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Minst 5 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\n Vi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt.  \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 25 september. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg?promotion=1602493-arbetsformedlingen",
        "published": "2025-08-27T09:50:15",
        "deadline": "2025-09-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30058018",
        "title": "Engineering Architect",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nThe Customer Function Owner will join our Connected Functions & System design group at Volvo Cars to passionately drive the development of the function scope which includes connected functions such as Road Sign Information and Connected Safety functions. The primary objective of the role is to be a leader developing the functions through setting the product development objective on a team level in line with our strategic roadmap, making sure that all stakeholders and dependencies are working towards the same goal. The team delivery should ensure fulfillment of legal requirements, rating activities and safety standards while ensuring customer satisfaction by using & analysing data.\n\nWhat you'll do\n\nBased on a delegated mandate, you will take responsibility for a Customer Function, cross organisations. You're part of all phases, from vision to end of service. All in accordance with PEF.\nYou ensure that each of the tasks below are performed, either by myself or with help from the organisation:\n\nShape the function experience\n  *  Design outstanding function experiences, balance and optimize for the overall business value\n\n\nGovern the Customer Function\n  *  Develop long term goals, strategies and function growth\n  *  Engage in performance, user satisfaction and quality\n  *  Ensure knowledge (of area, competitors, science, etc), pay attention to competence gaps\n\n\nDrive Customer Function definition and secure its realization\n  *  Drive that the Customer Function is defined and secure its realization end to end\n  *  Secure that system design and implementation deliver the decided user value, handle user value anomalies\n  *  Drive Customer Function verification and validation\n  *  Represent the Customer Function, align planning with contributors and stakeholders, report Customer Function status\n\n\nBalance and document the Customer Function\n  *  Balance the function experience towards e.g. legislations, attributes, system needs and capabilities\n  *  Document the Customer Function according to PEF, describe Customer Function changes\n\n\nWhat you'll bring\n\nYou would bring technical leadership and guidance in connectivity & cloud functions. You would also bring experience from working with functions such as Connected Safety, Map based functionalities and data based functionalities and drive the development from vision to validation of implemented features for production vehicles. You have knowledge in competitor offerings and be able to define the roadmap of feature growth as well as drive and guide the development throughout the complete development chain and ensure content realization in alignment with VPDS and vehicle introductions cross suppliers, stakeholders and vehicle platforms.\nYou would also carry a MSc education in Engineering (preferably software/electronics related education) as well as approximately 10 year of relevant working experience.\n\nHaving technical/operational knowledge of Requirement management, SystemWeaver and Programming skills: C/C++, Python",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43668565",
        "published": "2025-09-22T17:25:01",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30057598",
        "title": "Program Lead - Software Engineer",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nThe Volvo Cars mobile app revolutionized the industry and every day we make life less complicated for hundreds of thousands of people by giving them remote access to the car from the comfort of their couch. With the app you can for instance start, heat and prepare the car for your trip by sending your destination to the car, either from your phone, tablet or your watch.\n\nHere in Lindholmen, you will thrive as part of a cross functional agile team and develop a mobile app and supporting systems needed for the entire feature to work.\n\nSo, come join us in the forefront of technology and create the next thing that magazines and sites like Engadget and the Verge writes about.\n\nThe Volvo Cars mobile app has revolutionized the industry, making life less complicated for hundreds of thousands of people by providing remote access to their cars from the comfort of their homes. With the app, users can start, heat, and prepare their cars for trips by sending destinations from their phones, tablets, or watches.\n\nAt our Lindholmen location, you will thrive as part of a cross-functional agile team, developing the mobile app and the supporting systems needed for the entire feature to work. Join us at the forefront of technology and help create the next big thing that magazines and sites like Engadget and The Verge will rave about.\n\nWhat you'll do\n\nThe Program Lead is responsible for driving strategic initiatives across cross-functional teams, ensuring timely delivery, stakeholder alignment, and adherence to Volvo Cars’ engineering frameworks and compliance standards. This role bridges business objectives with operational execution, enabling flow, speed, and quality across the lifecycle of product and process development.\n\nKey Responsibilities:\n\nProgram Ownership & Execution\n  *  Lead end-to-end program planning, execution, and delivery across multiple teams and ARTs (Agile Release Trains)\n  *  Define scope, milestones, and deliverables in alignment with business goals and stakeholder expectations\n\nStakeholder Engagement\n  *  Establish and maintain formal networks across Units, Departments, and Operational Leads\n  *  Anchor improvements and decisions with relevant stakeholders and sponsors\n\nProcess & Compliance\n  *  Ensure adherence to Volvo’s Information Management Directive and PMTI (Process, Methods, Tools, and Information) standards\n  *  Align program processes with related methods to increase efficiency and compliance\n\nContinuous Improvement\n  *  Drive development of definitions for product deliverables and information model elements\n  *  Identify and implement improvements to enhance program performance and user experience\n\nTraining & Deployment Support\n  *  Support deployment activities and training initiatives across global sites\n  *  Ensure local contacts are appointed for cross-site coordination when needed\n\n\nWhat you'll bring\n\nYou would carry a Bachelor’s or Master’s degree in Engineering, Business, or a related field. You should bring a minimum 5–10 years of experience in software development, preferably in automotive or tech industries. You would have strong understanding of Agile methodologies, SAFe, and product lifecycle management as well as experience with tools like JIRA, Confluence, and Volvo’s internal systems (e.g., BMS, EF Master List).\n\nYou bring strategic thinking and problem-solving along with excellent communication and interpersonal skills and the ability to lead cross-functional teams and manage complex stakeholder landscapes. You will have familiarity with compliance frameworks and data governance.\n\nPerformance Indicators\n  *  Delivery against program milestones and KPIs\n  *  Stakeholder satisfaction and engagement\n  *  Compliance adherence and audit readiness\n  *  Efficiency improvements and innovation contributions",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43668444",
        "published": "2025-09-22T16:25:02",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30054977",
        "title": "Software Engineering Analyst",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nYou will be a member of a team that is responsible for base technologies related to diagnostics. Your main mission will be to perform analysis and verification in different environments. In addition, you will create reports, present conclusions and share recommendations based on verification outcomes. Continuous work with improving test coverage and finding new opportunities to automate testing.\n\nWhat you'll do\n\nYou will have the ability to try various test methods and as you develop in your role, you will have opportunities to work with system design. Some examples of what your tasks might include are fault tracing DTCs that are set wrongly and cause unnecessary repair spending. Help manufacturing engineering to establish procedures to trace problems in electrical connections.\n\nHere you will use your strong relationship building and communication skills to ensure effective communication with your teammates and across collaborating departments. As part of your daily work, you will work closely with Manufacturing Engineering, ECU development teams and other critical stakeholders. Through your curious yet structured approach in testing you will take part in small and larger challenges together working closely with your team members. We are a diverse team and mainly communicate in English and Swedish.\n\nWhat you'll bring\n\nWe believe you are curious, with high ambitions, and have a sense of ownership with dedication to quality. With your curios mind you will find solutions for complex problems. With analytical skills and a structured approach where you can take the lead for testing activities within the team. Most of all you enjoy problem-solving through testing, taking responsibility for your career and collaborating with your teammates.\n\nRequirements\n  *  Master or equivalent within Electrical, Electronics, Computers or similar areas of education\n  *  Experience of technologies and tools such as Signalyzer, CANape, Canoe, vTESTstudio, Matlab and Elektra\n  *  Experience working with diagnostics tools relevant to development, production and the aftermarket\n  *  Experience with UDS ISO standards\n  *  Familiarity with ISO-26262 functional safety standards\n  *  Experience in test automation\n  *  Driving license (B)\n  *  Fluent in the English language, spoken and written",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43667451",
        "published": "2025-09-22T11:25:02",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30040664",
        "title": "Software Engineer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Software Engineer to strengthen our team in Gothenburg.\nResponsibilities\nAs a software engineer within release team, you will be responsible for releasing software and promoting day-to-day deliveries upwards in the stream making sure our deliveries are quality assured, verified and documented. To manage this successfully you need to be working cross-functionally with your team-colleagues and other teams. \nWho are you?\nWe want to work with you who have a keen interest in modern computing technologies and want to work in an evolving industry. You like solving problems together with others. You are communicative, collaborative, and comfortable with working within a challenging environment. You enjoy being part of a team where you take own initiatives and take pride in your own and the team’s deliveries.\nRequirements \n• University degree\n• Fluent in spoken and written English\n• Proven ability in coordinating, release planning, collaborating on multiple streams of work and cross-team collaboration documenting & reviewing.\n• Experience working in CI&CD and with tool such as Gerrit, Jenkins to support build, integration, and deployment pipelines.\n• Knowledge of build systems such as Make, Bazel.\n• Meritorious: Knowledge of the BSW configuration (Autosar), Knowledge of Artifactory and Conan packaging.\n• Being a networker with great communication skills\n• You are result-oriented, with a high level of engagement and a strong enthusiasm\n• You have been working successfully in an agile or lean environment\n• Your “think-outside-of-the-box-attitude” is valued by your co-workers\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": "http://www.tatatechnologies.com",
        "published": "2025-09-17T15:23:10",
        "deadline": "2025-10-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30030255",
        "title": "Software Engineer - One Product CI",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\nShaping tomorrow's technology \n\nAt Vehicle Technology, we are passionate about shaping tomorrow’s technology to create excellent sustainable transport and infrastructure solutions to make the world a better place for future generations. We provide innovative, safe, and driver-friendly solutions, we develop top-quality services, and we make our customer operations more efficient by using excellent data insights. We support the Volvo Group engineering community with innovative tools and methods.\n\nAt Vehicle Software Factory, a part of Vehicle Technology, our mission is to provide the best development toolchain in the automotive business for our Software Developers in Volvo Group Trucks Technology. And in this way, we can bring new products to the market quicker than our competition. We believe that working with software is a creative process and it should be fast! The engineers should focus on the technical challenges of our products and not the shortcomings of our development tools or processes.\n\n\nWhat you will do\n\nWe are looking for a Software Engineer to join our quest for One Product CI. We are at the beginning of a journey, and you are welcome to join and influence the road we are paving.\n\nAs a Software Engineer in the Development Operations team, you will actively participate in enabling continuous integration on the product level, while a separate team is responsible for the infrastructure level. You will drive the development and optimization of tools that support state-of-the-art software delivery, ensuring it reaches all the way to the truck.\n\nYou will support and enhance the developer experience while also improving ease of use and reliability.\n\n\nWho are you?\n\nWe believe that you are an open-minded, proactive, and structured professional with a genuine passion for software development and product support tools. Comfortable working both independently and as a part of a team, you take initiatives and are contributing to cross-functional technical solutions. With a value-driven development approach, you prioritize effectively delivering both business goals and customer needs.\n\nYou are a true team player with strong interpersonal skills. Curious by nature, you explore new technologies, and share insights, engaging with stakeholders to drive product enablement with a solution-focused mindset.\n\nYou bring more than 5 years of experience in software development in the automotive industry and have solid knowledge in:\n  *  Modern cloud architecture\n  *  CI/CD and test automation\n  *  Python\n  *  C# \n\n\nIt is considered a plus if you are already familiar with SW Configurator, KOLA, and SEWS.\n\n\nWhat’s in it for you?\n\nWe offer you the opportunity to work alongside highly skilled colleagues in a global and dynamic environment. Here, you will be close to the product and play a role in shaping the future of sustainable transport, while developing both professionally and personally. We trust the individual, succeed as a team, and provide plenty of opportunities for continuous learning, growth, and career development.\n\n\n\nWe value your data privacy and therefore do not accept applications via mail. \n\nWho we are and what we believe in\nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment.\n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43653748",
        "published": "2025-09-15T16:25:11",
        "deadline": "2025-10-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30029152",
        "title": "Hårdvarunära Mjukvaruutvecklare sökes till Lafayette AB",
        "employer": "Lafayette AB",
        "location": "Göteborg",
        "description": "Bolaget grundades 1961 och var det svenska bolag som var först ut med privatradio. Lafayette har idag en framskjuten position inom tillverkning av utrustning som främst används av jägare eller naturälskande människor. \nTillsammans med våra dotterbolag VMAC AB samt Lafayette Oy utvecklar, tillverkar och säljer vi produkter såsom kommunikationsradio, spårningsutrustning som främst används för att spåra jakthundar eller boskap med en egenutvecklad mjukvaruplattform, samt att vi utvecklar och tillverkar ljuddämpare och pannlampor.\nVåra kunder befinner sig i nuläget främst i Norden men vi kommer i framtiden att etablera oss på nya marknader, först och främst inom EU.\nKoncernen har idag sitt huvudkontor i Göteborg samt ett finskt säljbolag som är beläget strax utanför Helsingfors. Tillverkning och utveckling sker även i orterna Vilhelmina och Shenzhen i Kina. Omsättning för bolagen är cirka 45 MSEK med ett 12 anställda.\nLafayette söker nu dig som vill bidra med din tekniska kompetens genom att arbeta med utveckling och underhåll av företagets GPS-produkter genom mjukvaruutveckling. Du kommer att programmera i C/C++ för att utveckla och underhålla mjukvara som integrerar med hårdvaran i våra produkter. Samtidigt kommer du att få engagera dig i projekt med förbättringsarbeten och det finns goda möjligheter att ta egna initiativ till utvecklingsprojekt för att förbättra produkternas funktioner.\nVi är ett växande företag med starkt fokus på kvalitet och innovation. Du kommer att ingå i ett team och bli en del av ett litet och familjärt företag med stora utvecklingsmöjligheter. Här får du goda förutsättningar att påverka vägen framåt för bolaget som är i tillväxtfas. Arbetet utförs på plats i Göteborg och är förlagt till kontorsarbetstider.\nArbetsuppgifterProgrammering i C/C++ för utveckling och underhåll av produkternas mjukvara\nDelta i samt driva egna förbättringsprojekt av GPS-produkterna\nFölja upp och kontrollera produkternas funktioner\nIngå i utvecklingsteamet och samarbeta kring produktutvecklingen\nKvalifikationerHar goda kunskaper och erfarenhet av kodning i C/C++\nKörkort\nRelevant utbildning\nMinst 3 års yrkeserfarenhet eller motsvarande\nHar kunskaper inom GPS, telekom eller radioteknik\nHar goda kunskaper i svenska och engelska både i tal och skrift då dessa språk används i det dagliga arbetet \n\n\n\nMeriterande om du har· Arbetslivserfarenhet av hårdvarunära utveckling inom GPS, telekom eller radioteknik\n· Har kunskaper om serverkommunikation\n· Har kunskaper om Arm - och Pic-processorer som används i produkterna \nPersonliga egenskaper· Kommunikativ\n· God samarbetsförmåga\n· Noggrann och strukturerad\n· Självständig och ansvarstagande\n· Problemlösande\nVi erbjuder· En dynamisk arbetsplats med engagerade kollegor\n· Möjlighet att påverka och utvecklas i rollen\n· Konkurrenskraftig lön och förmåner\n· Trevligt kontor och moderna lokaler\nSkicka din ansökan med CV och personligt brev till patrik@lafayette.se senast den 15 oktober 2025. Urval sker löpande och anställnings sker efter överenskommelse. Vid frågor kontakta Patrik Johansson, 0702269000",
        "url": null,
        "published": "2025-09-15T14:44:05",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30023522",
        "title": "Experienced Systems Engineer ",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Want to influence the bigger picture? At Saab, you can realise amazing innovations that keep people and societies safe. Together, we can truly make an impact - and your part matters.\n\n \n\nYour role\n\nAs a Systems Engineer in our team, you will -in this position- be working at the intersection of product leadership and system development, playing a key role in translating long-term product roadmaps into actionable technical work. This includes everything from early-stage pre-studies and research activities to shaping methodologies and system architectures that will define future capabilities.\n\n \n\nYou will be a crucial part of the Saab G1X System Engineering team, which is highly associated with a cross functional collaboration between customers, product managers, project managers, development and verification engineers.\n\n * Collaborating closely with product management (both capability and technical product leads)\n * Breaking down high-level roadmaps into structured work packages\n * Defining and driving pre-studies and technical investigations\n * Supporting and mentoring thesis students and early-stage initiatives\n * Building application understanding through data collection and environmental data gathering\n * Evaluating collected data to guide system-level decisions\n * Working with product and design standards to ensure compliance and structured development\n * Collaborating with specialty engineering teams across domains\n * Acting with buyer competence in cross-functional technical discussions\n * Contributing to methodology and process development for scalable and future-oriented system engineering\n * Playing a key role in shaping tomorrow's systems within our platform\n\n \n\nYour profile \n\nYou have an orientation toward the electronics, software, and power systems domain, and are comfortable working across these domains at a system level. While deep expertise in specific standards isn't required, it's important that you understand how product and design standards govern development - and that you're comfortable navigating within and around them as part of structured system work.\n\n \n\nYou approach problems from a systems engineering perspective, where structure, traceability, and cross-functional collaboration are key. You're comfortable working across disciplines and development phases - from early pre-studies and data collection to defining architectures and enabling implementation.\n\n \n\nExperience with the V-model or similar structured development frameworks is valuable, but more important is your ability to think holistically and connect technical, user, and business needs into a coherent system.\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply. The location of the role will be in Mölnlycke.\n\n \n\nWhat you will be part of\n\nExplore a wealth of possibilities. Take on challenges, create smart inventions, and grow beyond. This is a place for curious minds, brave pioneers, and everyone in between. Together, we achieve the extraordinary, each bringing our unique perspectives. Your part matters.\n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,000 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here",
        "url": "https://www.aplitrak.com/?adid=YS5vYmVyZy41NjA4Mi4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-09-12T15:30:41",
        "deadline": "2025-09-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30008479",
        "title": "Experienced Systems Engineer ",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Want to influence the bigger picture? At Saab, you can realise amazing innovations that keep people and societies safe. Together, we can truly make an impact - and your part matters.\n\n Your role\n\nYou will be a crucial part of the Saab G1X system engineering team which is highly associated with a cross functional collaboration between customers, product managers, project managers, development and verification engineers. In this role, Systems Engineering is the foundation of everything you do. You will take ownership of system-level work from requirements through to delivery - with a strong focus on interpreting customer needs, ensuring alignment with our base product, and coordinating across disciplines such as integration, structure, and architecture rather than detailed component design.\n\n \n\nA key part of the role is to break down and interpret customer project requirements and apply them to our existing technical base product. This means translating customer-specific needs into structured system requirements, ensuring they align with our platform architecture and technical capabilities - while maintaining traceability and supporting reuse across projects.\n\n \n\nYour profile\n\n * Solid experience in Systems Engineering, preferably using the V-model, and a strong educational background in engineering.\n * Broad system understanding - you think in terms of structure, interfaces, and complete solutions rather than subsystems or individual components.\n * Proven ability to work requirements-driven: trace, break down, author, and manage requirements - translating customer project needs into system-level requirements aligned with our platform and product standards.\n * Experience in process-oriented development and coordination of roles such as Integration and Verification lead and other sub system leads.\n * A holistic mindset, with the ability to balance customer, user, and environmental perspectives.\n * Excellent communication skills, including technical writing in both Swedish and English.\n * Comfort working in an international technical environment - you navigate cross-cultural collaboration with ease.\n * Strong business understanding and leadership skills - you take ownership, drive initiatives, and lead task forces when needed.\n * A genuine interest in learning new things - and sharing your knowledge to support others.\n * Willingness to travel when required.\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply. The role is based in Mölnlycke.\n \n\nWhat you will be part of\n\nExplore a wealth of possibilities. Take on challenges, create smart inventions, and grow beyond. This is a place for curious minds, brave pioneers, and everyone in between. Together, we achieve the extraordinary, each bringing our unique perspectives. Your part matters.\n \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,000 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here",
        "url": "https://www.aplitrak.com/?adid=YS5vYmVyZy45NDEwNS4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-09-09T15:57:35",
        "deadline": "2025-09-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29995984",
        "title": "PLC Engineer",
        "employer": "Sigma Embedded Engineering AB",
        "location": "Göteborg",
        "description": "Are you interested in sustainability? Do you want to be part of a talented team and work within Industry 4.0? We are now looking for a PLC Engineer for an exciting opportunity!\n\n\nIn the role you will be working with:\nDesign and manage SQL databases to support data-heavy recycling operations.\nDevelop and fine-tune Java-based applications to improve overall system efficiency and user experience.\nWork closely with automation engineers to program and debug PLC systems within recycling facilities.\nEnsure smooth communication and integration between software platforms and hardware.\nContinuously monitor, test, and enhance system stability and performance.\nWe are looking for you with the following skills:\nCapable of collaborating in team settings with clear and effective communication.\nUnderstanding of Industry 4.0 principles and modern technological solutions.\nSkilled in writing SQL queries and managing relational databases.\nAnalytical thinker with a keen eye for detail.\nProficient in Java development and building software applications.\nHands-on experience with PLC coding and knowledge of automated industrial systems.\nFor this role we are looking for a degree in Software Engineering och Computer Science with a few years of working experience.\nFluency in spoken and written Swedish is a requirement.",
        "url": "https://jobs.sigmaembeddedengineering.se/en/jobs/6374245-plc-engineer?utm_campaign=jobs-widget&utm_source=jobs.sigmaembeddedengineering.se&utm_content=jobs&utm_medium=web",
        "published": "2025-09-05T15:30:55",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29975252",
        "title": "Mjukvaruutvecklare – Utveckla framtidens avancerade system!",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Drömmer du om en karriär där du får arbeta med framtidens teknik och utmana din kompetens? Nu erbjuder vårt kontor i Göteborg en spännande möjlighet att bli en del av ett globalt företag med fokus på innovation och avancerade tekniska lösningar.\nVi söker nu efter en mjukvaruutvecklare till ett av våra projekt gentemot vår kund som arbetar med avancerade programvarusystem och simuleringar. Är du vår nästa stjärna?\nOm rollen\nSom mjukvaruutvecklare kommer du få arbeta i ett tvärfunktionellt utvecklingsteam med ansvar för både utveckling och underhåll av mjukvaruprodukter. Du kommer vara involverad i hela utvecklingskedjan – från kravhantering och design till implementering, testning och underhåll. Du kommer bland annat ansvara över följande:\n Utveckling och underhåll av programvara för avancerade system\n Design, implementation och testning av mjukvarulösningar\n Samarbete med andra team och avdelningar för att säkerställa hög kvalité\n Bidra till effektiva utvecklingsprocesser och kontinuerlig förbättring\n Arbeta med moderna utvecklingsmetoder och verktyg.\n \nVi söker en mjukvaruutvecklare som har:\n En högskole- eller civilingenjörsexamen inom data eller motsvarande\n Några års erfarenhet av mjukvaruutveckling och moderna utvecklingsverktyg\n Goda kunskaper inom Linux och versionshantering\n Erfarenhet utav CI/CD.\n \nUtöver detta så ser vi även det som positivt om du har erfarenhet av följande:\n C++\n Git\n Inbyggda system\n Simulering, signalbehandling samt radarstyrning.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande. \nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 30 september. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/5500131-mjukvaruutvecklare-utveckla-framtidens-avancerade-system?promotion=1609709-arbetsformedlingen",
        "published": "2025-09-02T07:53:57",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29973367",
        "title": "Technical Lead ",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Technical Lead - Steering to strengthen our team in Gothenburg.\nTHE ROLE\nResponsible for handling System Safety in steering systems, requirement engineering. Know how to work with architecture elements. Good know how of ISO 26262 for System safety.\nThis position would be working within Engineering Research and Development area of Tata Technologies and specifically on Vehicle Programs. The fast-paced development provides a challenging environment suited to an engineer who can quickly develop skills in new areas and liaise with and drive other engineers within a multidisciplinary/global team. Our customers expect high standards, and we require staff capable of meeting such demands.\nAREA OF RESPONSIBILITY\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.\nSupplier interaction for correct delivery of content.\nAlignments with testing team for verification of safety requirements.\nSystem Architect – Defining safety requirements/design at all CF/PF level.\nSupplier acquisition and ESOW support for system safety topics.\nValidate Safety Goals in vehicle fault injection testing.\nTest case reviews system safety requirements.\nBasic electronic design knowledge.\n\nEXPERIENCE / KNOWLEGDE\nBachelor’s degree in computer science/electrical/mechatronics Engineering.\nExtensive experience in automotive systems.\nExploratory requirement handling understanding.\nUnderstanding of ISO26262\nBasic knowhow of CAN/CANoe, CANalyzer and similar tools for the analysis and manipulation of CAN traffic\nAspice understanding.\nSystemite’s System Weaver – CarWeaver\nHave knowledge of TCe (Teamcenter).\nExperience working with CANoe , CANape , Simulink.\nExperience working with diagnostics and good knowledge of UDS.\nExperience in testing on test vehicles.\nGood understanding of system/software testing and methodologies.\nGood understanding of vehicle network communication technologies.\nGood English language skills.\nSwedish Drivers License (B).\nTrack license T1/T2 is advantage.\n\n\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you. \n Tata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-09-01T15:12:05",
        "deadline": "2025-10-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29973357",
        "title": "System Safety Engineer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a System Safety Engineer - Steering to strengthen our team in Gothenburg.\nTHE ROLE\nResponsible for handling System Safety in steering systems, requirement engineering. Know how to work with architecture elements. Good know how of ISO 26262 for System safety.\nThis position would be working within Engineering Research and Development area of Tata Technologies and specifically on Vehicle Programs. The fast-paced development provides a challenging environment suited to an engineer who can quickly develop skills in new areas and liaise with and drive other engineers within a multidisciplinary/global team. Our customers expect high standards, and we require staff capable of meeting such demands.\nAREA OF RESPONSIBILITY\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.\nSupplier interaction for correct delivery of content.\nAlignments with testing team for verification of safety requirements.\nSystem Architect – Defining safety requirements/design at all CF/PF level.\nSupplier acquisition and ESOW support for system safety topics.\nValidate Safety Goals in vehicle fault injection testing.\nTest case reviews system safety requirements.\nBasic electronic design knowledge.\n\nEXPERIENCE / KNOWLEGDE\nBachelor’s degree in computer science/electrical/mechatronics Engineering.\nExtensive experience in automotive systems.\nExploratory requirement handling understanding.\nUnderstanding of ISO26262\nBasic knowhow of CAN/CANoe, CANalyzer and similar tools for the analysis and manipulation of CAN traffic\nAspice understanding.\nSystemite’s System Weaver – CarWeaver\nHave knowledge of TCe (Teamcenter).\nExperience working with CANoe , CANape , Simulink.\nExperience working with diagnostics and good knowledge of UDS.\nExperience in testing on test vehicles.\nGood understanding of system/software testing and methodologies.\nGood understanding of vehicle network communication technologies.\nGood English language skills.\nSwedish Drivers License (B).\nTrack license T1/T2 is advantage.\n\n\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you. \n Tata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-09-01T15:09:50",
        "deadline": "2025-10-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29972377",
        "title": "Test Engineer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY erbjuder tjänster inom teknik, design, digitalisering och rådgivning. Vi är hängivna experter inom industri, energi- och infrastruktur, som skapar värde för kommande generationer. AFRY har en global räckvidd med djupa rötter i Norden. Tillsammans accelererar vi omställningen till ett mer hållbart samhälle.\n\n\nJob Description\nWe are currently looking for a driven and detail-oriented Test Engineer to support the development and validation of advanced steering systems. This role involves both HIL-based testing and in-car verification, ensuring robust functionality and safety of steering software and hardware components.\nYou will be responsible for planning, executing, and documenting test activities for steering systems in both simulated and real-world environments. The role requires close collaboration with software developers, system engineers, and suppliers to ensure compliance with functional and safety requirements.\nWhat you will do\nPlan and execute test cases on HIL rigs and in-vehicle environments.\nAnalyze and troubleshoot issues related to steering system behavior.\nValidate steering functions such as Haptic Warning, Active Return, Torque Overlay, and Safety Monitors.\nTest all supplier releases, including all services\nSupport fault injection and degradation testing for safety validation.\nCollaborate with cross-functional teams to align on test coverage and results.\nDocument test results and contribute to continuous improvement of test methods.\n\nYou can either be located at one of our offices in Gothenburg or in Trollhattan.\n\n\nQualifications\nAt least 5 years experience in steering system development and testing.\nHands-on experience with HIL systems (e.g., dSPACE, Vector).\nProficiency in tools such as CANoe, CANape, CAPL, and requirements tooling\nSolid understanding of vehicle dynamics, CAN communication, and UDS diagnostics.\nExperience with functional safety (ISO 26262) \nAbility to work independently and in a team-oriented environment.\n\nOther requirements\nMSc or BSc in Mechatronics, Electrical Engineering, or similar.\nFluent in English (spoken and written).\nValid driver’s license (B) and experience with test driving is required.\nTrack license T1/T2/T3 is advantage\n\n\n\nAdditional Information\nFor more information about the position please contact/\nGothenburg: Torgrim Brochmann, Section Manager  torgrim.brochmann@afry.com\nTrollhattan: Nicklas Karlsson, Section Manager nicklas.g.karlsson@afry.com\n \nDue to summer/vacation period the reply from us can take a little bit longer then usual, but we will reply/get back to you as soon as possible.\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000069607400-test-engineer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-09-01T13:41:56",
        "deadline": "2025-10-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29961119",
        "title": "Senior DevOps Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "We are looking for an experienced DevOps engineer who wants to enhance security and performance through reliable and scalable solutions.\nYou will work closely with architects and engineers to run applications and services on AWS, build and maintain integrations in our CI/CD ecosystem, and support product teams in effectively utilizing the platform. You will also identify bottlenecks, drive improvements, and shape how we deliver critical services at enterprise scale.\n\nAbout You\nYou are a customer-focused DevOps engineer with a strong background in AWS and modern CI/CD practices. You enjoy simplifying complex problems, thrive in collaborative environments, and take ownership of solutions from design to delivery.\n\nRequirements:\n- 7+ years of experience with AWS cloud architecture and operations\n- Solid background in CI/CD pipelines, automation, and monitoring\n- Hands-on experience with containerization and Kubernetes\n- Knowledge of Infrastructure as Code (Terraform, CloudFormation, CDK, or similar)\n- Good understanding of secure and reliable system design\n- Fluent English, spoken and written \n\nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
        "url": "https://career.explipro.com/jobs/6361033-senior-devops-engineer?promotion=1604837-arbetsformedlingen",
        "published": "2025-08-28T13:39:16",
        "deadline": "2025-09-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29958776",
        "title": "Machine Learning Engineer - Computer Vision",
        "employer": "Repli5 AB",
        "location": "Göteborg",
        "description": "The Role: We're looking for an experienced Machine Learning Engineer with a deep background in computer vision and generative AI. You’ll be part of a team developing systems that generate realistic, diverse, and highly controllable synthetic image data using state-of-the-art tools like Stable Diffusion, LoRA, and ControlNet. Your work will directly impact the performance and robustness of real-world AI systems—from self-driving cars to defense robotics.\nWhat You’ll Do\n Develop and fine-tune generative AI pipelines (e.g., Stable Diffusion, ControlNet, LoRA) for synthetic image generation.\n Design and implement machine learning workflows to generate structured, photorealistic datasets.\n Collaborate with 3D artists and simulation engineers to align ML models with physical environments and sensor setups.\n Work closely with customers in automotive, robotics, and aerospace to deliver tailored datasets.\n Optimize generation systems for scalability, quality, and speed using tools like ComfyUI or custom pipelines.\n \nYou Should Have\n MSc or PhD in Computer Vision, Machine Learning, or related field.\n 3+ years of hands-on experience with deep learning frameworks (e.g., PyTorch, TensorFlow).\n Experience working with generative AI models (especially diffusion-based models).\n Familiarity with tools like LoRA, ControlNet, ComfyUI, or custom workflows around Stable Diffusion.\n Strong understanding of synthetic data generation and its role in training perception systems.\n A track record of deploying ML systems in domains like automotive, robotics, defense, or manufacturing.\n \nNice to Have\n Experience working with 3D simulation pipelines or sensor modeling (e.g., depth, LiDAR, segmentation).\n Contributions to open-source ML/gen AI tools or custom diffusion model training.\n Enjoying reading research papers\n A problem solving intellect and a team player spirit\n Knowledge of synthetic-to-real domain adaptation techniques.\n Experience in startup environments or working directly with enterprise R&D teams.\n A positive can-do attitude",
        "url": "https://repli5.teamtailor.com/jobs/6037269-machine-learning-engineer-computer-vision?promotion=1527819-arbetsformedlingen",
        "published": "2025-08-28T08:34:46",
        "deadline": "2026-02-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29889595",
        "title": "Firmware Engineer",
        "employer": "Elektron Music Machines Mav AB",
        "location": "Göteborg",
        "description": "Elektron builds state-of-the-art electronic music instruments with deep functionality and exceptional sonic capabilities. With a track record of iconic products such as the Machinedrum, Octatrack and Digitakt, Elektron has become uniquely positioned in the artist and producer community.\nWe’re now expanding our team, to push the edge of music creation and meet customer demand!\nWith small teams, flat hierarchy, and high emphasis on creativity, Elektron gives room for every idea to be heard! Joining the Elektron team means being trusted in your abilities.\nDo you want to be a part of the team that creates the best electronic music instruments in the world?\nRole Description\nWe are currently looking for a full-time Firmware Engineer to expand the R&D team. As a firmware engineer at Elektron you will work with the complete software design chain; from product ideas, through prototype stages, to released firmwares and updates in future releases.\nThe embedded software team is responsible for all the programmable aspects of the instruments, ranging from digital logic to high level data management. We develop software for products to come, and we continue to improve the software long after they have been released.\nOur instruments have multi-threading real-time operating systems, and may be composed of multiple micro-controllers and digital signal processors. You will be working at the application level, but you are required to interface the operating system at a lower level.\nYou are passionate about writing code which is reliable as well as efficient. You are comfortable working with a large existing codebase. You are self-motivated and have strong problem solving capabilities.\nThis is an on-site position based in Gothenburg, Sweden.\nRequired skills & experience\nMaster of Science in Computer Science, Electrical Engineering, or similar experience.\nSeveral years of experience with C++.\nSome experience with Python.\nExtensive embedded systems design knowledge - choosing components, reading schematics, interacting with hardware.\nGood knowledge about Operating Systems and Real-time Systems.\nGreat problem-solving skills.\nLow-level knowledge: knows about caches, stack/heap, allocation schemes.\nExperience with software architecture and knows how to write maintainable systems.\nKnows Git inside-out and is well familiar with code review.\nGood knowledge of algorithms and data structures.\nA structured way of working, using version control, issue trackers and similar tools.\nSeveral years of working experience in a similar field.\nFluent spoken and written English\nInterest in music instruments (preferably making music)\n\nValued skills\nKnowledge in Rust, Digital Signal Processing, USB communication\nExperience with production testing and a drive for testability.\nExperience with major real-time operating systems such as FreeRTOS, Zephyr etc.\nLow level ARM A/M architecture and ISA knowledge.\n\nWhat we offer\nA dynamic and multicultural workplace where you have the opportunity to make a real impact and take ownership. At Elektron, you’ll experience great team spirit and a warm atmosphere, with music at the heart of everything we do. You’ll work closely with all departments and gain a broad understanding of the company, opening doors for professional development and long-term growth. Along the way, you’ll enjoy regular social events, fresh fruit, free parking, a wellness benefit, and more — all backed by the security of a collective agreement.\nStart: As soon as possible, by agreement\nScope: Full-time, permanent position\nLocation: Banehagsliden 5, Gothenburg\nApplication deadline: September 30, 2025",
        "url": "https://careers.elektron.se/jobs/6147177-firmware-engineer",
        "published": "2025-08-08T10:44:35",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29818976",
        "title": "Embedded Software Engineer within the Automotive Industry",
        "employer": "SiNIX Embedded AB",
        "location": "Göteborg",
        "description": "Are you an experienced embedded software developer looking to work with cutting-edge technology in the automotive domain?\nWe are looking for an experience Embedded Software Engineer to join our team!\nAs part of our embedded software team, you'll contribute to a variety of development projects—ranging from system architecture and software design to implementation, integration, and validation of embedded systems. The work is both technically challenging and rewarding, often involving modern platforms and real-world problem-solving in the fast-evolving automotive industry.\nWe offer a workplace where your voice is heard, your skills are developed, and where we have fun while solving challenging technical problems together.\nQualifications for this position\nSeveral years of experience in embedded software development\nM.Sc or B.Sc. in Computer Science Electronics, Mechatronics or related technical field\nProficiency C++ and embedded systems programming\nExperience with Linux, QNX and Yocto\nEnsure compliance with AUTOSAR, ISO 26262, and MISRA C++ guidelines\nFamilarity with tools such as GIT, JIRA, Vector tools (CANoe, CANalyzer)\nExperience working within the automotive industry\nIt’s a plus if you have experience working closely with suppliers and have been involved in cybersecurity-related aspects of embedded development\n\n\n\nAbout you\nWe believe that you are curious, driven and solution-oriented. You have a mindset of continuous learning and like to share knowledge with those around you. We value individuals who take ownership, enjoy working in teams, and actively contribute to a positive and open atmosphere.\nWho we are\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/jobs/6026679-embedded-software-engineer-within-the-automotive-industry",
        "published": "2025-07-08T10:28:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-10-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661465",
        "title": "Senior Python/Matlab Developer- Gothenberg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Professional Galaxy looking for an experienced Matlab and Python developer for one of our clients in Gothenburg. The role requires strong analytical skills, experience working in complex technical environments, and proven knowledge of microwave technology.\nYou will contribute to the creation and improvement of technical systems and analytical tools. Its beneficial if you have a great understanding of microwave technology, as well as the ability to manage technical documentation and databases.\nRequirements: - 3–5 years of experience in Matlab and Python development - Documented experience with microwave technology - Strong skills in handling technical documentation and databases - Excellent communication skills in English - Relevant educational background in engineering, electronics, computer science, or similar\nDuration: 2025-09-01 - 2025-02-28\nApplication deadline: 2025-04-30",
        "url": "https://careers.progalaxy.se/jobs/5857963-senior-python-matlab-developer-gothenberg?promotion=1447444-arbetsformedlingen",
        "published": "2025-04-28T12:59:35",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30058549",
        "title": "C++ Developer (Deep Learning)",
        "employer": "Academic Work Sweden AB",
        "location": "Göteborg",
        "description": "Join a forward-thinking team driving AI innovation. Our client develops advanced deep learning solutions in C++ for high-performance applications that transform industries—be part of groundbreaking projects.\n\nOM TJÄNSTEN \nAs a C++ Developer specializing in Deep Learning, you will be instrumental in building and optimizing the core AI infrastructure. This role involves working on high-performance computing solutions and collaborating closely with AI researchers. You will contribute to the development of cutting-edge deep learning applications, ensuring their efficiency and scalability.\n\nYou are offered a dynamic and international work environment. Here, you are welcomed into a setting where expertise and innovation converge to drive the development of cutting-edge technology. If you are passionate about contributing to the future of self-driving vehicles and thrive in an international context, we invite you to explore this exciting opportunity.\n\nARBETSUPPGIFTER \n\nWork tasks\n\n\n* Design and implement high-performance C++ code for deep learning models.  \n* Optimize existing deep learning algorithms for efficiency and scalability.  \n* Collaborate with research scientists to integrate new AI advancements.  \n* Develop and maintain robust software infrastructure for machine learning pipelines.  \n* Debug and troubleshoot complex systems.  \n* Participate in code reviews and contribute to architectural discussions.\n\n\nVI SÖKER DIG SOM \n- Advanced knowledge of C++ programming.\n- Good understanding of deep learning frameworks (e.g., TensorFlow, PyTorch).\n- Basic knowledge of machine learning concepts and algorithms.\n- Experience with performance optimization techniques.\n- Experience with version control systems (e.g., Git).\n\nIt is meritorious if you have\n- Good knowledge of CUDA or other GPU programming.\n- Experience with distributed systems.\n- Developed and deployed deep learning models in production.\n- Familiarity with Python for scripting and data analysis.\n\nTo succeed in the role, your personal skills are:\n- Cooperative\n- Innovative\n- Quality-oriented\n\nOur recruitment process\n\nThis recruitment process is handled by Academic Work and it is our client’s wish that all questions regarding the position is directed to Academic Work.\n\nOur selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the next phase. The process includes two tests: one personality test and one cognitive test. The tests are tools to find the right talent for the right position, to enable equality, diversity, and a fair process.\n\nINFORMATION OM FÖRETAGET \nN/A",
        "url": "http://www.academicwork.se/jobad/c-developer-deep-learning/15114692?apply=1",
        "published": "2025-09-23T00:01:52",
        "deadline": "2025-10-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30057451",
        "title": "AI & Data Center Of Excellence Lead",
        "employer": "Msx International Ltd. England, Filial",
        "location": "Göteborg",
        "description": "Are you ready to lead the AI revolution? Can you envision and build a future where AI and data drive business decisions? Are you passionate about ethical AI and robust data governance?\nWe are currently looking for a visionary and hands-on AI & Data CoE Lead to spearhead the implementation of AI technologies and advanced data management practices across the company. This role is pivotal in shaping our organization's future by ensuring AI and data initiatives deliver measurable business value aligned with our corporate strategy.\n \nYou will be responsible for the following:\n \nBuild and scale the Center of Excellence as a hub for driving the development of AI and data capabilities across the organization.\nDrive cultural transformation towards an AI-first, data-driven mindset.\nServe as the single point of contact for all AI and data-related matters across the organization.\nChampion AI initiatives, define architecture frameworks, optimize agentic AI systems and LLMs, and evaluate emerging AI tools (Generative AI, NLP, Computer Vision) for business scalability.\nEstablish ethical AI principles and governance frameworks.\nDefine and implement enterprise-level data management governance frameworks, policies and standards.\nCollaborate with the company’s CTO organization on infrastructure and architectural decisions.\nManage relationships with external AI and data management technology providers.\n\nQualifications\nYou will do best in this role, if you have:\n \nA Bachelor’s or Master’s degree in AI, Data Science, Computer Science, Engineering, or Business Administration.\n5+ years of leadership experience in technological transformation, especially in AI and data management.\nProven ability to lead cross-functional teams and drive organizational change.\nDeep understanding of AI/ML concepts and practical applications.\nStrong technical expertise in data architecture and cloud platforms (Azure preferred).\nExcellent communication and stakeholder engagement skills.\nFamiliarity with ethical AI and data compliance standards.\nExperience managing budgets and vendor relationships.\n\nAdditional Information\nWhat’s in it for you?\n \nBe at the forefront of AI innovation in a dynamic and forward-thinking organization.\nShape the future of data and AI strategy across all business units.\nMake a real impact through ethical, scalable, and transformative AI solutions.\n\nThe role is a full-time position located at the Nordic head office located in Gothenburg (Gamlestan). This is a role that requires extended international travel.\nAs an employee at MSX, you work in a dynamic environment with high growth and a hard-to-beat customer offer. For us, this is a key position where you will have an important role in an expansive company with great opportunities to develop and influence. We offer flexibility, home office a few days a week, collective agreement and additional benefits.\nWhen you join our team, you become part of the MSX International family. It’s more than a job – it’s the opportunity to build a career, make a difference, and be part of an exciting industry.",
        "url": "https://us.smrtr.io/4846p",
        "published": "2025-09-22T16:10:50",
        "deadline": "2025-10-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30055748",
        "title": "Machine Learning Engineer",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nStrategy & Program Management (S&PM) was established in 2022 as the cross functional hub for all product related matters with the purpose: To lead the creation of products that exceed our customers’ expectations every day, and in every way.\n\nWhat you'll do\n\nDesign machine learning systems to create artificial intelligence applications and products. Research and implement algorithms and tools, create machine learning models, train/retrain systems, conduct learning tests and experiments, and develop applications according to requirements. Extend existing machine learning libraries and frameworks.\n\nWhat you'll bring\n\nYou should have a proven track record of full value flow in machine learning systems, proven experience in building and scaling operational Machine Learning systems and  proven experience in machine learning methodology evaluation used in deployments. Understanding of current generational AI/ML/GenAI TechStack together with an interest in future trend is beneficial to keep up with fast paced development.\n\nSome skills you would bring is your experience with machine Learning Algorithms, Deep Learning, Feature Engineering, Neural Networks, Reinforcement Learning and Generative Pre-trained Transformers (GPT).\n\nProgramming languages: (Python), Pandas, Jupyter Notebooks, TensorFlow, Version Control (Git)\n\nYou would bring a minimum Bachelor’s degree in Mathematics, Computational biology/chemistry or Computer Science as well as 3-5 year of relevant working experience.",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43667853",
        "published": "2025-09-22T13:25:11",
        "deadline": "2025-10-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30033706",
        "title": "Data Privacy Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nAt the GTT Digital Operations Department, we are safeguarding quality, compliance, and enhancing data availability and ease of use. We leverage digital technologies to empower our organization with data-driven insights and strategies, ensuring data integrity, security and accessibility.\n\nIn the Data Governance and Data Compliance team, we are seeking a highly skilled and experienced Senior data privacy professional with engineering experience to join our dynamic team. The team works with different data regulations such as GDPR, EU Data Act and EU AI Act as well as various Data Governance topics. This role is critical in ensuring the organization’s adherence to data protection regulations. It also plays a key role in fostering a culture of privacy and accountability across all engineering and technology functions. We would be happy to see that you have a proven record of driving successful change initiatives and are skilled in stakeholder management across organizational levels.\n\nKey responsibilities\n  *  Drive investigations and initiatives as needed to facilitate, promote and protect Volvo Group data privacy and personal data sharing.\n  *  Monitor and evaluate compliance with applicable data protection laws and internal privacy policies, including but not limited to the General Data Protection Regulation (GDPR).\n  *  Collaborate with R&D to analyze and implement privacy by design guidelines and requirements for new engineering projects.\n  *  Evaluate existing privacy by design principles and requirements in engineering projects to improve or upgrade Volvo products.\n  *  Review and complete privacy by design risk assessments that are engineering projects requiring a privacy by design approval.\n  *  Further strengthen the data privacy framework and capability within GTT by driving activities in the GTT Data Privacy roadmap.\n  *  Stay informed of developments in global privacy legislation and regulatory expectations.\n\n\nQualifications\n  *  Bachelor’s degree in Engineering, Computer Science, Information management or a related field.\n  *  Minimum of 3–5 years of experience in privacy, privacy by design, data protection, or compliance roles.\n  *  Strong working knowledge of GDPR and other relevant privacy frameworks.\n  *  Excellent analytical, organizational, and communication skills.\n  *  Practical experience in Data Privacy tools is considered a merit.\n  *  Fluency in English is essential.\n\n\nWhy join us?\n  *  Work with a forward-thinking team committed to ethical data uses\n  *  Influence strategic decisions in data governance and compliance.\n  *  Opportunities for professional growth\n\n\nIf you want to make an impact and drive the area of data privacy, give me a call to talk more on +46-765-534110 or reach out via mail: sten.ludvigsson@volvo.com.\nThe interview and selection process will start directly after posting.\n\n\n\n\n\nWe value your data privacy and therefore do not accept applications via mail. \n\nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43655687",
        "published": "2025-09-16T12:25:12",
        "deadline": "2025-10-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30021273",
        "title": "AI Growth Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Ride the AI Wave: Become MindArk’s AI Growth Engineer!\nThe AI revolution isn’t waiting for your graduation. If you’ve completed two years of a technical degree (with top grades in math and physics) and find yourself questioning the value of a traditional diploma in a world about to be upended by AI, this is your moment. \nMindArk – the creative force behind Entropia Universe – is hiring an AI Growth Engineer in Gothenburg to help market our virtual universe using cutting-edge AI tools. We want brilliant minds like yours on board now to ride the wave of AI transformation with us.\nStep off the academic treadmill and into a real-world impact role. \nAs our AI Growth Engineer, you’ll apply your technical skills to engineer explosive growth for Entropia Universe. Forget the old marketing playbook – you’ll write new rules, using data, code, and creativity to turn bold ideas into global success stories.\nThis is your chance to work at the crossroads of advanced tech and creative marketing, where marketing is treated as an engineering challenge. You’ll run experiments powered by AI and turn them into real results, helping transform a pioneering virtual world into a global phenomenon.\nWhy Join MindArk?\n• Accelerated Learning: Work with state-of-the-art AI tools on live projects and level up faster than any classroom can offer.\n• Real Impact: See your ideas drive the growth of Entropia Universe in real time and shape a vibrant online community on a global stage.\n• Ahead of the Curve: Be at the forefront of AI-driven marketing in gaming, outpacing what’s taught in textbooks and setting trends instead of following them.\nWe’re looking for ambitious, creative problem-solvers who refuse to settle for “good enough.” If you thrive on innovation and want to be ahead of the curve, join us and make your mark now. Don’t watch the AI revolution from the sidelines – become the engineer driving it.\nReady to launch your career and make history? Apply today to join MindArk’s mission and help us engineer the future of digital marketing. Let’s ride this wave together.",
        "url": "https://career.mindark.com/jobs/6262447-ai-growth-engineer",
        "published": "2025-09-12T11:23:25",
        "deadline": "2025-09-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29996104",
        "title": "Communications specialist to Nord-Lock Group",
        "employer": "Nord-Lock International AB",
        "location": "Göteborg",
        "description": "Are you a skilled communications expert with a passion for storytelling and brand-building? We’re looking for a talented Group Communications Specialist to drive impactful content creation and digital engagement, with focus on copy writing, for Nord-Lock Group.\nThis position plays a vital role in shaping the digital presence by creating and communicating high-quality content for both internal and external audiences. You will also collaborate with teams to amplify Nord-lock Group and its brands, targeting the objectives of the strategic communication agenda. \nKey Responsibilities\nFor everything we do in marketing, we need compelling, well written and SEO adapted content. Written content is needed on all our platforms, web, social media, initiatives & campaigns, to drive customer engagement and brand awareness as well as internal communications. You will be the spearhead, delivering high quality assets, driving the Group content plans. \n Build the content plan, maintain and enhance the Group's presence across social media channels \n Contribute to internal communication projects by planning, creating, and executing exceptional content, eg create intranet content plan, production and publishing \n Content production on Group Initiatives & platforms eg, web, white papers, presentations, PR, ads, blogs etc\n Support and collaborate with brand-level communication and marketing teams to align content and strategic communication themes. Support on the production of assets (White papers, blog articles, sales material, web, social etc etc)\n Excel in SEO optimization of content\n Utilize analytics to continuously monitor, report, and optimize content performance and engagement\n Maintain consistency in tone, style, and branding across all published materials.\n \nWho you are\nThe ideal candidate for this role is a highly motivated and detail-oriented communications professional who thrives in a collaborative, fast-paced environment. You are a true storyteller and are highly passionate about creating strategic and brand-building content. The role collaborates closely with the Brand & Marketing manager, production team and regional marketing.\nCompetencies and Qualifications:\n Exceptional copywriting skills to craft compelling content for diverse audiences. Ability to present information that requires explanation in an appealing way. Experience in long- and short formats.\n Content strategy understanding. Good understanding of how content needs to adapt to personas, target audiences and customer journeys, as well as brand messaging \n Experience working in B2B, global or internal comms\n SEO skills: Understand keyword research and on-page SEO principles \n At least 3 years of experience in digital content production and channel management\n Good understanding and curiosity of major social media platforms, CMS, trends, and AI tools\n Good knowledge of production tools like Canva or similar (a plus for skills in Adobe Suite)\n Experience in analyzing and optimizing content performance using tools such as Google Analytics, SEMrush, Hotjar and social media insights\n Ability to follow brand guidelines, tonality etc\n While being a true team player, you are comfortable working independently on briefs, or project lead, and delivering polished content\n Fluency in English and Swedish on a professional level, both verbal and written \n \nWhy Join Us?\nThis is a chance to be part of a small, senior in-house team with a clear purpose: to elevate and support our brand and marketing efforts across the globe. You’ll work on a variety of projects, contribute to creative campaigns, and play a key role in shaping how our story is told.\nNord-Lock Group is on a growth journey. A profitable forward leaning company with a clear mission to increase our global footprint, an exciting time to join our Head Quarters. Being part of Investment AB Latour, situated in the “Latour building” in Högsbo, we also have close connections to other Latour owned companies such as Hultafors group, Swegon etc. \nAbout Nord-Lock Group\nNord-Lock Group is a global leader in bolting and engineering solutions. From deep subsea to outer space, our promise to buildconnections that last goes beyond manufacturing the best bolting technologies. Our people are experts in the lifecycle of secure bolted joints, innovators at the forefront ofdigital solutions andcommitted to doing business with respect for people and planet. \nOur technology brands are all the original inventors of their respective technologies: Nord-Lock wedge-locking washers, Superbolt mechanical tensioners, Boltight hydraulic tensioners and Expander System pivot pins. \nWe build connections that last.\n\nPlease send in you application latest by 26th of September, however we review applications on an ongoing basis.",
        "url": "https://careers.nord-lock.com/jobs/6411230-communications-specialist-to-nord-lock-group?promotion=1617078-arbetsformedlingen",
        "published": "2025-09-05T15:37:25",
        "deadline": "2026-02-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29993330",
        "title": "AI & Robotics Scientist",
        "employer": "Stiftelsen Chalmers Industriteknik",
        "location": "Göteborg",
        "description": "At Applied AI, we develop exciting new AI solutions in innovative projects, we strengthen research, industry and the public sector. We create positive effects on society through technological development together with external partners and access to the latest research.\nAbout the role We are looking for an AI & Robotics Scientist with strong expertise across data science, robotics, and software engineering to drive the next generation of data-driven industrial automation solutions. With a proven background in model-driven engineering, applied machine learning, and interdisciplinary research, you will play a key role in transforming industrial data into actionable insights, optimizing processes, and bridging the gap between AI innovation and operational deployment.\n This role is ideal for someone who combines curiosity, technical knowledge, and hands-on experience across academia and industry. Someone who thrives in working at the intersection of research, engineering, and applied data science.\nYour responsibilities include:\n Lead the development of machine learning and AI models for automation use cases such as predictive maintenance, mission assurance, and process optimization.\n Design and implement knowledge-driven approaches (e.g., knowledge graphs, model-driven engineering) to improve data reusability, verifiability, and interpretability.\n Architect and manage data pipelines integrating IoT sensors, robotics systems, and industrial control environments.\n Translate advanced data science methods (e.g., statistical modeling, graph analytics, optimization) into robust, real-world industrial applications.\n Collaborate with cross-disciplinary teams (automation engineers, researchers, industry partners) to align analytics solutions with operational goals.\n Mentor colleagues, contribute to capacity building, and supervision experience to strengthen organizational knowledge.\n Contribute to research and innovation projects (e.g., EU/Vinnova/Energimyndigheten) by preparing technical content, and reports.\n Act as a bridge between academic insights and industrial practice, ensuring that innovative methods are practical, explainable, and industry-ready.\n \nAbout you\n You have a PhD in Computer Science, Data Science, Robotics, or Automation Engineering.\n You enjoy working across domains, from robotics and automation to data-intensive applications.\n You have a proven ability to communicate complex ideas clearly to both technical and non-technical audiences.\n You thrive in collaborative environments, with experience across academia, industry, or applied projects.\n You are motivated by turning research into practice, ensuring that advanced methods lead to real-world impact.\n \nWhat we would hope you know\n Hands-on expertise in machine learning, statistical modeling, and optimization techniques.\n Strong programming skills in Python (including Pandas, Scikit-learn, TensorFlow/PyTorch, NetworkX).\n Familiarity with robotics and automation systems, including mission design, or control theory.\n Understanding of industrial data sources and protocols (time-series sensor data, OPC UA, MQTT, KPIs).\n Experience in data visualization and analysis for decision-making and reporting.\n \nOther qualifications\n Experience with knowledge graphs, ontologies, and semantic data technologies.\n Generative and agentic AI\n \nAbout the position and application The position is a permanent position with a six-month probation period. Our office is centrally located at Chalmers and you are offered a hybrid solution where you have the opportunity to alternate office work with work from home.\n Application deadline: 30th of September Selection will take place on an ongoing basis and we will place great emphasis on personal suitability in the appointment.\nWe would like you to attach / write a personal letter together with your application (CV).\nWe offer At Chalmers Industrial Technology, we offer a dynamic and innovative environment and a role in an exciting and growing business with a focus on problem solving, where you are involved in influencing tomorrow. We take advantage of your skills but also your desire to develop. \n About us Stiftelsen Chalmers Industriteknik is a research and development organization dedicated to driving innovation for a sustainable society. We are a passionate team of innovators, researchers, and project managers driven by the desire to make a difference for the future. By enhancing Sweden's capacity for innovation and making research accessible, we work to shape a better and more sustainable world. We are preparing tomorrow for the future.",
        "url": "https://chalmersindustriteknik.teamtailor.com/jobs/6410739-ai-robotics-scientist?promotion=1616199-arbetsformedlingen",
        "published": "2025-09-05T11:01:16",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "29916224",
        "title": "Data Warehouse & Integration Specialist till NTEX, Göteborg",
        "employer": "Jerrie AB",
        "location": "Göteborg",
        "description": "NTEX startades för att erbjuda ett svenskägt alternativ på marknaden. Genom förvärv och organisk tillväxt är NTEX nu ett av Sveriges största privatägda speditionsföretag med 3,7 miljarder kronor i omsättning. Bolaget äger runt 1350 trailers för godstransporter samt omlastnings- och logistikterminaler och egna dragbilar. Med över 1 000 medarbetare och ca. 800 000 uppdrag årligen har vi resurserna att ta hand om uppdrag i alla skalor och storlekar. Vi bryr oss. Hela vägen.\n\nOm rollen\n\nVi söker en erfaren och lösningsorienterad specialist som vill ta täten i utvecklingen av vår nya datawarehouselösning. I denna nyckelroll blir du motorn bakom att samla och konsolidera data från flera av våra Transport Management System (TMS) och vårt ekonomisystem Netsuite. Målet? Att skapa en robust och skalbar dataplattform som blir hjärtat i vår framtida kundportal – där våra kunder enkelt kan se historisk data och smidigt boka sina transporter online.\n\nArbetsuppgifter\n\nDesigna, bygga och underhålla en central datawarehouselösning som integrerar data från flera TMS-system och Netsuite samt eventuellt andra interna och externa datakällor.\nUtveckla och optimera ETL/ELT-processer för hög datakvalitet, prestanda och tillgänglighet.\nDefiniera datamodeller för analys, rapportering och realtidsapplikationer.\nSäkerställa datastyrning (data governance), säkerhet, åtkomstkontroller och regelefterlevnad.\nDelta i utvecklingen av en kundportal med historisk och realtidsdata, inklusive API-integrationer.\nSamarbeta med utvecklare och UX-designers för bästa prestanda och användarupplevelse.\nImplementera monitorering och larm för att upptäcka dataproblem proaktivt.\nDokumentera lösningar och utbilda interna användare.\n\n\nOm dig\n\nDu kombinerar teknisk expertis med affärsförståelse och trivs i en roll där du driver utveckling framåt. Du har god kommunikationsförmåga och är van att samarbeta över olika funktioner.\n\nKrav och kompetenser\n\n3–5 års erfarenhet av datawarehouse utveckling och integration.\nGoda kunskaper i SQL och minst en modern dataplattform (t.ex. Snowflake, Azure Synapse, Google BigQuery, AWS Redshift).\nErfarenhet av ETL/ELT-verktyg (t.ex. Fivetran, Talend, dbt, Azure Data Factory).\nFörståelse för molninfrastruktur (Azure, AWS eller GCP).\nFlytande svenska och engelska i tal och skrift.\n\n\nMeriterande\n\nErfarenhet av att använda AI och maskininlärning för:\nPrediktiv analys (t.ex. ETA-prognoser, kapacitetsplanering)\nAutomatiserad dataklassificering och anomalidetektion\nChatbotar eller smarta frågegränssnitt mot data\nErfarenhet av data visualisering (t.ex. Power BI, Tableau, Looker).\nKunskap om API-utveckling och REST/GraphQL-integrationer.\nErfarenhet från logistik- eller transportsektorn.\n\n\nErbjudande\n\nEn nyckelroll i en strategisk satsning som förändrar vårt datadrivna arbete.\nMöjlighet att bygga en plattform från grunden med moderna tekniker.\nInternationell arbetsmiljö med frihet att utforska AI-lösningar.\n\n\nNTEX erbjuder en trivsam arbetsmiljö med trevliga kollegor. Här får du de verktyg du behöver för att utföra ditt arbete på bästa möjliga sätt. På NTEX har vi ett stort hjärta för våra medarbetare och våra kunder. Vi tror på att vara branschledande genom att ständigt förbättra oss och ha ett nära samarbete med kunder och leverantörer. Vi bryr oss hela vägen!\n\nAnsök\n\nLåter detta som nästa steg i din karriär? Skicka in din ansökan redan idag – vi intervjuar löpande.\n\nÄr du nyfiken och vill ställa några frågor? Hör gärna av dig till Igor Glavan, igor.glavan@jerrie.se, 0701-765828. Välkommen med din ansökan!",
        "url": "https://jerrie.se/lediga-jobb/2737-data-warehouse-integration-specialist-till-ntex-goteborg?pnty_src=arbetsformedlingen",
        "published": "2025-08-18T02:16:25",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787427",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-06-24T08:06:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787426",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-06-24T08:03:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760753",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
        "published": "2025-06-10T13:37:03",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]