[
    {
        "id": "30180604",
        "title": "Senior Developer to Relay Software Team",
        "employer": "Mullvad VPN AB",
        "location": "Göteborg",
        "description": "About Us \nMullvad VPN is a Swedish VPN company dedicated to fighting mass surveillance and censorship. We do this primarily through our VPN service and our web browser.\nWe believe in a free and open society where people have the right to personal privacy; the right to their own thoughts and opinions, and the right to decide exactly when and with whom they want to share them.\nWe believe that privacy is the right which all other rights rest upon, and that democratic societies must be built on the right to privacy in order to thrive and develop.\nThe Job\nWe’re looking for a Senior Developer to join our Relay Software Team at Mullvad. This team is responsible for all custom software solutions used on our VPN relays. \nYou’ll play a key role in advancing server support for technologies such as Quantum-secure tunnels, traffic-analysis protection and protocol obfuscation. \nWho Are You\nYou’re someone who enjoys working in a team, contributes ideas proactively, and has a strong interest in security, networks and low-level software development. \nYou value quality, maintainability, and thoughtful software design. You are curious and eager to learn, and you understand the importance of digital privacy.\nResponsibilities Work on new and exciting technologies and greenfield projects.\n Using Go, design and implement robust server software for running on Linux.\n Author clean solutions that balance performance and resource usage.\n Perform measurements, testing and troubleshooting.\n Coordinate with stakeholders and developers in other departments.\n Qualifications Excellent written and spoken English and Swedish.\n Highly developed understanding of software design and all aspects of software implementation.\n Experience with building server software.\n Excellent understanding of networking fundamentals.\n Strong knowledge in at least one of C/Go/Rust.\n Why Mullvad?\nWe are a bunch of diversified peeps: from vegans to marathon runners, audiophiles to farmers and coffee brewers. So, what unites us? Our commitment to living and breathing our mission, to make mass surveillance and censorship impractical. \nAdditional Information\nLocation: Gothenburg, Sweden Start: As soon as possible Job Hours: Full-time\nThis is an ongoing recruitment process and we aim to fill the position as soon as possible. As part of our hiring process, we conduct a background check to ensure a safe and secure work environment.",
        "url": "https://www.mullvad.careers/jobs/6634589-senior-developer-to-relay-software-team?promotion=1683351-arbetsformedlingen",
        "published": "2025-10-23T13:07:36",
        "deadline": "2026-04-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30179680",
        "title": "Systemutvecklare ServiceNow GRC (Governance Risk Compliance)",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nDin roll\n\nDu kommer att ingå i vår centrala ServiceNow-grupp, där ditt fokus på GRC-projekt gör dig till ett värdefullt tillskott. Vi befinner oss i en spännande och snabbväxande fas, där vi förutom nyutveckling också arbetar med att underhålla och förädla befintliga lösningar.\n\nVåra verksamhetsnära projekt ger unika möjligheter att bidra till verklig affärsnytta. Därför är det viktigt att du, förutom att vara en skicklig utvecklare, också är duktig på att förstå verksamhetens behov och skapa välanpassade lösningar. Du behöver vara lika intresserad av att lyssna på och kommunicera med verksamheten som av att arbeta självständigt som utvecklare.\n\nResor kan tillkomma i tjänsten, främst till våra andra kontor runt om i landet. Det finns möjligheter att arbeta remote i viss utsträckning, och detaljerna kring detta kommer du att komma överens om med din närmaste chef.\n\nDin profil\n\nFör att passa hos oss tror vi att du är prestigelös och har en stark vilja att ständigt utvecklas och bli ditt bästa jag. Du trivs med att arbeta agilt, tar gärna egna initiativ och är naturligt hjälpsam. Eftersom vi arbetar i team är det viktigt att du känner dig bekväm i en lagmiljö. Vi är övertygade om att det är tillsammans som vi når framgång - genom att lita på, stötta och lära av varandra, både för Saabs bästa och för vår personliga utveckling.\n\nVi värdesätter också kreativitet och förmågan att tänka utanför boxen - att våga prova nya vägar och hitta innovativa lösningar är en självklar del av vårt arbetssätt.\n\nVi ser gärna att du har:\n\n * \n\nErfarenhet av implementering och/eller förvaltning av GRC (Governance, Risk & Compliance)\n * \n\nGod förståelse för GRC/IRM i ServiceNow samt kännedom om vanliga fallgropar\n * \n\nGod kunskap om ServiceNow som plattform\n * \n\nErfarenhet av att arbeta i ServiceNow-projekt med ambitionen att återgå till så kallade \"Out of the Box\"-lösningar\n * \n\nFörståelse för kopplingen mellan affärsvärde och GRC-processer\n * \n\nErfarenhet av agila arbetssätt\n * \n\nFlytande svenska och engelska i både tal och skrift\n * \n\nEn lagspelare som trivs i team\n\nMeriterande är om du också har:\n\n * \n\nKunskap om säkerhetsstandarder såsom ISO 27001 och NIST\n * \n\nCertifieringen CIS Risk and Compliance\n * \n\nErfarenhet av arbete som kravhanterare\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n \n\nVad du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=YS5vbHNzb24uOTcwMjguMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-10-23T10:50:36",
        "deadline": "2025-11-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30171542",
        "title": "Software Engineer",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\n\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent.\n\nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\n\nAt Core System Platform we are building a computer-in-the-car architecture, a key for enabling innovation within areas such as advanced connectivity, machine learning and autonomous drive. Our mission is to create a High Performance  platform using new technologies like NVIDIA DRIVE™ OS and NVIDIA’s latest chip technology in combination with more traditional car signaling technologies. We are dedicated to deliver platform functions simplifying the application development to create a safe, reliable, and secure platform solution within Volvo Cars for increased innovation and speed.\n\nWhat you'll do\n\nAs a Software Test Engineer within High Performance Platform, you will work as part of an agile team, building solutions which are safe and reliable. You will create automated test routines enabling our solutions to be compliant with the highest safety grades in the car industry.\n\nWhat you'll bring\n\nWe want to work with you who have a keen interest in modern computing technologies and want to work in an evolving industry. You like solving problems together with others. You are a customer-oriented person who enjoys being part of a team where you take your own initiative and take pride in your own and the team’s deliveries.\n\nYou and your skills\nWe think you have a broad background within software, both coding and testing.\nFor this position the following skills are needed:\n  *  Great skills in automated tests with good experience in embedded systems.\n  *  Good knowledge of working in a Linux environment\n  *  Good knowledge in Python\n  *  Good knowledge in Robot Framework\n  *  Knowledge in C/C++\n\n\n#LI-DNI\n#LI-DNP\r\n\r\nWhat you'll bring\n\nWe want to work with you who have a keen interest in modern computing technologies and want to work in an evolving industry. You like solving problems together with others. You are a customer-oriented person who enjoys being part of a team where you take your own initiative and take pride in your own and the team’s deliveries.\n\nYou and your skills\nWe think you have a broad background within software, both coding and testing.\nFor this position the following skills are needed:\n  *  Great skills in automated tests with good experience in embedded systems.\n  *  Good knowledge of working in a Linux environment\n  *  Good knowledge in Python\n  *  Good knowledge in Robot Framework\n  *  Knowledge in C/C++",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43730808",
        "published": "2025-10-21T14:25:06",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30169492",
        "title": "System Developer - Equipment Handling",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nAbout this opportunity\n\nEricsson is looking for a skilled System Developer to join our team and drive the development and optimization of next-generation communication systems. This is an opportunity to work on cutting-edge technologies that power global networks!\n\nAbout us\nAt R&D, CCI Technology & Systems (T&S) we primarily engage with system engineers in the SW domain but also support HW development. Our section contributes to almost all requirement areas (RAs) and programs. We engage in technology strategies and early phases of development, as well as create design and configuration input for RAN, RAN Compute and Site products.\n\nFurthermore, we are a part of: \n\n-    make system design for SW features.\n-    coordinate RAs work via Technical Coordinators.\n-    technically lead our product development projects.\n-    set requirement on ASICs for RAN Compute products based on L1 and L2 architecture and performance needs.\n-    System Simulation and algorithm development. \n-    Product requirement setting.\n\n\nSystem Developer – Equipment Handling \n\nResponsible for supporting hardware maintenance, including installations and replacement of field hardware. Ensure critical functionality to maintain seamless customer operations.\n\nKey responsibilities:\n•    Bring equipment into operation, supervise performance, and secure continuous availability.\n•    Support a wide range of hardware units, such as radios and RAN computers, with different capabilities and capacities.\n•    Manage configurations of varying sizes to meet operational requirements.\n•    Handle multiple front-haul topology variants for efficient equipment interconnection.\n\n\nWho are you?\n\nTo take on this role you need to have expertise and a strong background in telecommunication and mobile networks. As well as a solid background in the equipment handling (EH) domain. You will drive and take active part in creating our strategies for the equipment handling alongside providing technical leadership, support, and competence development for our researchers in this area (EH).\nWith your solution-oriented mindset, you bring a unique mix of qualities to this role. Such as outstanding communication-, craftsmanship-, and leadership skills that enable you to deliver exceptional results and bring people together.\n\nQualifications: \n•    Master’s degree in engineering\n•    Minimum 5 years’ experience in either System Design, Software Design, RAN, or System Verification, or relevant fields.\n•    Solid background in telecommunications.\n•    Proven ability to drive system solutions. \n\nFollowing skills are meritorious: \n\nExperience with Unified Modelling Language, Git/Gerrit/PlantUML/Markdown, Netconf/Yang, 3GPP/O-RAN, Managed Object Modelling, Ericsson Corporate Standards, RAN Architecture, and coding skills within C++.\n\nWhy join us?\nWhen working with us it's more about the craft as a system developer then knowing all the answers. We believe in the power of collaboration and embrace a team-first mindset to achieve excellence together. Here, you'll grow, share ideas, and build innovations that make a real impact.\n\nPlease note: We value your data privacy and therefore do not accept applications via mail.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43730093",
        "published": "2025-10-21T10:25:06",
        "deadline": "2025-11-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30123730",
        "title": "Utvecklare - Fullstack react python",
        "employer": "Textual AB",
        "location": "Göteborg",
        "description": "textual.ai utvecklar AI-drivna lösningar som hjälper e-handelsföretag att automatisera innehållsproduktion, översättningar och marknadsföring. Våra verktyg kombinerar språkmodeller, dataanalys och smart design för att skapa effektiva system som används av stora e-handlare i Sverige och utomlands.\nOm rollen\nVi söker en fullstackutvecklare med erfarenhet av React och Python som vill arbeta med nästa generation av AI-baserade verktyg för digital handel. Du kommer att vara en del av ett litet, tekniskt starkt team som arbetar agilt och nära produkten – från idé till lansering.\nDina arbetsuppgifter\nUtveckla webbaserade applikationer och interna verktyg med React (frontend) och Python (backend).\nIntegrera språkmodeller och API:er för AI-funktionalitet.\nDelta i planering, design och tekniska beslut.\n\nKvalifikationer\nMinst 2 års erfarenhet av fullstackutveckling.\nGoda kunskaper i React, TypeScript och Python (t.ex. Django eller Flask).\nErfarenhet av API-utveckling och databaser.\nVan att arbeta med Git och moderna utvecklingsflöden.\nAnvända AI-assisterade utvecklingsverktyg som Cursor\nFörmåga att arbeta både självständigt och i team.\n\nMeriterande\nErfarenhet av AI eller maskininlärning (t.ex. LLM).\nErfarenhet av molnplattformar (AWS, GCP).\nIntresse för e-handel, språk och automatisering.\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": null,
        "published": "2025-10-09T07:56:40",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30097929",
        "title": "Erfaren systemutvecklare inom mjukvaruutveckling",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Syntronic är en ledande design- och utvecklingspartner inom avancerade tekniklösningar. \nVi är stolta över att vara i framkant av teknologisk innovation och söker nu en erfaren systemutvecklare inom mjukvaruutveckling till vårt team i Göteborg.\nSom systemutvecklare hos oss:\nKommer du att vara involverad i allt från design, programmering, testning och implementation av mjukvarulösningar. Du får möjlighet att arbeta med varierande uppdrag hos olika kunder. \nVi använder moderna programmeringsspråk och ramverk såsom C#, Java, Python, .NET, och vi värdesätter erfarenhet av både SQL-databaser. \nVad vi söker hos dig som systemutvecklare:\n Högskole- eller civilingenjörsutbildning inom mjukvaruutveckling, systemutveckling, IT eller liknande\n Minst 5 års erfarenhet av systemutveckling och mjukvaruutveckling, med djup kunskap inom något eller flera programmeringsspråk (t.ex. C#, Java, Python, .NET)\n Erfarenhet av agil utveckling, Scrum, eller liknande metoder\n Erfarenhet av molntjänster som AWS, Azure, eller Google Cloud är ett stort plus\n Kommunicerar flytande på svenska och engelska, i tal och skrift.\n \nVi letar inte efter en perfekt lista av kvalifikationer, utan efter rätt person som vill utvecklas tillsammans med oss och våra kunder. \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 1 november. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354308-erfaren-systemutvecklare-inom-mjukvaruutveckling?promotion=1653198-arbetsformedlingen",
        "published": "2025-10-02T13:05:51",
        "deadline": "2025-11-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30092160",
        "title": "Machine Learning Engineer - Computer Vision",
        "employer": "Repli5 AB",
        "location": "Göteborg",
        "description": "The Role: We're looking for an experienced Machine Learning Engineer with a deep background in computer vision and generative AI. You’ll be part of a team developing systems that generate realistic, diverse, and highly controllable synthetic image data using state-of-the-art tools like Stable Diffusion, LoRA, and ControlNet. Your work will directly impact the performance and robustness of real-world AI systems—from self-driving cars to defense robotics.\nWhat You’ll Do\n Develop and fine-tune generative AI pipelines (e.g., Stable Diffusion, ControlNet, LoRA) for synthetic image generation.\n Design and implement machine learning workflows to generate structured, photorealistic datasets.\n Collaborate with 3D artists and simulation engineers to align ML models with physical environments and sensor setups.\n Work closely with customers in automotive, robotics, and aerospace to deliver tailored datasets.\n Optimize generation systems for scalability, quality, and speed using tools like ComfyUI or custom pipelines.\n \nYou Should Have\n MSc or PhD in Computer Vision, Machine Learning, or related field.\n 3+ years of hands-on experience with deep learning frameworks (e.g., PyTorch, TensorFlow).\n Experience working with generative AI models (especially diffusion-based models).\n Familiarity with tools like LoRA, ControlNet, ComfyUI, or custom workflows around Stable Diffusion.\n Strong understanding of synthetic data generation and its role in training perception systems.\n A track record of deploying ML systems in domains like automotive, robotics, defense, or manufacturing.\n \nNice to Have\n Experience working with 3D simulation pipelines or sensor modeling (e.g., depth, LiDAR, segmentation).\n Contributions to open-source ML/gen AI tools or custom diffusion model training.\n Enjoying reading research papers\n A problem solving intellect and a team player spirit\n Knowledge of synthetic-to-real domain adaptation techniques.\n Experience in startup environments or working directly with enterprise R&D teams.\n A positive can-do attitude",
        "url": "https://repli5.teamtailor.com/jobs/6544271-machine-learning-engineer-computer-vision?promotion=1650650-arbetsformedlingen",
        "published": "2025-10-01T10:35:02",
        "deadline": "2026-03-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30085111",
        "title": "Systems Engineer",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Passion för framtida teknologier?!\nRedo för nya utmaningar!\n\nKom hit till oss och utvecklas vidare i din karriär!\n\n \n\nDin roll\n\nDu kommer ha rollen som teknisk ledare inom plattformen som vi tar fram. Det är ett mycket varierande jobb som spänner över ett stort område. Några exempel på arbetsuppgifter är design av ny funktionalitet från kontrakterade krav och arkitekturdesign. I den här rollen kommer du jobba med nya teknikområden som innebär en möjlighet att utvecklas både personligt och professionellt. Vi jobbar i agila team som jobbar med Scrum. Teamen består av en blandning av olika expertkompetenser.\n \n\nDin profil\n\nSom person är du positiv, nyfiken, drivande och bra på samarbete och jobbar gärna i team. Du har förmåga att kommunicera med olika intressenter och på olika nivåer såsom på systemnivå likaväl som på modulnivå. Du kan presentera och förklara tekniska lösningar som är anpassade för olika intressenter. Du har förmåga att förstå komplexa tekniska system, kan se helheten ur ett systemperspektiv och möjlighet att hantera nya frågeställningar och miljöer.\n\nVidare så har du kunskap inom något eller några av följande områden:\n\n \n\n * \n\nSystemdesign\n * \n\nKravhantering och teknisk dokumentation (svenska och engelska)\n * \n\nSäkerhetstänk, informationssäkerhet\n * \n\nOlika standarder\n * \n\nProduktutveckling\n * \n\nDatorer, närverk, mjukvara och operativsystem\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nVad blir du en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\n \n\nSaab är stolt karriärföretag 2023 - läs mera här",
        "url": "https://www.aplitrak.com/?adid=YW0uNDM0MTguMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-09-29T18:16:11",
        "deadline": "2025-10-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30011536",
        "title": "Cyber Security Engineer to Alps Alpine!",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Alps Alpine is looking for a Cyber Security Lead to join their team in Gothenburg. In this role, you will take the lead in ensuring high-quality cybersecurity processes in global automotive projects. This is a unique opportunity to work with innovative vehicle electronics and drive future developments in a truly international environment.\n\n\n\nABOUT THE COMPANY\n\nAlps Alpine is one of the world’s leading manufacturers of electronic components for computers, communications, and automotive electronics. The company is also a market leader in high-performance mobile electronic solutions. Founded in 1948, Alps Alpine is unique as the only manufacturer specializing in mobile multimedia, offering integrated system solutions within digital entertainment, security, and navigation.\n\nThe Swedish branch focuses on vehicle electronics, with products in speakers and sound, infotainment, and radar solutions.\n\nABOUT THE POSITION\n\nWe are now looking for a Cyber Security Engineer to join Alps Alpine in Gothenburg. The company delivers customized products to the global automotive industry. Each product is managed as part of a global project that follows the entire product lifecycle.\n\nAs Cyber Security Engineer, you are responsible for ensuring that all activities and artifacts related to cybersecurity are completed on time, with high quality, and with successful outcomes. You will work closely with the Swedish project teams, supporting them with cybersecurity-related matters – the level of involvement depending on the knowledge within each specific project. The role also requires you, when needed, to demand that the development center in Asia completes cybersecurity-related tasks on time and with the right quality.\n\nYou will not carry out all cybersecurity work yourself but will instead coordinate and lead the efforts together with Cyber Security Managers and Engineers in other development centers as well as on the customer side.\n\nYOUR PROFILE\nRelevant university degree in software engineering or equivalent.\nAt least 2 years of work experience in cybersecurity and software development.\nExperience from the automotive industry and its regulations.\nFluent in English, both spoken and written.\n\n\nTo be successful in this role, we believe you are a strong team player with excellent collaboration skills. You have great communication abilities, can work independently, take initiative, and assume full ownership of your work. You are also eager to learn and develop within the company.\n\nABOUT THE EMPLOYMENT\nType of employment: Full-time, direct recruitment to Alps Alpine\nStart date: As soon as possible\nLocation: Gothenburg\nContact person: Stina Högström\nSalary: Fixed monthly salary\n\nABOUT FRIDAY\n\nBy being a partner to our clients and candidates, we strive to find the best match for both parties. We achieve this by really getting to know our clients and candidate’s needs! Of course, we will ensure that requirements and skillsets match. But above all, we focus on the importance to find harmony between values ​​and corporate culture which both candidate and client considers optimal.\n\nOur passion is to help people to the right position, workplace and context within the IT and Technology field. That's also the reason to why we founded Friday, with the aim to help you find the job that gives you that Friday feeling – every day! We mainly focus on young engineers who either are at the beginning of their career or soon graduating from university within the IT/Tech field. Our belief is that people reach their fullest potential when looking forward to going to work each morning. \"Friday - everyday\", how about that?",
        "url": "https://pnty-apply.ponty-system.se/friday?id=3602&pnty_src=arbetsformedlingen",
        "published": "2025-09-10T11:48:25",
        "deadline": "2025-10-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29983430",
        "title": "Senior DevOps Engineer",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "About this role \nWe are now looking for a Senior DevOps Engineer for our organization, someone with a deep interest in infrastructure and enabling fast feedback loops for developers by developing continuous integration capabilities. You will belong to a small and passionate team responsible for developing our infrastructure and related technology stack for on premise and cloud deployments; the foundation for our video analytics platform that thousands of cameras across the world are connected to. \nSome of the technologies we use: \n Go and C++ \n  Kubernetes, OpenShift and Docker \n  Kafka, Redis, MongoDB and Postgres \n  Elastic and Grafana \n  Git, CircleCI and ArgoCD \n \nOur company culture is based on freedom and responsibility. For us that means you will be given extensive freedom to make strategic technical decisions while meeting our ambitious standards and making decisions in a responsible way. You will be located at our headquarters in Gothenburg where we are a team with a lot of positive energy and a strong sense of community. \nWho we think you are \nTo be successful in this role, we expect you will bring experience of working with product development and/or solutions that leverage physical or cloud infrastructure. Experience with on premise deployments is a plus. You also need a good understanding of organizational aspects of software development and of how to collaborate efficiently with others. \nRequirements \n At least 4 years of experience working with infrastructure and tooling for applications with high performance requirements. \n  Strong knowledge of multiple of the technologies we use, e.g., OpenShift, Kubernetes, databases and messaging systems. Kubernetes administrator certificate is a plus. \n  Linux administrator knowledge, e.g., knowledge in kernels, different distributions etc. \n  General interest and knowledge in security. \n  A strong desire to collaborate with others and to contribute to team success. \n  Great understanding of both Windows and Linux build environments and toolchains. \n  Excellent communication and organization skills and great personal initiative and drive, with an ability to understand the requirements of different stakeholders, keeping things organized, and making things happen. \n  Proficiency in English. Swedish is a plus but not a requirement. \n  A degree in computer science or software engineering. Alternatively, a combination of other relevant education (formal or self-taught) and experience. \n \n\nAbout Irisity \nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alert, leading to reduced crime rates and increased safety without any negative effects on personal privacy. \nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 90+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. \nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history. \nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds. \nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. Read more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6394507-senior-devops-engineer?promotion=1612570-arbetsformedlingen",
        "published": "2025-09-03T13:10:25",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787419",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-06-24T07:59:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29701269",
        "title": "Lead Developer Dynamics 365 Customer Engagement",
        "employer": "Fellowmind Sweden AB",
        "location": "Malmö",
        "description": "Forma framtidens kundupplevelser tillsammans med oss på Fellowmind \nHär är chansen för dig som är redo att ta nästa kliv i din karriär som utvecklare – och samtidigt vara med och sätta din prägel på den tekniska standarden för hur framtidens digitala kundlösningar ser ut! Hos oss på Fellowmind får du en ledande roll i ett sammanhang där teknik och mänsklighet går hand i hand. Vi söker nu en Lead Developer inom Dynamics 365 CE som brinner för kvalitet, innovation och att inspirera andra! \nDin roll hos oss \nSom Lead Developer är du mer än en teknisk specialist – du är en vägvisare! Du är med och formar riktningen för hur vi bygger, utvecklar och levererar våra lösningar inom Dynamics 365 CE. En del av ditt uppdrag blir att säkerställa vår tekniska kompetens och var ett nav för kunskapsdelning, kvalitetssäkring och inspiration för våra utvecklare. \nDu kommer bland annat att: \n Jobba i teknikens framkant – särskilt inom Power Platform och Dynamics 365 CE. \n  Leda interna utvecklarforum – en kreativ samlingsplats för inspiration, idéutbyte och kompetenshöjning. \n  Granska kodbaser och leveranser för att säkra kvalitet, hållbarhet och skalbarhet. \n  Coacha kollegor genom code reviews, teknisk vägledning och mentorskap. \n  Samverka med arkitekter och andra experter i tvärfunktionella projekt – ibland leder du själv, ibland bidrar du i teamet.\n \nTekniken vi älskar att jobba med \nHos oss är tekniken ett medel för att skapa verkligt värde. Vi jobbar bland annat med: \n Power Platform (Power Automate, Power Apps) \n  JavaScript/TypeScript \n  C#.NET (t.ex. plugins, Custom APIs) \n  Power Apps Component Framework \n  React \n  Azure DevOps och CI/CD-pipelines\n Vi tror att du  Har gedigen erfarenhet av utveckling inom Dynamics 365 CE och Microsofts molnbaserade ekosystem - troligen 5 år eller mer. \n  Brinner för struktur, arkitektur och kod av hög kvalitet. \n  Är nyfiken och pedagogisk – du trivs med att både lära och lära ut. \n  Vill kombinera teknik med ansvar och samarbete – du gillar att se helheten.\n Vad vi erbjuder \nSom en ledande europeisk Microsoftpartner är Fellowmind en arbetsplats där tekniken får ett mänskligt ansikte. Vi tror på att digital transformation börjar med relationer – och att de bästa lösningarna föds i samarbetet mellan människor. Här får du en roll med verklig påverkan, i en kultur som präglas av: \n Always personal – Vi bygger relationer på äkta engagemang. \n  Better together – Vi tror på kraften i samarbete. \n  Act with courage – Vi vågar tänka nytt och utmana gamla sanningar. \n  Serious about fun – Vi kombinerar hög leveranskvalitet med en arbetsmiljö där du trivs, växer och skrattar.\n \nLägg därtill att vi i höstas blev utsedda till Sveriges Bästa Arbetsgivare vilket vi ser som ett kvitto på att vi gör mycket rätt – och vi kommer alltid att fortsätta arbeta för att vara en plats där alla ska må bra och känna sig hemma. \nDet praktiska  Omfattning: Heltid \n  Placering: Något av våra centrala kontor i Malmö, Göteborg, Stockholm, Jönköping eller Halmstad \n  Start: Snarast – men vi anpassar oss efter din kalender\n \nRedo att leda vägen för tekniken – och samtidigt göra skillnad för både kunder och kollegor? -Sök redan idag!",
        "url": "https://career.fellowmind.se/jobs/5927477-lead-developer-dynamics-365-customer-engagement?promotion=1468872-arbetsformedlingen",
        "published": "2025-05-14T09:30:15",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30183444",
        "title": "Teamcenter Developer",
        "employer": "Hitachi Energy Sweden AB",
        "location": "Göteborg",
        "description": "About the Role: As a Siemens Teamcenter Developer, you will be responsible for developing and customizing solutions within the Siemens Teamcenter environment. You will work closely with the development team to ensure solutions meet business requirements and adhere to best practices in PLM (Product Lifecycle Management). \nKey Responsibilities: \nDevelop and customize Teamcenter solutions using both configuration and custom code/scripts. \nPerform ITK server-side programming in C/C++, Java for dispatcher clients, and XML for stylesheet definitions. \nUtilize tools such as BMIDE, Workflow Designer, and Query Builder for continuous development. \nTroubleshoot and resolve issues in existing code based on user or team reports. \nSupport the development team with technical expertise in programming. \nIncorporate PLM/Teamcenter development best practices. \nIntegrate Teamcenter solutions with third-party applications such as SAP4Hana, NX, and ECAD tools. \nConfigure and customize Active Workspace and Teamcenter architecture/data model. \nInstall and configure 2-Tier & 4-Tier clients, file management servers, dispatcher servers, and CAD integrations. \n\nRequired Qualifications: \nProficiency in at least one of the following programming languages: C/C++, C#, Java, or XML/XSLT. \nStrong knowledge of Teamcenter APIs and the Dispatcher framework. \nExperience with Active Workspace configuration and customization. \nFamiliarity with Git (Azure DevOps) for code management. \nUnderstanding of Teamcenter UA products, including Engineering Data Management, BOM Management, Workflow, and Change Management. \nExperience in Teamcenter client-server customization and SOA customization. \nBasic problem-solving skills for application issues and root cause analysis. \nExposure to real-time customer environments and implementation of Teamcenter product solutions. \nProficiency in English; additional languages such as Swedish are highly valued. \n\nGood to Have: \nExperience with Product Configurator, Multi BOM Management, Service BOM, or Supplier Collaboration in TC and AWC latest versions. \nKnowledge of transitioning from RAC to AWC, understanding the TC AWC data model and Multi BOM Management capabilities. \n\nPersonal Attributes: \nSelf-motivated and able to work effectively both independently and as part of a team. \nStrong interpersonal skills with the ability to communicate clearly at all levels of the organization. \nCreative mindset with excellent problem-solving abilities. \nNatural leadership qualities and the ability to resolve issues efficiently. \n\nWhy Join Us: \nBe part of an international team where you can exchange knowledge with colleagues from around the world. \nWork on cutting-edge PLM solutions and contribute to innovative projects. \nOpportunities for professional growth and development.",
        "url": "https://www.hitachienergy.com/careers/open-jobs",
        "published": "2025-10-24T09:02:25",
        "deadline": "2025-11-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30169261",
        "title": "Software Developer",
        "employer": "Alten Sverige AB",
        "location": "Göteborg",
        "description": "We are looking for a Software Developer with strong experience in Model-Based Development for an advanced R&D assignment within the automotive industry. You will work on developing core functionalities for next-generation vehicle platforms, using Simulink and AUTOSAR-compliant workflows.\n\n \n\nYour profile\nA degree in Mechatronics, Electrical, Computer or Automotive Engineering\nAt least 3 years of experience in model-based software development within the automotive domain\nExcellent knowledge of MATLAB / Simulink, Stateflow, and Embedded Coder\nDeep understanding of AUTOSAR architecture, including SW-Cs, RTE interfaces and BSW integration\nExperience generating production-ready AUTOSAR-compliant code from Simulink models\nFamiliarity with Simulink libraries, custom blocks and S-Functions\nAbility to design modular, reusable and scalable software components\nA structured, analytical and collaborative way of working\nMeritorious experience includes functional safety (ISO 26262), CI/CD integration for MBD, and performance optimization of Simulink models.\n\r\n\nWhat you will do\n\nAs a Model-Based Software Developer, you will be responsible for designing and implementing Simulink models that enable functional growth in the vehicle’s core computing system.\n\n \n\nTasks include:\nDeveloping new features in Simulink / Stateflow aligned with AUTOSAR standards\nDesigning and structuring application-layer software components (SW-Cs)\nConfiguring and generating AUTOSAR-compliant C-code using Embedded Coder\nEnsuring traceability from requirements to model design\nPerforming peer reviews and continuous model improvements\nSupporting integration by delivering well-structured, verified models\n\n \n\nDeliveries\nSimulink models aligned with AUTOSAR architecture and development guidelines\nModular and reusable design ensuring scalability and maintainability\nVerified and production-ready generated code through Embedded Coder\nDocumentation according to project standards and model review results",
        "url": "https://www.alten.se/career/15160-Software-Developer-Simulink",
        "published": "2025-10-21T10:02:36",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30146336",
        "title": "CNC FRÄSARE/ PROGRAMMERARE",
        "employer": "Ingeniörsfirma Bågenfelt & Hellström AB",
        "location": "Göteborg",
        "description": "VI SÖKER CNC FRÄSARE/ PROGRAMMERARE!\nVi har idag en mycket fin och modern cnc maskinpark med en växande organisation som nu söker nya medarbetare!\nVi arbetar med Mazak cnc maskiner kunskap i styrsystem Mazatrol eller Master CAM är meriterande.\n\n\nOm oss:\nVi är ett ledande verkstadsföretag inom Fräsning, svarvning, laserskärning, bockning, svetsning, maskinbearbetning samt automation i Västra Frölunda/ Göteborg. Vi söker medarbetare som inte är rädda för nya utmaningar med driv och brinnande intresse för att växa med oss!!\n\n\nArbetsbeskrivning\nVi söker dig som har\n* Erfarenhet och verkstadsvana inom cnc fräsning, programmering.\n* Tekniskt intresse och kompetens\n* Initiativförmåga, kvalitetsfokus, noggrannhet, produktivitetsfokus och kan jobba självständigt",
        "url": "www.bagenfelt.se",
        "published": "2025-10-14T19:00:05",
        "deadline": "2025-11-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30145150",
        "title": "Embeddedutvecklare med inriktning mot FPGA",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Drivs du av att se dina idéer bli verklighet? Välkommen till vår spännande och teknikintensiva värld.\n\n \n\nDin roll\n\nVälkommen till ett härligt korsfunktionellt team som har till uppdrag att leverera embeddedmjukvara för antenner i våra världsledande radarprodukter.\n\n \n\nSom erfaren embeddedutvecklare har du en central roll i utvecklingen av sensornära funktioner. Du följer produkten hela resan, från kravställning till verifiering och slutligen integrationen i ett helt radarsystem. Som erfaren utvecklare förväntas du kunna lösa uppgifter självständigt och ta initiativ.\n\n \n\nDin profil\n\nI rollen som senior embeddedutvecklare ser vi att du har relevant högskoleutbildning och några års erfarenhet av FPGA-utveckling (VHDL). Du har driv, teknikintresse och kan stärka vårt team genom att dela din kunskap. Vi ser också att du har god förmåga att uttrycka sig i såväl tal som skrift, både på svenska och engelska.\n\n \n\nDet är också meriterande om du har erfarenhet av:\n\n * C++\n * GIT, Jenkins, Artifactory\n * Arbete i agila team\n * Grundläggande kunskaper inom signalbehandling och/eller kommunikationsteori\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\n \n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här",
        "url": "https://www.aplitrak.com/?adid=cy5zdmVuc3Nvbi41MzUxNy4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-10-14T15:15:11",
        "deadline": "2025-11-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30144806",
        "title": "Python Data Automation & Visualization Developer",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Description\nWe are seeking a skilled Python Data Engineer to join our release management team. In this role, you’ll be responsible for enhancing and maintaining data processing pipelines, automation scripts, and visualization tools that support our automotive software release processes. You’ll work with diverse data sources and collaborate with both technical and non-technical stakeholders to ensure reliable, traceable, and high-quality software releases.\nOur client is a leading software development company in the automotive sector, with deep expertise in Advanced Driver Assistance Systems (ADAS) and autonomous vehicle technologies. The organization focuses on creating robust software solutions that power next-generation automotive systems and drive innovation in the mobility industry.\nRequirements\nStrong Python programming skills: Ability to collect, process, and aggregate data from diverse sources, including databases, web services, REST APIs, and files.\nExperience with data visualization: Capable of generating charts, dashboards, Excel/Google Sheets reports, and datasets for both technical and non-technical audiences.\nFamiliarity with CI/CD toolchains (Jenkins, GoCD): Able to automate and integrate release tasks into continuous integration flows.\n\n\n\nBonus Skills:\nSQL and relational database querying.\nExperience with Elasticsearch and related search/data aggregation.\nFamiliarity with SystemWeaver for requirements and traceability management.\nExperience with Grafana/Kibana for dashboarding and monitoring.\nAbility to design and maintain Python libraries and reusable modules.\nFront-end development experience (e.g., web dashboards, interactive reports).\n\n\n\nJob responsibilities\nExtend and refactor existing Python scripts to support new data sources, reporting requirements, and automation needs.\nEnsure traceability, reliability, and quality of release data.\nPropose and implement improvements for data flow, automation, and visualization.\nHelp maintain a robust, automated release process for the client’s automotive software.",
        "url": "https://www.globallogic.com/careers/python-data-automation-visualization-developer-irc276859/",
        "published": "2025-10-14T14:43:20",
        "deadline": "2025-10-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30125316",
        "title": "Software Developer / Data Engineer",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "About Combine At Combine Control Systems, we are passionate about technology and innovation. We specialize in creating innovative technology that empowers industries and shapes the world around us. Our pursuit of staying at the forefront of the rapidly changing tech world drives us to develop and work with the latest tools and techniques in areas such as Data Science, AI, embedded systems, and control engineering. We offer exciting and diverse challenges at the cutting edge of technology and create an inspiring work environment where our employees thrive and have the opportunity to grow and develop. Together, we form a team of dedicated and skilled engineers and experts who are passionate about technology and innovation. As we continue to expand our horizons, we are seeking a passionate and talented Data Science Engineer to join our dynamic team in Gothenburg. \nWhat can we offer you? Joining our team means becoming part of a community that values openness, creativity, and trust. We embrace teamwork and welcome your contribution. At Combine, we encourage personal development, provide opportunities to explore new domains, and offer an inspiring and inclusive workplace.\nTechnically challenging projects - You will be part of exciting and technically challenging projects. You will work with the latest technologies and tools in Data Science and AI/Machine Learning. We give you the opportunity to challenge yourself and grow in specialized areas.\nInspiring work environment - Here, you will be surrounded by like-minded and enthusiastic colleagues. We promote collaboration and knowledge sharing to create a dynamic and rewarding work environment.\nProfessional development - We invest in our employees and provide opportunities for skills development and further education to help you grow in your career.\nYour role In this role, you’ll work on maintaining, improving, and supporting an internal analytics tool that enables advanced time-series data analysis. You’ll also contribute to the data platform, building and optimizing data pipelines that efficiently ingest daily streams from MDF files into an Iceberg catalog.\n This position combines hands-on development, data engineering, and collaboration with internal users and stakeholders. Your Key Responsibilities Maintain and enhance the internal analysis tool\n  Provide user support and internal training\n Build and optimize data ingestion pipelines\n Collaborate with developers, data engineers, and analysts\n Present and promote the tool’s capabilities within the organization\n  \nQualifications\n Master's degree in areas related to computer science, information technology, or equivalent. \n Strong Python programming skills\n Experience with Git, CI/CD, and/or Data/DevOps. \n At least two years of experience working with large datasets\n Very good skills within the English language, both spoken and written.  Preferred Qualifications\n Experience with SQL, Databricks, Kubernetes, Crossplane and Docker \n Understanding of databases and time-series data\n \nWho are you? We are looking for you who have patience when handling recurring user questions. A love for puzzles and problem-solving along with strong communication skills. To suceed in this role we belive you are confident in presenting technical solutions to different audiences and enjoy teaching and supporting others.\nWe look forward to receiving your application!",
        "url": "https://combine.teamtailor.com/jobs/6586184-software-developer-data-engineer?promotion=1663329-arbetsformedlingen",
        "published": "2025-10-09T11:31:12",
        "deadline": "2026-03-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30074588",
        "title": "Senior full stack developer",
        "employer": "CetaSol AB",
        "location": "Göteborg",
        "description": "Senior Full Stack Developer – Cetasol \n\n\nLocation: Gothenburg \nJob Type: Full-time \nAbout Cetasol \n\n\nCetasol is an innovative AI startup dedicated to optimising marine operations and enhancing sustainability in the maritime industry. Our cutting-edge solutions help vessel operators improve efficiency, reduce fuel consumption, and minimize environmental impact. As we continue to grow, we’re looking for a skilled Senior Full Stack Developer to join our team and help shape the future of marine technology. \n\n\nYour Role \n\n\nAs a Senior Full Stack Developer at Cetasol, you will be a key player in designing, developing, and maintaining our software solutions. You will work closely with our product and data science teams to create a seamless user experience and scalable architecture. \n\n\nResponsibilities \n\n\nDevelop and maintain front-end and cloud applications for our AI-driven solutions. \n\n\n\nDesign, implement, and optimize APIs and microservices. \n\n\n\nCollaborate with UX/UI designers to create intuitive and visually appealing interfaces. \n\n\n\nEnsure high performance, responsiveness, and security of applications. \n\n\n\nWork with cloud services and containerized deployments (AWS, Docker). \n\n\n\nConduct code reviews, write tests, and ensure code quality. \n\n\n\nTroubleshoot, debug, and optimise applications for performance and scalability. \n\n\n\nRequirements \n\n\nExperience & Core Skills \n\n\n5+ years of professional experience in full-stack development. \n\n\n\nStrong proficiency in TypeScript (React, Node.js) and/or Python (FastAPI). \n\n\n\nSolid understanding of RESTful APIs and microservices architecture. \n\n\n\nExperience building and deploying containerised applications with Docker. \nFamiliarity with Agile methodologies and collaborative team environments. \n\n\n\nCloud & Infrastructure \n\n\nHands-on experience with cloud databases (DynamoDB, Timestream, PostgreSQL, etc.) and cloud services (AWS Lambda, Cognito, S3, etc.). \n\n\n\nProven expertise in Infrastructure as Code (IaC), ideally with AWS CDK. \n\n\n\nKnowledge of DevOps practices, including CI/CD pipelines and automated deployments. \n\n\n\nNice to Have \n\n\nExperience with real-time data visualisation and mapping. \n\n\n\nBackground in performance optimization and scalable system design. \n\n\n\nFamiliarity with monitoring and logging tools for cloud-native applications (DataDog). \n\n\n\nWhat We Offer \n\n\nA chance to work on cutting-edge AI-driven solutions for the maritime industry. \n\n\n\nA collaborative and dynamic startup environment. \n\n\n\nOpportunities for professional growth and development. \n\n\n\nFlexible working arrangements (remote/hybrid options available). \n\n\n\nHow to Apply \n\n\nIf you're passionate about technology and sustainability and want to make a real impact in the maritime industry, we'd love to hear from you! \n\n\nJoin Cetasol and help us shape the future of sustainable marine operations! \n\n\n \nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://www.linkedin.com/hiring/jobs/4304203945/detail/",
        "published": "2025-09-26T09:24:25",
        "deadline": "2025-10-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30047682",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAt AFRY, we develop and deliver cutting-edge solutions for vehicles, systems, functions, and attributes to clients in the automotive industry. Our customers include both established OEMs, innovative startups, and Tier 1 system suppliers.\nWe are currently seeking experienced software developers who are passionate about shaping the next generation of infotainment systems based on Google’s Android Automotive OS.\nAs an Android Automotive Software Developer, you will work on software development across both application and native layers of the Android stack for infotainment systems. You will collaborate closely with UX designers and other stakeholders to define a seamless, end-to-end user experience. You’ll be part of a team with full responsibility—from design and architecture to documentation, development, verification, and validation. At AFRY, you’ll also have the opportunity to contribute actively to innovation by generating new ideas and solutions.\n\n\nQualifications\n\nWe are looking for candidates with the following background and skills:\n\nM.Sc. in Software Engineering or equivalent experience gained through years of professional practice\nSolid experience in Android application and platform development, including work with AOSP and the AOSP build system\nFamiliarity with modern app architectural patterns such as MVP, MVVM, and layered architecture\nExperience working with automotive communication buses\nStrong programming skills in Android Java, C++, and Python\nGood knowledge of Android testing frameworks such as JUnit, Espresso, and Mockito\nExcellent command of English, both written and spoken\nMandatory qualifications:\nProven experience working with a Swedish OEM within the automotive industry\nCurrently residing in Sweden today\n\nMeritorious qualifications:\n\nExperience in Embedded Linux development\nFamiliarity with Continuous Integration (CI) tools and workflows\nDevOps\nPossession of a Swedish B-class driving license\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: October 2025\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000082865365-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-09-19T10:29:11",
        "deadline": "2025-11-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29943074",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-08-25T09:05:40",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30097905",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Minst 5 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt.  \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 1 november. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg?promotion=1653193-arbetsformedlingen",
        "published": "2025-10-02T13:04:31",
        "deadline": "2025-11-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30097348",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 1 november.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1652938-arbetsformedlingen",
        "published": "2025-10-02T11:26:22",
        "deadline": "2025-11-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30186205",
        "title": "Engineering Graduate Program 2026 - System Verification Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\n\nWork with the latest technologies to shape tomorrow's society\nImagine yourself working with some of the sharpest and most creative brains in the transport and infrastructure industry, developing cutting-edge technologies and sustainable transport solutions that will change the future of society.\nWe are passionate about what we do; we aim for high performance and thrive on teamwork. We are almost 100,000 colleagues united around the world by a culture of care, empowerment, and inclusiveness, where each one of us can give our very best.\n\n\nAre you ready to join the Engineering Graduate Program?\nThe Engineering Graduate Program at Volvo Group Trucks Technology is a global 12-month program where you are offered the perfect mix of on-the-job learning and diverse training modules. You will get the chance to use and develop your technical and creative engineering skills, while gaining valuable experience working with real products on real business challenges. During the year you will engage in activities that will help you grow professionally and personally, developing strong communication and collaboration skills. \nBesides your manager, who will guide and support you in your daily job, you will have a supportive network of peer graduates, colleagues across the globe, and senior leaders to help you excel. We hope you will learn as much from us as we will from you.\n\n\nShape the Future of Safe & Efficient Driving and Services with Us\nAbout the Team\nWe support the Volvo Group engineering community with cutting-edge tools, verification methods, and data-driven insights. The Data & Release substream is a dynamic and newly formed organization within Safe & Efficient Driving (SED) at Volvo Group Trucks Technology (GTT). Our Test and Release team is at the forefront of verifying and validating the main ECUs that enable ADAS functionalities—and beyond. As vehicle functions become increasingly distributed across multiple ECUs, our challenge is to develop new verification frameworks to ensure comprehensive HIL (Hardware-in-the-Loop) and SIL (Software-in-the-Loop) testing for all our end-user functions.\n\n\nHow you will make an impact \nAs an Engineering Graduate in the Data & Release, you will:\n•  Participate in the verification and validation of ADAS and other vehicle functionalities at both HIL and SIL levels.\n•  Contribute to the development of new verification frameworks to ensure full coverage of our Functions.\n•  Leverage data-driven approaches to create dashboards that visualize software performance and quality.\n•  Automate data collection and analysis tasks, enabling the team to focus on insights and improvements rather than manual data handling.\n•  Collaborate with cross-functional teams to drive continuous improvement in our verification processes.\n•  Gain hands-on experience with state-of-the-art tools and methodologies in a global, innovative environment.\n \nWe believe that you are driven, curious, and eager to learn. You thrive in a collaborative environment and are passionate about making a difference through technology and data.\n\n\nYou meet the following requirements: \n•  An M.Sc. degree in Computer Science, Electrical Engineering, Data Science, Systems and Controls, or a related field.\n•  Strong interest and/or experience in verification and validation, especially HIL/SIL testing.\n•  Good programming skills (Python, C++, or similar) and familiarity with data analytics tools (e.g., MATLAB, Power BI).\n•  A passion for automation and data-driven development.\n•  The ability to work in an international context and willingness to travel.\n\n\nTo qualify for the Engineering Graduate Program, you’ve completed a master’s degree prior to the start of the program but not more than 18 months ago. You should not have more than two years' full-time working experience in the field prior to starting. You also need to be fluent in English, both written and verbal.\n\n\nWhat’s in it for you?\nOur Engineering Graduate Program starts in August 2026, and you will be offered a permanent position at Volvo Group Trucks Technology with placement in Sweden, Gothenburg. These are some of the benefits of joining our program:\nAn opportunity to work with the latest technology. \nAn exciting and global working environment with experienced colleagues. \nPossibility to gain international experience through a short-term assignment abroad. \nA competitive salary and permanent position from day one. \nVarious workshops and seminars designed to help you grow into your future career at Volvo Group. \nThe possibility to shape your own career with endless career opportunities.\n\n\n\nThe application process\nThe journey begins! An email confirmation will be sent when you submit your application. After this, it is still possible to update your personal profile by logging into your account. The hiring team will review your application together with the hiring manager. Shortlisted candidates will be contacted with information about the following steps.\n\n\nLast application date: November 23rd, 2025.\n\n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://jobs.volvogroup.com/job-invite/25706/",
        "published": "2025-10-24T13:42:45",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30185472",
        "title": "Product Development Leader(7)",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:We are thrilled to offer the position of Product Development Leader at Ericsson. This role is essential to maintaining our competitive edge as it relates to technology management, fostering an innovative culture, and ensuring the right balance of quality, time, scope, and cost for our products. A Product Development Leader at Ericsson takes on a variety of leadership tasks within product development, teaching, coaching, challenging, and aiding in individual, team, and organizational development. The successful candidate will be pivotal in the execution of development strategies and plans. We value an environment that embodies lean and agile methodologies, promoting continuous learning and innovation. Learn more about the role, read more\nWhat you will do:- Drive Ericsson's technical direction to maintain technology leadership.\n- Advocate for lean and agile principles, mentoring teams and individuals.\n- Execute and oversee development strategies, keeping quality, time, scope, and cost in mind for products.\n- Take charge as a leader within product development, including roles such as line managers, program managers, and project managers.\n- Foster an innovative and learning culture within the organization.\n- Engage in learning and development opportunities to maintain expertise in your role.\nThe skills you bring:- Business Understanding.\n- Negotiation.\n- CCD CAPO Integration.\n- Communication.\n- CEE10 Integration DGS.\n- CEE10 Upgrade DGS.\n- Program Management.\n- SDI3 Upgrade.\n- SDI3 Solution Design.\n- GDCE.\n- Coaching and Mentoring.\n- Change Management.\n- Project Management.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43738731",
        "published": "2025-10-24T12:25:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30185470",
        "title": "Sr Specialist Element Management & OAM",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:We are thrilled to offer the position of Product Development Leader at Ericsson. This role is essential to maintaining our competitive edge as it relates to technology management, fostering an innovative culture, and ensuring the right balance of quality, time, scope, and cost for our products. A Product Development Leader at Ericsson takes on a variety of leadership tasks within product development, teaching, coaching, challenging, and aiding in individual, team, and organizational development. The successful candidate will be pivotal in the execution of development strategies and plans. We value an environment that embodies lean and agile methodologies, promoting continuous learning and innovation. Learn more about the role, read more\nWhat you will do:- Drive Ericsson's technical direction to maintain technology leadership.\n- Advocate for lean and agile principles, mentoring teams and individuals.\n- Execute and oversee development strategies, keeping quality, time, scope, and cost in mind for products.\n- Take charge as a leader within product development, including roles such as line managers, program managers, and project managers.\n- Foster an innovative and learning culture within the organization.\n- Engage in learning and development opportunities to maintain expertise in your role.\nThe skills you bring:- Business Understanding.\n- Negotiation.\n- CCD CAPO Integration.\n- Communication.\n- CEE10 Integration DGS.\n- CEE10 Upgrade DGS.\n- Program Management.\n- SDI3 Upgrade.\n- SDI3 Solution Design.\n- GDCE.\n- Coaching and Mentoring.\n- Change Management.\n- Project Management.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43738721",
        "published": "2025-10-24T12:25:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30183166",
        "title": "Product Manager, Sensor Platform",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Passionate about making ideas a reality? Join our welcoming world of tech and let your ideas soar. \n\n \n\nWe are now looking for a Product Manager to join our team in Gothenburg.\n\n \n\nYour Role\n\nOur sensor systems are at the forefront of innovation, and we are looking to expand our team with a dynamic Product Manager to oversee the development of our sensor antenna platform portfolio. This role is crucial for driving the technical direction and ensuring our products meet the highest standards of innovation, market, and customer needs.\n\n \n\nAs a Product Manager, your main responsibilities will include:\n\n * Developing and maintaining technical roadmaps that align with our strategic goals and market opportunities for the entire platform portfolio.\n * Collaborating closely with cross-functional teams, including software engineers, systems architects, and product management, to deliver cutting-edge solutions.\n * Acting as a mentor and support for engineers, fostering a culture of continuous learning and development.\n * Representing the platform portfolio's technical solutions to both internal stakeholders and external customers, ensuring clear communication and alignment.\n * Overseeing the integration and interoperability of the antenna platform, compute platform, and sensor application software to create a cohesive and innovative product offering.\n\n \n\nYour Profile\n\nWe are looking for a driven and experienced professional with a strong background in product management and a deep understanding of both technology and business needs.\n\nKey qualifications include:\n\n * A degree in Engineering, Computer Science, or a related field, preferably with a focus on software and hardware development.\n * Proven experience in product management, software development, hardware development or a similar role.\n * Excellent analytical and leadership skills, with the ability to work both independently and as part of a team.\n * Passion for innovation, both regarding technology and business models\n * Strong communication skills in Swedish and English, both written and verbal.\n * Experience with software and hardware development methodologies, requirements management, and technical documentation.\n * A genuine interest in technology and a customer-centric approach.\n * Knowledge of antenna systems, high-performance compute systems, and software integration.\n * Experience from the defense or aerospace industry.\n\n \n\nWe value diversity in our team and place importance on both your competencies and who you are as a person. If you are passionate about driving innovation and have the skills to lead our platform portfolio to new heights, we want to hear from you.\n\n \n\nDo you imagine a career that constant stretches your capabilities and offer you the opportunity to work with technologies of the future? We offer an exciting opportunity to join a global company with a mission to make the society safer.\n\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.\n\n \n\n \n\nWhat you will be part of\n\nBehind our innovations stand the people who make them possible. Brave pioneers and curious minds. Everyday heroes and inventive troubleshooters. Those who share deep knowledge and those who explore sky-high. And everyone in between. ​\n\n \n\nJoining us means making an impact together, contributing in our own unique ways. From crafting complex code and building impressive defence and security solutions to simply sharing a coffee with a colleague, every action counts. We encourage you to take on challenges, to create smart inventions and grow in our friendly and tech-savvy workspace. We have a solid mission to keep people and society safe.\n\n \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,100 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here\n\n \n\nIf you are interested in what benefits you can take part of as an employee at Saab in Sweden, you can read more about them her\n\nDo you want to get to know our business and our people a little bit better? Here you can find some stories told by our employees.\n\nKindly observe that this is an ongoing recruitment process and that the position might be filled before the closing date of the advertisement.",
        "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjI4MzgzLjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
        "published": "2025-10-24T08:20:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30175946",
        "title": "Software Lead at Colibrium Additive",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Would you like to lead software development for a physical product in a global, cross disciplinary environment?\nAt Colibrium Additive, part of GE Aerospace, we’re on a mission to bring the transformative power of additive manufacturing to industries around the world. We’re now looking for a Software Lead to join our Gothenburg team: A hands-on technical leader who thrives on guiding others, writing great code, and improving complex systems that drive real, physical machines.\nIn this role, you’ll lead the development of the software and services that power our electron beam–based additive manufacturing machines. Our main technologies are C# .NET and Python, with additional components in C++. You’ll work both strategically and operationally: setting direction, supporting your teammates, and ensuring our software is reliable, scalable, and ready for the future. You’ll work in a cross disciplinary, global team where software, hardware, and process expertise come together, offering a unique chance to learn and grow while contributing to cutting-edge additive manufacturing technology. You will dig into existing solutions, understand their logic, and help modernize and extend them. You’ll also take part in 3rd line support and root cause analyses, ensuring that we learn from challenges and strengthen our products over time.\n\nKey responsibilities include:\n\n• Write clean, efficient, and scalable code in C# and C++, with a focus on geometric data processing and distributed systems.\n\n• Contribute to software design and ensure that architectural principles are implemented effectively in the codebase.\n\n• Develop and maintain robust client–server communication interfaces, ensuring performance and reliability.\n\n• Work hands-on in an Agile/Scrum team, translating requirements into practical and maintainable solutions.\n\n• Collaborate closely with global and other software teams to shape technology roadmaps for our EBM (Electron Beam Melting) software products.\n\n• Act as a spokesperson for the software team within the global organization, communicating progress, challenges, and future initiatives.\n\n• Provide technical leadership and guidance to a software development team, helping define and deliver high-quality solutions.\n\n• Mentor and coach other developers, fostering a culture of technical excellence and continuous improvement.\nAbout You\nYou have a degree in Computer Science or another relevant education, and probably 3-5 years of professional experience in software development, ideally in a role where you’ve provided both technical and functional leadership. You’re confident working in C# .NET and you have a solid understanding of the software development lifecycle, including modern practices like Agile, CI/CD, secure coding, scalability, and testing techniques. You communicate fluently in English and enjoy working in international teams. You’re a strong collaborator with great communication and influencing skills, able to align people and ideas across different disciplines and locations.\n\nExperience from additive manufacturing or other industrial machinery environments is a strong advantage. Experience with C++ and Python is also meritorious. You’re curious, approachable, and open, someone who enjoys learning, sharing knowledge, and helping others grow. Familiarity with OPC UA, WebSocket, or other industry-standard communication protocols is valuable. \n\nApply now!\nIn this recruitment process Colibrium Additive collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Talent Advisor Marcus Hultberg on +46 72 366 49 43, or Johanna Engblom on +46 73 320 09 00. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application, the 16th of November. \n\nThis position requires that you already have the legal right to work in Sweden (e.g. citizenship, residence permit, or work visa). No relocation assistance is provided.\nAbout Colibrium Additive\nAt GE Aerospace, we invent the future of flight, lift people up, and bring them home safely. We are a world-leading provider of jet engines, components, and integrated systems for commercial and military aircraft. At GE Aerospace, respect for people is core to our culture and commitment to FLIGHT DECK, our proprietary lean operating model. We attract, develop, and retain industry-leading talent from all backgrounds and cultivate communities where people are respected and empowered to reach their fullest potential. For the people of GE Aerospace, their work isn't just a job. It's their passion and purpose. We work and win as one team, accountable to each other and our customers, and we are always finding a better way to climb higher together. We were meant to fly.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=303204&ref=platsbanken",
        "published": "2025-10-22T13:27:56",
        "deadline": "2025-11-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30171400",
        "title": "Technology Project Leader",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nJoin Our Team as a Technology Project Leader in Electric & Electronics \nAre you passionate about shaping the future of propulsion systems? We are at the forefront of embedded system development for electrical, hydrogen, and conventional powertrains, and we’re now seeking an experienced Technology Project Leader to lead our Electric & Electronics initiatives.  \nAbout the Role: \nIn this key position, you will drive the entire development process from initial planning and strategic anchoring to executing solutions that not only meet immediate project needs but also enable scalable, cross-project platform solutions. You will be a vital part of the team responsible for the Propulsion Electrical System Platform, working closely with cross-functional teams to ensure innovative, efficient, and future-proof solutions. \nYour responsibilities will include leading system solution investigations, planning development activities, and tracking progress. A significant part of your role involves networking with stakeholders across projects, supporting the development of systems built on our platform, and collaborating with our agile hardware and software teams.  \nWho We Are: \nWe are a dynamic team of system engineers dedicated to developing the most efficient embedded electrical systems. Our platform is used by over 400 software and hardware engineers worldwide to create cutting-edge features for our customers. We operate in a fast-paced environment, constantly pushing the boundaries of innovation. \nKey Activities: \nDefine and capture development needs for the Propulsion Electrical System Platform \nLead the identification and design of platform solutions \nPlan, document, and oversee development activities \nMonitor project progress and ensure timely delivery \nIdentify and resolve technical and development obstacles \n\nWe believe that you have: \n5+ years of experience in embedded systems development \nHands-on experience with electronic hardware and/or software \nExcellent communication skills, both oral and written \nThe ability to work independently and collaboratively with global teams \nA proactive, open-minded, structured approach and is driven to lead \n \n\nPrevious experience with Volvo Propulsion software development is highly valued \nEducational requirement: \nBachelor’s or Master’s Degree in Engineering \nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": null,
        "published": "2025-10-21T14:13:25",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30159751",
        "title": "Embedded Infotainment Platform Software Engineer (C++)",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Description\nSW development is focused on:\n• Infotainment Head Unit Platform (IHU/DHU/UXC) on Android Automotive (both for iCUP and SPA platforms)\nSW development within company is developed in-house with collaboration with our partners Google, Aptiv, Qualcomm and QNX.\nDevelopment of the next generation of SPA Infotainment solution based on Android Automotive OS with QNX hypervisor as the foundation.\nRequirements\n• C++ Proficiency: High proficiency in C++, particularly for embedded and automotive systems, with experience adhering to modern coding standards.\n• QNX, AAOS, AOSP and AOSP Build Process: Build systems such as CMake, Makefiles, Bazel.\n• Operating Systems Expertise: Knowledge of Real-Time Operating Systems (RTOS) like QNX, including practical experience with the POSIX API, multithreading, communication, and synchronization.\n• Android Automotive Development: Experience developing on the Android Automotive platform using C++, AIDL/HIDL. Bonus for Kotlin, and/or Java.\n• Software Testing & Automation: Strong skills in writing and maintaining unit, component, and integration tests, with proficiency in Python and testing frameworks like pytest.\n• Automotive Testing: Vehicle testing, log captures, and log analysis.\n• CI/CD & DevOps: Hands-on experience with building and maintaining CI/CD pipelines under HIL and SIL is desirable.\n \nOther Expectations\n• Relevant technical education and background\n• Have strong English skills (Swedish is a bonus), with excellent communication skills\n• Team player who take ownership for the team’s deliveries, with a proactive commitment to delivering high-quality software\n• Collaborative mindset, and can give and receive constructive code reviews\n• Have an open mind about different Agile Processes and can help the team adapt its ways of working\n• Enjoy learning new skills, languages, and toolsets (including generative AI)\n• Domain Knowledge: Previous professional experience in automotive software development is desirable.\n• Driven, adaptable, and eager to take initiative in problem-solving and process improvement\nJob responsibilities\nSupport teams in developing and designing for Platform upgradeability. Find technical solutions fulfilling complex requirements utilizing both inhouse and Android/QNX technical solutions.\nAssure high level of quality through test automation (maintaining inhouse Python software test tool, integrate with CI systems to test upgrades from previous releases, enable other teams in verifying their components integrations with platform updates.",
        "url": "https://www.globallogic.com/careers/embedded-infotainment-platform-software-engineer-c-irc272476/",
        "published": "2025-10-17T14:18:30",
        "deadline": "2025-10-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30131070",
        "title": "Embedded Software Application Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nWho are we?\nThe Vehicle Motion & Thermal Management Technology stream leads and develops complete vehicle motion-, energy- and thermal control solutions for Safe, Sustainable and Efficient transportation.\nOur technology scope is broad and involves advanced mechatronic systems related to motion and optimization of energy in our vehicles.\nThermal Management is a department within Vehicle Technology responsible for developing, delivering, and maintaining an optimized complete thermal management system. This is including cab climate and vehicle cooling & heating systems for ICE, BEV, and Fuel cell vehicles within the Volvo Group. We are responsible for the thermal management platform from cradle to grave, both Hardware and Software. The teams within thermal management are located in Gothenburg and Bangalore and have close cooperation with the sites Greensboro and Lyon. To succeed we need to understand the final customer needs and apply our knowledge to develop technical concepts and solutions that satisfy customer and business needs.\nWe are now looking for an experienced, self-driven Embedded Software Engineer to strengthen our team, Thermal Supply Product & SW. Our team is responsible for the design and development of the application SW, controlling the complete thermal management system, and the calibration and tuning of it. Meaning that we are responsible for mainly the Refrigerant loop, the Fan ,and the Coolant loop functionality covering all sites and truck brands (among more) within the Volvo Group.\nWhat will you do?\nAs an Embedded SW Application Engineer you plan your work according to the agile SAFE principals together with your team. The main responsibility of the team is the development of the Thermal supply sub-system mainly consisting of Coolant Loop, Fan, Refrigerant loop Controller, acting as a central enabler in the thermal management system, realizing functionality that has clear customer impact. Within the role you will work with both new development towards future feature/function growth and with maintenance improving the system already on the market. You will have the opportunity to collaborate a lot with many surrounding teams within and outside of our direct organization. Today we have a very close collaboration with EMOB, testing facilities, testing teams, workshops, and more.\nWho are we looking for?\nWe believe you are a person who is driven, business-oriented and innovative. You are interested to solve problems in a structured and effective way. You are a person with a genuine interest in technology as well as people. You feel accountable for the tasks you take on. You are self-motivated by driving changes in a complex environment.\nWe also think you have:\n  *  An open mindset to learn & grow. Share your knowledge with others\n  *  Good networking skills on a local and global basis and you have an ability to understand and accept cultural differences\n  *  Good communication and presenting skills both in text and verbally (English)\n\nRelevant Experience:\n  *  Master’s Degree in Computer, Electrical/Electronic or similar\n  *  5-10 years of Embedded SW development experience\n  *  Experience with control strategy and SW verification\n  *  Experience of functional verification and system tuning/calibration\n\nMeritorious to have:\n  *  C or CE Truck Driving License\n  *  Knowledge of Automotive Thermal management system\n  *  Experience in SIL/MIL/HIL testing\n  *  Experience in Matlab, Simulink, TargetLink, Jenkins, Embedded Coder, C, C++, Python\n  *  Knowledge in planning, performing, and analyzing results from rig or vehicle testing\n\nReady for the next move?\nJoin us in our mission to create a better tomorrow! The applications will be screened continuously, so don’t miss your chance to be part of this exciting journey. Apply now!\nFor questions about the process, contact Smita Shree, Talent Acquisition Partner, at smita.shree@volvo.com\nHiring manager: Sebastian Palm, sebastian.palm@volvo.com                                                       \nLast application date: 31st Oct’2025 \nPlease note: This ad is valid for more than one positions.                                                           \nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43708794",
        "published": "2025-10-10T12:25:11",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30126240",
        "title": "Senior Javautvecklare till teknikbolag i framkant – Etteplan Göteborg",
        "employer": "Etteplan Sweden AB",
        "location": "Göteborg",
        "description": "På Etteplan samlar vi människor och teknik för att förändra saker till det bättre. Vi är ett internationellt teknikbolag med stark lokal närvaro i Sverige —här får du arbeta i team med riktigt vassa kollegor och kunder i framkant.\n\n\n\nRollen i korthet\n\nVi söker en Senior Javautvecklare  som vill bygga robusta, skalbara lösningar för komplexa system i en miljö där driftsäkerhet, prestanda och säkerhet är centrala. \n\nDet här kommer du att göra\n\n - Designa, utveckla och optimera Java mjukvara inom sensor utveckling\n - Sätta upp och förvalta CI/CD‑flöden för snabb och säker leverans\n - Arbeta med testautomatisering och kvalitetssäkring end‑to‑end\n - Delta i systemintegration och verifiering av komplexa system\n - Samarbeta nära med olika utvecklingsteam\nDin profil\n\nVi söker dig som är lösningsorienterad, strukturerad och har ett genuint teknikintresse. Du trivs i en miljö där du får ta ansvar och bidra till både tekniska lösningar och teamets utveckling.\n\nVi tror att du har:\n\n\n - Civil- eller högskoleingenjörsexamen inom data, IT, elektro eller motsvarande\n\n - 5–10 års erfarenhet av Java-utveckling i större/systemkritiska miljöer\n\n - God vana av CI/CD och testautomatisering\n\n - Förståelse för mikroarkitektur, API:er och systemintegration\n\n - Mycket goda kunskaper i svenska och engelska\n\nMeriterande erfarenheter:\n\n\n - Sensor- eller telekomsystem\n\n - Säkerhetsklassade miljöer eller informationssäkerhetsarbete\nSäkerhet & sekretess\n\nFör den här rollen krävs genomförd och godkänd säkerhetsprövning samt svensk medborgarskap. \n\n\n\nVi ser fram emot att höra från dig! Ansök redan idag och låt oss tillsammans skapa innovativa lösningar för en smartare framtid.\r\n\n\nEtteplan är ett ledande ingenjörsföretag som formar framtidens industrier. Med en dynamisk och inkluderande arbetskultur, erbjuder vi spännande uppdrag, mångfaldiga kundrelationer och en miljö där din ambition får blomma. Vi är över 700 teknikspecialister i Sverige som brinner för teknik och människor. Tillsammans formar vi framtidens innovationer och utveckling inom en global affärsmiljö. Hos oss finns många möjligheter för dig som vill växa och utvecklas i en framåtsträvande organisation.",
        "url": "https://emp.jobylon.com/applications/jobs/315749/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-10-09T13:49:51",
        "deadline": "2025-11-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30110481",
        "title": "Technical Lead ",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continuous grow Tata Technologies Nordics AB is now looking to recruit a Technical Lead to join our team in Gothenburg, Sweden.\nThe role\nWe’re looking for a Technical Lead in CI/CD to support software development in the automotive embedded systems space. Your main job is to build and improve automated pipelines for software build, test, and deployment. You'll work closely with developers and testers to make sure everything runs smoothly and efficiently.\nKey Responsibilities\nDesign and maintain CI/CD pipelines to automate software builds, testing, and deployment.\nTroubleshoot and fix issues in the CI environment (e.g., Jenkins, Docker).\nCollaborate with development and QA teams to ensure effective integration and delivery processes.\nWrite scripts and tools (mainly in Python and Groovy) to improve automation and reduce manual work.\nContinuously optimize build and test workflows for speed and reliability.\nHelp maintain and manage tools like Jenkins, Gerrit, Artifactory, and Docker.\n\nRequirements\nStrong experience in CI/CD, especially for embedded software.\nHands-on knowledge of:\nJenkins, Docker,\nGerrit\nArtifactory\nLinux and WSL (Windows Subsystem for Linux)\nScripting skills in Python and Groovy.\nExperience with automated build systems and software deployment workflows.\nGood problem-solving and communication skills.\nBachelor’s degree in computer science, Engineering, or related field.\n\nMeritourius \nExperience with safety-critical systems or AUTOSAR Classic.\nBackground in C programming.\nKnowledge-sharing mindset and team spirit.\nProactive, self-driven, and quality-focused attitude.\n\nIf you are passionate about bringing innovation to the projects you work on and want to join a global company, then this is the place for you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-10-06T14:25:25",
        "deadline": "2025-11-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30082181",
        "title": "Master Thesis 2026",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "Step into a community of innovators\nTechnology here is always applied, tested and built to make a difference. We design solutions in automation, electromobility, connectivity and marine systems that bring lasting value to our partners and customers. Every project combines sharp expertise with a hands-on problem-solving mindset.\nDoing your thesis with us means more than a project. You become part of a engaged community of engineers who support each other, move fast and always work with purpose. Your ideas matter, your skills are trusted and your contribution makes real impact. \nWhat we offerWe want your master thesis to be both challenging and rewarding. Here you’ll get:\n Real-world projects with direct industry impact\n Guidance from experienced engineers who are passionate about their craft\n An open and collaborative culture where your ideas matter\n A fun workplace with room for both personal and professional growth\n Company benefits such as breakfast, fika and two hours of paid weekly exercise during work hours\n Areas of exploration\nWe offer master thesis projects in fields such as:\n Computer vision\n Cloud & Backend solutions\n Cybersecurity\n E-mobility solutions\n Power electronics\n Machine learning & AI\n Sensor fusion\n Marine autopilot systems\n Android/Linux operating systems\n \nGot your own idea? We’d love to hear it.\nWho you areYou’re probably studying mechatronics, mechanical engineering, electrical engineering, physics engineering or computer science. What matters most is your passion for technology, your curiosity, and motivation to make technology matter.\nHow to applySend us your CV along with a short description of your background and your thesis goals. Applications are reviewed continuously so don’t wait too long to get in touch.",
        "url": "https://careers.cpacsystems.se/jobs/6509896-master-thesis-2026?promotion=1646989-arbetsformedlingen",
        "published": "2025-09-29T11:36:41",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30081527",
        "title": "Senior Embedded Software Developer",
        "employer": "Allgon AB",
        "location": "Göteborg",
        "description": "Who We Are\nAllgon is a leading manufacturer of wireless machinery control systems, delivering customized solutions to companies across the industrial sector. Our customers engage with us through our subsidiaries, Tele Radio, Åkerströms and Sistematica. We are passionate about developing industrial remote control solutions that enhance safety and efficiency worldwide.\nOur R&D department values fast decision-making, open communication, and a flat organizational structure while offering strong resources and excellent development opportunities. We have a team of around 50 professionals working across multiple locations, including Gothenburg, Björbo, Malaga, China and Vietnam.\nAbout the Role\nWe are looking for an additional Senior Embedded Software Developer to join our embedded software development team. As a key member of our team, you will be partly responsible for ensuring that our software is designed for scalability, maintainability, and efficiency, enabling multiple teams to work seamlessly on development. This is a strategic and hands-on role, involving direct software development, requirements management, and architectural best practices. The role is based in the head office in Gothenburg and reports to the R&D Embedded Manager.\nKey Responsibilities:\nRepresent embedded software in project core teams and act as a technical expert across projects.\nDrive the development of specifications, design, and implementation of software solutions.\nProvide accurate time and resource estimations for software development.\nEnsure adherence to software architecture and design standards.\nLead development tasks and mentoring junior developers.\nCollaborate with product managers, project managers, and other engineers to align software solutions with business needs.\nAnalyze and define technical requirements, considering cost, performance, usability, and customer needs.\n\nWhat We’re Looking For\nWe are looking for a highly skilled embedded software developer who thrives in a collaborative and technical environment. The ideal candidate is passionate about software architecture and has a strong ability to develop scalable and maintainable embedded software solutions. This role requires strong organizational skills with a focus on quality and attention to detail. The candidate should have a customer-focused mindset with the ability to translate requirements into technical solutions. Additionally, we seek someone who is self-driven and responsible, capable of working independently while leading technical discussions.\nKey qualifications include:\nUniversity degree in Electronics, Computer Science, or a related field, or extensive hands-on experience in software engineering.\n5+ years of experience in embedded software development, including requirement management, architectural design, testing, and automation. Preferably used to C-programming.\nStrong understanding of software development methodologies and structured processes.\nExperience of wirelesses technologies and protocols.\nBasic knowledge of electronics with the ability to read and interpret circuit diagrams.\nExcellent problem-solving skills with a keen eye for technical details.\nFluent in English (written and verbal) and preferably also Swedish.\n\nWhat We Offer\nWork with cutting-edge, high-quality products in a dynamic environment.\nOpportunities for continuous professional growth and career development.\nA challenging and rewarding role within a growing organization.\nCollective agreement, including over 8 extra days off per calendar year through reduced working hours.\n3,000 SEK annually for wellness benefits.\n\nAbout Allgon\nAllgon is a Swedish company specializing in industrial radio control, with a strong track record in wireless technology innovation. Through our brands Tele Radio, Åkerströms and Sistematica, we have built a global presence, employing over 470 professionals and presence in 26 countries.\nWe offer an exciting work environment in a profitable and growing organization with a strong technical focus. Despite our global reach, we maintain the close-knit atmosphere of a smaller company, where every employee has a voice and can influence the projects they work on.\nAt Allgon, sustainability is a key priority—ecologically, socially, and financially. We are committed to attracting passionate individuals who share our vision of a safer, more efficient world through advanced wireless technology.\nJoin us and contribute to building world-class embedded software solutions!\n_____________________________________________________\nThe application deadline is October 31st. Applications will be evaluated on an ongoing basis.\nWe look forward to your application!",
        "url": "https://career.allgon.com/jobs/6162342-senior-embedded-software-developer",
        "published": "2025-09-29T10:36:25",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30075599",
        "title": "Product Cybersecurity Architect",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nAbout us\nOur team, 'Cybersecurity Infrastructure Capabilities' is in the heart of a great transformation. We are a central team within the Volvo GTT consisting of Cybersecurity Architects and Experts. We work with developing cybersecurity infrastructure requirements (also called CS System Specification), supporting teams and continuously improving the product cybersecurity management system (PCSMS). In addition to providing high-level attack analysis and vehicle TARA analysis to support the development of work products in accordance with state-of-the-art standards such as ISO/SAE 21434 and UNECE R155, we also operate in multitenant HPC environments.\nWe are also coordinating the CS work across the whole organization at Group Trucks Technology (GTT). \n\nWhat you will do\nOur mission is to develop and maintain Cybersecurity solutions for our Vehicle platform & infrastructure, both conceptual and Architectural wise. Enable products, managing & governing End-to-End Integrity of cybersecurity solutions in Volvo Group Products. Provide cybersecurity architectural concept and release Cybersecurity infrastructure requirements/ specifications to ensure end-to-end implementation involving various stakeholders. \nThe main responsibility is to ensure Cybersecurity type approval for R155, coordinate the work with technical services and type approval authority.\nWe are therefore looking for Cybersecurity Architects with expertise in various Cybersecurity solutions/concepts who will act as CS Solution Architects.\nAs CS Solution Architect you will focus on technical aspects of security solutions and lead the work with conceptual CS solutions and Vehicle architectural topology. You will write high level cybersecurity attribute requirements and provide guidelines for allocation of requirements on ECU level. You will also have the opportunity to work with the latest cybersecurity solutions according to the state of the art, and collaborate with experts within this domain.\nWho are you?\nYou have a broad technical know-how combined with very good people skills and a strong belief in agile methods. You have a good ability to collaborate across teams in a large, complex organization.\n\nQualifications: \n  *  BSc. or MSc. in Computer Science, Electronics or equivalent \n  *  Experience in at least one of these areas: IT Software/systems, Connectivity or Secure Embedded Software architectural design or cybersecurity concept design.\n  *  Knowledge of connected communication technologies (CAN, Ethernet, Wireless)\n  *  Previous experience of working as CS engineer or CS architect with focus on embedded engineering.\n  *  Deep knowledge on Cybersecurity Concepts & Solutions e.g., Public Key Infrastructure, etc\n  *  Knowledge of TARA execution for complex systems, Security Risk Management and Threat Modelling.\n  *  Knowledge within cybersecurity requirements & system/software engineering.\n  *  Previous experience in secure coding practices and cryptographic algorithms in embedded systems.\n  *  Knowledge of Certificate Life cycle Management, Certificate Authority Management, In-vehicle PKI Implementation is meritorious.\n  *  Experience in agile methods is meritorious\n  *  Experience of working in multitenant (HPC) environments.\n\n\nReady for the next move?\nCurious and have some questions? We have multiple positions open so send in your application and don’t hesitate to reach out to us if you have any questions!\nFor questions about the process, contact Smita Shree, Talent Acquisition Partner, at smita.shree@volvo.com\nHiring manager: Mahshad Mahally, Director Cybersecurity & Functional Safety.\nLast application date: 31st October 2025\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43678135",
        "published": "2025-09-26T11:25:12",
        "deadline": "2025-10-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29995984",
        "title": "PLC Engineer",
        "employer": "Sigma Embedded Engineering AB",
        "location": "Göteborg",
        "description": "Are you interested in sustainability? Do you want to be part of a talented team and work within Industry 4.0? We are now looking for a PLC Engineer for an exciting opportunity!\n\n\nIn the role you will be working with:\nDesign and manage SQL databases to support data-heavy recycling operations.\nDevelop and fine-tune Java-based applications to improve overall system efficiency and user experience.\nWork closely with automation engineers to program and debug PLC systems within recycling facilities.\nEnsure smooth communication and integration between software platforms and hardware.\nContinuously monitor, test, and enhance system stability and performance.\nWe are looking for you with the following skills:\nCapable of collaborating in team settings with clear and effective communication.\nUnderstanding of Industry 4.0 principles and modern technological solutions.\nSkilled in writing SQL queries and managing relational databases.\nAnalytical thinker with a keen eye for detail.\nProficient in Java development and building software applications.\nHands-on experience with PLC coding and knowledge of automated industrial systems.\nFor this role we are looking for a degree in Software Engineering och Computer Science with a few years of working experience.\nFluency in spoken and written Swedish is a requirement.",
        "url": "https://jobs.sigmaembeddedengineering.se/en/jobs/6374245-plc-engineer?utm_campaign=jobs-widget&utm_source=jobs.sigmaembeddedengineering.se&utm_content=jobs&utm_medium=web",
        "published": "2025-09-05T15:30:55",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29889595",
        "title": "Firmware Engineer",
        "employer": "Elektron Music Machines Mav AB",
        "location": "Göteborg",
        "description": "Elektron builds state-of-the-art electronic music instruments with deep functionality and exceptional sonic capabilities. With a track record of iconic products such as the Machinedrum, Octatrack and Digitakt, Elektron has become uniquely positioned in the artist and producer community.\nWe’re now expanding our team, to push the edge of music creation and meet customer demand!\nWith small teams, flat hierarchy, and high emphasis on creativity, Elektron gives room for every idea to be heard! Joining the Elektron team means being trusted in your abilities.\nDo you want to be a part of the team that creates the best electronic music instruments in the world?\nRole Description\nWe are currently looking for a full-time Firmware Engineer to expand the R&D team. As a firmware engineer at Elektron you will work with the complete software design chain; from product ideas, through prototype stages, to released firmwares and updates in future releases.\nThe embedded software team is responsible for all the programmable aspects of the instruments, ranging from digital logic to high level data management. We develop software for products to come, and we continue to improve the software long after they have been released.\nOur instruments have multi-threading real-time operating systems, and may be composed of multiple micro-controllers and digital signal processors. You will be working at the application level, but you are required to interface the operating system at a lower level.\nYou are passionate about writing code which is reliable as well as efficient. You are comfortable working with a large existing codebase. You are self-motivated and have strong problem solving capabilities.\nThis is an on-site position based in Gothenburg, Sweden.\nRequired skills & experience\nMaster of Science in Computer Science, Electrical Engineering, or similar experience.\nSeveral years of experience with C++.\nSome experience with Python.\nExtensive embedded systems design knowledge - choosing components, reading schematics, interacting with hardware.\nGood knowledge about Operating Systems and Real-time Systems.\nGreat problem-solving skills.\nLow-level knowledge: knows about caches, stack/heap, allocation schemes.\nExperience with software architecture and knows how to write maintainable systems.\nKnows Git inside-out and is well familiar with code review.\nGood knowledge of algorithms and data structures.\nA structured way of working, using version control, issue trackers and similar tools.\nSeveral years of working experience in a similar field.\nFluent spoken and written English\nInterest in music instruments (preferably making music)\n\nValued skills\nKnowledge in Rust, Digital Signal Processing, USB communication\nExperience with production testing and a drive for testability.\nExperience with major real-time operating systems such as FreeRTOS, Zephyr etc.\nLow level ARM A/M architecture and ISA knowledge.\n\nWhat we offer\nA dynamic and multicultural workplace where you have the opportunity to make a real impact and take ownership. At Elektron, you’ll experience great team spirit and a warm atmosphere, with music at the heart of everything we do. You’ll work closely with all departments and gain a broad understanding of the company, opening doors for professional development and long-term growth. Along the way, you’ll enjoy regular social events, fresh fruit, free parking, a wellness benefit, and more — all backed by the security of a collective agreement.\nStart: As soon as possible, by agreement\nScope: Full-time, permanent position\nLocation: Banehagsliden 5, Gothenburg\nApplication deadline: October 30, 2025",
        "url": "https://careers.elektron.se/jobs/6147177-firmware-engineer",
        "published": "2025-08-08T10:44:35",
        "deadline": "2025-10-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30187386",
        "title": "AI Growth Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Ride the AI Wave: Become MindArk’s AI Growth Engineer!\nThe AI revolution isn’t waiting for your graduation. If you’ve completed two years of a technical degree (with top grades in math and physics) and find yourself questioning the value of a traditional diploma in a world about to be upended by AI, this is your moment. \nMindArk – the creative force behind Entropia Universe – is hiring an AI Growth Engineer in Gothenburg to help market our virtual universe using cutting-edge AI tools. We want brilliant minds like yours on board now to ride the wave of AI transformation with us.\nStep off the academic treadmill and into a real-world impact role. \nAs our AI Growth Engineer, you’ll apply your technical skills to engineer explosive growth for Entropia Universe. Forget the old marketing playbook – you’ll write new rules, using data, code, and creativity to turn bold ideas into global success stories.\nThis is your chance to work at the crossroads of advanced tech and creative marketing, where marketing is treated as an engineering challenge. You’ll run experiments powered by AI and turn them into real results, helping transform a pioneering virtual world into a global phenomenon.\nWhy Join MindArk?\n• Accelerated Learning: Work with state-of-the-art AI tools on live projects and level up faster than any classroom can offer.\n• Real Impact: See your ideas drive the growth of Entropia Universe in real time and shape a vibrant online community on a global stage.\n• Ahead of the Curve: Be at the forefront of AI-driven marketing in gaming, outpacing what’s taught in textbooks and setting trends instead of following them.\nWe’re looking for ambitious, creative problem-solvers who refuse to settle for “good enough.” If you thrive on innovation and want to be ahead of the curve, join us and make your mark now. Don’t watch the AI revolution from the sidelines – become the engineer driving it.\nReady to launch your career and make history? Apply today to join MindArk’s mission and help us engineer the future of digital marketing. Let’s ride this wave together.",
        "url": "https://career.mindark.com/jobs/6262447-ai-growth-engineer",
        "published": "2025-10-24T15:26:40",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30183385",
        "title": "Director, Biostatistics and Informatics - Discovery Sciences",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you motivated by using your data science skills to drive biological insights and are seeking a role where your expertise can make an extraordinary impact? This is an opportunity to join a dynamic and enthusiastic environment, whilst delivering critical support to drug discovery projects.\n\n \n\nJoin a place built on innovation and creativity. We harness digital, data science & AI to fast-forward our research. Making sure work born in a lab can make a real difference. Every day, impacting patients' lives across the world.\n\n \n\nAs a Director, Biostatistics and Informatics, you'll be part of the Data Sciences & Quantitative Biology department within Discovery Sciences - a global, diverse and delivery focused department where we collaborate to support drug projects aiming to impact patients' lives. In partnership with our experimentalist colleagues and other data scientists, we provide computational analysis and solutions to enable and enhance output from our technical platforms driving our drug discovery efforts. The role is based at our vibrant R&D site in Gothenburg, Sweden.\n\n \n\nWhat you'll do\n\nYou will lead, mentor and develop the team and collaborate across functions to evolve our computational approaches and their drug discovery applications, to drive impact and deepen scientific excellence. We will rely on you to initiate and lead both internal and external collaborations and partnerships to ensure that we are at the cutting edge of technology and innovation.\n \n\nWe truly believe that everyone contributes with a unique set of competence. Your curiosity and passion for personal development combined with support from colleagues, mentors and leaders, will ensure you maximise your potential and contribution, building from your current skills, abilities and experience.\n \n\nEssential for the role\n\nOur team is a highly collaborative group of scientists, working in a constantly evolving technical and scientific landscape. Therefore, you'll have to be comfortable working at a fast pace, with a team-focused approach. You have excellent communication skills and a proactive and delivery-focused approach.\n \n\nRegardless of your current level of leadership experience, you're passionate about supporting your staff and wider colleagues' development, as well as driving your own personal development and maximising your team's and individual contribution to drug discovery.\n \n\nYou also have:\n\n * \n\nPhD, or equivalent, in bioinformatics, mathematics, computer science, statistics, engineering or the life sciences\n * \n\nExpertise in omics, particularly NGS based technologies\n * \n\nExpertise in biostatistics including Frequentist statistics, Bayesian statistics and Design of Experiments\n * \n\nIn-depth experience with drug discovery and AZ R&D disease area priorities and proven experience with impacting drug discovery projects across multiple disease areas.\n * \n\nIn-depth experience with delivering statistical solutions to early drug discovery\n * \n\nIn-depth experience of manipulating and analysing large high dimensionality unstructured datasets, drawing conclusions, defining recommended actions, and reporting results across stakeholders\n * \n\nExcellent written and verbal communication, business analysis, and consultancy skills\n * \n\nExperience in a complex global organization\n * \n\nA track record of people leadership\n\n \n\nDesirable for the role\n\n * \n\nComfortable working in high performance computing or cloud environment\n * \n\nProven track record of publishing relevant results and tools in peer-reviewed journals, conferences, and other scientific proceedings.\n * \n\nExperience in novel methods development and application\n * \n\nExperience in influencing and controlling budgets\n\n \n\nThe successful candidate can operate effectively in a multi-disciplinary research environment. You enjoy teamwork, have a collaborative nature and will be an encouraging colleague to all.\n\n \n\nWork policy\nWhen we put people in the same room, we unleash bold thinking with the power to inspire life-changing medicines. In-person working gives us the platform we need to connect, work at pace and challenge perceptions. That's why we work, on average, a minimum of three days per week from the office. This role is located in Gothenburg, Sweden and is not available for remote work or with travel support.\n\nWhat's next?\nIf this sound like the position and place for you - apply today!\nWe look forward to receiving your application, but no later than November 10, 2025. The interview process will be ongoing, do not hesitate to apply early.\n\nMore information\nFor more information about the position please contact the hiring manager Natalie van Zuydam, natalie.vanzuydam@astrazeneca.com\n\nAdditional information\nOur Gothenburg site: https://www.astrazeneca.com/our-science/gothenburg.html\nLife in Gothenburg: https://www.movetogothenburg.com/ \nAbout AstraZeneca R&D: https://www.astrazeneca.com/r-d.html",
        "url": "https://www.aplitrak.com/?adid=a2Fyb2xpbmEuemluZ21hcmsuNjg4MjMuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2025-10-24T08:57:36",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30182882",
        "title": "Operations Graduate Program 2026 - Digital Transformation Leader",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "During 15 intense and exciting months, our Operations Graduate Program will give you a holistic view of our operational and logistic activities, including both the local and global perspective.\r\n\r\nYou will have a permanent position from day one, with a manager and mentor to support you. You will experience several local and international on the job-rotations and work on business-critical projects developing your competencies for tomorrow. \n\nOur organization\n\nAt Tuve Plant, we are not just building heavy-duty trucks, we are shaping the future of sustainable transportation! Guided by lean manufacturing values, we are proud to be the forefront of innovation, and exciting things are happening all around us. As we embrace industrialization and digitalization, we are pushing the boundaries to create greener, more efficient automotive products. Our internal flows and processes are evolving rapidly with automation and breakthrough technologies are at the heart of our transformation.\n\nThis is us, your new team\n\nWelcome to Digitalization & IT team from Tuve! We are a collaborative, curious, and value-oriented group working closely with production, logistics, engineering, and business units to unlock digital potential in a company where change is gradual and budget-conscious decisions are the norm. We value open communication, resilience, and practical innovation over flashy quick wins.\n\nMain activities and responsibilities: \n\nIn this role, you will have the opportunity to explore and shape innovative Industry 4.0 applications, such as IoT, AI, machine learning, and data management, to bring measurable value to production, logistics, and business processes.\n\nYou will collaborate with cross-functional teams to map and enhance business processes, conduct value stream mapping and gap analyses, and propose practical, cost-effective solutions. Additionally, you will act as a facilitator of change by engaging stakeholders across different departments to build alignment and foster a digital mindset. You will create and manage small-scale pilots or proof-of-concept projects, from scoping to execution, ensuring that the learnings can be scaled. In parallel, you will contribute to shaping product-oriented digital strategies that thoughtfully balance long-term transformation with immediate operational needs.\n\nThroughout the process, you will communicate progress, challenges, and insights clearly, engaging leadership and leveraging data to support decision-making.\n\nWho are you? \n\nWe are looking for a proactive, entrepreneurial graduate with strong interest in AI and digital transformation. You thrive in environments where patience and resilience are required to drive change, and you are comfortable working with low digital maturity operations while inspiring others with new possibilities.\n\nWe believe you bring a strong analytical mindset and a genuine passion for applying data and AI to solve business problems. You are someone who takes initiative, works independently, and drives projects forward despite obstacles. Your ability to navigate uncertainty with adaptability and a clear focus on value creation is one of your strengths.\n\nAn inclusive and collaborative attitude, along with strong facilitation skills, are essential to bring stakeholders together effectively. Your curiosity and eagerness to understand the complexities of vehicle manufacturing are key assets. You have strong communication skills and the ability to present complex topics in a simple and understandable manner. Perseverance and resilience are necessary to drive transformation in a slow-changing, budget-conscious environment. You are a creative problem-solver with a practical mindset, balancing innovation with cost constraints. High energy, curiosity, and a drive to learn and grow within a global manufacturing context are important.\n\nRequired knowledge:\n\n  *  MSc or BSc with strong academic achievements in Computer Science, Data Science, Artificial Intelligence, Industrial Engineering & Management, Information Technology, or a related field. Specialization in AI/ML, Data Analytics, Digital Transformation, Industrial Digitalization (Industry 4.0), or Smart Manufacturing.\n  *  Knowledge of Industry 4.0 concepts (IoT, AI/ML, automation, digital twins).\n  *  Familiarity with data analytics tools (PTC tools, Python, R, Power BI, or similar).\n  *  Understanding of agile methodologies and product-oriented work.\n  *  Ability to perform gap analysis and business process mapping.\n  *  Comfort with stakeholder management and cross-functional collaboration.\n  *  Maximum two years of previous full-time working experience, prior to or after graduation. Work during studies are not included.\n  *  In this truly global program, communication will be in English, hence you need to be fluent in both speaking and writing in Swedish & English.\n  *  Valid work or study permit for Sweden, if not a citizen.\n\n\nCurious, and have some questions?\n\nManager: Priscila Lovato, +46313278005, priscila.lovato@volvo.com\nHRBP: Louise Karlsson, +46 765534974, louise.karlsson.3@volvo.com",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43735676",
        "published": "2025-10-24T02:25:20",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30182874",
        "title": "Finance Graduate Program - Business Controller skilled in Digital Tools",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nThe Finance Graduate Program\nIf you are up for the challenge of developing our future Finance function and want to be a part of the innovative world of Volvo Group, this is the graduate program for you! \nDuring 12 intense months, you will get an end-to-end perspective of our Finance functions and how we co-drive the business, both from a local as well as from a Volvo Group perspective. From day one, you will have a permanent role in one of our organizations, where you will play an active role in daily deliveries. In parallel, you will participate in a number of common training weeks with the other Finance graduates throughout the year, do various job rotations to increase your insights of the Volvo Group and last but not least you will grow as a person. Your professional and personal growth will be supported through individual and team development sessions, mentoring, coaching and feedback. \nYou will take a deep dive into some specific areas of our business, which will help you get a holistic view and build your future career within the Volvo Group. Besides your manager, who will guide and support you in your daily job, you will have a supportive network of peer graduates, colleagues across the globe and senior leaders to help you excel. We hope you will learn as much from us as we will from you! \n\nOur Organization - Volvo Group Digital & IT\n\nVolvo Group Digital & IT is an interesting place to be, especially during periods of change and transformation. We have a clear commitment to enable value creation at scale for the entire Volvo Group. With a new product-centric operating model and digital technologies, we produce digital offerings that are profitable, scalable, and differentiated. At Volvo Group Digital & IT, you will be part of a global and diverse team of highly skilled professionals, who learn continuously and embrace change to stay ahead.  \n\nYour Future Team\n\nOur global Business Control function supports Volvo Group Digital & IT with financial insights that enable sound planning, efficient operations, and informed decision-making. We work closely with colleagues across Digital & IT, Finance, and other functions within the Volvo Group, ensuring a holistic perspective on business performance. In addition, collaboration and knowledge sharing are central to how we operate.\n\nHow you will make an impact\n\nAs a Business Controller, you play a key role in driving financial excellence and supporting the strategic direction of Volvo Group Digital & IT. You will work with follow-up, planning and estimates of IT cost and deliveries as well as providing proactive financial analysis and advice to management, helping guide decisions that strengthen business results and operational efficiency. Beyond traditional controlling activities, you will contribute to the Volvo Group’s digital transformation, supporting initiatives within automation, innovation, and advanced analytics that shape the future of how we work.  \n\nWho are you?\n\nWe are looking for next-generation experts and leaders within the Finance field who want to make a real difference to society. You are passionate about what you do, have a curious mind, and are willing to learn. Just like us, you thrive on teamwork. In this role, you should be able to cooperate with various stakeholders in a multicultural environment.  You have a strategic, long-term mindset and great skills in telling a story based on financial information in a way that is understood and actionable. \nQualifications for this role \n  *  BSc or MSc degree in Finance, Business Administration or similar fields. Meritorious if you have read courses in AI, machine learning and deep learning. \n  *  Excellent analytical skills as well as visualization and communication skills.\n  *  Strong digital literacy, with the ability to quickly adapt to new tools and systems, including AI solutions, and engaged in driving automation through their use.   \n  *  Good knowledge Microsoft Excel and PowerPoint\n  *  Fluency in business English, both spoken and written\n  *  Knowledge in Power BI or SAP are a merit\n  *  You should not have more than two years of full-time working experience prior to, or after graduation, excluding work during studies. \n  *  A valid study or work permit for the country to which you apply (if you are not a citizen)",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43730228",
        "published": "2025-10-24T02:25:17",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30182862",
        "title": "Operations Graduate Program 2026 - Business Controller",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity.\r\n\r\nIf you are up for the challenge of developing our future Operations and want to be a part of the innovative world of Volvo Group, this is the graduate program for you!   \n\nDuring 15 intense and exciting months, our Operations Graduate Program will give you a holistic view of our operational and logistic activities, including both the local and global perspective. You will be working with the technologies of tomorrow, building the products of the future – electric, connected and automated. In parallel, you will grow as a person, through individual and team development sessions.\n\nYou will have a permanent position from day one, with a manager and mentor to support you. You will experience several local and international on the job-rotations and work on business-critical projects developing your competencies for tomorrow. You will take a deep dive into some specific areas of our business such as manufacturing, health and safety, quality, and continuous improvements, while also learning about the end-to-end supply chain, aftermarket parts and our remanufacturing operations. In addition, you will gather with other program participants to take part in trainings and events designed to help you grow into your future career at the Volvo Group.\nWe offer the opportunity for you to be part of our digital transformation, applying new technologies to connect and automate our processes. Together we work with AI, data science, machine learning, circular systems, virtual manufacturing and more, to build our full electric or autonomous products.\n\nIf rotational development, a global set up and designing the world of tomorrow are aspects you are looking for in your next job context, this position might be something for you.\n\nOur organization \n\nTuve Plant, located in Gothenburg at the heart of Volvo, produces premium heavy-duty diesel, gas and electric trucks. Additionally, we produce frame members not only for ourselves but also for Ghent and our knock-down assembly plants. Furthermore, we are the introduction plant for all new models for Volvo Brand, meaning we are first out!\n\nThis is us, your new team\n\nHere at Tuve Plant, we are 2800 employees, so come join our Business Controller Team where we manage all financial aspects of the operations.\n\nWe deliver on our promises. At Tuve we are a curious team, work with passion and embrace challenges to stay ahead. We work KPI oriented, both in goal setting and follow up.\n\nMain activities and responsibilities: \n\nAs a Business Controller, you will deliver financial support and guidance to our Tuve organization, with the aim of enhancing our business performance. You should be a good storyteller and provide transparent information. You will work with digitalization to optimize existing processes and develop good visualizations for the organization. We focus on continuous improvements, and we hope you will be able to bring new aspects into our way of working.\n\nIn addition, you will participate in several common training weeks with the other participants in the program and do various job rotations to broaden your horizon within the Volvo Group.\n\nWho are you? \n\nTo be successful in this role, you bring a reflective and structured approach, along with strong analytical abilities. You have a holistic, end-to-end understanding of business and enjoy working closely with others to create impact. Additionally, you find energy in collaborative environments and are a supportive and engaged team member. Your passion for new technologies and digital tools inspires you to explore innovative ways of working. You are naturally curious, creative, and communicate with clarity and empathy.\n\n Required knowledge/experience:\n\n  *  BSc or MSc in business administration specialized in business control or accounting.\n  *  Knowledge in Lean manufacturing.\n  *  Knowledge in BI-tools.\n  *  You understand the basics of lean manufacturing and continuous improvement methodologies.\n  *  Maximum two years of previous full-time working experience, prior to or after graduation. Work during studies are not included.\n  *  In this truly global program, communication will be in English, hence you need to be fluent in both speaking and writing in Swedish and English.  \n  *  Valid work permit for Sweden if not a citizen. \n\n\nCurious, and have some questions? Contact us!\n\nManager: Olga Landstrom, +46 739022252, olga.landstrom@volvo.com \nHRBP: Louise Karlsson, +46 739022252, louise.karlsson.3@volvo.com \n\nKindly note that due to GDPR, we will not accept applications via mail. Please use our career site. \n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43724375",
        "published": "2025-10-24T02:25:09",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30161598",
        "title": "Senior penetrationstestare",
        "employer": "Combitech AB",
        "location": "Göteborg",
        "description": "Är du en penetrationstestare med flera års erfarenhet och redo för nya utmaningar tillsammans med likasinnade? Combitech söker nu erfarna penetrationstestare till vårt team med placering i Göteborg, Stockholm, Linköping och Sundsvall. Som penetrationstestare på Combitech kommer du ingå i en enhet bestående av specialister inom Penetrationstester och Red Teaming.\n\nDin roll som penetrationstestare\n\nVår enhet är en tekniskt stark och en social arbetsplats med team över flera orter i Sverige. Vi arbetar brett från IoT och webbsäkerhet till nätverk, Active Directory, Automotive och OT/ICS och tar komplexa uppdrag mot myndigheter, försvarsindustri, industri och finanssektorn.\n\nKärnan i vårt arbetssätt är en teamleverans, vi sätter samman grupper med kompletterande kompetenser för att säkerställa hög kvalitet, problemlösning och kontinuerlig kompetensöverföring. Vi har regelbundna veckomöten där vi delar erfarenheter, metodik och uppdateringar, samt forum för teknisk diskussion och planering.\n\nVi investerar i din utveckling du får stöd för certifieringar, tid för lärande och möjlighet att representera oss på konferenser och i professionella nätverk. Detta är en plats där du både bidrar och växer. \n\nArbetsuppgifterna innebär att du utför uppdrag åt våra kunder. I våra leveranser prioriterar vi alltid teamarbete. Du kommer att arbeta i team med kompletterande kompetenser då det ger högre kvalitet, bättre problemlösning och kontinuerlig kunskapsöverföring. Vi matchar rätt person och kompetens till varje uppdrag och stöd från erfarna kollegor finns alltid nära till hands.\n\nDå varje uppdrag avslutas med en rapport och oftast tillhörande presentation, medför det att vi ser att du har vana av att uttrycka dig i skrift såväl på svenska som på engelska, men även att du är van att prata med både tekniskt kunniga individer såväl som de som inte är tekniskt insatta.\n\nResor i tjänsten förekommer frekvent då många av våra uppdrag innebär att vi måste vara på plats hos våra kunder på grund av säkerhetsskyddsskäl, men även för att utföra tester som innebär fysisk närhet till testobjektet.\n \n\nVem är du?\n\nVi söker seniora penetrationstestare med minst fem års erfarenhet av yrket. Du har omfattande erfarenhet av olika IT och IT-miljöer och har arbetat med penetrationstester, där du har utvecklat djup kompetens inom säkerhetstester och granskningar. En teknisk examen i grunden är önskvärt, men dina erfarenheter och personliga egenskaper väger tyngre än en specifik examen.\n\nDu är bevandrad och trygg när det gäller tillvägagångssätt, metodik och tekniker inom penetrationstestning, inklusive planering, scoping samt testdesign och har stött på många typer av IT-miljöer i ditt arbetsliv. Vi tror även att du är van att hjälpa till att planera, definiera uppdrag och bidra till testplaner inför olika projekt, det vill säga att du kan ta ett projekt-/leveransansvar, kunna leda testteam, leverera tidplaner, estimeringar och sign-off.\n\nVi ser gärna att du är flexibel och har möjlighet att resa samt ta kundkontakt och arbeta onsite vid behov, vilket är avgörande för att upprätthålla goda relationer och framgångsrika projekt. Du har lätt att samarbeta med andra och kan bidra med en god stämning i enheten. Vi är ett tekniskt team som alltid ställer upp för varandra och hjälper till där det behövs, vi tror att du delar vår glädje i att sprida kompetens till kollegor och hjälpa varandra framåt. Du är strukturerad i ditt arbete och har en stark förmåga att uttrycka dig i tal och skrift, både på svenska och engelska.\n\nVi förstår att du kanske inte har erfarenhet inom alla dessa områden nedan, men vi värdesätter din expertis inom flera av dem.\n\nKvalifikationer \n\n * Minst 5 års erfarenhet av penetrationstestning och/eller Red Teaming. \n * Erfarenhet av att skriva uttömmande tekniska rapporter och presentera resultat både för teknisk personal och ledning. \n * Kunskap om relevanta standarder, ramverk och metoder, exempelvis OWASP, MITRE ATT&CK, OSSTMM, PTES, TIBER, NIST och IEC 62443. \n * Stark teknisk grund inom nätverk och infrastruktur (design, struktur, protokoll, samt en förståelse för brandväggar, IDS/IPS, lastbalanserare och lagringslösningar). \n * God operativsystemskunskap (Linux och Windows) och vana vid virtualisering/containers. \n\nMeriterande \n\n * Gärna certifieringar som OSCP, SANS/GCIA/GPEN, CREST/Red Team-certifieringar, ISC2 eller liknande, då dessa efterfrågas av våra kunder. \n * Erfarenhet av Red Team, TIBER, scenariobaserade tester och hotaktörsemulering. \n * Djup AD- och Windows-internals-kunskap (kerberos, trusts, GPO, LSASS, SID-history) \n * Cloud-security: praktisk erfarenhet av AWS/Azure/GCP säkerhetsarkitektur, IAM, och moln-attacker (inkl. IaC: Terraform/ARM). moln-certifieringar (AWS-CSP/Azure-Security). \n * Web-/applikationssäkerhet och erfarenhet av avancerade web-verktyg (t.ex. Burp Suite). \n * Erfarenhet inom AI LLM. \n * Erfarenhet av OT-säkerhet/ICS, CAN-buss (inom automotive) eller andra industrisystem. \n * Trådlös kommunikation (Wi-Fi, BT, NFC, radio) och IoT-säkerhet. \n * Kompetens inom hårdvara/ embedded (PCB, JTAG, UART, CAN) för automotive/IoT-tester. \n * Programmering, scripting (Python, PowerShell, Bash) och erfarenhet av exploit-utveckling \n * Reverse engineering & malware analysis (IDA, Ghidra, dynamisk analys) - meriterande för avancerade uppdrag. \n * Säker kodgranskning och kännedom om OWASP ASVS / Secure SDLC. \n * Erfarenhet av lagringslösningar, lastbalanserare och avancerade nätverksarkitekturer. \n\n \n\nDå våra tjänster ofta innebär arbete som omfattas av försvarssekretess krävs det att du genomför och godkänns i en säkerhetsprövning med eventuell registerkontroll.\n\nLåter det intressant? Hör av dig till oss eller skicka in din ansökan. Urval sker löpande.\nVill du veta mer om hur det är att arbeta hos oss? Kolla in våra karriärsidor!",
        "url": "https://www.aplitrak.com/?adid=aC5oZWRlbmdyZW4uMzk3MTQuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-10-17T17:54:31",
        "deadline": "2025-11-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30153078",
        "title": "Lärare i Teknikämne och Artificiell Intelligens (AI)",
        "employer": "Amerikanska Gymnasiet i Sverige AB",
        "location": "Göteborg",
        "description": "Om Amerikanska Gymnasiet\nAmerikanska Gymnasiet grundades utifrån en stark pedagogisk idé. Vår Ledstjärna är att ”vi arbetar för att våra elever och medarbetare ska nå sin fulla potential”. Vi arbetar därför med både kunskapsutveckling och personlig utveckling. Vår kultur kännetecknas av tydliga spelregler med omtanke. Vi kallar det ”Ramar och Kramar”. Skolverksamheten organiseras så att eleverna förbereds för en internationell arbetsmarknad i en snabbt föränderlig värld, i vår logotype kan man därför läsa “Get ready for the world”.\nAllt som sker på skolan utgår från våra fyra grundvärderingar: Courage, Kindness, Knowledge & Curiosity och Grit. I klassrum och i korridor så kännetecknas möten mellan elever och personal av beteenden som härleds från dessa. Vi arbetar elevnära och sätter alltid elevernas bästa i första rummet.\nOm Amerikanska Gymnasiet, Göteborg\nPå Lindholmen, granne med Karlatornet, ligger vår nybyggda skola där vi flyttade in hösten 2024. På skolan går cirka 590 elever som studerar på Natur-, Teknik-, Ekonomi- eller det Samhällsvetenskapliga programmet. Undervisningen bedrivs på både svenska och engelska av ett kompetent och drivet lärarlag med en stark gemenskap.\nOm rollen\nVi söker en engagerad tekniklärare som vill vara med och utveckla teknikundervisningen tillsammans med vår befintliga lärare. Vi söker dig som kan undervisa i något av följande ämnen; Artificiell Intelligens (AI), Dator och nätverksteknik, Webbutveckling, Programmering eller Teknik. Du kommer ansvara för att planera, genomföra, bedöma och utvärdera din egen undervisning. Du förväntas leda lektionerna utifrån vår pedagogiska struktur, vilket du kommer få handledning i. Du kommer att arbeta nära tillsammans med ett engagerat och sammansvetsat lärarlag, där samarbete och kollegialt lärande är en självklar del av vardagen. Du kommer att undervisa i en digital miljö med digitala läromedel i kombination med traditionell litteratur. Undervisningen sker på både svenska och engelska. \nTjänsten är en visstidsanställning på deltid eller heltid, där omfattningen beror på vilka ämnen som det blir aktuellt undervisa i. Tjänsten sträcker sig till och med 14 juni 2026. Startdatum snarast eller enligt överenskommelse. \nDin profil\nVi söker i första hand dig med lärarlegitimation och erfarenhet av undervisning, som har behörighet att undervisa något av följande ämnen; Artificiell Intelligens (AI), Dator och nätverksteknik, Webbutveckling, Programmering eller Teknik. Alternativt så har du en gedigen kunskap inom något av dessa ämnen, samt en mycket god pedagogisk förmåga. Du har ett stort engagemang för undervisning och vill vara med och utveckla verksamheten tillsammans med ett starkt team av medarbetare och du delar vår pedagogiska syn:\nhttps://www.amerikanskagymnasiet.se/om-skolan/tankar-om-skola/. \nVi söker dig som leder i linje utifrån vår devis “Ramar & Kramar”, som innebär ett tydligt ledarskap och tydliga spelregler i kombination med en stark omsorg om varje elev. Med hjälp av din energi, lyhördhet och uthållighet har du lätt för att engagera och skapa delaktighet mot gemensamt satta mål. Teamwork och transparens är ledord.\nDu förväntas ha god kommunikation på både svenska och engelska, i både tal och skrift. Du har förmågan att använda ett brett spektra av digitala läromedel och du har en stabil digital kompetens. \nStor vikt kommer att läggas vid personlig lämplighet.\nAnsökan\nSista ansökningsdag: 5 november 2025.\nIntervjuer sker löpande och tillsättning av tjänsten kan ske innan ansökningstiden har gått ut.\nKontaktuppgifter\nBiträdande rektor Evelina Löfnertz, evelina.lofnertz@amerikanskagymnasiet.se\nHR-ansvarig Elin Fagerberg, elin.fagerberg@amerikanskagymnasiet.se",
        "url": "https://amerikanskagymnasiet.teamtailor.com/jobs/6565930-larare-i-teknikamne-och-artificiell-intelligens-ai?promotion=1662711-arbetsformedlingen",
        "published": "2025-10-16T11:15:12",
        "deadline": "2026-03-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30127328",
        "title": "Android Platform Architect",
        "employer": "Coretura AB",
        "location": "Göteborg",
        "description": "Join the Revolution in Commercial Vehicle Tech. At Coretura, we’re not just building the future of commercial vehicles—we’re redefining how automotive software is developed. As a joint venture between Volvo Group and Daimler Truck, we blend startup speed with industry strength. And we’ve gone all-in on AI.\nWe’re looking for an experienced Android Platform Architect to help define and lead the system-level architecture of our Android-based infotainment and vehicle integration stack—bridging the gap between hardware, middleware, and Android OS internals.\n \nWhat You’ll Do\nIn this role, you’ll take ownership of the Android platform architecture, working closely with hardware and middleware teams to ensure seamless integration, performance, and compliance. Your responsibilities will include:\n Architecting the Android platform stack from HAL to system services, with a focus on embedded integration.\n Defining HAL/service boundaries and OTA update strategies (including A/B partitioning).\n Collaborating with hardware, AUTOSAR, and middleware teams to align Android with real-time ECUs.\n Leading efforts in secure and scalable system design: SELinux, sandboxing, secure/verified boot.\n Optimizing system performance: boot time, memory footprint, GPU/CPU scheduling.\n Designing for multi-SoC, multi-display, and multi-user environments.\n Ensuring compliance with Google certification (CTS, VTS) and projection standards.\n Guiding Android virtualization strategies (e.g., VirtIO, Cuttlefish).\n Aligning architecture with functional safety standards (ISO-26262, ASPICE, AUTOSAR).\n Acting as a technical interface with OEM stakeholders and certification partners.\n Lead Android certification strategy and compliance processes including projection certification\n \n \nWhat You Bring\nAt Coretura, we value more than just technical expertise—we’re looking for someone who brings genuine drive, initiative, and a proactive, action-driven mindset to every challenge. You’re passionate about technology and innovation, and your leadership skills inspire those around you to push boundaries and deliver results. Your ability to take ownership and lead projects forward makes you a catalyst for progress in our team.\nAlongside these qualities, you have a strong technical foundation and hands-on experience in Android platform development, particularly in embedded and automotive environments. Ideally, you have:\n Proven experience as an Android System Architect \n Deep knowledge of AAOS internals: system services, Binder IPC, HAL, and embedded design.\n Strong understanding of Android’s interaction with hardware and middleware layers.\n Experience with Android bring-up, BSP/kernel integration, and SoC-level architecture.\n Familiarity with automotive protocols (CAN, LIN, SOME/IP) and VHAL design.\n Hands-on experience with Android graphics stack (SurfaceFlinger, HWComposer).\n \nExposure to cloud-native design, edge-cloud orchestration, and telematics is a plus.\n \nWhy us?\nAt Coretura, we’re all about shaking things up in our industry! We believe in empowering our team and creating a culture where innovation thrives. \nWhen you join us, you won’t just be another employee; you’ll have the freedom to make decisions that drive our projects and tech forward. We encourage creativity and we know that diverse perspectives are key to solving the tough challenges we face. \nOur focus is on making a real impact, and we prioritize what matters most to deliver value to our customers quickly. With a lean team that’s always learning and adapting, we’re ready to evolve with the latest technology and market trends. Come be a part of a workplace where your contributions truly matter!\n \nReady to architect the next generation of Android-powered commercial vehicles?\nApply now and help us build the foundation for the future of transport. Applications will be reviewed continuously.\n \nQuestions? Dont hesitate to reach out to Sandra.hamdi@coretura.com you have any questions. \nPlease note we do not accept any applications via email.",
        "url": "https://career.coretura.com/jobs/6588345-android-platform-architect?promotion=1664134-arbetsformedlingen",
        "published": "2025-10-09T15:47:21",
        "deadline": "2025-11-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30125686",
        "title": "Global AI Solutions Architect",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\nWhat you will do\n\n\nThe Global AI Solutions Architect works closely with the Global AI Advisory Expert to design, integrate, and optimize the organization’s AI ecosystem. This senior role is responsible for mapping out all existing and required AI components, connecting disparate technologies, and ensuring a robust, scalable, and full-stack AI infrastructure. The architect will collaborate across business units, IT, and data teams to identify gaps, harmonize solutions, and drive the technical implementation of the corporate AI strategy. Given the distributed nature of knowledge and resources in a large organization, exceptional communication and stakeholder engagement skills are essential. \nThe AI Strategy and Governance department is new and you’ll be key in forming and bringing the GTT AI community together. This is a unique opportunity to be a main contributor in developing GTT’s future digital capabilities.   \n\nWho are you?\n\n\n\nKey Responsibilities: \n\n In this role, you will assess and document the current state of AI technologies, platforms, and data assets across the organization, identifying strengths, gaps, and opportunities for improvement. You will define what is needed to build a complete, future-ready AI stack and translate these insights into a clear technical roadmap. \nYou will design and oversee the integration of AI systems, ensuring they are interoperable, scalable, and compliant with security standards. Collaboration will be central to your work — you will partner with the Global AI Advisory Expert and cross-functional teams to translate business strategy into actionable, technical solutions that create real value. \n\nYour role will also include: \n\n  *  Design and oversee the integration of AI systems, ensuring interoperability, scalability, and security \n  *  Driving alignment and knowledge sharing across teams and regions, ensuring consistent adoption of AI practices. \n  *  Defining and maintaining technical standards, best practices, and governance frameworks to support responsible AI implementation. \n  *  Staying at the forefront of emerging AI technologies, evaluating their potential fit and recommending strategic adoption. \n  *  Acting as a trusted advisor to technical and business stakeholders, guiding architectural decisions and fostering a culture of continuous improvement. \n\n\nQualifications: \n\n  *  Advanced degree in Computer Science, Data Science, or related field. \n  *  8+ years of experience in AI architecture, solution design, and systems integration. \n  *  Deep understanding of AI frameworks, cloud platforms, data engineering, and MLOps. \n  *  Proven ability to connect complex technical components into cohesive solutions. \n  *  Outstanding communication, collaboration, and stakeholder management skills.\n\n\nReady for the next move?\n\n\nCurious and have some questions, reach out to:  \nPeter Härslätt, GTM AI strategy & governance, peter.harslatt@volvo.com\nThe last day to apply is 26th of October.\n\n\n\nWe value your data privacy and therefore do not accept applications via mail.\r\n\r\nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43706131",
        "published": "2025-10-09T12:25:11",
        "deadline": "2025-10-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30108410",
        "title": "Doctoral student in physics-informed machine learning for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided and data-driven foundation models for multivariate time series in safety-critical systems such as automotive. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering at Chalmers and University of Gothenburg in Sweden employs approximately 300 employees from more than 30 countries. The department is divided into four divisions and is widely recognized for excellent research and education, with activities on two campuses in the city of Gothenburg. Research in the department has a wide span, from theoretical foundations to applied systems development. We provide high quality education at the bachelor's, master's, and graduate levels, offering over 120 courses each year. We also have extensive national and international collaborations with academia, industry and society.\n\nWe are announcing a PhD position that is placed at the Computing Science division with Chalmers University of Technology as the employer. \n\nThis project is a collaboration between the AIXLab@Chalmers and Volvo Group. At AIXLab, we focus on developing AI solutions that are usable and applicable in real-world settings. We are part of the Computing Science division at the Department of Computer Science and Engineering.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other domains. You do not need extensive experience with physics-guided modeling; strong interest in time series machine learning and the ambition to learn are what matter most. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent.\n• You will need strong written and verbal communication skills in English.\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning.\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch). \n• Engineering skills: GPU/cluster training, experiment tracking, data engineering.\n• Ability to formulate research questions, run empirical studies at scale.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience with physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Experience with academic research and publications\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files. Please note the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than December 1st 2025\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nEmail: yinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nEmail: secarl@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14252&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-10-06T10:43:01",
        "deadline": "2025-12-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "29787427",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-06-24T08:06:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787426",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-06-24T08:03:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760753",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
        "published": "2025-06-10T13:37:03",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30164389",
        "title": "QA Engineer",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "About this role\nWe are now looking for a QA Engineer to join our R&D team. You will be part of a cross-functional team in which you will take on the responsibility for activities related to testing throughout the development process, helping us secure a quality delivery of our state-of-the-art video analytics system to which thousands of cameras across the world are connected.\nYou will, together with your team plan, implement and maintain automated tests of various types and collaborate with developers to address potential issues. You pay attention to details, are enthusiastic about uncovering the next bug and bring experience in test development.\nBesides your contributions to the team, you are one that champions a culture of continuous improvement, suggesting enhancements to testing processes and test strategies across the organization. We’re a small team and your possibility to influence the way of working is large; improvements can be suggested and implemented in everything from continuous integration processes to automated end-to-end testing.\nOur company culture is based on freedom and responsibility. For us that means you will be given extensive freedom to make technical decisions while meeting our high standards and making decisions in a responsible way. You will be located at our headquarters in Gothenburg where we are a team with a lot of energy and a strong sense of community.\nThis role is hybrid remote with three days weekly in the office. \nWho we think you are\nTo be successful in this role we expect you to bring extensive software development experience and have worked with complex systems. You also need a good understanding of organizational aspects of software development and of how to collaborate efficiently with others.\nRequirements\n At least 3 years of experience in testing and test development.\n  Strong knowledge in test development, testing methodologies and preferably in testing of both backend and frontend functionality.\n  Experience in Go, TypeScript and related test frameworks is a plus.\n  Experience in PlayWright is a plus.\n  Experience in C# and C++ is desired.\n  A strong desire to collaborate with others and to contribute to team success.\n  Excellent communication and organization skills and great personal initiative and drive, with an ability to understand requirements of different stakeholders, keeping things organized, and making things happen.\n  Proficiency in English. Swedish is a plus but not a requirement.\n  A degree in computer science or software engineering. Alternatively, a combination of other relevant education (formal or self-taught) and experience.\n \n \nAbout Irisity\nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alerts, leading to reduced crime rates and increased safety without any negative effects on personal privacy.\nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 70+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. Our software is packaged into a complete cloud-based SaaS platform marketed towards large global customers and with thousands of cameras connected.\nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history.\nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds.\nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. For integrity reasons, we do not accept applications submitted by e-mail.\nRead more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6631598-qa-engineer?promotion=1677125-arbetsformedlingen",
        "published": "2025-10-20T11:06:16",
        "deadline": "2026-04-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30149663",
        "title": "Master Thesis Student - Machine Learning Driver Model",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\r\n\r\nBackground\nAre you ready to kickstart your career with one of the most innovative and renowned automotive companies in the world? We are thrilled to announce an incredible Master thesis opportunity at Volvo GTT starting in the beginning of year 2026. \nTransport solutions are a vital part of the modern lifestyle we live in today. At Volvo Group we are committed to driving prosperity by improving our technologies. The future of autonomous and driver-assist systems hinges on their ability to operate safely, efficiently, and comfortably behaving in ways that are intuitive and human-like. For heavy-duty trucks, this challenge is magnified by complex dynamics, significant variations in mass, and the high impact of driving style on fuel consumption. \nOur department Customer Features Verification focuses on various features, including vehicle fuel/energy economy, CO₂ emission, performance and drivability. We are hands-on when conducting physical tests, performing cutting-edge data analysis and complete vehicle simulations to evaluate these features. \n\n\nAbout the thesis work\n\nThis project aims to develop a sophisticated, two-tier intelligent driver model that leverages machine learning to learn complex vehicle behavior from data and emulate nuanced, human-like driving strategies. The project builds upon an existing validated longitudinal vehicle dynamics model in Simulink, replacing the current physics-based controller with an advanced machine learning approach. \n\nThe driver model will consist of: \n  *  Driver Intent Model (Behavioral Layer): A high-level module that learns human-like driving decisions, mapping driving context (speed error, distance to stop, lead vehicle behavior, road grade preview) to smooth, realistic acceleration profiles using imitation learning techniques. \n  *  Pedal Mapper (Control Layer): A low-level module acting as a learned inverse model of the truck’s powertrain and brake dynamics, translating desired acceleration into precise pedal commands. This will be implemented using MLP-based (Multi-Layer Perceptron) neural networks with online adaptation capability through Recursive Least Squares (RLS). \n  *  Safety & Comfort Supervisor: A supervisory layer enforcing critical constraints including jerk limits, pedal rate limits, and Time-to-Collision (TTC) guards. \n\n\nBy utilizing imitation learning, neural networks, and online system identification techniques, this intelligent driver model will improve vehicle control performance, enhance human-like driving behavior, and contribute to safer autonomous driving solutions. \nA critical component of this thesis is the full integration and comprehensive validation of the developed driver model into the existing Simulink vehicle dynamics environment. You will systematically evaluate the model’s performance against a comprehensive set of KPIs, including control performance (RMSE of acceleration tracking, stop position accuracy), human-likeness (jerk profiles, headway distribution vs. human data), safety & plausibility (pedal command overlap, TTC violations in car-following scenarios), and efficiency metrics (proxy for energy consumption). This integration and validation work will ensure the model’s readiness for real-world deployment in autonomous and driver-assist systems. \nThe MSc. thesis proposal has a scope of 30 ECTS credits (suitable for one student). \nProject start: January/February 2025. \nPhysical location: Volvo GTT (Group Truck Technology), Lundby, Göteborg \n\n\nAbout you\n\nWe expect that you are finishing your studies in Automotive Engineering, Control Systems, Mechanical Engineering or similar. You should have excellent proficiency in MATLAB & Simulink and be familiar with Python. A solid theoretical foundation in Control Theory (e.g., PID, state-space models), and good understanding of fundamental Machine Learning concepts (Supervised Learning, Neural Networks) are required. \nBackground in vehicle dynamics, system identification (e.g., RLS), or reinforcement learning is a plus. You should be comfortable implementing algorithms from first principles in code. \n\n\nReady for the next move?\n\nIf you want to make a real impact in your future career, the transportation business is where you want to be. We look forward to meeting you.\nRenan Sasahara Hernandes (Industrial Supervisor), Volvo Group Trucks Technology (GTT), \nStaffan Luong (Industrial Supervisor), Volvo Group Trucks Technology (GTT), \nEmail: renan.hernandes@volvo.com, staffan.luong@volvo.com  \nWe value your data privacy and therefore do not accept applications via mail. \n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43718883",
        "published": "2025-10-15T14:25:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30096280",
        "title": "Data Warehouse Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "About Us\nEtraveli Group is the globally leading company for tech solutions and fulfilment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travellers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nDo you want to be part of the next step in our growth journey?\nAt Etraveli Group we use a lot of data for decision making processes, analysis and machine learning. Users of the data can be found in different departments like Finance, Customer Service, Sales, Data Science and Research. In alignment with our growing targets we are looking for experienced data engineers to become part of our Data Solutions team to get more data into our data lakehouse platform and prepare it in order to be used by the users. \nWho You Are\nWith the right skill set and motivation you will be setting up, maintaining and evolving our data warehouse solution as well as participating in driving a large portion of our future data engineering.\nIn this primarily technical role, there will be close interaction with database administrators and operations’ engineers, but there will also be collaboration with stakeholders from other parts of our organization (e.g data analysts, business intelligence teams and business stakeholders). The data sources we use are located both in cloud environments as well as on-prem. Working with us means you'll have access to a team of highly competent professionals and ample resources to foster your personal and professional growth. We face the challenges of the day working for a company that goes the extra mile to ensure that we have fun at, and outside, the office. \nRequirements\nTo thrive and succeed in this role we believe that you have:\nA strong interest in maintain and evolve our data warehouse solution\nAbility to analyze and take on tasks, both individually and together with others\nAbility to design and implement tasks from scratch, individually gathering the necessary information where needed\nStrong foundation in data warehousing concepts and data modeling (e.g., Star and Snowflake Schemas, Incremental Loads, Slowly Changing Dimensions)\nPrevious experience working with data processing and distributed query engines, like Spark, Dremio/Trino, Databricks\nPrevious experience working as a data engineer, with different ETL (e.g., dbt, Airflow) and CDC tools (e.g., Debezium, Flink CDC, Kafka Connect)\nPrevious experience working with multiple scripting languages, like Bash, Python, SQL, etc\n\nIt is also desirable that your skills match one or more of the following:\nPrevious experience to ensure high-performance data processing with techniques like indexing, partitioning, and caching.\nPrevious experience working with data integrations\nPrevious experience working with data modelling for efficient query performance, data quality and optimization\nPrevious experience working as a database administrator\nComfortable working with Linux, Docker, and preferably also Kubernetes\nExperience with data lakehouse table formats like Apache Iceberg or Delta Lake, enabling features like ACID transactions and time-travel on object storage\n\nBenefits\nAt Etraveli Technology, you will be part of a gang of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard.\nEtraveli Group is a company that really wants to contribute to you reaching your full potential.\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\nWe love gaming and after work activities.\nWe know the value of personal development and continuous training.\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\nWellness allowance - Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities.\nThrough partners, we offer comprehensive pension and health insurance so that you can quickly get help if the accident occurs.\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\nAnd we serve breakfast every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/206B865709/apply",
        "published": "2025-10-02T09:24:25",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30095286",
        "title": "IT & Security Specialist",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "We are looking for an experienced IT & Security Specialist to take full responsibility for Irisity’s tech and security environment. In this role, you will be the go-to person for IT and security matters, making sure that our systems, office environment, and employee equipment are reliable and well-protected.\nYour scope will include managing IT infrastructure, supporting colleagues with technical needs, maintaining office security (such as access cards and alarms), and overseeing inventory management. You will work with cybersecurity tasks like penetration testing, vulnerability checks, and incident response, while also advising leadership on risk, compliance, and future improvements.\nThis is a broad and practical role without direct reports, where you’ll collaborate with colleagues and external partners to ensure both digital and physical security are in place.\nKey responsibilities\n Oversee IT infrastructure, end-user devices, access control systems, and office security solutions for both Sweden (headquarters) and Hungary (satellite office). \n Maintain and improve cybersecurity posture, including penetration testing, vulnerability scanning, and risk assessments.\n Ensure compliance with information security policies, GDPR, and relevant regulations.\n Manage hardware and software inventory, including laptops, cell phones, licenses, and key cards.\n Lead incident response and business continuity planning.\n Support a part-time IT colleague in Hungary.\n Advise management on IT investments, security risks, and digital workplace improvements.\n Act as point of contact for external auditors, vendors, and security partners.\n Help keep RnD test systems, development environments up to date and running both on Linux and Windows.\n \nWho we think you are\n Strong technical background in IT systems, security, clients, networks (Microsoft 365, Microsoft Entra ID, Intune, SharePoint, Azure).\n Hands-on experience with penetration testing, security monitoring, and threat mitigation.\n Hands-on knowledge of both Windows and Linux administration (Ubuntu & Red Hat), \n Knowledge of identity and access management.\n Experience with IT asset and inventory management.\n Familiar with physical office security (access systems, surveillance, alarms).\n Strong analytical skills and structured way of working.\n Fluent in English; Swedish is an advantage\n Driven to stay up to date on security trends, and interested in ensuring compliance according to ISO and cyber security certifications \n \nNice haves\n Knowledge in ISO / IEC 27001 standards and relevant certifications is highly meritorious \n Experience with IP cameras and network devices including NVRs is meritorious\n  Experience with Kubernetes (K3s and OpenShift) is a plus\n \nWhat we offer\n A key role with direct impact on the security and efficiency of our workplace.\n A modern, international environment with fun and skilled colleagues who value collaboration and transparency.\n Flexibility through hybrid work arrangements.\n \nAbout Irisity \nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alerts, leading to reduced crime rates and increased safety without any negative effects on personal privacy. \nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 90+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. Our software is packaged into a complete cloud-based SaaS platform marketed towards large global customers and with thousands of cameras connected. \nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history. \nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds. \nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. For integrity reasons, we do not accept applications submitted by e-mail.\nRead more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6394704-it-security-specialist?promotion=1652104-arbetsformedlingen",
        "published": "2025-10-01T17:47:01",
        "deadline": "2026-03-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30078420",
        "title": "Founding ML Engineer / Researcher",
        "employer": "Monava AB",
        "location": "Göteborg",
        "description": "Monava is an acoustic machine learning lab - turning sound into actionable intelligence for defence and security. We currently focus on alternative ways of detecting flying drones by replacing radars with microphones (microphones are undetectable, energy efficient and cheaper but have lower range as a downside). If you want to work at the edge of ML and defence, we’d love to hear from you.\nWhy now:\nFirst unit sold: we’ve sold our first test system to armed forces.\nPaid pilots: our technology has been validated (TRL 6) in paid pilots with large defence contractor.\nThe role:\nAs a Founding ML Engineer / Researcher, you’ll build end-to-end systems across research, product, and deployment. We’re looking for generalists with depth in one or more of: defence, machine learning, math, software, digital signal processing, or electronics.\nIn short. We are looking for strong builders and researchers with previous experience in the above mentioned fields. You might have contributed to foundational research, lead data teams, enjoy math competitions or built missile guidance systems. As long as you are at the forefronts, we will make sure to accommodate the role regardless of seniority, gender, nationality, sexuality, religion and political views.\nThe role is based around Gothenburg, Stockholm or Helsinki and is remote for now (we are open to other locations). It is a paid position with equity at a growing start up.\nHow to apply:\nApply by sending an email with a brief sentence on what you’ve built before, and where you/we are heading next.\nLet’s build the future of sound.",
        "url": null,
        "published": "2025-09-26T16:28:35",
        "deadline": "2025-10-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]