[
    {
        "id": "30235210",
        "title": "Erfaren systemutvecklare inom mjukvaruutveckling",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Syntronic är en ledande design- och utvecklingspartner inom avancerade tekniklösningar. \nVi är stolta över att vara i framkant av teknologisk innovation och söker nu en erfaren systemutvecklare inom mjukvaruutveckling till vårt team i Göteborg.\nSom systemutvecklare hos oss:\nKommer du att vara involverad i allt från design, programmering, testning och implementation av mjukvarulösningar. Du får möjlighet att arbeta med varierande uppdrag hos olika kunder. \nVi använder moderna programmeringsspråk och ramverk såsom C#, Java, Python, .NET, och vi värdesätter erfarenhet av både SQL-databaser. \nVad vi söker hos dig som systemutvecklare:\n Högskole- eller civilingenjörsutbildning inom mjukvaruutveckling, systemutveckling, IT eller liknande\n Minst 5 års erfarenhet av systemutveckling och mjukvaruutveckling, med djup kunskap inom något eller flera programmeringsspråk (t.ex. C#, Java, Python, .NET)\n Erfarenhet av agil utveckling, Scrum, eller liknande metoder\n Erfarenhet av molntjänster som AWS, Azure, eller Google Cloud är ett stort plus\n Kommunicerar flytande på svenska och engelska, i tal och skrift.\n \nVi letar inte efter en perfekt lista av kvalifikationer, utan efter rätt person som vill utvecklas tillsammans med oss och våra kunder. \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354308-erfaren-systemutvecklare-inom-mjukvaruutveckling?promotion=1703512-arbetsformedlingen",
        "published": "2025-11-07T08:21:53",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30123730",
        "title": "Utvecklare - Fullstack react python",
        "employer": "Textual AB",
        "location": "Göteborg",
        "description": "textual.ai utvecklar AI-drivna lösningar som hjälper e-handelsföretag att automatisera innehållsproduktion, översättningar och marknadsföring. Våra verktyg kombinerar språkmodeller, dataanalys och smart design för att skapa effektiva system som används av stora e-handlare i Sverige och utomlands.\nOm rollen\nVi söker en fullstackutvecklare med erfarenhet av React och Python som vill arbeta med nästa generation av AI-baserade verktyg för digital handel. Du kommer att vara en del av ett litet, tekniskt starkt team som arbetar agilt och nära produkten – från idé till lansering.\nDina arbetsuppgifter\nUtveckla webbaserade applikationer och interna verktyg med React (frontend) och Python (backend).\nIntegrera språkmodeller och API:er för AI-funktionalitet.\nDelta i planering, design och tekniska beslut.\n\nKvalifikationer\nMinst 2 års erfarenhet av fullstackutveckling.\nGoda kunskaper i React, TypeScript och Python (t.ex. Django eller Flask).\nErfarenhet av API-utveckling och databaser.\nVan att arbeta med Git och moderna utvecklingsflöden.\nAnvända AI-assisterade utvecklingsverktyg som Cursor\nFörmåga att arbeta både självständigt och i team.\n\nMeriterande\nErfarenhet av AI eller maskininlärning (t.ex. LLM).\nErfarenhet av molnplattformar (AWS, GCP).\nIntresse för e-handel, språk och automatisering.\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": null,
        "published": "2025-10-09T07:56:40",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30286983",
        "title": "Junior Software Developer",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:\nToday we stand at the forefront of agile software development, using methods like Lean and Scrum to create a product that excels. Early customer and stakeholder feedback is a key element in our development process which is based on Continuous Integration SW practices. Our product, tools and infrastructure places high technical requirements on the team, including high-performance application development, low latency requirements, multi-threaded/multi-process troubleshooting, and embedded system development in an environment with huge amounts of data.\n\nIn the role of Junior Software Developer, you will get the opportunity to work closely with your Product Owner and stakeholders in a collaborative environment, requiring both maturity and a strong ‘team first’ approach. Here, we embrace a culture of collective responsibility, ensuring that all tasks are completed according to the established backlog priority.  To expand our organization’s capacity, we are looking for ambitious, intelligent, creative and inspiring individuals who are in the early stage of their career. We provide a dynamic, fun and challenging environment where you can grow and help to inspire your colleagues to further growth. With us, you’ll be joining a small cross-functional development team working with feature development.  \n\nWhat you will do:\nThe team will design, implement and test the feature, product and system from requirements to production and commercial deployment. Each team has life cycle responsibility for a part of the product. Among other things, Unit/Component Test, Refactoring and Continuous Delivery are defining concepts and we are constantly improving our ways of working. We are not perfect and not afraid to say so. We are on a journey, and we know we have many problems to solve, and we need to learn new things on the way. We believe in trying new things connected to, e.g:\n  *  Software Craftsmanship\n  *  Analyze requirements and propose a software design\n  *  Analyze verification needs and develop test cases validating your design\n  *  Develop test case automation Execute tests, troubleshoot, and correct faults found\n  *  Reserved time for improvements and innovations, Hackathons\n  *  Knowledge sharing from external channels \n\n\nThe skills you bring:\n  *  MSc level in Computer Science or the equivalent level of knowledge\n  *  0 - 2 years of related experience in SW development\n  *  Fluent in English, written and oral\n  *  Skills in software development, preferably using Erlang, python or other functional language\n\n\nMeritorious qualifications:\n  *  Experience from verification, troubleshoot and debug software issues to ensure optimal performance\n  *  Experience of agile development and the Scrum framework.\nKnowledge of Git, Gerrit, Jenkins, HTTP2, TCP/IP, Linux, Containers\n\n\n\nThe characteristics we hope to see in you: We are looking for a person who enjoys working with software and product development in an environment driven by close collaboration. We work together to reach and even exceed our goals and continuously strive to improve ourselves and our output. We believe that you with your structured and disciplined approach, are not just ready to learn but eager to tackle complex challenges and redefine the boundaries of innovation alongside your team. You can communicate in a clear and effective way. With a focus on solutions, you bring a can-do attitude to challenges, working well both independently and with the team.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43794090",
        "published": "2025-11-20T11:25:02",
        "deadline": "2025-12-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30285768",
        "title": "Join Our Team as a SW Engineer",
        "employer": "FPT Software Sverige AB",
        "location": "Göteborg",
        "description": "About the Role\nWe are seeking a highly motivated and skilled Automotive Software Engineer to join our engineering team. In this role, you will be responsible for the full software development lifecycle of embedded systems for automotive applications, from requirement analysis through to qualification testing. You will collaborate closely with cross-functional teams and work independently to deliver high-quality software components.\nKey Responsibilities\n·      Analyze software and hardware requirements for automotive embedded systems.\n·      Design system architecture, detailed modules, and software interfaces.\n·      Develop, test, and integrate embedded software, including hardware drivers and bootloaders.\n·      Conduct unit testing, integration testing, and qualification testing in compliance with automotive standards.\n·      Collaborate with cross-functional teams to support system bring-up and debugging.\n·      Document design specifications and test procedures.\n·      Work efficiently both independently and as part of a collaborative team.\nWhat You'll Bring\n·      3+ years of experience in automotive embedded systems development.\n·      Proficient in C/C++ programming; scripting experience in Python, Shell, or Perl.\n·      Strong understanding of microcontrollers, device drivers, and embedded systems.\n·      Hands-on experience with bootloaders, cross compilers, and toolchains.\n·      Familiarity with software development lifecycle and working with hardware manuals, schematics, and data sheets.\n·      Practical experience with automotive communication protocols: SPI, CAN, LIN, FlexRay, Ethernet.\n·      Experience with debugging tools, simulators, emulators, and test equipment.\n·      Team player with excellent self-management and communication skills.\nNice to Have\n·      Experience with AUTOSAR Classic Platform development.\n·      Familiarity with AUTOSAR Configuration Tools (e.g., DaVinci, ECU Spectrum).\n·      Understanding of Functional Safety concepts (ISO 26262).\n·      Experience with multi-threaded and multitasking systems.\n·      Knowledge of Automotive SPICE or CMMI frameworks.\nBenefits & Perks:\n·      Competitive salary and performance-based bonuses.\n·      Health, dental, and vision insurance.\n·      Flexible work hours and remote work options.\n·      Learning and development opportunities\n.      Work with a talented and passionate team in a collaborative environment.",
        "url": null,
        "published": "2025-11-20T08:55:20",
        "deadline": "2025-12-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30256442",
        "title": "Data Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "Are you passionate about transforming data into scalable, secure, and intelligent solutions? We are hiring Data Engineers to join exciting projects at the forefront of analytics and innovation in the automotive and mobility sectors.\nWhat You’ll Do:\n• Design, build, and maintain scalable batch and streaming data pipelines. \n• Engineer robust ETL workflows and medallion architecture-based data lakehouses. \n• Develop and deploy data solutions using Python, PySpark, SQL, Airflow, and Databricks. \n• Use and manage tools across Azure, AWS, Docker, and Linux environments. \n• Operate with CI/CD principles using Git, DevOps, and Infrastructure as Code (IaC). \n• Ensure data quality, security, and system performance via monitoring and validation. \n• Work on advanced BI dashboards in Power BI.\n\nWhat we are looking for:\n• 6+ years of data engineering experience for senior roles; more for principal roles.\n• Strong coding background in Python, SQL, and Shell scripting.\n• Proficiency with cloud services like Azure Data Factory, AWS (Redshift, EMR, S3).\n• Experience in data modeling and business intelligence.\n• Comfortable with DevOps workflows and data platform operations.\n• Strong communication skills and team-first mindset.\n• Fluent in English\n \n \nNice to Have:\n• Experience with Power BI dashboards and BI project leadership.\n• Familiarity with automotive data systems.\n• Hands-on experience with regression, security, and system upgrade testing.\n\n \nWhy Work With Us?\nYou'll contribute to future-facing initiatives in autonomous driving, electric mobility, and global BI solutions. Whether it's within a startup environment or a powerhouse like the big automotive companies in Gothenburg , your work will directly impact the vehicles and technologies of tomorrow. Ready to make a data-driven difference? Apply now and power the future with us.",
        "url": "https://career.explipro.com/jobs/6744935-data-engineer?promotion=1710111-arbetsformedlingen",
        "published": "2025-11-12T15:05:13",
        "deadline": "2025-11-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30219739",
        "title": "Senior DevOps Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "We are looking for an experienced DevOps engineer who wants to enhance security and performance through reliable and scalable solutions.\nYou will work closely with architects and engineers to run applications and services on AWS, build and maintain integrations in our CI/CD ecosystem, and support product teams in effectively utilizing the platform. You will also identify bottlenecks, drive improvements, and shape how we deliver critical services at enterprise scale.\n\nAbout You\nYou are a customer-focused DevOps engineer with a strong background in AWS and modern CI/CD practices. You enjoy simplifying complex problems, thrive in collaborative environments, and take ownership of solutions from design to delivery.\n\nRequirements:\n- 7+ years of experience with AWS cloud architecture and operations\n- Solid background in CI/CD pipelines, automation, and monitoring\n- Hands-on experience with containerization and Kubernetes\n- Knowledge of Infrastructure as Code (Terraform, CloudFormation, CDK, or similar)\n- Good understanding of secure and reliable system design\n- Fluent English, spoken and written \n\nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
        "url": "https://career.explipro.com/jobs/6361033-senior-devops-engineer?promotion=1697451-arbetsformedlingen",
        "published": "2025-11-03T17:12:02",
        "deadline": "2025-12-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30092160",
        "title": "Machine Learning Engineer - Computer Vision",
        "employer": "Repli5 AB",
        "location": "Göteborg",
        "description": "The Role: We're looking for an experienced Machine Learning Engineer with a deep background in computer vision and generative AI. You’ll be part of a team developing systems that generate realistic, diverse, and highly controllable synthetic image data using state-of-the-art tools like Stable Diffusion, LoRA, and ControlNet. Your work will directly impact the performance and robustness of real-world AI systems—from self-driving cars to defense robotics.\nWhat You’ll Do\n Develop and fine-tune generative AI pipelines (e.g., Stable Diffusion, ControlNet, LoRA) for synthetic image generation.\n Design and implement machine learning workflows to generate structured, photorealistic datasets.\n Collaborate with 3D artists and simulation engineers to align ML models with physical environments and sensor setups.\n Work closely with customers in automotive, robotics, and aerospace to deliver tailored datasets.\n Optimize generation systems for scalability, quality, and speed using tools like ComfyUI or custom pipelines.\n \nYou Should Have\n MSc or PhD in Computer Vision, Machine Learning, or related field.\n 3+ years of hands-on experience with deep learning frameworks (e.g., PyTorch, TensorFlow).\n Experience working with generative AI models (especially diffusion-based models).\n Familiarity with tools like LoRA, ControlNet, ComfyUI, or custom workflows around Stable Diffusion.\n Strong understanding of synthetic data generation and its role in training perception systems.\n A track record of deploying ML systems in domains like automotive, robotics, defense, or manufacturing.\n \nNice to Have\n Experience working with 3D simulation pipelines or sensor modeling (e.g., depth, LiDAR, segmentation).\n Contributions to open-source ML/gen AI tools or custom diffusion model training.\n Enjoying reading research papers\n A problem solving intellect and a team player spirit\n Knowledge of synthetic-to-real domain adaptation techniques.\n Experience in startup environments or working directly with enterprise R&D teams.\n A positive can-do attitude",
        "url": "https://repli5.teamtailor.com/jobs/6544271-machine-learning-engineer-computer-vision?promotion=1650650-arbetsformedlingen",
        "published": "2025-10-01T10:35:02",
        "deadline": "2026-03-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30257224",
        "title": "Ignition Automation Developer",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vi tror att framsteg och möjligheter skapas bäst tillsammans. Välkommen till en plats där samarbete gör skillnad. \n\n \n\nDin roll\n\nSAAB är på en resa mot Industri 4.0 och vi behöver stärka teamet med en utvecklare som arbetar med vår Ignition plattform. Att ha bakgrundskunskap inom IIOT, PLC, HMI och SCADA är meriterande för att bygga lösningar mot Saabs olika enheter/ affärsområden. På sektionen jobbar idag cirka 15 personer och verksamheten är fördelad både geografiskt och över ett antal olika team. På arbetsplatsen finns en prestigelös kultur där man är professionell och engagerad, respekterar, stöttar och lär av varandra, resultat når vi tillsammans som ett team.\n \n\nSom Industrial Automation Engineer kommer du att arbeta i ett DevOps-team och ha en viktig roll inom framförallt utveckling men även förvaltning av Ignition plattformen. I din nya roll kommer du arbeta nära Service Manager, Scrum master, Solution Architects och Data Engineers. För att trivas i den här rollen behöver du ha ett intresse för industriella processer och produktionsmiljöer samt ett genuint intresse för utveckling och support av mjukvara inom IIOT/SCADA-området. Du kommer även att få hantera affärsmässiga krav från våra internkunder och verksamhetsprocesser.\n\n \n\nDin profil\n\nVi letar efter en noggrann och metodisk problemlösare, gärna med minst 5 års erfarenhet inom området, som är van vid att ta ansvar och arbeta självgående. Du har starka analytiska färdigheter, en god förmåga att strukturera och dokumentera ditt arbete samt ett öga för detaljer. Kommunikation är avgörande för oss, och vi värdesätter därför din sociala kompetens och förmåga att arbeta i team.\n\n \n\nVi tror att du som söker har:\n\n * Starka kunskaper inom Java-programmering för utveckling av skräddarsydda moduler och komponenter i Ignition.\n * Djupgående kunskap om Ignition-plattformens olika komponenter, inklusive moduler, klienter och databasintegration.\n * Färdigheter inom SQL för att skapa och hantera databaser samt förståelse för hur man integrerar databaser med Ignition-projekt.\n * Kunskap om webbteknologier som HTML, CSS, JavaScript och RESTful API för att skapa responsiva och användarvänliga gränssnitt i Ignition.\n * Förståelse för vanliga industriella kommunikationsprotokoll som OPC UA, Modbus och MQTT för att integrera olika enheter och system med Ignition.\n\n * Erfarenhet av att arbeta med SCADA-system och förståelse för dess arkitektur och funktioner.\n * Erfarenhet av HighByte Intelligence Hub är meriterande men inte ett krav.\n\n \n\nVi förväntar oss även att du har god förståelse för versionshanteringsverktyg, såsom Git, för att effektivt hantera källkod och samarbeta med andra utvecklare. Du har vana att utföra enhetstester och felsökning av kod för att säkerställa att Ignition-projekt fungerar felfritt och är robusta. En stark förståelse för säkerhetsprinciper och bästa praxis är avgörande för att skydda projekt mot potentiella säkerhetshot. Dessutom har du förmågan att skriva tydlig och omfattande dokumentation för både kod, konfiguration och användning av Ignition-projekt, vilket underlättar både underhåll och vidareutveckling.\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\n \n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\n \n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjIyNTY2LjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
        "published": "2025-11-12T16:22:04",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30292880",
        "title": "HIL Test Designer & Developer",
        "employer": "Quokka AB",
        "location": "Göteborg",
        "description": "Do you enjoy turning complex systems into reliable solutions? We’re looking for a HIL Test Designer & Developer with a background in Electronic Engineering to join our growing team.\nIn this role, you will:\nDesign and develop HIL test environments\nEnsure system reliability through creative test strategies\nCollaborate with engineers across disciplines in an international setting\n\nWe believe you’ll thrive if you:\nHold a degree in Electronic Engineering (or equivalent)\nHave a passion for test development and system design\nBring analytical skills, curiosity, and a solution‑oriented mindset\n\nWhat we offer:\nChallenging projects with cutting‑edge technology\nA supportive team culture inspired by the Quokka – positive, approachable, and full of energy\nOpportunities to grow, share ideas, and make an impact\n\nReady to bring your skills – and your Quokka‑like positivity – into our future‑focused projects? Apply today!",
        "url": null,
        "published": "2025-11-21T13:46:50",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30269219",
        "title": "System Test Engineer / Developer IRC281713",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Description\nDue to intensive growth, GlobalLogic Automotive department is glad to invite System Test Engineer to an Automotive project.\nThe project aim is to optimize, extend with new features Automotive Solution. Our clients are Tier 1s and OEMs from Europe and USA and development is targeted to Automotive Solution what will be deployed in newest European cars. The project is considered as technical excellence and we are paying huge attention to technical challenge motivation of our team members as well as excellence compensation.\nAt our project we are building a computer-in-the-car architecture – key for enabling innovation within areas such as advanced connectivity, machine learning and autonomous drive.\nRequirements\nThe System Test Engineer / Developer is a hybrid role focused on ensuring product quality, performance, and reliability through the entire development lifecycle. This role involves designing and implementing comprehensive test strategies, developing automated test frameworks, and executing rigorous testing across both functional and low-level technical domains (e.g., Basetech). The ideal candidate is a proactive problem-solver with a strong technical background, capable of working with vague requirements and transforming manual test cases into scalable, automated solutions often utilizing physical test setups like Box Cars and HIL (Hardware-in-the-Loop) rigs.\nJob responsibilities\nTest Execution and Defect Management\nExecute a variety of tests, including functional, exploratory, regression (diagnostics, communication, etc.).\nAnalyze test results, document a summary report, and identify the root cause of failures, differentiating between product defects and rig/environment issues.\nCreate and manage detailed fault reports and bug tickets for identified product defects.\nTest Setup Maintenance and HIL/Box Car Operations\nTake responsibility for the proper operation and maintenance of complex test setups, including Box Cars (test benches/rigs) and HIL (Hardware-in-the-Loop) systems.\nPrepare test objects (e.g., vehicles/rigs) by ensuring correct hardware and software baselines are installed and configured.\nPerform necessary hardware upgrades and technical maintenance in collaboration with engineering teams.\nTroubleshoot and resolve issues related to the testing rig or environment (e.g., invalid HW versions, connections to Box Cars) and implement countermeasures.\nTest Automation and Development\nDesign, develop, and maintain automated test scripts and frameworks to improve testing efficiency and coverage, particularly for repetitive and complex test cases.\nIdentify, propose, and implement automation work packages to continuously increase the level of test automation.\nUtilize and interpret data from logs generated by automation and rig environments (e.g., using Python, CAPL, and/or C#).\nTest Setup Maintenance (Physical/Hardware Focus)\nTake responsibility for the proper operation and maintenance of complex test setups (e.g., physical car setups, hardware-in-the-loop systems).\nPrepare test objects (e.g., vehicles/rigs) by ensuring correct hardware and software baselines are installed and configured.\nPerform necessary hardware upgrades and technical maintenance in collaboration with engineering teams.",
        "url": "https://www.globallogic.com/careers/system-test-engineer-developer-irc281713/",
        "published": "2025-11-17T08:03:15",
        "deadline": "2025-11-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30243671",
        "title": "Omda Incident - Back End Developer",
        "employer": "Omda AB",
        "location": "Göteborg",
        "description": "Join our team and your talent could be part of software creation that helps healthcare professionals bring new life safely into the world, contributes to more people living longer and more fully, or makes all the difference in emergencies when every second counts.\nOur teams empower customers with tools to support their patients and help save lives. We currently have seven business areas that develop specialised software solutions across medical fields and emergency services. At Omda you’ll be close to customer needs and your work will have an impact where it matters most.\nOur Emergency business area provides robust systems for managing every aspect of emergency response.\nWe are looking for a Back-End Developer who is not only passionate about solving problems and building great products for crucial 112 applications but also enthusiastic about contributing to a highly collaborative team based in Gothenburg. We offer a hybrid work model, where you can work remotely up to two days per week – or 40% of your time – depending on what suits the team and role best.\nYou will be part of a cross-functional agile development team working with new features, refactoring and maintaining our 112 back-end platform. You’ll collaborate with Product Owners, testers, UX and other developers in planning, daily stand-ups, code reviews and sprint deliveries. You will have a dedicated onboarding plan and experienced colleagues to guide and support you as you grow in the role.\nWe team up with product and design leads in planning and delivery, and we're firm believers that diverse teams are the strongest teams. We are always seeking ways to improve how we deliver projects and help evolve our technologies to solve upcoming challenges.\nAt the end of the day: we support each other's growth, encourage ownership and continuous development, and love that people can see the impact of their own work.\nDue to the nature of our systems within public safety, Swedish citizenship is a formal requirement for this position.\nOur tech stack:\n .NET / C#\n MSSQL\n \nYour matching strengths for the role:\n University degree in SW Engineering, or similar\n Proficiency in C# and .NET\n Great communication skills in both English and Swedish\n Teamwork oriented\n Strong \"Can-do-attitude\", fearless, proactive, and driven\n Proficiency in Database Development.\n Solution-oriented problem-solving with team and stakeholders\n A growth mindset and willingness to learn new things\n Being committed to Continuous Improvement in development practices\n Skill in Refactoring for improved code quality\n \nWould be great, but not mandatory, if you have:\n 2–8 years of experience as a back-end developer\n Experience with containers and orchestration (e.g. Docker, Kubernetes)\n A track record of innovation or creativity in software development\n Contributions to the tech community – such as bug reports, blog posts, talks, or open-source projects\n Any WPF experience would be great, we know it's unlikely..\n \n\nWe are interviewing continuously, therefore we recommend you submit your application as soon as possible.\nLooking forward to meeting you!",
        "url": "https://careers.omda.com/jobs/6562819-omda-incident-back-end-developer?promotion=1686188-arbetsformedlingen",
        "published": "2025-11-10T10:50:33",
        "deadline": "2026-04-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226640",
        "title": "Robotics Programmer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Robotics Programmer (ABB / Yamaha) to be based at our customer site in Gothenburg.\nThe role\nWe are seeking a highly skilled Robotics Programmer with expertise in ABB and Yamaha robotic systems to support advanced manufacturing processes including laser treatment, glue dispensing, and precision assembly. This role involves programming, calibrating, and optimizing robotic operations to meet performance, safety, and quality standards in automotive or battery production environments.\nKey Responsibilities\n- Program, calibrate, and optimise ABB and Yamaha robots for laser, dispense, and assembly operations.\n- Fine-tune robot paths to achieve required cycle time and quality.\n- Conduct online and offline programming using RobotStudio / Yamaha RCX Studio.\n- Validate safe robot motion and compliance with commissioning robot standards.\n- Collaborate with PLC, vision, and process engineers for seamless integration.\n- Support commissioning for laser, glue, and vision-guided robot cells.\n- Analyze defect, process improvement and Cycle time enhancement to improve productivity.\nRequired Skills\n- Strong command of ABB RAPID and Yamaha RCX programming environments.\n- Experience commissioning robots in automotive or battery manufacturing lines.\n- Proficiency in TCP calibration, path optimisation, and safe motion configuration.\n- Exposure to vision-guided robotics and dispense process synchronization preferred.\n- Experience of Robotic offline programming using Simulation software's like Delmia, Process Simulate, Robot Studio\nIf you are passionate about bringing innovation to the projects you work on and want to join a global company, then this is the place for you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-11-05T10:28:20",
        "deadline": "2025-12-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30215604",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-11-03T10:06:55",
        "deadline": "2025-12-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30213216",
        "title": "Senior Software Developer",
        "employer": "Commitify AB",
        "location": "Göteborg",
        "description": "Senior Software Developer\nWe are now looking for an experienced and motivated Senior Software Developer who wants to help shape the future of automotive software systems.\nAbout the role\nAs a Senior Software Developer, you will be part of a team responsible for developing embedded software in close collaboration with both suppliers and external partners. You will be involved throughout the entire process – from implementation and verification to delivery of complete systems for production.\nYou will contribute to developing the next generation of control units as well as maintaining current products in production. The role also includes planning test activities, managing equipment needs, and taking part in defining the software architecture and implementation strategy – from configuration to final delivery.\nYou will support the team in identifying and implementing enablers, provide technical guidance, and help foster a culture of quality and continuous improvement. Using your technical expertise, you will ensure that the software stack is developed, integrated, and tested efficiently and sustainably.\nThe work is carried out in close collaboration with various areas of expertise, both internally and externally, providing excellent opportunities for professional growth and broadening your technical knowledge.\nWho you are\nYou are a curious, positive, and self-driven individual with a strong passion for technology and collaboration. You have extensive experience in embedded software development and enjoy working in teams where you can contribute both strategically and hands-on.\nYou have strong communication skills and easily build trust and relationships across different stakeholders. You take a structured approach to your work and thrive in an environment where quality, responsibility, and innovation are key values.\nRequirements:\nMaster’s degree (MSc) in Software Engineering, Computer Science, Electrical Engineering, or equivalent field\nAt least 10 years of experience as a software developer, preferably within embedded systems\nStrong ability to plan, lead, and execute software development activities\nDeep understanding of software architecture, integration, and testing\n\nExperience in the following areas are required\nAUTOSAR\nAutomotive software stack development\nEmbedded software development\nConfiguration management and version control\nSoftware release and delivery processes\nProgramming in Python\nCommunication protocols such as CAN and Automotive Ethernet\nHardware-in-the-loop (HIL) systems and real-time simulation\nContinuous Integration, Verification, and Development\nPlatform and system development",
        "url": null,
        "published": "2025-10-31T16:25:20",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30203393",
        "title": "Senior Software Developer  Cybersecurity & System Architecture",
        "employer": "Globedesk Sverige AB",
        "location": "Göteborg",
        "description": "We’re looking for a Senior Software Developer with a strong background in Cybersecurity to join an agile team building a brand-new internal system for managing and securing external software. This is a hands-on development role with room to take technical leadership and shape how IT security is handled across the organization.\n🛠️ You’ll be involved in:\n• Building and maintaining a new system from scratch\n• Working closely with security requirements and compliance\n• Developing features, fixing bugs, and improving system performance\n• Conducting code reviews and writing unit tests\n• Using tools to visualize data and track usage\n• Sharing your knowledge and mentoring others in the team\n\n\n👨‍💻 Tech environment includes: Golang, Python, Java, Camunda, microservices, Git, Jenkins\n\n\n✅ What we’re looking for:\n• Several years of experience as a software developer, ideally with a focus on cybersecurity\n• Experience designing system architecture or working on new system builds\n• A team player who communicates clearly in both Swedish and English\n• Someone who enjoys mentoring, problem-solving, and working in a collaborative environment",
        "url": null,
        "published": "2025-10-29T15:12:50",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30169261",
        "title": "Software Developer",
        "employer": "Alten Sverige AB",
        "location": "Göteborg",
        "description": "We are looking for a Software Developer with strong experience in Model-Based Development for an advanced R&D assignment within the automotive industry. You will work on developing core functionalities for next-generation vehicle platforms, using Simulink and AUTOSAR-compliant workflows.\n\n \n\nYour profile\nA degree in Mechatronics, Electrical, Computer or Automotive Engineering\nAt least 3 years of experience in model-based software development within the automotive domain\nExcellent knowledge of MATLAB / Simulink, Stateflow, and Embedded Coder\nDeep understanding of AUTOSAR architecture, including SW-Cs, RTE interfaces and BSW integration\nExperience generating production-ready AUTOSAR-compliant code from Simulink models\nFamiliarity with Simulink libraries, custom blocks and S-Functions\nAbility to design modular, reusable and scalable software components\nA structured, analytical and collaborative way of working\nMeritorious experience includes functional safety (ISO 26262), CI/CD integration for MBD, and performance optimization of Simulink models.\n\r\n\nWhat you will do\n\nAs a Model-Based Software Developer, you will be responsible for designing and implementing Simulink models that enable functional growth in the vehicle’s core computing system.\n\n \n\nTasks include:\nDeveloping new features in Simulink / Stateflow aligned with AUTOSAR standards\nDesigning and structuring application-layer software components (SW-Cs)\nConfiguring and generating AUTOSAR-compliant C-code using Embedded Coder\nEnsuring traceability from requirements to model design\nPerforming peer reviews and continuous model improvements\nSupporting integration by delivering well-structured, verified models\n\n \n\nDeliveries\nSimulink models aligned with AUTOSAR architecture and development guidelines\nModular and reusable design ensuring scalability and maintainability\nVerified and production-ready generated code through Embedded Coder\nDocumentation according to project standards and model review results",
        "url": "https://www.alten.se/career/15160-Software-Developer-Simulink",
        "published": "2025-10-21T10:02:36",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235250",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1703519-arbetsformedlingen",
        "published": "2025-11-07T08:26:13",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235236",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Minst 5 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt.  \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg?promotion=1703515-arbetsformedlingen",
        "published": "2025-11-07T08:23:02",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30289631",
        "title": "Mjukvaruutvecklare till avancerade sensorsystem",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nHos oss bidrar du till att skapa trygghet för människor och samhällen - på riktigt. Här utvecklar du teknik som gör skillnad, i ett team där kunskap, innovation och samarbete står i centrum.\n\nDin roll\n\nSom mjukvaruutvecklare blir du en del av ett engagerat team som utvecklar programvara för signalbehandling och radarstyrning i avancerade sensorsystem för flygande plattformar.\n\nDu kommer att arbeta i en agil utvecklingsmiljö med stort utrymme för teknisk utveckling och personligt ansvar. Här får du möjligheten att påverka hela utvecklingskedjan - från idé till färdig lösning.\n\nDin profil\n\nVi söker dig som vill växa tillsammans med oss och bidra med både teknisk kompetens och drivkraft. Vi tror att du har:\n\n* Högskole- eller civilingenjörsexamen inom datateknik, elektroteknik, teknisk fysik eller motsvarande.\n\n* Goda programmeringskunskaper i exempelvis C++, C eller Java.\n\n* Starka matematiska färdigheter, gärna med erfarenhet av signalbehandling eller tracking.\n\n* Förmåga att arbeta i team men också kan arbeta självständigt och ta initiativ.\n\n* God kommunikativ och social förmåga - du gillar att samarbeta och dela kunskap.\n\nDet är meriterande om du har erfarenhet av agila arbetssätt och ett genuint intresse för teknik och problemlösning.\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n Vad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här",
        "url": "https://www.aplitrak.com/?adid=YS5vYmVyZy42Nzk1OC4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-11-20T17:20:03",
        "deadline": "2025-12-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30282246",
        "title": "Software Engineer",
        "employer": "Einride AB",
        "location": "Göteborg",
        "description": "Want to be part of transforming road freight – for good? Einride is showing the world a new way to move, based on the latest digital, electric and autonomous technologies. Through freight capacity as a service, we enable businesses around the world to accelerate towards their sustainability goals.\nFounded in 2016, Einride became the first company in the world to deploy a cab-less autonomous electric vehicle on a public road (Sweden, 2019). In 2022, we were the first to successfully operate such a vehicle on a US public road. Today our award-winning technology has been launched across 8 countries (and counting). Our clients are some of the world’s biggest shippers, including Fortune 500 companies. We are also operating Sweden’s largest truck dedicated public charging network and counting.\nWe are looking for a Software Engineer specialized in multi-modal perception systems for autonomous driving applications. The ideal candidate has strong software engineering skills and experience in designing, developing and transitioning R&D solutions into final products.\nYou will:\nResearch and develop state-of-the-art perception algorithms for autonomous vehicles to advance our perception stack.\nImplement solutions for multi-modal sensor fusion, 3D object detection, segmentation, tracking in complex dynamic environments, sensor degradation, and other safety-critical systems.\nIntegrate, validate, and deploy production-ready solutions.\nCollaborate closely with experts from System Engineering, Localization, Planning, and other teams to build a safe, deployable system.\n\n\n\nWe expect you to have:\nStrong technical background: PhD or highly qualified MS in one of the following: Robotics, Computer Science, Artificial Intelligence, Mathematics, or a related field.\n3-5+ years research or industry experience in one or more of the following: Perception, Sensor Fusion, Computer Vision, SLAM, Calibration.\nStrong foundation in linear algebra, data structures, algorithm design, and complexity analysis.\nExperience in C/C++ and Python, and strong problem-solving skills. You are passionate about solving real-world robotics challenges in the context of autonomous driving.\n\n\n\nThis is a full-time position based in Stockholm or Gothenburg. You will be part of a truly diverse, high performing team with a common passion for sustainability and making things happen in an innovative way. We recommend that you submit your application as soon as possible since selection and interviews are held continually.\nAt Einride, we are innovators, building solutions the world has never seen before – but urgently needs. That’s why we take action, and it’s why we are always eager to be challenged. We know that our best innovations come from having a diverse mix of people, including those of different experiences, career paths, and walks of life. By coming together and sharing our perspectives openly – by disagreeing, discussing, and committing – we deliver greater impact.\nPlease note that as part of our standard recruitment process, we conduct a background control on the final candidate for this role. This may include verification of education, employment history, any relevant professional certifications or other information that may be of our interest.\nBorn autonomous. Born electric.\nSince 2016, our technology has connected global communities with the things they need – and all without the emissions. We’re made up of experts in multiple fields and that’s how we’ve developed a new way to move goods. This is technology purpose-built for the industry. This is safer, cleaner, and more reliable movement.\nWe are Einride and this is how we build a better future.",
        "url": "https://emp.jobylon.com/jobs/290140-einride-senior-perception-engineer/",
        "published": "2025-11-19T11:18:00",
        "deadline": "2025-12-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30279026",
        "title": "Embedded Software Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "What you will do \nAs an Embedded Software Engineer, you will be at the heart of the development of future realtime SW platform. You will work with the specification and design of software architecture, implement, verify, integrate, and test embedded software, as well as develop test frameworks. We can offer you both fun and exciting challenges.  \nThe software platform includes, for example, low-level MCU drivers, device drivers for all connected peripherals, and CAN and Ethernet communication stacks. Other features are the real-time OS configuration, diagnostic event manager, and ECU power management. \nAdditionally, you will help improve our way of working, development tools, and continuous integration framework. \n \nYour future team \nIn our team, SW Platform - Vehicle, part of the Embedded Platform Factory in Vehicle Technology, we develop embedded solutions for full electric/hybrid powertrains, hydrogen technologies, engines, and transmissions, climate systems for the complete Volvo Group. In practice, we develop the next-generation embedded software for all our platform in-house control systems, and we are now in search of new innovative coworkers. We are a global team, and you will join our core software development center located in Lundby, Gothenburg. \nThe software platform provides a large set of generic services, like electronic hardware abstraction, central diagnostic functions, and various communication tasks. The development is targeting advanced automotive multicore MCUs and electronics. \n \nWho are you? \nWe are looking for you who are eager to grow as a professional, with an open mind and a proactive approach. With a strong drive and creativity, you provide ideas and solutions, from system design to verification. You are a team player and enjoy working with others but can also work independently. You are an open-minded and structured person with an proactive approach, and you have a drive to take initiative and not wait for them.  \n \nRequirements: \nB.Sc./M.Sc. in Embedded Software, Electronics, Physics, or equivalent education. \n2-5 years of experience in software engineering and embedded real-time systems programming. \nCompetence in embedded software architecture, design, and verification. \nKnowledge of programming embedded real-time systems in C. \nSkilled in Python and Git. \nFluent in English, both verbal and written. \n\n\n\nIt is considered a merit if you have knowledge in: \nTarget CPUs like Infineon Aurix TriCore 2:nd and 1:st gen, and NXP MPC57xxx \nISO26262 \nISO14229 \nTools like the Lauterbach T32 debugger, Oscilloscopes, and Robot Framework \nElectronics knowledge in automatics engineering and/or mechatronics \nPrevious experience in Volvo Powertrain software development \n\n\n\nReady for the next move? \nIf you want to make a real impact in your career, the transportation business is where you want to be. \n\n\nLocation: Gothenburg, Sweden. \nLast application date: November 29th, 2025.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=26578&company=volvoinfor&st=724E724FADE3CD55B40803C56B9D47A0E75E74D3",
        "published": "2025-11-18T15:26:40",
        "deadline": "2025-11-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30275551",
        "title": "Software Engineer - GPU & High-Performance Signal Processing",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Senior Software Engineer - GPU & High-Performance Signal Processing\n\nWant to influence the bigger picture? At Saab, you can realise amazing innovations that keep people and societies safe. Together, we can truly make an impact - and your part matters.\n\n \n\nYour role\n\nAt Saab Surveillance, we are developing the next generation of intelligent radar systems - advanced technology with a clear mission: to protect people and society.\n\nWe are looking to enhance the next generation of radar systems by fully utilizing the capabilities of GPU to crunch algorithms and manage signal processing in a much more efficient way. We´re about to start a new team and looking for a Senior Software engineer that can lead the team to design and build the next generation of high-performance radars where milliseconds matter and large amounts of data need to be handled in real time.\n\nIn this role you will:\n\n * Drive the development of advanced embedded radar signal processing applications on GPU\n * Work hands-on with performance-critical code to fully leverage modern computer architectures.\n * Collaborate with hardware architects, signal processing experts, and fellow software engineers throughout the product lifecycle.\n * Make important architectural decisions balancing performance, efficiency, and scalability.\n * Profile, analyze and optimize code to remove bottlenecks and push performance to new limits.\n * Act as the lead developer in the team that we´re about to form and foster and guide your team mates.\n\n \n\nYour profile\n\nWe believe you are a problem-solver who thrives on technical challenges and enjoys working in teams where knowledge-sharing and innovation are key. You combine deep technical expertise with a strong sense of responsibility for delivering high-quality solutions.\n\nTo succeed in this role, you bring:\n\n * A degree in Electrical Engineering, Computer Science, Mathematics, Physics - or equivalent professional experience.\n * 5+ years of professional experience in software development, preferably in an embedded context.\n * Proficient in C/C++.\n * Professional experience of GPU programming (CUDA, MatX or similar).\n * A solid understanding of parallel programming, computer architecture, and signal processing concepts.\n * Experience with modern software development practices (version control, testing, CI/CD).\n\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.\n\n \n\nWhat you will be a part of\n\nExplore a wealth of possibilities. Take on challenges, create smart inventions, and grow beyond. This is a place for curious minds, brave pioneers, and everyone in between. Together, we achieve the extraordinary, each bringing our unique perspectives. Your part matters.\n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,000 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here\n\nDo you want to get to know our business and our people a little bit better? Here you can find some stories told by our employees.\n\nIf you are interested in what benefits you can take part of as an employee at Saab in Sweden, you can read more about them here",
        "url": "https://www.aplitrak.com/?adid=cy5zdmVuc3Nvbi40MTEzMy4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-11-18T09:13:12",
        "deadline": "2025-12-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30266548",
        "title": "Enterprise Architect",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nEnterprise Architecture (EA) provides guidance and support in shaping a business-aligned digital ecosystem, fostering collaboration between business and technology functions to enable the organisation’s strategy.\n\nEA emphasises the importance of data-driven decision-making, ensuring that strategic and operational choices are informed by reliable data and insights.\n\nRather than prescribing rigid structures, EA encourages a shared understanding and flexible integration of business, information, application, data, and technology architecture, supporting innovation and adaptability as the digital landscape evolves.\n\n\nWhat you'll do\n\n\n  *  Define and evolve enterprise architecture across business, data, application, and technology domains.\n  *  Translate strategy into architectural roadmaps, enablers, and guardrails.\n  *  Establish and govern enterprise principles, patterns, and standards.\n  *  Guide teams to ensure designs align with target architecture.\n  *  Identify and manage architectural risks, technical debt, and dependencies.\n  *  Provide architectural input to investment planning and governance.\n  *  Embed security, privacy, resilience, performance, and cost considerations into designs.\n  *  Focus relentlessly on reducing complexity and accelerate delivery.\n  *  Surface and help resolve cross-organizational dependencies early.\n  *  Frame options and trade-offs to enable timely decisions.\n  *  Balance delivery needs with long-term architectural integrity.\n  *  Communicate complex topics clearly to diverse audiences.\n  *  Apply economic thinking to recommendations and decisions.\n  *  Foster transparency through documentation, knowledge sharing, and architectural thinking.\n  *  Build trusted relationships with business and technology leaders.\n  *  Mentor architects and elevate the architecture practice.\n\n\n\nWhat you'll bring\n\n\n  *  Demonstrated experience developing target states and transition roadmaps for complex ecosystems.\n  *  Strong understanding of enterprise capabilities, business architecture, and value streams.\n  *  Proficiency in reference architectures and patterns for integration, data, security, and cloud-native platforms.\n  *  Practical knowledge of identity and access management, cybersecurity, data privacy, and compliance.\n  *  Hands-on familiarity with distributed systems, scalability, operability, and reliability engineering concerns.\n  *  Experience applying fit-for-purpose governance to create guardrails without stifling delivery.\n  *  Ability to deliver clear, communicated enterprise guidance and principles.\n  *  Track record of establishing governed standards and patterns adopted by delivery teams.\n  *  Experience reducing duplication and technical debt through reuse and rationalization.\n  *  Proven ability to improve time-to-value and risk posture via aligned designs and roadmaps.\n\n\n\n#LI-DNI\n#LI-DNP",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43783295",
        "published": "2025-11-14T14:25:04",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30263723",
        "title": "Data Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment Description\nOur Client is looking for a Senior Data Engineer to join the BI & Analytics project . You will be part of a global team with colleagues in Sweden and India, working closely with business stakeholders to translate business needs into robust technical solutions.\n\nThis role requires a technically strong engineer who is also communicative, proactive, and comfortable working in an agile environment. You will be involved throughout the entire data lifecycle—from requirements and modeling to development, deployment, and operations.\n\nResponsibilities\n Design and implement data pipelines for processing and transforming data\n Work hands-on in the Databricks environment\n Set up and manage Azure DevOps from end to end (pipelines, releases, deployments, hotfixes)\n Perform data modeling and support BI initiatives\n Develop solutions using SQL, Python, PySpark, scripting\n Use Azure Data Factory, Databricks Workflows, and cluster management\n Collaborate with global teams in an agile setting\n Share knowledge and support colleagues\n Manage multiple projects in parallel\n Work on-site at the Gothenburg office\n \n\nRequired Skills – Must Have\n 7+ years of experience in data engineering\n Proven experience independently building data pipelines\n Strong experience setting up and configuring Azure DevOps from scratch\n Hands-on experience working in Databricks\n Excellent coding skills: SQL, Python, PySpark, scripts\n Experience with Azure Data Factory, Databricks Workflows, clusters\n 5+ years of experience in BI projects, including data modeling and business understanding\n Agile mindset and strong communication skills\n Experience with Git and DevOps practices\n Team player with strong collaboration skills\n Ability to work on-site in Gothenburg\n Fluent in English\n  Nice to Have \n  Ability to conduct hands-on upskilling sessions\n Automation experienc\n Shell scripting\n Power BI experience\n \nRequired skills\n\n \n Agile Delivery   PySpark   AzureDevops   BI Data Modeling   Automation-Driven Development    Databricks\n\n \nLanguages  English(Proficient)\nApplication Deadline-19th Nov",
        "url": "https://careers.progalaxy.se/jobs/6761349-data-engineer?promotion=1713085-arbetsformedlingen",
        "published": "2025-11-14T09:10:52",
        "deadline": "2026-05-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30252478",
        "title": "SW Verification Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment description \nProfessional Galaxy is looking for a SW Verification Engineer. \nAs an Integration functional test engineer, you are responsible for the functional verification of the complete electrical systems within SW Verification team in front of SW release for our client's cars. Working closely together with the China team. Execute verification and develop test methods in the Integration area. You will be a part of the Integration test team in Sweden. \nQualifications and skills required for the role \n B.Sc. in Electrical or Computer Engineering or similar. \n  4 years’ experience of automotive & integration of embedded systems \n  Relevant experience of the Integration and functional test in vehicle. \n  Experience driver of automotive tests in vehicles. \n  Ability to drive, motivate and convince. \n  Cultural awareness, especially China – European culture \n  Good in English (spoken and written) \n  Swedish driver’s license \n \nPersonal attributes \n Interest in cars and experience in driving \n  Strong test analysis skills \n  Cultural awareness, especially China – European culture \n  Good in English (spoken and written) \n  Advantageously to know Mandarin (Chinese) \n \nIT/SW requirements \nANanalyzer, Embedded Systems, CANoe, Functional Testing \nLanguages \nEnglish (Proficient)",
        "url": "https://careers.progalaxy.se/jobs/6741658-sw-verification-engineer?promotion=1708627-arbetsformedlingen",
        "published": "2025-11-11T19:33:54",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30224846",
        "title": "Electronics Hardware Design Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment description\nIn this position, you will be the Component Owner for key control units such as ECM or Inverter. You will carry full product responsibility over time, ensuring robust design, industrialization, and lifecycle management.\n\nYou will be the main contact between customers and suppliers and drive the product development from concept to production. You will be part of a team consisting of Software Component Owners, Architects and experts within System Safety, Cyber Security & EMC.\n\n\nKey responsibilities\n\n Lead the hardware design and lifecycle management of electronic control units (ECUs).\n Drive industrialization of automotive electronics from concept to production.\n Ensure compliance with automotive standards and best practices.\n Manage and resolve challenges related to EMC, load handling, and functional in/out pinning of circuit boards.\n Collaborate closely with software engineers and system architects to secure integration and node topology.\n Act as technical expert and main contact point for suppliers and internal stakeholders.\n \n\n\nSkill requirements\nYour profile\n\n Master’s degree or equivalent in Electrical Engineering or related field.\n Solid experience in electronics hardware development within the automotive industry.\n Proven track record working with industrialization of automotive ECUs.\n Deep knowledge of communication protocols between nodes, EMC impact, loads, and circuit board pin functionality.\n Strong understanding of software interaction and ECU topology.\n Experience from Volvo Cars, AB Volvo, or Geely Group companies in Western Sweden is a strong merit.\n Excellent problem-solving skills and ability to take ownership of technical solutions.\n \nRequired skills\nECUs,Communication Protocols, Automotive, Electrical Engineering, electronics hardware\nLanguages\nSwedish(Proficient)  English(Proficient) \nAssignment period\n17 Nov 2025  to 17 Dec 2026",
        "url": "https://careers.progalaxy.se/jobs/6709232-electronics-hardware-design-engineer?promotion=1699347-arbetsformedlingen",
        "published": "2025-11-04T16:24:52",
        "deadline": "2026-04-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30276840",
        "title": "Director of AI Engineering",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you passionate about Machine Learning and AI? Do you have the expertise to lead and inspire a high-performing enterprise AI team, whilst imparting deep and up-to-date technical hands on coding expertise in applied AI ? AstraZeneca is looking for an experienced Director of AI Engineering to join our dynamic team focused on using advanced technologies to solve high-impact strategic challenges in support of AstraZeneca's 2030 ambitions. If you are ready to make a real difference and drive innovation in a company committed to turning ideas into life-changing medicines, this might be the perfect opportunity for you. \n\n \n\nAbout the Role - Director of AI Engineering  \n\nAs the Director of AI Engineering, you will lead a team of AI Engineers in Gothenburg, collaborating deeply with product teams, product managers, and designers to build state-of-the-art reusable AI services and assets. These solutions will help accelerate our business outcomes and drive innovation across AstraZeneca. You will work closely with AI engineering product groups to integrate the latest features and capabilities, ensuring our AI solutions are at the forefront of technological advancements. \n\n \n\nKey Responsibilities: \n\n * \n\nTeam and technical leadership: Inspire and manage a team of AI Engineers, fostering growth and career development whilst imparting deep and up-to-date technical expertise in applied AI. Be as comfortable sourcing and defining projects as you are hands on team member code, proactively ensuring the highest engineering and software standards in the AI products that you build. \n\n * \n\nCollaboration: Work closely with product teams, leaders, and architecture teams to deliver AI solutions grounded in consistent, repeatable enterprise patterns and practices. \n\n * \n\nInnovation: Stay up-to-date and informed about the rapidly evolving AI landscape, integrating new algorithmic advancements into our solutions. \n\n * \n\nProblem Solving: Represent the AI engineering team, unblocking issues and driving alignment with senior management. \n\n * \n\nDelivery: Lead the planning and execution of key AI deliverables, structuring and streamlining delivery patterns across the Reusable AI Services portfolio. \n\n * \n\nStakeholder Engagement: Develop effective relationships with senior stakeholders to ensure optimal utilization of resources and services. \n\n * \n\nTechnical Excellence: Promote best practices in agile AI product development, software engineering, and model research. Define and implement golden-path standards and lead deep-expertise into one or more AI sub-domains (such as optimisation, language, muti-modal, prediction, deployment). \n\nEssential Skills/Experience: \n\n * \n\nBackground as a senior AI engineer with significant experience in leading agile AI products and services. \n\n * \n\nBsc/MSc/Ph.D degree in Computer Science or related quantitative field \n\n * \n\nExperience leading and managing junior and mid-level colleagues, delivering technical workshops and providing advanced technical mentorship. \n\n * \n\nExperience in planning and executing complex AI projects within high-performing engineering teams. \n\n * \n\nAbility to translate customer demands into detailed and actionable software briefs. \n\n * \n\nExperience with regulatory or compliance settings, appreciating the documentation and diligence required for ethical AI. \n\n * \n\nExpertise in developing machine learning models using cloud platforms, building APIs, and deploying web services. \n\n * \n\nAdvanced software development skills in Python and familiarity with database systems (e.g., SQL, NoSQL, graph). \n\n * \n\nProven leadership in software development best practices (software architecting, linting, CI/CD, unit tests, OOP, Git). \n\n * \n\nStrong understanding of algorithm design, development, optimisation, and scaling. \n\n * \n\nExcellent communication, business analysis, and consultancy skills, with the ability to work with various senior business and technical stakeholders. \n\n * \n\nPassion for advising on best-in-class delivery patterns that enable AI developers to do their best work. \n\n * \n\nStrong bias for action and results. \n\nWhat We Offer: \n\n * \n\nOpportunity to lead a high-impact AI team at AstraZeneca, making a real difference in healthcare. \n\n * \n\nCollaborative and innovative work environment with access to cutting-edge AI technologies. \n\n * \n\nProfessional growth and career development opportunities. \n\n * \n\nCompetitive compensation and benefits package. \n\nAre you ready to shape the future of AI at AstraZeneca? Apply now to join us on this exciting journey!",
        "url": "https://www.aplitrak.com/?adid=bWlrYWVsYS5qYWhyZXNrb2cuMzM2NDkuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2025-11-18T11:02:42",
        "deadline": "2025-12-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30260743",
        "title": "Junior Researcher in Machine Learning",
        "employer": "RISE Research Institutes of Sweden AB",
        "location": "Göteborg",
        "description": "Do you want to use your expertise in AI to help build a greener future? At RISE, you’ll have the opportunity to grow as a researcher in an environment where innovation, societal impact, and sustainability are at the core. We are now looking for a junior researcher in machine learning who wants to grow with us – and make a real difference.\nAbout us RISE Research Institutes of Sweden is Sweden’s research institute and innovation partner. With over 3,000 employees, we collaborate closely with industry, academia, and the public sector to strengthen Swedish competitiveness and contribute to a more sustainable society.\nWe are now looking for a Junior Researcher in Machine Learning for Earth Observation and Multisource Data Analysis, to join our Intelligent Systems unit, part of the Computer Science department. You will be part of our Deep Learning Group RIDR, where you’ll work alongside experienced colleagues in AI and machine learning – with a particular focus on climate adaptation. The group is also active in the research network Climate AI Nordics, providing you with a strong professional network and opportunities for collaboration and supervision with leading researchers across the Nordics and beyond.\nAs a junior researcher at RISE, you’ll have a unique opportunity to grow – both professionally and personally. Several of our junior researchers have started their PhD studies as part of their work at RISE, which may also become an opportunity for you in the near future. About the position You will conduct research in machine learning under the supervision of your research leader. Initially, you will work on the project “Grey to Green”, a project where we develop an AI- and GIS-based tool that helps cities and real estate companies transform grey areas into multifunctional green spaces, leading to smarter and more sustainable cities. Read more. \nYour responsibilities will also include:\n Communicating and coordinating with external stakeholders and project partners. \n Developing algorithms and writing code (typically in Python, using frameworks such as PyTorch) for training and evaluating machine learning models.\n Writing scientific articles for publication in journals and conferences.\n Participating in and practicing presenting research at academic conferences, workshops, and other relevant events.\n Engaging in meetings with a wide range of project stakeholders, including researchers and representatives from organizations such as the Swedish Environmental Protection Agency, SLU, and municipalities.\n Writing and presenting licentiate and doctoral theses.\n Contributing to internal meetings and collaborations within the research group, unit, and department. \n \nLocation: Gothenburg Travel: Some travel is required, primarily within Sweden and the Nordic region. \nWho are you? We are looking for someone with a strong interest in research related to climate, environment, and sustainable development. You are also eager to develop your ability to present your work and research in both individual and collaborative settings.\nRequired qualifications:\n A Master’s degree in a relevant field, such as such as engineering physics, applied mathematics, computer science, or remote sensing.\n Coursework in AI, machine learning, and image analysis.\n Excellent communication skills in English, both written and spoken.\n The position may be subject to security clearance, which means that EU citizenship is required.\n \nMeritorious qualifications:\n Ability to communicate in Swedish.\n Research experience and scientific publications in relevant fields.\n Experience with AI-focused projects, preferably with code available on platforms like GitHub.\n Coursework or experience in GIS, remote sensing, or similar areas.\n \nAre we a good match? At RISE, you’ll be part of our mission and work towards a more sustainable and competitive society. You’ll have the opportunity to work and develop in a dynamic and inspiring environment, alongside talented colleagues, where your work truly makes a difference. Welcome to RISE – Sweden’s research institute and innovation partner!\nWe look forward to your application! If this sounds interesting and you want to know more, please contact Stefan Wendin, Manager of Intelligent systems, stefan.wendin@ri.se. The application deadline is November 30. Apply without cover letter. Selection and interviews will take place continuously during and after the application period.\nOur trade union representatives are: Linda Ikatti, Unionen, 010-516 51 61, and Ingemar Petermann, SACO, +46 10 228 41 22.",
        "url": "https://career.ri.se/jobs/6755413-junior-researcher-in-machine-learning?promotion=1711854-arbetsformedlingen",
        "published": "2025-11-13T13:15:43",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30256653",
        "title": "Project Assistant in Modelling Digital Twin in Drinking Water Systems",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "If you are interested in drinking water and appreciate modelling drinking water distribution networks, this project is for you. You will work in an academic environment within ongoing research projects, collaborating closely with the drinking water industry.\n\nAbout us \nThe Water Environment Technology (WET) division at the Department of Architecture and Civil Engineering conducts research primarily in drinking water, wastewater, and stormwater systems. In the research area of drinking water, our focus includes flow modelling and risk assessment in distribution networks, water reuse and conservation, laboratory analytical chemistry, and risk management. This project specifically concentrates on flow modelling and contaminant transport within the distribution network.\n\nJob description\n\nThe project assistant will support the development of a decision support system based on a digital twin of the drinking water network. This Digital twin system will be used to detect leaks, that later can lead to pipe breaks, and also for emergency preparedness preventing and detecting system attacks. Key aspects include flow modelling of the network under normal and emergency conditions to stress the system and assess how the digital twin can aid decision-making from these scenarios.\n\nWho we are looking for \nApplicants must hold a MSc degree (or higher) in Civil Engineering, Environmental Engineering, or a closely related field, including courses in hydraulics/fluid mechanics. Knowledge of Python programming, machine learning (ML) or AI is a plus. Experience in hydrodynamic modelling of water systems is required, and familiarity with EPANET or similar software is an advantage. Understanding written and spoken Swedish is also necessary.\n\nContract terms  \nThe position is a temporary full-time employment for a maximum of 360 days. The desired start date is 15 December 2025, and the end date is 31 October 2026.\n\nWhat we offer \n\n• Read more about  working at Chalmers  and our benefits  for employees. \n\n\n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nApplication procedure \nThe application should be written in English be attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV \nPersonal letter \nOther documents (optional): \n• Copies of completed education, grades etc.\n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nApplication deadline: 25 November, 2025\n\nFor questions, please contact: \nProf. Thomas Pettersson\n Department of Water Environment Technology (WET)\n Email: thomasp@chalmers.se\n Phone: +46 (0)31-772 21 27\n\n \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14378&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-11-12T15:30:02",
        "deadline": "2025-11-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30216178",
        "title": "Product Manager, Kiona",
        "employer": "We SeeQ AB",
        "location": "Göteborg",
        "description": "Join Kiona as Product Manager and drive innovation and real impact for customers in our Retail & Refrigeration segment  In this strategic role, you’ll shape the segment’s future by combining AI, data, and sustainability to deliver smarter, energy-efficient solutions that help retailers and building owners reduce waste and optimize operations. You’ll own the product roadmap across the SaaS lifecycle and use AI to validate concepts faster and enhance workflows. \n About the role As Product Manager at Kiona, you play a key role in shaping and leading the development of services and features within our SaaS offering. You operate at the intersection of business, customer, and technology, turning insight into action and strategy into measurable results.\nYou’ll own the product strategy for the segment, ensuring that identified customer needs and business opportunities are turned into scalable SaaS solutions and measurable impact. Together with other Product Managers and the development team, you’ll ensure a unified strategy and turn insights into solutions that drive measurable business results. \n Your main responsibilities Take full ownership of the SaaS product lifecycle from concept and product strategy to packaging, launch, and continuous optimization. You’ll ensure our SaaS offering evolves into an even more professional, scalable, and value-driven solution, balancing short-term customer needs with long-term product vision.\n Define and communicate the end-to-end product roadmap, from idea to launch and continuous improvement \n Drive SaaS productification, ensuring that features and services are packaged and delivered as scalable, value-driven offerings\n Identify and validate new service and product opportunities that create customer value\n Leverage AI as a driver of smarter decisions, faster validation, and continuous innovation\n Collaborate with the development team to turn strategy into effective solutions\n Communicate roadmap progress and results across teams to ensure alignment and transparency\n Track feature adoption, measure impact, and deliver measurable business outcomes\n Work cross-functionally with tech, marketing, sales, and customer success\n Own the product’s business case and contribute to company growth and commercial success\n Act as an ambassador for your product, both internally and externally\n \nWe’re looking for someone who has\n A university degree in engineering, business, informatics, or equivalent\n Managing the full product lifecycle in a SaaS environment\n Ability to drive product strategy from idea to delivery and measurable results\n Prioritizing and making decisions based on customer insights and data\n Strong communication skills and the ability to align stakeholders\n Analytical strength and solid business acumen\n Excellent collaboration skills in cross-functional teams\n Fluency in both Swedish and English, written and spoken\n \nMeriting experience\n PropTech or Retail/Refrigeration domains\n Using or exploring AI in product development processes\n Scaling SaaS products across multiple markets\n Understanding of system integrations with platforms or hardware\n Monitoring and developing product business cases and commercial outcomes\n \nWho you are You thrive in a fast-paced environment where business and technology meet, curious about customer challenges and passionate about solving them. Analytical, communicative, and empathetic, you lead by example from idea to launch and build trust through clarity and collaboration. You navigate complexity with confidence and inspire others through engagement, vision, and clarity.\nYou are driven by development and want to contribute to shaping services and features that make a real difference for users and society.\nWhat Kiona offers you At Kiona, you get more than a job; you become part of a culture defined by our values: Trust, Curiosity, and Creativity. We trust each other and offer freedom with responsibility. We encourage curiosity and continuous learning, and we believe creativity drives progress. Here, you have space to grow, take ownership, and make an impact while working on solutions that make a real difference for the climate and our customers.\nThe position is based at Kiona’s new office in MIMO House, central Mölndal, opening in June 2026.\nAre you the Product Manager we’re looking for?   Application Kiona is partnering with We SeeQ in this recruitment. Please apply by answering the questions below and uploading your profile. For questions or further information, contact Lena Wadenby: 0702-943550 / lena.wadenby@weseeq.se.  \nAbout Kiona Kiona is a leading SaaS company with the vision to make a big impact in the fight against climate change by offering the smartest and most cost-effective proptech platform on the market. The company enables building owners and other stakeholders to achieve their financial and sustainability goals through the digitalization of new and old buildings and their heating, cooling, ventilation, and refrigeration systems. With offices in eight markets and 150 colleagues, Kiona currently connects over 55,000 commercial, industrial, residential, and public buildings and 3,000 grocery stores in Europe. Through an innovative platform that monitors, controls, and optimizes both energy use and organizations, Europe's existing buildings can now become part of the solution for the future. For more information, visit our website: www.kiona.com",
        "url": "https://weseeq.teamtailor.com/jobs/6688801-product-manager-kiona?promotion=1695718-arbetsformedlingen",
        "published": "2025-11-03T10:51:33",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30108410",
        "title": "Doctoral student in physics-informed machine learning for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided and data-driven foundation models for multivariate time series in safety-critical systems such as automotive. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering at Chalmers and University of Gothenburg in Sweden employs approximately 300 employees from more than 30 countries. The department is divided into four divisions and is widely recognized for excellent research and education, with activities on two campuses in the city of Gothenburg. Research in the department has a wide span, from theoretical foundations to applied systems development. We provide high quality education at the bachelor's, master's, and graduate levels, offering over 120 courses each year. We also have extensive national and international collaborations with academia, industry and society.\n\nWe are announcing a PhD position that is placed at the Computing Science division with Chalmers University of Technology as the employer. \n\nThis project is a collaboration between the AIXLab@Chalmers and Volvo Group. At AIXLab, we focus on developing AI solutions that are usable and applicable in real-world settings. We are part of the Computing Science division at the Department of Computer Science and Engineering.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other domains. You do not need extensive experience with physics-guided modeling; strong interest in time series machine learning and the ambition to learn are what matter most. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent.\n• You will need strong written and verbal communication skills in English.\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning.\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch). \n• Engineering skills: GPU/cluster training, experiment tracking, data engineering.\n• Ability to formulate research questions, run empirical studies at scale.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience with physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Experience with academic research and publications\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files. Please note the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than December 1st 2025\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nEmail: yinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nEmail: secarl@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14252&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-10-06T10:43:01",
        "deadline": "2025-12-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30096280",
        "title": "Data Warehouse Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "About Us\nEtraveli Group is the globally leading company for tech solutions and fulfilment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travellers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nDo you want to be part of the next step in our growth journey?\nAt Etraveli Group we use a lot of data for decision making processes, analysis and machine learning. Users of the data can be found in different departments like Finance, Customer Service, Sales, Data Science and Research. In alignment with our growing targets we are looking for experienced data engineers to become part of our Data Solutions team to get more data into our data lakehouse platform and prepare it in order to be used by the users. \nWho You Are\nWith the right skill set and motivation you will be setting up, maintaining and evolving our data warehouse solution as well as participating in driving a large portion of our future data engineering.\nIn this primarily technical role, there will be close interaction with database administrators and operations’ engineers, but there will also be collaboration with stakeholders from other parts of our organization (e.g data analysts, business intelligence teams and business stakeholders). The data sources we use are located both in cloud environments as well as on-prem. Working with us means you'll have access to a team of highly competent professionals and ample resources to foster your personal and professional growth. We face the challenges of the day working for a company that goes the extra mile to ensure that we have fun at, and outside, the office. \nRequirements\nTo thrive and succeed in this role we believe that you have:\nA strong interest in maintain and evolve our data warehouse solution\nAbility to analyze and take on tasks, both individually and together with others\nAbility to design and implement tasks from scratch, individually gathering the necessary information where needed\nStrong foundation in data warehousing concepts and data modeling (e.g., Star and Snowflake Schemas, Incremental Loads, Slowly Changing Dimensions)\nPrevious experience working with data processing and distributed query engines, like Spark, Dremio/Trino, Databricks\nPrevious experience working as a data engineer, with different ETL (e.g., dbt, Airflow) and CDC tools (e.g., Debezium, Flink CDC, Kafka Connect)\nPrevious experience working with multiple scripting languages, like Bash, Python, SQL, etc\n\nIt is also desirable that your skills match one or more of the following:\nPrevious experience to ensure high-performance data processing with techniques like indexing, partitioning, and caching.\nPrevious experience working with data integrations\nPrevious experience working with data modelling for efficient query performance, data quality and optimization\nPrevious experience working as a database administrator\nComfortable working with Linux, Docker, and preferably also Kubernetes\nExperience with data lakehouse table formats like Apache Iceberg or Delta Lake, enabling features like ACID transactions and time-travel on object storage\n\nBenefits\nAt Etraveli Technology, you will be part of a gang of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard.\nEtraveli Group is a company that really wants to contribute to you reaching your full potential.\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\nWe love gaming and after work activities.\nWe know the value of personal development and continuous training.\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\nWellness allowance - Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities.\nThrough partners, we offer comprehensive pension and health insurance so that you can quickly get help if the accident occurs.\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\nAnd we serve breakfast every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/206B865709/apply",
        "published": "2025-10-02T09:24:25",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]