[
    {
        "id": "30235210",
        "title": "Erfaren systemutvecklare inom mjukvaruutveckling",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Syntronic är en ledande design- och utvecklingspartner inom avancerade tekniklösningar. \nVi är stolta över att vara i framkant av teknologisk innovation och söker nu en erfaren systemutvecklare inom mjukvaruutveckling till vårt team i Göteborg.\nSom systemutvecklare hos oss:\nKommer du att vara involverad i allt från design, programmering, testning och implementation av mjukvarulösningar. Du får möjlighet att arbeta med varierande uppdrag hos olika kunder. \nVi använder moderna programmeringsspråk och ramverk såsom C#, Java, Python, .NET, och vi värdesätter erfarenhet av både SQL-databaser. \nVad vi söker hos dig som systemutvecklare:\n Högskole- eller civilingenjörsutbildning inom mjukvaruutveckling, systemutveckling, IT eller liknande\n Minst 5 års erfarenhet av systemutveckling och mjukvaruutveckling, med djup kunskap inom något eller flera programmeringsspråk (t.ex. C#, Java, Python, .NET)\n Erfarenhet av agil utveckling, Scrum, eller liknande metoder\n Erfarenhet av molntjänster som AWS, Azure, eller Google Cloud är ett stort plus\n Kommunicerar flytande på svenska och engelska, i tal och skrift.\n \nVi letar inte efter en perfekt lista av kvalifikationer, utan efter rätt person som vill utvecklas tillsammans med oss och våra kunder. \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354308-erfaren-systemutvecklare-inom-mjukvaruutveckling?promotion=1703512-arbetsformedlingen",
        "published": "2025-11-07T08:21:53",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30179680",
        "title": "Systemutvecklare ServiceNow GRC (Governance Risk Compliance)",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nDin roll\n\nDu kommer att ingå i vår centrala ServiceNow-grupp, där ditt fokus på GRC-projekt gör dig till ett värdefullt tillskott. Vi befinner oss i en spännande och snabbväxande fas, där vi förutom nyutveckling också arbetar med att underhålla och förädla befintliga lösningar.\n\nVåra verksamhetsnära projekt ger unika möjligheter att bidra till verklig affärsnytta. Därför är det viktigt att du, förutom att vara en skicklig utvecklare, också är duktig på att förstå verksamhetens behov och skapa välanpassade lösningar. Du behöver vara lika intresserad av att lyssna på och kommunicera med verksamheten som av att arbeta självständigt som utvecklare.\n\nResor kan tillkomma i tjänsten, främst till våra andra kontor runt om i landet. Det finns möjligheter att arbeta remote i viss utsträckning, och detaljerna kring detta kommer du att komma överens om med din närmaste chef.\n\nDin profil\n\nFör att passa hos oss tror vi att du är prestigelös och har en stark vilja att ständigt utvecklas och bli ditt bästa jag. Du trivs med att arbeta agilt, tar gärna egna initiativ och är naturligt hjälpsam. Eftersom vi arbetar i team är det viktigt att du känner dig bekväm i en lagmiljö. Vi är övertygade om att det är tillsammans som vi når framgång - genom att lita på, stötta och lära av varandra, både för Saabs bästa och för vår personliga utveckling.\n\nVi värdesätter också kreativitet och förmågan att tänka utanför boxen - att våga prova nya vägar och hitta innovativa lösningar är en självklar del av vårt arbetssätt.\n\nVi ser gärna att du har:\n\n * \n\nErfarenhet av implementering och/eller förvaltning av GRC (Governance, Risk & Compliance)\n * \n\nGod förståelse för GRC/IRM i ServiceNow samt kännedom om vanliga fallgropar\n * \n\nGod kunskap om ServiceNow som plattform\n * \n\nErfarenhet av att arbeta i ServiceNow-projekt med ambitionen att återgå till så kallade \"Out of the Box\"-lösningar\n * \n\nFörståelse för kopplingen mellan affärsvärde och GRC-processer\n * \n\nErfarenhet av agila arbetssätt\n * \n\nFlytande svenska och engelska i både tal och skrift\n * \n\nEn lagspelare som trivs i team\n\nMeriterande är om du också har:\n\n * \n\nKunskap om säkerhetsstandarder såsom ISO 27001 och NIST\n * \n\nCertifieringen CIS Risk and Compliance\n * \n\nErfarenhet av arbete som kravhanterare\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n \n\nVad du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=YS5vbHNzb24uOTcwMjguMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-10-23T10:50:36",
        "deadline": "2025-11-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30123730",
        "title": "Utvecklare - Fullstack react python",
        "employer": "Textual AB",
        "location": "Göteborg",
        "description": "textual.ai utvecklar AI-drivna lösningar som hjälper e-handelsföretag att automatisera innehållsproduktion, översättningar och marknadsföring. Våra verktyg kombinerar språkmodeller, dataanalys och smart design för att skapa effektiva system som används av stora e-handlare i Sverige och utomlands.\nOm rollen\nVi söker en fullstackutvecklare med erfarenhet av React och Python som vill arbeta med nästa generation av AI-baserade verktyg för digital handel. Du kommer att vara en del av ett litet, tekniskt starkt team som arbetar agilt och nära produkten – från idé till lansering.\nDina arbetsuppgifter\nUtveckla webbaserade applikationer och interna verktyg med React (frontend) och Python (backend).\nIntegrera språkmodeller och API:er för AI-funktionalitet.\nDelta i planering, design och tekniska beslut.\n\nKvalifikationer\nMinst 2 års erfarenhet av fullstackutveckling.\nGoda kunskaper i React, TypeScript och Python (t.ex. Django eller Flask).\nErfarenhet av API-utveckling och databaser.\nVan att arbeta med Git och moderna utvecklingsflöden.\nAnvända AI-assisterade utvecklingsverktyg som Cursor\nFörmåga att arbeta både självständigt och i team.\n\nMeriterande\nErfarenhet av AI eller maskininlärning (t.ex. LLM).\nErfarenhet av molnplattformar (AWS, GCP).\nIntresse för e-handel, språk och automatisering.\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": null,
        "published": "2025-10-09T07:56:40",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30256442",
        "title": "Data Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "Are you passionate about transforming data into scalable, secure, and intelligent solutions? We are hiring Data Engineers to join exciting projects at the forefront of analytics and innovation in the automotive and mobility sectors.\nWhat You’ll Do:\n• Design, build, and maintain scalable batch and streaming data pipelines. \n• Engineer robust ETL workflows and medallion architecture-based data lakehouses. \n• Develop and deploy data solutions using Python, PySpark, SQL, Airflow, and Databricks. \n• Use and manage tools across Azure, AWS, Docker, and Linux environments. \n• Operate with CI/CD principles using Git, DevOps, and Infrastructure as Code (IaC). \n• Ensure data quality, security, and system performance via monitoring and validation. \n• Work on advanced BI dashboards in Power BI.\n\nWhat we are looking for:\n• 6+ years of data engineering experience for senior roles; more for principal roles.\n• Strong coding background in Python, SQL, and Shell scripting.\n• Proficiency with cloud services like Azure Data Factory, AWS (Redshift, EMR, S3).\n• Experience in data modeling and business intelligence.\n• Comfortable with DevOps workflows and data platform operations.\n• Strong communication skills and team-first mindset.\n• Fluent in English\n \n \nNice to Have:\n• Experience with Power BI dashboards and BI project leadership.\n• Familiarity with automotive data systems.\n• Hands-on experience with regression, security, and system upgrade testing.\n\n \nWhy Work With Us?\nYou'll contribute to future-facing initiatives in autonomous driving, electric mobility, and global BI solutions. Whether it's within a startup environment or a powerhouse like the big automotive companies in Gothenburg , your work will directly impact the vehicles and technologies of tomorrow. Ready to make a data-driven difference? Apply now and power the future with us.",
        "url": "https://career.explipro.com/jobs/6744935-data-engineer?promotion=1710111-arbetsformedlingen",
        "published": "2025-11-12T15:05:13",
        "deadline": "2025-11-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30222565",
        "title": "Senior Automation Test Engineer C++",
        "employer": "Luxoft Sweden AB",
        "location": "Göteborg",
        "description": "Luxoft is a leading global software services company, delivering professional services across multiple business verticals such as finance, automotive, and digital transformation. The Automotive practice inside DXC Luxoft delivers SW projects to a majority of the world's car manufacturers and suppliers for both personal and commercial vehicles. We are known for our Automotive SW expertise and for helping our customers with high quality services and deliveries. Currently we are growing for our Swedish customers and are looking for Software Developers to join our team. You will be part of our growing organization in Sweden and will be part of developing next gen systems for the Automotive industry for the age of connected, autonomous, electric vehicles. Participate in the process of test system flow by defining test activities, equipment, asset under test and DUT (Device Under Test) preparedness together with requirement owner and suppliers..\nResponsibilities:\nAs a senior Test Automation Engineer at Luxoft you will be responsible for:\n• The ECU component verification, i.e. black and white box test, acceptance test and regression test on deliverables from supplier (both inhouse and external).\n• Automation of test cases in vTestStudio for Component-/Domain- and Complete testing in bench rig, HIL and on Vehicle. Test Cases to automate are from all functional areas.\n• Creating and maintain automation test framework in Python.\n• Testing methods & test case development, planning and coordination of test activities together with rest of the team. • Creating Fault reports and assign to receivers to investigate and create solutions.\n• Reviewing and communicating with suppliers' the test reports and results.\n• Independently take logs and measurement on the component and actuators and signals.\n• In collaboration with developer analyze logs to identify root cause of faults.\n• Ensuring the work is delivered as per specified acceptance criteria and definition.\n• Reading and analyzing from HIL's or other test set-ups.\n• Empowering close collaboration with team members within team and other teams.\n• Being self-organized and outspoken to support the team creating the best solutions.\nMandatory Skills Description:\n• Bachelor's or Master's degree in Engineering or equivalent education.\n• At least 8 years of experience from manual and automated verification of automotive embedded software.\n• Programming knowledge in Python and exposure to C++.\n• Knowledge and understanding how to read electrical schematics, use of instruments such as voltmeters and oscilloscopes.\n• Experiences of the following tools is preferred: Requirement management tool, Vektor tools like Canalyzer/Canoe (both Hardware and software), Inca and DSA.\n• Fluent in English.\n• European B-driver license.\nNice-to-Have Skills:\n• HIL sanity test automation in CANoe (CAPL) or Robot Framework.\n• Vector tools knowledge. • DSPACE tools knowledge.\n• JavaScript expert competence.\n• Docker.\n• Ansible.\n• Git, Gerrit, Artifactory.\n• CI/CD mindset.\n• Passion for new technologies, software and hardware test and creating great user experiences.\n• Willing to take up the task that is most important for the team to progress.\nhttp://www.luxoft.com",
        "url": "https://career.luxoft.com/jobs/regular-automation-test-engineer-15378",
        "published": "2025-11-04T11:44:00",
        "deadline": "2025-11-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30219739",
        "title": "Senior DevOps Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "We are looking for an experienced DevOps engineer who wants to enhance security and performance through reliable and scalable solutions.\nYou will work closely with architects and engineers to run applications and services on AWS, build and maintain integrations in our CI/CD ecosystem, and support product teams in effectively utilizing the platform. You will also identify bottlenecks, drive improvements, and shape how we deliver critical services at enterprise scale.\n\nAbout You\nYou are a customer-focused DevOps engineer with a strong background in AWS and modern CI/CD practices. You enjoy simplifying complex problems, thrive in collaborative environments, and take ownership of solutions from design to delivery.\n\nRequirements:\n- 7+ years of experience with AWS cloud architecture and operations\n- Solid background in CI/CD pipelines, automation, and monitoring\n- Hands-on experience with containerization and Kubernetes\n- Knowledge of Infrastructure as Code (Terraform, CloudFormation, CDK, or similar)\n- Good understanding of secure and reliable system design\n- Fluent English, spoken and written \n\nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
        "url": "https://career.explipro.com/jobs/6361033-senior-devops-engineer?promotion=1697451-arbetsformedlingen",
        "published": "2025-11-03T17:12:02",
        "deadline": "2025-12-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30180604",
        "title": "Senior Developer to Relay Software Team",
        "employer": "Mullvad VPN AB",
        "location": "Göteborg",
        "description": "About Us \nMullvad VPN is a Swedish VPN company dedicated to fighting mass surveillance and censorship. We do this primarily through our VPN service and our web browser.\nWe believe in a free and open society where people have the right to personal privacy; the right to their own thoughts and opinions, and the right to decide exactly when and with whom they want to share them.\nWe believe that privacy is the right which all other rights rest upon, and that democratic societies must be built on the right to privacy in order to thrive and develop.\nThe Job\nWe’re looking for a Senior Developer to join our Relay Software Team at Mullvad. This team is responsible for all custom software solutions used on our VPN relays. \nYou’ll play a key role in advancing server support for technologies such as Quantum-secure tunnels, traffic-analysis protection and protocol obfuscation. \nWho Are You\nYou’re someone who enjoys working in a team, contributes ideas proactively, and has a strong interest in security, networks and low-level software development. \nYou value quality, maintainability, and thoughtful software design. You are curious and eager to learn, and you understand the importance of digital privacy.\nResponsibilities Work on new and exciting technologies and greenfield projects.\n Using Go, design and implement robust server software for running on Linux.\n Author clean solutions that balance performance and resource usage.\n Perform measurements, testing and troubleshooting.\n Coordinate with stakeholders and developers in other departments.\n Qualifications Excellent written and spoken English and Swedish.\n Highly developed understanding of software design and all aspects of software implementation.\n Experience with building server software.\n Excellent understanding of networking fundamentals.\n Strong knowledge in at least one of C/Go/Rust.\n Why Mullvad?\nWe are a bunch of diversified peeps: from vegans to marathon runners, audiophiles to farmers and coffee brewers. So, what unites us? Our commitment to living and breathing our mission, to make mass surveillance and censorship impractical. \nAdditional Information\nLocation: Gothenburg, Sweden Start: As soon as possible Job Hours: Full-time\nThis is an ongoing recruitment process and we aim to fill the position as soon as possible. As part of our hiring process, we conduct a background check to ensure a safe and secure work environment.",
        "url": "https://www.mullvad.careers/jobs/6634589-senior-developer-to-relay-software-team?promotion=1683351-arbetsformedlingen",
        "published": "2025-10-23T13:07:36",
        "deadline": "2026-04-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30092160",
        "title": "Machine Learning Engineer - Computer Vision",
        "employer": "Repli5 AB",
        "location": "Göteborg",
        "description": "The Role: We're looking for an experienced Machine Learning Engineer with a deep background in computer vision and generative AI. You’ll be part of a team developing systems that generate realistic, diverse, and highly controllable synthetic image data using state-of-the-art tools like Stable Diffusion, LoRA, and ControlNet. Your work will directly impact the performance and robustness of real-world AI systems—from self-driving cars to defense robotics.\nWhat You’ll Do\n Develop and fine-tune generative AI pipelines (e.g., Stable Diffusion, ControlNet, LoRA) for synthetic image generation.\n Design and implement machine learning workflows to generate structured, photorealistic datasets.\n Collaborate with 3D artists and simulation engineers to align ML models with physical environments and sensor setups.\n Work closely with customers in automotive, robotics, and aerospace to deliver tailored datasets.\n Optimize generation systems for scalability, quality, and speed using tools like ComfyUI or custom pipelines.\n \nYou Should Have\n MSc or PhD in Computer Vision, Machine Learning, or related field.\n 3+ years of hands-on experience with deep learning frameworks (e.g., PyTorch, TensorFlow).\n Experience working with generative AI models (especially diffusion-based models).\n Familiarity with tools like LoRA, ControlNet, ComfyUI, or custom workflows around Stable Diffusion.\n Strong understanding of synthetic data generation and its role in training perception systems.\n A track record of deploying ML systems in domains like automotive, robotics, defense, or manufacturing.\n \nNice to Have\n Experience working with 3D simulation pipelines or sensor modeling (e.g., depth, LiDAR, segmentation).\n Contributions to open-source ML/gen AI tools or custom diffusion model training.\n Enjoying reading research papers\n A problem solving intellect and a team player spirit\n Knowledge of synthetic-to-real domain adaptation techniques.\n Experience in startup environments or working directly with enterprise R&D teams.\n A positive can-do attitude",
        "url": "https://repli5.teamtailor.com/jobs/6544271-machine-learning-engineer-computer-vision?promotion=1650650-arbetsformedlingen",
        "published": "2025-10-01T10:35:02",
        "deadline": "2026-03-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "29983430",
        "title": "Senior DevOps Engineer",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "About this role \nWe are now looking for a Senior DevOps Engineer for our organization, someone with a deep interest in infrastructure and enabling fast feedback loops for developers by developing continuous integration capabilities. You will belong to a small and passionate team responsible for developing our infrastructure and related technology stack for on premise and cloud deployments; the foundation for our video analytics platform that thousands of cameras across the world are connected to. \nSome of the technologies we use: \n Go and C++ \n  Kubernetes, OpenShift and Docker \n  Kafka, Redis, MongoDB and Postgres \n  Elastic and Grafana \n  Git, CircleCI and ArgoCD \n \nOur company culture is based on freedom and responsibility. For us that means you will be given extensive freedom to make strategic technical decisions while meeting our ambitious standards and making decisions in a responsible way. You will be located at our headquarters in Gothenburg where we are a team with a lot of positive energy and a strong sense of community. \nWho we think you are \nTo be successful in this role, we expect you will bring experience of working with product development and/or solutions that leverage physical or cloud infrastructure. Experience with on premise deployments is a plus. You also need a good understanding of organizational aspects of software development and of how to collaborate efficiently with others. \nRequirements \n At least 4 years of experience working with infrastructure and tooling for applications with high performance requirements. \n  Strong knowledge of multiple of the technologies we use, e.g., OpenShift, Kubernetes, databases and messaging systems. Kubernetes administrator certificate is a plus. \n  Linux administrator knowledge, e.g., knowledge in kernels, different distributions etc. \n  General interest and knowledge in security. \n  A strong desire to collaborate with others and to contribute to team success. \n  Great understanding of both Windows and Linux build environments and toolchains. \n  Excellent communication and organization skills and great personal initiative and drive, with an ability to understand the requirements of different stakeholders, keeping things organized, and making things happen. \n  Proficiency in English. Swedish is a plus but not a requirement. \n  A degree in computer science or software engineering. Alternatively, a combination of other relevant education (formal or self-taught) and experience. \n \n\nAbout Irisity \nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alert, leading to reduced crime rates and increased safety without any negative effects on personal privacy. \nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 90+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. \nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history. \nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds. \nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. Read more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6394507-senior-devops-engineer?promotion=1612570-arbetsformedlingen",
        "published": "2025-09-03T13:10:25",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30257224",
        "title": "Ignition Automation Developer",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vi tror att framsteg och möjligheter skapas bäst tillsammans. Välkommen till en plats där samarbete gör skillnad. \n\n \n\nDin roll\n\nSAAB är på en resa mot Industri 4.0 och vi behöver stärka teamet med en utvecklare som arbetar med vår Ignition plattform. Att ha bakgrundskunskap inom IIOT, PLC, HMI och SCADA är meriterande för att bygga lösningar mot Saabs olika enheter/ affärsområden. På sektionen jobbar idag cirka 15 personer och verksamheten är fördelad både geografiskt och över ett antal olika team. På arbetsplatsen finns en prestigelös kultur där man är professionell och engagerad, respekterar, stöttar och lär av varandra, resultat når vi tillsammans som ett team.\n \n\nSom Industrial Automation Engineer kommer du att arbeta i ett DevOps-team och ha en viktig roll inom framförallt utveckling men även förvaltning av Ignition plattformen. I din nya roll kommer du arbeta nära Service Manager, Scrum master, Solution Architects och Data Engineers. För att trivas i den här rollen behöver du ha ett intresse för industriella processer och produktionsmiljöer samt ett genuint intresse för utveckling och support av mjukvara inom IIOT/SCADA-området. Du kommer även att få hantera affärsmässiga krav från våra internkunder och verksamhetsprocesser.\n\n \n\nDin profil\n\nVi letar efter en noggrann och metodisk problemlösare, gärna med minst 5 års erfarenhet inom området, som är van vid att ta ansvar och arbeta självgående. Du har starka analytiska färdigheter, en god förmåga att strukturera och dokumentera ditt arbete samt ett öga för detaljer. Kommunikation är avgörande för oss, och vi värdesätter därför din sociala kompetens och förmåga att arbeta i team.\n\n \n\nVi tror att du som söker har:\n\n * Starka kunskaper inom Java-programmering för utveckling av skräddarsydda moduler och komponenter i Ignition.\n * Djupgående kunskap om Ignition-plattformens olika komponenter, inklusive moduler, klienter och databasintegration.\n * Färdigheter inom SQL för att skapa och hantera databaser samt förståelse för hur man integrerar databaser med Ignition-projekt.\n * Kunskap om webbteknologier som HTML, CSS, JavaScript och RESTful API för att skapa responsiva och användarvänliga gränssnitt i Ignition.\n * Förståelse för vanliga industriella kommunikationsprotokoll som OPC UA, Modbus och MQTT för att integrera olika enheter och system med Ignition.\n\n * Erfarenhet av att arbeta med SCADA-system och förståelse för dess arkitektur och funktioner.\n * Erfarenhet av HighByte Intelligence Hub är meriterande men inte ett krav.\n\n \n\nVi förväntar oss även att du har god förståelse för versionshanteringsverktyg, såsom Git, för att effektivt hantera källkod och samarbeta med andra utvecklare. Du har vana att utföra enhetstester och felsökning av kod för att säkerställa att Ignition-projekt fungerar felfritt och är robusta. En stark förståelse för säkerhetsprinciper och bästa praxis är avgörande för att skydda projekt mot potentiella säkerhetshot. Dessutom har du förmågan att skriva tydlig och omfattande dokumentation för både kod, konfiguration och användning av Ignition-projekt, vilket underlättar både underhåll och vidareutveckling.\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\n \n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\n \n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjIyNTY2LjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
        "published": "2025-11-12T16:22:04",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30269219",
        "title": "System Test Engineer / Developer IRC281713",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Description\nDue to intensive growth, GlobalLogic Automotive department is glad to invite System Test Engineer to an Automotive project.\nThe project aim is to optimize, extend with new features Automotive Solution. Our clients are Tier 1s and OEMs from Europe and USA and development is targeted to Automotive Solution what will be deployed in newest European cars. The project is considered as technical excellence and we are paying huge attention to technical challenge motivation of our team members as well as excellence compensation.\nAt our project we are building a computer-in-the-car architecture – key for enabling innovation within areas such as advanced connectivity, machine learning and autonomous drive.\nRequirements\nThe System Test Engineer / Developer is a hybrid role focused on ensuring product quality, performance, and reliability through the entire development lifecycle. This role involves designing and implementing comprehensive test strategies, developing automated test frameworks, and executing rigorous testing across both functional and low-level technical domains (e.g., Basetech). The ideal candidate is a proactive problem-solver with a strong technical background, capable of working with vague requirements and transforming manual test cases into scalable, automated solutions often utilizing physical test setups like Box Cars and HIL (Hardware-in-the-Loop) rigs.\nJob responsibilities\nTest Execution and Defect Management\nExecute a variety of tests, including functional, exploratory, regression (diagnostics, communication, etc.).\nAnalyze test results, document a summary report, and identify the root cause of failures, differentiating between product defects and rig/environment issues.\nCreate and manage detailed fault reports and bug tickets for identified product defects.\nTest Setup Maintenance and HIL/Box Car Operations\nTake responsibility for the proper operation and maintenance of complex test setups, including Box Cars (test benches/rigs) and HIL (Hardware-in-the-Loop) systems.\nPrepare test objects (e.g., vehicles/rigs) by ensuring correct hardware and software baselines are installed and configured.\nPerform necessary hardware upgrades and technical maintenance in collaboration with engineering teams.\nTroubleshoot and resolve issues related to the testing rig or environment (e.g., invalid HW versions, connections to Box Cars) and implement countermeasures.\nTest Automation and Development\nDesign, develop, and maintain automated test scripts and frameworks to improve testing efficiency and coverage, particularly for repetitive and complex test cases.\nIdentify, propose, and implement automation work packages to continuously increase the level of test automation.\nUtilize and interpret data from logs generated by automation and rig environments (e.g., using Python, CAPL, and/or C#).\nTest Setup Maintenance (Physical/Hardware Focus)\nTake responsibility for the proper operation and maintenance of complex test setups (e.g., physical car setups, hardware-in-the-loop systems).\nPrepare test objects (e.g., vehicles/rigs) by ensuring correct hardware and software baselines are installed and configured.\nPerform necessary hardware upgrades and technical maintenance in collaboration with engineering teams.",
        "url": "https://www.globallogic.com/careers/system-test-engineer-developer-irc281713/",
        "published": "2025-11-17T08:03:15",
        "deadline": "2025-11-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30243671",
        "title": "Omda Incident - Back End Developer",
        "employer": "Omda AB",
        "location": "Göteborg",
        "description": "Join our team and your talent could be part of software creation that helps healthcare professionals bring new life safely into the world, contributes to more people living longer and more fully, or makes all the difference in emergencies when every second counts.\nOur teams empower customers with tools to support their patients and help save lives. We currently have seven business areas that develop specialised software solutions across medical fields and emergency services. At Omda you’ll be close to customer needs and your work will have an impact where it matters most.\nOur Emergency business area provides robust systems for managing every aspect of emergency response.\nWe are looking for a Back-End Developer who is not only passionate about solving problems and building great products for crucial 112 applications but also enthusiastic about contributing to a highly collaborative team based in Gothenburg. We offer a hybrid work model, where you can work remotely up to two days per week – or 40% of your time – depending on what suits the team and role best.\nYou will be part of a cross-functional agile development team working with new features, refactoring and maintaining our 112 back-end platform. You’ll collaborate with Product Owners, testers, UX and other developers in planning, daily stand-ups, code reviews and sprint deliveries. You will have a dedicated onboarding plan and experienced colleagues to guide and support you as you grow in the role.\nWe team up with product and design leads in planning and delivery, and we're firm believers that diverse teams are the strongest teams. We are always seeking ways to improve how we deliver projects and help evolve our technologies to solve upcoming challenges.\nAt the end of the day: we support each other's growth, encourage ownership and continuous development, and love that people can see the impact of their own work.\nDue to the nature of our systems within public safety, Swedish citizenship is a formal requirement for this position.\nOur tech stack:\n .NET / C#\n MSSQL\n \nYour matching strengths for the role:\n University degree in SW Engineering, or similar\n Proficiency in C# and .NET\n Great communication skills in both English and Swedish\n Teamwork oriented\n Strong \"Can-do-attitude\", fearless, proactive, and driven\n Proficiency in Database Development.\n Solution-oriented problem-solving with team and stakeholders\n A growth mindset and willingness to learn new things\n Being committed to Continuous Improvement in development practices\n Skill in Refactoring for improved code quality\n \nWould be great, but not mandatory, if you have:\n 2–8 years of experience as a back-end developer\n Experience with containers and orchestration (e.g. Docker, Kubernetes)\n A track record of innovation or creativity in software development\n Contributions to the tech community – such as bug reports, blog posts, talks, or open-source projects\n Any WPF experience would be great, we know it's unlikely..\n \n\nWe are interviewing continuously, therefore we recommend you submit your application as soon as possible.\nLooking forward to meeting you!",
        "url": "https://careers.omda.com/jobs/6562819-omda-incident-back-end-developer?promotion=1686188-arbetsformedlingen",
        "published": "2025-11-10T10:50:33",
        "deadline": "2026-04-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226296",
        "title": "Market Developer Polyolefins ",
        "employer": "Telko Sweden AB",
        "location": "Göteborg",
        "description": "📌Location: Sweden \n📅 Application Deadline: 20.11.2025\n🔗 www.telko.com\nWe are looking for a skilled Market Developer Polyolefins to elevate our growth to new heights.\n \nWhy Telko?\nTelko is more than a distributor, we are a sustainable growth partner for various industries. We combine strong technical expertise, sustainability-driven thinking, and customer-centric solutions to help businesses succeed. With operations in 18 countries and a broad portfolio in plastics, chemicals, and lubricants, we are a trusted link between leading global principals and local industries.\nWe operate with the agility of a mid-sized company and the stability of a long-established corporation. At Telko, you’ll join an open, international, solution-oriented culture that encourages initiative and growth.\n Your Key Responsibilities\nIdentify and initiate new business opportunities, including emerging applications and profitable market segments \nAgree and follow monthly schedule of joint customer visits to provide technical and commercial support. \nProvide technical support during joint customer visits, enhancing credibility and solution-oriented discussions. \nCollaborate closely with Sales teams to align campaigns, share insights, and jointly pursue growth opportunities. \nDefine value propositions and growth potential for existing and new products, supporting strategic focus.\nDevelop technical sales documents (presentations, brochures) in cooperation with Marketing team \nSupport application development initiatives, leveraging polymer knowledge to create value-added solutions. \nParticipate in trade fairs and industry events to identify new developments and customer needs. \nConduct market research and competitor analysis to anticipate trends and adjust strategies proactively. \n\n \nWhat We’re Looking For\n-         Deep Industry Knowledge\n*    Profound understanding of polyolefins (PE, PP) markets, applications, and value chains.\n*    Awareness of sustainability trends and green plastics impact, including recycling and circular economy initiatives. \n-         Strategic Market Development\n*  Ability to identify and initiate new business opportunities and profitable market segments.\n*  Develop and execute sales strategies, pricing plans, and marketing campaigns aligned with long-term growth objectives. \n-         Customer-Centric Approach\n* Strong capability to support industrial customers in sustainability projects.\n*  Skilled in building long-term relationships and providing technical and commercial solutions. \n-         Sales & Negotiation Excellence: Proven track record in B2B sales and negotiation with complex accounts.\n-         Communication & Presentation: Ability to convey technical and commercial value propositions clearly to diverse stakeholders.\n-         Entrepreneurial Mindset: Business sense to spot trends and act proactively in competitive markets.\n-         Degree in Plastics Technology, Chemical Engineering, or related field.\n-         Fluency in English; additional European languages are advantageous. \n \nWhat We Offer\nA role in a dynamic, growing company with world-class principles in engineering plastics.\nOnboarding and further development of top-level selling and negotiation techniques and skills.\nTechnical trainings on the latest developments in the polymer industry, including sustainable plastics solutions.\nA positive and autonomous work environment.\nA great atmosphere in a highly engaged and top-performing Engineering team.\nTelko Campus offers a variety of development programs for our employees, including leadership skills, mentoring programs, English courses, sales skills and more.\n\n \nInterested? Submit your application and CV by 20.11.2025.\nWelcome to Unleash the Telko Effect with us!",
        "url": null,
        "published": "2025-11-06T10:12:25",
        "deadline": "2025-11-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226640",
        "title": "Robotics Programmer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Robotics Programmer (ABB / Yamaha) to be based at our customer site in Gothenburg.\nThe role\nWe are seeking a highly skilled Robotics Programmer with expertise in ABB and Yamaha robotic systems to support advanced manufacturing processes including laser treatment, glue dispensing, and precision assembly. This role involves programming, calibrating, and optimizing robotic operations to meet performance, safety, and quality standards in automotive or battery production environments.\nKey Responsibilities\n- Program, calibrate, and optimise ABB and Yamaha robots for laser, dispense, and assembly operations.\n- Fine-tune robot paths to achieve required cycle time and quality.\n- Conduct online and offline programming using RobotStudio / Yamaha RCX Studio.\n- Validate safe robot motion and compliance with commissioning robot standards.\n- Collaborate with PLC, vision, and process engineers for seamless integration.\n- Support commissioning for laser, glue, and vision-guided robot cells.\n- Analyze defect, process improvement and Cycle time enhancement to improve productivity.\nRequired Skills\n- Strong command of ABB RAPID and Yamaha RCX programming environments.\n- Experience commissioning robots in automotive or battery manufacturing lines.\n- Proficiency in TCP calibration, path optimisation, and safe motion configuration.\n- Exposure to vision-guided robotics and dispense process synchronization preferred.\n- Experience of Robotic offline programming using Simulation software's like Delmia, Process Simulate, Robot Studio\nIf you are passionate about bringing innovation to the projects you work on and want to join a global company, then this is the place for you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-11-05T10:28:20",
        "deadline": "2025-12-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30215604",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-11-03T10:06:55",
        "deadline": "2025-12-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30213216",
        "title": "Senior Software Developer",
        "employer": "Commitify AB",
        "location": "Göteborg",
        "description": "Senior Software Developer\nWe are now looking for an experienced and motivated Senior Software Developer who wants to help shape the future of automotive software systems.\nAbout the role\nAs a Senior Software Developer, you will be part of a team responsible for developing embedded software in close collaboration with both suppliers and external partners. You will be involved throughout the entire process – from implementation and verification to delivery of complete systems for production.\nYou will contribute to developing the next generation of control units as well as maintaining current products in production. The role also includes planning test activities, managing equipment needs, and taking part in defining the software architecture and implementation strategy – from configuration to final delivery.\nYou will support the team in identifying and implementing enablers, provide technical guidance, and help foster a culture of quality and continuous improvement. Using your technical expertise, you will ensure that the software stack is developed, integrated, and tested efficiently and sustainably.\nThe work is carried out in close collaboration with various areas of expertise, both internally and externally, providing excellent opportunities for professional growth and broadening your technical knowledge.\nWho you are\nYou are a curious, positive, and self-driven individual with a strong passion for technology and collaboration. You have extensive experience in embedded software development and enjoy working in teams where you can contribute both strategically and hands-on.\nYou have strong communication skills and easily build trust and relationships across different stakeholders. You take a structured approach to your work and thrive in an environment where quality, responsibility, and innovation are key values.\nRequirements:\nMaster’s degree (MSc) in Software Engineering, Computer Science, Electrical Engineering, or equivalent field\nAt least 10 years of experience as a software developer, preferably within embedded systems\nStrong ability to plan, lead, and execute software development activities\nDeep understanding of software architecture, integration, and testing\n\nExperience in the following areas are required\nAUTOSAR\nAutomotive software stack development\nEmbedded software development\nConfiguration management and version control\nSoftware release and delivery processes\nProgramming in Python\nCommunication protocols such as CAN and Automotive Ethernet\nHardware-in-the-loop (HIL) systems and real-time simulation\nContinuous Integration, Verification, and Development\nPlatform and system development",
        "url": null,
        "published": "2025-10-31T16:25:20",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30209432",
        "title": "Senior developer (C++)",
        "employer": "Academic Work Sweden AB",
        "location": "Göteborg",
        "description": "Academic Work is now recruiting a Senior C++ Developer on behalf of our client – a role for someone who thrives in a fast-paced environment and enjoys working independently with complex software tasks.\n\nOM TJÄNSTEN \nIn this role, you’ll take ownership of advanced development tasks—from planning software architecture and writing new code from scratch, to testing, verifying, and documenting your work. You’ll be working independently, but also contributing actively to the team’s goals and collaboration.\n\nTo succeed, you’ll need solid experience in C++, Git, Gerrit, and SQL, along with an analytical mindset, persistence, and strong attention to detail. Excellent communication skills and the ability to contribute positively to the team are key.\n\nVI SÖKER DIG SOM \n- Solid experience in C++ development\n- Proficient in Git and Gerrit for version control and code review\n- Hands-on experience with SQL and database handling\n- Ability to plan and design software architecture\n- Skilled in writing unit tests, verifying code, and documenting work\n- Comfortable working independently on complex development tasks\n- Strong analytical mindset and attention to detail\n\nOur recruitment process\n\nThis recruitment process is handled by Academic Work and it is our client’s wish that all questions regarding the position is directed to Academic Work.\n\nOur selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the next phase. The process includes two tests: one personality test and one cognitive test. The tests are tools to find the right talent for the right position, to enable equality, diversity, and a fair process.\n\nINFORMATION OM FÖRETAGET \nN/A",
        "url": "http://www.academicwork.se/jobad/senior-developer-c/15115475?apply=1",
        "published": "2025-10-31T00:01:38",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30203393",
        "title": "Senior Software Developer  Cybersecurity & System Architecture",
        "employer": "Globedesk Sverige AB",
        "location": "Göteborg",
        "description": "We’re looking for a Senior Software Developer with a strong background in Cybersecurity to join an agile team building a brand-new internal system for managing and securing external software. This is a hands-on development role with room to take technical leadership and shape how IT security is handled across the organization.\n🛠️ You’ll be involved in:\n• Building and maintaining a new system from scratch\n• Working closely with security requirements and compliance\n• Developing features, fixing bugs, and improving system performance\n• Conducting code reviews and writing unit tests\n• Using tools to visualize data and track usage\n• Sharing your knowledge and mentoring others in the team\n\n\n👨‍💻 Tech environment includes: Golang, Python, Java, Camunda, microservices, Git, Jenkins\n\n\n✅ What we’re looking for:\n• Several years of experience as a software developer, ideally with a focus on cybersecurity\n• Experience designing system architecture or working on new system builds\n• A team player who communicates clearly in both Swedish and English\n• Someone who enjoys mentoring, problem-solving, and working in a collaborative environment",
        "url": null,
        "published": "2025-10-29T15:12:50",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30169261",
        "title": "Software Developer",
        "employer": "Alten Sverige AB",
        "location": "Göteborg",
        "description": "We are looking for a Software Developer with strong experience in Model-Based Development for an advanced R&D assignment within the automotive industry. You will work on developing core functionalities for next-generation vehicle platforms, using Simulink and AUTOSAR-compliant workflows.\n\n \n\nYour profile\nA degree in Mechatronics, Electrical, Computer or Automotive Engineering\nAt least 3 years of experience in model-based software development within the automotive domain\nExcellent knowledge of MATLAB / Simulink, Stateflow, and Embedded Coder\nDeep understanding of AUTOSAR architecture, including SW-Cs, RTE interfaces and BSW integration\nExperience generating production-ready AUTOSAR-compliant code from Simulink models\nFamiliarity with Simulink libraries, custom blocks and S-Functions\nAbility to design modular, reusable and scalable software components\nA structured, analytical and collaborative way of working\nMeritorious experience includes functional safety (ISO 26262), CI/CD integration for MBD, and performance optimization of Simulink models.\n\r\n\nWhat you will do\n\nAs a Model-Based Software Developer, you will be responsible for designing and implementing Simulink models that enable functional growth in the vehicle’s core computing system.\n\n \n\nTasks include:\nDeveloping new features in Simulink / Stateflow aligned with AUTOSAR standards\nDesigning and structuring application-layer software components (SW-Cs)\nConfiguring and generating AUTOSAR-compliant C-code using Embedded Coder\nEnsuring traceability from requirements to model design\nPerforming peer reviews and continuous model improvements\nSupporting integration by delivering well-structured, verified models\n\n \n\nDeliveries\nSimulink models aligned with AUTOSAR architecture and development guidelines\nModular and reusable design ensuring scalability and maintainability\nVerified and production-ready generated code through Embedded Coder\nDocumentation according to project standards and model review results",
        "url": "https://www.alten.se/career/15160-Software-Developer-Simulink",
        "published": "2025-10-21T10:02:36",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235250",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1703519-arbetsformedlingen",
        "published": "2025-11-07T08:26:13",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235236",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Minst 5 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt.  \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg?promotion=1703515-arbetsformedlingen",
        "published": "2025-11-07T08:23:02",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30266548",
        "title": "Enterprise Architect",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nEnterprise Architecture (EA) provides guidance and support in shaping a business-aligned digital ecosystem, fostering collaboration between business and technology functions to enable the organisation’s strategy.\n\nEA emphasises the importance of data-driven decision-making, ensuring that strategic and operational choices are informed by reliable data and insights.\n\nRather than prescribing rigid structures, EA encourages a shared understanding and flexible integration of business, information, application, data, and technology architecture, supporting innovation and adaptability as the digital landscape evolves.\n\n\nWhat you'll do\n\n\n  *  Define and evolve enterprise architecture across business, data, application, and technology domains.\n  *  Translate strategy into architectural roadmaps, enablers, and guardrails.\n  *  Establish and govern enterprise principles, patterns, and standards.\n  *  Guide teams to ensure designs align with target architecture.\n  *  Identify and manage architectural risks, technical debt, and dependencies.\n  *  Provide architectural input to investment planning and governance.\n  *  Embed security, privacy, resilience, performance, and cost considerations into designs.\n  *  Focus relentlessly on reducing complexity and accelerate delivery.\n  *  Surface and help resolve cross-organizational dependencies early.\n  *  Frame options and trade-offs to enable timely decisions.\n  *  Balance delivery needs with long-term architectural integrity.\n  *  Communicate complex topics clearly to diverse audiences.\n  *  Apply economic thinking to recommendations and decisions.\n  *  Foster transparency through documentation, knowledge sharing, and architectural thinking.\n  *  Build trusted relationships with business and technology leaders.\n  *  Mentor architects and elevate the architecture practice.\n\n\n\nWhat you'll bring\n\n\n  *  Demonstrated experience developing target states and transition roadmaps for complex ecosystems.\n  *  Strong understanding of enterprise capabilities, business architecture, and value streams.\n  *  Proficiency in reference architectures and patterns for integration, data, security, and cloud-native platforms.\n  *  Practical knowledge of identity and access management, cybersecurity, data privacy, and compliance.\n  *  Hands-on familiarity with distributed systems, scalability, operability, and reliability engineering concerns.\n  *  Experience applying fit-for-purpose governance to create guardrails without stifling delivery.\n  *  Ability to deliver clear, communicated enterprise guidance and principles.\n  *  Track record of establishing governed standards and patterns adopted by delivery teams.\n  *  Experience reducing duplication and technical debt through reuse and rationalization.\n  *  Proven ability to improve time-to-value and risk posture via aligned designs and roadmaps.\n\n\n\n#LI-DNI\n#LI-DNP",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43783295",
        "published": "2025-11-14T14:25:04",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30263723",
        "title": "Data Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment Description\nOur Client is looking for a Senior Data Engineer to join the BI & Analytics project . You will be part of a global team with colleagues in Sweden and India, working closely with business stakeholders to translate business needs into robust technical solutions.\n\nThis role requires a technically strong engineer who is also communicative, proactive, and comfortable working in an agile environment. You will be involved throughout the entire data lifecycle—from requirements and modeling to development, deployment, and operations.\n\nResponsibilities\n Design and implement data pipelines for processing and transforming data\n Work hands-on in the Databricks environment\n Set up and manage Azure DevOps from end to end (pipelines, releases, deployments, hotfixes)\n Perform data modeling and support BI initiatives\n Develop solutions using SQL, Python, PySpark, scripting\n Use Azure Data Factory, Databricks Workflows, and cluster management\n Collaborate with global teams in an agile setting\n Share knowledge and support colleagues\n Manage multiple projects in parallel\n Work on-site at the Gothenburg office\n \n\nRequired Skills – Must Have\n 7+ years of experience in data engineering\n Proven experience independently building data pipelines\n Strong experience setting up and configuring Azure DevOps from scratch\n Hands-on experience working in Databricks\n Excellent coding skills: SQL, Python, PySpark, scripts\n Experience with Azure Data Factory, Databricks Workflows, clusters\n 5+ years of experience in BI projects, including data modeling and business understanding\n Agile mindset and strong communication skills\n Experience with Git and DevOps practices\n Team player with strong collaboration skills\n Ability to work on-site in Gothenburg\n Fluent in English\n  Nice to Have \n  Ability to conduct hands-on upskilling sessions\n Automation experienc\n Shell scripting\n Power BI experience\n \nRequired skills\n\n \n Agile Delivery   PySpark   AzureDevops   BI Data Modeling   Automation-Driven Development    Databricks\n\n \nLanguages  English(Proficient)\nApplication Deadline-19th Nov",
        "url": "https://careers.progalaxy.se/jobs/6761349-data-engineer?promotion=1713085-arbetsformedlingen",
        "published": "2025-11-14T09:10:52",
        "deadline": "2026-05-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30252478",
        "title": "SW Verification Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment description \nProfessional Galaxy is looking for a SW Verification Engineer. \nAs an Integration functional test engineer, you are responsible for the functional verification of the complete electrical systems within SW Verification team in front of SW release for our client's cars. Working closely together with the China team. Execute verification and develop test methods in the Integration area. You will be a part of the Integration test team in Sweden. \nQualifications and skills required for the role \n B.Sc. in Electrical or Computer Engineering or similar. \n  4 years’ experience of automotive & integration of embedded systems \n  Relevant experience of the Integration and functional test in vehicle. \n  Experience driver of automotive tests in vehicles. \n  Ability to drive, motivate and convince. \n  Cultural awareness, especially China – European culture \n  Good in English (spoken and written) \n  Swedish driver’s license \n \nPersonal attributes \n Interest in cars and experience in driving \n  Strong test analysis skills \n  Cultural awareness, especially China – European culture \n  Good in English (spoken and written) \n  Advantageously to know Mandarin (Chinese) \n \nIT/SW requirements \nANanalyzer, Embedded Systems, CANoe, Functional Testing \nLanguages \nEnglish (Proficient)",
        "url": "https://careers.progalaxy.se/jobs/6741658-sw-verification-engineer?promotion=1708627-arbetsformedlingen",
        "published": "2025-11-11T19:33:54",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30246370",
        "title": "ESW Function Owner - Steering systems",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions.\"\r\n\r\nAbout Us \nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport solutions for the future? If you seek to make a difference on a global scale, working with the next generation of technologies in a very collaborative team, then we could be a perfect match. \nThe group “Electrohydraulic Steering systems” within Vehicle Dynamics sub stream, belongs to the “Vehicle motion and thermal management” technology stream is responsible for developing platform electrohydraulic steering solutions within Volvo GTT.\nWe are seeking a Function Owner to strengthen our team in the Electrohydraulic Steering software development area.\nYou will be a member of a highly skilled agile team that have full product ownership of electrohydraulic steering systems, from requirement and specification to end customer and quality follow up. The team works closely together with all needed cross-functional counterparts in our global arena. \nRole Description\nAs a Function Developer and Function Owner within Vehicle Dynamics, you will be involved in all phases of development and maintenance of our interesting and complex end user functions connected to Electrohydraulic Steering systems. You will be the owner of some of our end-user functions and leading the development work in this area. \nThe work consists of specification and review of function and SW requirements, but also development of new functions and customer features. You will support internal customers, the aftermarket, production and end customers. You will perform tests in vehicles as well as tests in virtual and real environment. You will be a part of developing the global roadmap for future functions and features. An important part of the role is also to fault trace in vehicles.\nYour responsibilities will include:\n•    Perform functional development meaning requirement breakdown, software design, documentation, implementation, testing and verification\n•    Specify system/functional requirements and logic design breakdown\n•    Organize and participate in technical discussions with suppliers\n•    Test, tune and document function parameters, for each variant\n•    Leading functional safety and cyber security work \n•    Trouble shooting and provide support to aftermarket and production plants\n•    Network across the organization, as well as influencing the work in the other sites\n•    Develop acquired competence, as well as participate in business development\n•    Taking operational responsibility on your scope, implement improvements and fostering collaboration to get things done when needed\n•    Working closely together with other product leaders and suppliers to deliver a complete SW platform \nWho are you?\nAs a person you are driven with a mindset to learn and improve. As part of an agile team, you are a team player and enjoy teamwork, but you also have proven ability to work independently and drive development on your own. You have a Master of science degree in Mechatronics, Control engineering, Computer Science, Electronics or similar. We expect you to have a good understanding of system development of embedded real time systems and have good programing skills. You have effective communication and presenting skills both in text and verbally.  Business and customer oriented with an interest in the automotive industry. \nKnowledge and Experience requirements:\n•    Matlab and Simulink\n•    C++, C#, CANoe and CANalyzer\n•    Git\n•    Rapid prototyping (dSPACE tools) and systems development principles\n•    Static code analysis tools\n•    SystemWeaver (SE-TOOL)\n•    Autosar integration and Vector DaVinci\n•    Diagnostics and UDS protocol knowledge\n•    Strong knowledge of ISO26262 \n•    Vehicle Dynamics and Advanced Steering system is beneficial\n•    C/CE driving license is beneficial\nWork experience: Minimum 10 years of relevant experience. \nReady for the next move?\nIf you have any questions, feel free to contact us!\nEmma Heiwall, Group Manager, Electrohydraulic Steering Systems, Email - emma.heiwall@volvo.com\nSmita Shree, Talent Acquisition Partner, Email - smita.shree@volvo.com\nLast Application Date- 21st November, 2025\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43773321",
        "published": "2025-11-10T15:25:02",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235768",
        "title": "Junior Embedded Software Developer",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:We are delighted to announce an exciting opportunity to join Ericsson as a Developer. Within this role, you will have the chance to develop and maintain an array of products and services, spanning across components, units, nodes, networks, systems, and solutions. Your development journey in this role will range from requirement analysis, system design, architecture design, hardware design, software design, integration, simulation, tools design, Product Lifecycle Management (PLM) support, to creating product documentation. The role resonates profoundly with the Ericsson Product Development Principles. Please note that stage 8 and 9 Developer-specific governance and appointment rules are encapsulated within the job role. For further reference, a detailed description of the position outlining domain-specific responsibilities and authorities can be accessed on read more\nWhat you will do:- Engage in CEE10 Design DGS.\n- Undertake the SDI3 Upgrade.\n- Proactively share knowledge and collaborate with team members.\n- Design solutions using SDI3.\n- Incorporate SDI3 into system integration.\n- Oversee General Duties within a Cyclic Exec Environment (GDCE).\nThe skills you bring:- CEE10 Design DGS.\n- SDI3 Upgrade.\n- Knowledge Sharing and Collaboration Skills.\n- SDI3 Solution Design.\n- SDI3 Integration.\n- GDCE.\n- Coaching and Mentoring.\n- Innovation and Creativity.\n- Google GCP.\n- AWS Public Cloud.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43768134",
        "published": "2025-11-07T09:25:03",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30224846",
        "title": "Electronics Hardware Design Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment description\nIn this position, you will be the Component Owner for key control units such as ECM or Inverter. You will carry full product responsibility over time, ensuring robust design, industrialization, and lifecycle management.\n\nYou will be the main contact between customers and suppliers and drive the product development from concept to production. You will be part of a team consisting of Software Component Owners, Architects and experts within System Safety, Cyber Security & EMC.\n\n\nKey responsibilities\n\n Lead the hardware design and lifecycle management of electronic control units (ECUs).\n Drive industrialization of automotive electronics from concept to production.\n Ensure compliance with automotive standards and best practices.\n Manage and resolve challenges related to EMC, load handling, and functional in/out pinning of circuit boards.\n Collaborate closely with software engineers and system architects to secure integration and node topology.\n Act as technical expert and main contact point for suppliers and internal stakeholders.\n \n\n\nSkill requirements\nYour profile\n\n Master’s degree or equivalent in Electrical Engineering or related field.\n Solid experience in electronics hardware development within the automotive industry.\n Proven track record working with industrialization of automotive ECUs.\n Deep knowledge of communication protocols between nodes, EMC impact, loads, and circuit board pin functionality.\n Strong understanding of software interaction and ECU topology.\n Experience from Volvo Cars, AB Volvo, or Geely Group companies in Western Sweden is a strong merit.\n Excellent problem-solving skills and ability to take ownership of technical solutions.\n \nRequired skills\nECUs,Communication Protocols, Automotive, Electrical Engineering, electronics hardware\nLanguages\nSwedish(Proficient)  English(Proficient) \nAssignment period\n17 Nov 2025  to 17 Dec 2026",
        "url": "https://careers.progalaxy.se/jobs/6709232-electronics-hardware-design-engineer?promotion=1699347-arbetsformedlingen",
        "published": "2025-11-04T16:24:52",
        "deadline": "2026-04-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30186205",
        "title": "Engineering Graduate Program 2026 - System Verification Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\n\nWork with the latest technologies to shape tomorrow's society\nImagine yourself working with some of the sharpest and most creative brains in the transport and infrastructure industry, developing cutting-edge technologies and sustainable transport solutions that will change the future of society.\nWe are passionate about what we do; we aim for high performance and thrive on teamwork. We are almost 100,000 colleagues united around the world by a culture of care, empowerment, and inclusiveness, where each one of us can give our very best.\n\n\nAre you ready to join the Engineering Graduate Program?\nThe Engineering Graduate Program at Volvo Group Trucks Technology is a global 12-month program where you are offered the perfect mix of on-the-job learning and diverse training modules. You will get the chance to use and develop your technical and creative engineering skills, while gaining valuable experience working with real products on real business challenges. During the year you will engage in activities that will help you grow professionally and personally, developing strong communication and collaboration skills. \nBesides your manager, who will guide and support you in your daily job, you will have a supportive network of peer graduates, colleagues across the globe, and senior leaders to help you excel. We hope you will learn as much from us as we will from you.\n\n\nShape the Future of Safe & Efficient Driving and Services with Us\nAbout the Team\nWe support the Volvo Group engineering community with cutting-edge tools, verification methods, and data-driven insights. The Data & Release substream is a dynamic and newly formed organization within Safe & Efficient Driving (SED) at Volvo Group Trucks Technology (GTT). Our Test and Release team is at the forefront of verifying and validating the main ECUs that enable ADAS functionalities—and beyond. As vehicle functions become increasingly distributed across multiple ECUs, our challenge is to develop new verification frameworks to ensure comprehensive HIL (Hardware-in-the-Loop) and SIL (Software-in-the-Loop) testing for all our end-user functions.\n\n\nHow you will make an impact \nAs an Engineering Graduate in the Data & Release, you will:\n•  Participate in the verification and validation of ADAS and other vehicle functionalities at both HIL and SIL levels.\n•  Contribute to the development of new verification frameworks to ensure full coverage of our Functions.\n•  Leverage data-driven approaches to create dashboards that visualize software performance and quality.\n•  Automate data collection and analysis tasks, enabling the team to focus on insights and improvements rather than manual data handling.\n•  Collaborate with cross-functional teams to drive continuous improvement in our verification processes.\n•  Gain hands-on experience with state-of-the-art tools and methodologies in a global, innovative environment.\n \nWe believe that you are driven, curious, and eager to learn. You thrive in a collaborative environment and are passionate about making a difference through technology and data.\n\n\nYou meet the following requirements: \n•  An M.Sc. degree in Computer Science, Electrical Engineering, Data Science, Systems and Controls, or a related field.\n•  Strong interest and/or experience in verification and validation, especially HIL/SIL testing.\n•  Good programming skills (Python, C++, or similar) and familiarity with data analytics tools (e.g., MATLAB, Power BI).\n•  A passion for automation and data-driven development.\n•  The ability to work in an international context and willingness to travel.\n\n\nTo qualify for the Engineering Graduate Program, you’ve completed a master’s degree prior to the start of the program but not more than 18 months ago. You should not have more than two years' full-time working experience in the field prior to starting. You also need to be fluent in English, both written and verbal.\n\n\nWhat’s in it for you?\nOur Engineering Graduate Program starts in August 2026, and you will be offered a permanent position at Volvo Group Trucks Technology with placement in Sweden, Gothenburg. These are some of the benefits of joining our program:\nAn opportunity to work with the latest technology. \nAn exciting and global working environment with experienced colleagues. \nPossibility to gain international experience through a short-term assignment abroad. \nA competitive salary and permanent position from day one. \nVarious workshops and seminars designed to help you grow into your future career at Volvo Group. \nThe possibility to shape your own career with endless career opportunities.\n\n\n\nThe application process\nThe journey begins! An email confirmation will be sent when you submit your application. After this, it is still possible to update your personal profile by logging into your account. The hiring team will review your application together with the hiring manager. Shortlisted candidates will be contacted with information about the following steps.\n\n\nLast application date: November 23rd, 2025.\n\n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://jobs.volvogroup.com/job-invite/25706/",
        "published": "2025-10-24T13:42:45",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30260743",
        "title": "Junior Researcher in Machine Learning",
        "employer": "RISE Research Institutes of Sweden AB",
        "location": "Göteborg",
        "description": "Do you want to use your expertise in AI to help build a greener future? At RISE, you’ll have the opportunity to grow as a researcher in an environment where innovation, societal impact, and sustainability are at the core. We are now looking for a junior researcher in machine learning who wants to grow with us – and make a real difference.\nAbout us RISE Research Institutes of Sweden is Sweden’s research institute and innovation partner. With over 3,000 employees, we collaborate closely with industry, academia, and the public sector to strengthen Swedish competitiveness and contribute to a more sustainable society.\nWe are now looking for a Junior Researcher in Machine Learning for Earth Observation and Multisource Data Analysis, to join our Intelligent Systems unit, part of the Computer Science department. You will be part of our Deep Learning Group RIDR, where you’ll work alongside experienced colleagues in AI and machine learning – with a particular focus on climate adaptation. The group is also active in the research network Climate AI Nordics, providing you with a strong professional network and opportunities for collaboration and supervision with leading researchers across the Nordics and beyond.\nAs a junior researcher at RISE, you’ll have a unique opportunity to grow – both professionally and personally. Several of our junior researchers have started their PhD studies as part of their work at RISE, which may also become an opportunity for you in the near future. About the position You will conduct research in machine learning under the supervision of your research leader. Initially, you will work on the project “Grey to Green”, a project where we develop an AI- and GIS-based tool that helps cities and real estate companies transform grey areas into multifunctional green spaces, leading to smarter and more sustainable cities. Read more. \nYour responsibilities will also include:\n Communicating and coordinating with external stakeholders and project partners. \n Developing algorithms and writing code (typically in Python, using frameworks such as PyTorch) for training and evaluating machine learning models.\n Writing scientific articles for publication in journals and conferences.\n Participating in and practicing presenting research at academic conferences, workshops, and other relevant events.\n Engaging in meetings with a wide range of project stakeholders, including researchers and representatives from organizations such as the Swedish Environmental Protection Agency, SLU, and municipalities.\n Writing and presenting licentiate and doctoral theses.\n Contributing to internal meetings and collaborations within the research group, unit, and department. \n \nLocation: Gothenburg Travel: Some travel is required, primarily within Sweden and the Nordic region. \nWho are you? We are looking for someone with a strong interest in research related to climate, environment, and sustainable development. You are also eager to develop your ability to present your work and research in both individual and collaborative settings.\nRequired qualifications:\n A Master’s degree in a relevant field, such as such as engineering physics, applied mathematics, computer science, or remote sensing.\n Coursework in AI, machine learning, and image analysis.\n Excellent communication skills in English, both written and spoken.\n The position may be subject to security clearance, which means that EU citizenship is required.\n \nMeritorious qualifications:\n Ability to communicate in Swedish.\n Research experience and scientific publications in relevant fields.\n Experience with AI-focused projects, preferably with code available on platforms like GitHub.\n Coursework or experience in GIS, remote sensing, or similar areas.\n \nAre we a good match? At RISE, you’ll be part of our mission and work towards a more sustainable and competitive society. You’ll have the opportunity to work and develop in a dynamic and inspiring environment, alongside talented colleagues, where your work truly makes a difference. Welcome to RISE – Sweden’s research institute and innovation partner!\nWe look forward to your application! If this sounds interesting and you want to know more, please contact Stefan Wendin, Manager of Intelligent systems, stefan.wendin@ri.se. The application deadline is November 30. Apply without cover letter. Selection and interviews will take place continuously during and after the application period.\nOur trade union representatives are: Linda Ikatti, Unionen, 010-516 51 61, and Ingemar Petermann, SACO, +46 10 228 41 22.",
        "url": "https://career.ri.se/jobs/6755413-junior-researcher-in-machine-learning?promotion=1711854-arbetsformedlingen",
        "published": "2025-11-13T13:15:43",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 100
    },
    {
        "id": "30256653",
        "title": "Project Assistant in Modelling Digital Twin in Drinking Water Systems",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "If you are interested in drinking water and appreciate modelling drinking water distribution networks, this project is for you. You will work in an academic environment within ongoing research projects, collaborating closely with the drinking water industry.\n\nAbout us \nThe Water Environment Technology (WET) division at the Department of Architecture and Civil Engineering conducts research primarily in drinking water, wastewater, and stormwater systems. In the research area of drinking water, our focus includes flow modelling and risk assessment in distribution networks, water reuse and conservation, laboratory analytical chemistry, and risk management. This project specifically concentrates on flow modelling and contaminant transport within the distribution network.\n\nJob description\n\nThe project assistant will support the development of a decision support system based on a digital twin of the drinking water network. This Digital twin system will be used to detect leaks, that later can lead to pipe breaks, and also for emergency preparedness preventing and detecting system attacks. Key aspects include flow modelling of the network under normal and emergency conditions to stress the system and assess how the digital twin can aid decision-making from these scenarios.\n\nWho we are looking for \nApplicants must hold a MSc degree (or higher) in Civil Engineering, Environmental Engineering, or a closely related field, including courses in hydraulics/fluid mechanics. Knowledge of Python programming, machine learning (ML) or AI is a plus. Experience in hydrodynamic modelling of water systems is required, and familiarity with EPANET or similar software is an advantage. Understanding written and spoken Swedish is also necessary.\n\nContract terms  \nThe position is a temporary full-time employment for a maximum of 360 days. The desired start date is 15 December 2025, and the end date is 31 October 2026.\n\nWhat we offer \n\n• Read more about  working at Chalmers  and our benefits  for employees. \n\n\n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nApplication procedure \nThe application should be written in English be attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV \nPersonal letter \nOther documents (optional): \n• Copies of completed education, grades etc.\n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nApplication deadline: 25 November, 2025\n\nFor questions, please contact: \nProf. Thomas Pettersson\n Department of Water Environment Technology (WET)\n Email: thomasp@chalmers.se\n Phone: +46 (0)31-772 21 27\n\n \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14378&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-11-12T15:30:02",
        "deadline": "2025-11-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30250377",
        "title": "System Verification Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\n\nWhat you will do\nAs System Verification Engineer, you will play a critical role in defining, developing, and executing verification strategies for our embedded systems. Your responsibilities will range from crafting detailed verification plans to leading test execution and analysis, ensuring that all system components meet the highest functional and safety standards.\n \nYou will collaborate closely with system architects, software engineers, and hardware teams to define and refine verification requirements that align with system specifications. Your role will involve selecting the right verification tools and methodologies, from formal verification and simulation to emulation, while also developing custom testing environments and automation scripts to improve efficiency.\nKey Responsibilities:\nVerification Strategy Development: \nDevelop and maintain a comprehensive verification strategy, including test plans, test cases, and coverage analysis. \nDefine and implement verification methodologies and processes, such as formal verification, simulation, and emulation. \nCollaborate with system architects and software engineers to ensure verification requirements align with system specifications. \n\n \nVerification Toolchain: \nSelect and configure appropriate verification tools and frameworks, including simulators, emulators, and formal verification tools. \nDevelop and maintain custom verification environments and scripts to automate testing processes. \n\n \nVerification Execution and Analysis: \nOversee the execution of verification activities, including test case development, test execution, and defect tracking. \nAnalyze verification results to identify potential issues and risks, and work with development teams to resolve them. \nTrack and report on verification progress, metrics, and coverage. \n\n \nTeam Leadership and Mentoring: \nLead and mentor a team of verification engineers, providing technical guidance and support. \nFoster a culture of quality and continuous improvement within the verification team. \n\n \nCollaboration: \nCollaborate closely with system architects, software engineers, and hardware engineers to ensure seamless integration of verification efforts. \nWork with cross-functional teams to identify and address verification challenges. \n\nWho are you?\nWe are seeking a technically skilled individual with a solid background in Automotive embedded systems and software development processes. You should be comfortable working with various verification methodologies—whether it’s unit testing, integration testing, or system-level verification—and possess a deep understanding of tools and languages used for verification, such as Vector CAN tools and formal verification platforms.\n \nYour experience in scripting (Python, CAPL, C#) will allow you to automate testing processes and create efficient verification environments. You’ll need excellent problem-solving skills and the ability to analyze complex data and results.\n \nAs System Verification Engineer, you’ll not only execute verification activities but also lead and mentor a team of engineers. Good leadership skills, the ability to guide technical teams, and a passion for fostering a culture of quality are essential. Also, your collaborative mindset will help you work seamlessly across functions to address challenges and ensure that verification efforts are tightly integrated into the overall development process. \n \nPreferred qualifications \nWhile not required, we would particularly value candidates with experience in the automotive industry and a familiarity with industry standards and certification processes such as ISO 26262. A solid understanding of formal verification techniques and experience with continuous integration (CI/CD) pipelines will be advantageous. \n \nExperience in advanced verification techniques, including constrained-random verification and coverage-driven verification, will set you apart, as will any knowledge of emerging AI or machine learning-based verification methods.\n \nIf you hold any test certification, that would also be an asset, helping you to contribute more effectively to cross-functional initiatives and ensuring alignment with business priorities. \nReady for the next move?\nApply Now! If you are a motivated, detail-oriented engineer with a passion for automotive technologies and testing, we want to hear from you. Join us in shaping the future of the automotive industry! \n \nFor additional information about the process, contact Erik Lindberg, Talent Acquisition Partner at erik.lindberg.3@volvo.com\nHiring Manager: Lokeshwaran Maruthanayagam\n \nLast application date: November 22, 2025 \n\n\nWe value your data privacy and therefore do not accept applications via mail. \n \nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n \nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \n \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=25751&company=volvoinfor&st=9CBCF1142902D54109ABA180516D326BCCE03EBC",
        "published": "2025-11-11T13:36:30",
        "deadline": "2025-11-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30216178",
        "title": "Product Manager, Kiona",
        "employer": "We SeeQ AB",
        "location": "Göteborg",
        "description": "Join Kiona as Product Manager and drive innovation and real impact for customers in our Retail & Refrigeration segment  In this strategic role, you’ll shape the segment’s future by combining AI, data, and sustainability to deliver smarter, energy-efficient solutions that help retailers and building owners reduce waste and optimize operations. You’ll own the product roadmap across the SaaS lifecycle and use AI to validate concepts faster and enhance workflows. \n About the role As Product Manager at Kiona, you play a key role in shaping and leading the development of services and features within our SaaS offering. You operate at the intersection of business, customer, and technology, turning insight into action and strategy into measurable results.\nYou’ll own the product strategy for the segment, ensuring that identified customer needs and business opportunities are turned into scalable SaaS solutions and measurable impact. Together with other Product Managers and the development team, you’ll ensure a unified strategy and turn insights into solutions that drive measurable business results. \n Your main responsibilities Take full ownership of the SaaS product lifecycle from concept and product strategy to packaging, launch, and continuous optimization. You’ll ensure our SaaS offering evolves into an even more professional, scalable, and value-driven solution, balancing short-term customer needs with long-term product vision.\n Define and communicate the end-to-end product roadmap, from idea to launch and continuous improvement \n Drive SaaS productification, ensuring that features and services are packaged and delivered as scalable, value-driven offerings\n Identify and validate new service and product opportunities that create customer value\n Leverage AI as a driver of smarter decisions, faster validation, and continuous innovation\n Collaborate with the development team to turn strategy into effective solutions\n Communicate roadmap progress and results across teams to ensure alignment and transparency\n Track feature adoption, measure impact, and deliver measurable business outcomes\n Work cross-functionally with tech, marketing, sales, and customer success\n Own the product’s business case and contribute to company growth and commercial success\n Act as an ambassador for your product, both internally and externally\n \nWe’re looking for someone who has\n A university degree in engineering, business, informatics, or equivalent\n Managing the full product lifecycle in a SaaS environment\n Ability to drive product strategy from idea to delivery and measurable results\n Prioritizing and making decisions based on customer insights and data\n Strong communication skills and the ability to align stakeholders\n Analytical strength and solid business acumen\n Excellent collaboration skills in cross-functional teams\n Fluency in both Swedish and English, written and spoken\n \nMeriting experience\n PropTech or Retail/Refrigeration domains\n Using or exploring AI in product development processes\n Scaling SaaS products across multiple markets\n Understanding of system integrations with platforms or hardware\n Monitoring and developing product business cases and commercial outcomes\n \nWho you are You thrive in a fast-paced environment where business and technology meet, curious about customer challenges and passionate about solving them. Analytical, communicative, and empathetic, you lead by example from idea to launch and build trust through clarity and collaboration. You navigate complexity with confidence and inspire others through engagement, vision, and clarity.\nYou are driven by development and want to contribute to shaping services and features that make a real difference for users and society.\nWhat Kiona offers you At Kiona, you get more than a job; you become part of a culture defined by our values: Trust, Curiosity, and Creativity. We trust each other and offer freedom with responsibility. We encourage curiosity and continuous learning, and we believe creativity drives progress. Here, you have space to grow, take ownership, and make an impact while working on solutions that make a real difference for the climate and our customers.\nThe position is based at Kiona’s new office in MIMO House, central Mölndal, opening in June 2026.\nAre you the Product Manager we’re looking for?   Application Kiona is partnering with We SeeQ in this recruitment. Please apply by answering the questions below and uploading your profile. For questions or further information, contact Lena Wadenby: 0702-943550 / lena.wadenby@weseeq.se.  \nAbout Kiona Kiona is a leading SaaS company with the vision to make a big impact in the fight against climate change by offering the smartest and most cost-effective proptech platform on the market. The company enables building owners and other stakeholders to achieve their financial and sustainability goals through the digitalization of new and old buildings and their heating, cooling, ventilation, and refrigeration systems. With offices in eight markets and 150 colleagues, Kiona currently connects over 55,000 commercial, industrial, residential, and public buildings and 3,000 grocery stores in Europe. Through an innovative platform that monitors, controls, and optimizes both energy use and organizations, Europe's existing buildings can now become part of the solution for the future. For more information, visit our website: www.kiona.com",
        "url": "https://weseeq.teamtailor.com/jobs/6688801-product-manager-kiona?promotion=1695718-arbetsformedlingen",
        "published": "2025-11-03T10:51:33",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30187386",
        "title": "AI Growth Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Ride the AI Wave: Become MindArk’s AI Growth Engineer!\nThe AI revolution isn’t waiting for your graduation. If you’ve completed two years of a technical degree (with top grades in math and physics) and find yourself questioning the value of a traditional diploma in a world about to be upended by AI, this is your moment. \nMindArk – the creative force behind Entropia Universe – is hiring an AI Growth Engineer in Gothenburg to help market our virtual universe using cutting-edge AI tools. We want brilliant minds like yours on board now to ride the wave of AI transformation with us.\nStep off the academic treadmill and into a real-world impact role. \nAs our AI Growth Engineer, you’ll apply your technical skills to engineer explosive growth for Entropia Universe. Forget the old marketing playbook – you’ll write new rules, using data, code, and creativity to turn bold ideas into global success stories.\nThis is your chance to work at the crossroads of advanced tech and creative marketing, where marketing is treated as an engineering challenge. You’ll run experiments powered by AI and turn them into real results, helping transform a pioneering virtual world into a global phenomenon.\nWhy Join MindArk?\n• Accelerated Learning: Work with state-of-the-art AI tools on live projects and level up faster than any classroom can offer.\n• Real Impact: See your ideas drive the growth of Entropia Universe in real time and shape a vibrant online community on a global stage.\n• Ahead of the Curve: Be at the forefront of AI-driven marketing in gaming, outpacing what’s taught in textbooks and setting trends instead of following them.\nWe’re looking for ambitious, creative problem-solvers who refuse to settle for “good enough.” If you thrive on innovation and want to be ahead of the curve, join us and make your mark now. Don’t watch the AI revolution from the sidelines – become the engineer driving it.\nReady to launch your career and make history? Apply today to join MindArk’s mission and help us engineer the future of digital marketing. Let’s ride this wave together.",
        "url": "https://career.mindark.com/jobs/6262447-ai-growth-engineer",
        "published": "2025-10-24T15:26:40",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30182882",
        "title": "Operations Graduate Program 2026 - Digital Transformation Leader",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "During 15 intense and exciting months, our Operations Graduate Program will give you a holistic view of our operational and logistic activities, including both the local and global perspective.\r\n\r\nYou will have a permanent position from day one, with a manager and mentor to support you. You will experience several local and international on the job-rotations and work on business-critical projects developing your competencies for tomorrow. \n\nOur organization\n\nAt Tuve Plant, we are not just building heavy-duty trucks, we are shaping the future of sustainable transportation! Guided by lean manufacturing values, we are proud to be the forefront of innovation, and exciting things are happening all around us. As we embrace industrialization and digitalization, we are pushing the boundaries to create greener, more efficient automotive products. Our internal flows and processes are evolving rapidly with automation and breakthrough technologies are at the heart of our transformation.\n\nThis is us, your new team\n\nWelcome to Digitalization & IT team from Tuve! We are a collaborative, curious, and value-oriented group working closely with production, logistics, engineering, and business units to unlock digital potential in a company where change is gradual and budget-conscious decisions are the norm. We value open communication, resilience, and practical innovation over flashy quick wins.\n\nMain activities and responsibilities: \n\nIn this role, you will have the opportunity to explore and shape innovative Industry 4.0 applications, such as IoT, AI, machine learning, and data management, to bring measurable value to production, logistics, and business processes.\n\nYou will collaborate with cross-functional teams to map and enhance business processes, conduct value stream mapping and gap analyses, and propose practical, cost-effective solutions. Additionally, you will act as a facilitator of change by engaging stakeholders across different departments to build alignment and foster a digital mindset. You will create and manage small-scale pilots or proof-of-concept projects, from scoping to execution, ensuring that the learnings can be scaled. In parallel, you will contribute to shaping product-oriented digital strategies that thoughtfully balance long-term transformation with immediate operational needs.\n\nThroughout the process, you will communicate progress, challenges, and insights clearly, engaging leadership and leveraging data to support decision-making.\n\nWho are you? \n\nWe are looking for a proactive, entrepreneurial graduate with strong interest in AI and digital transformation. You thrive in environments where patience and resilience are required to drive change, and you are comfortable working with low digital maturity operations while inspiring others with new possibilities.\n\nWe believe you bring a strong analytical mindset and a genuine passion for applying data and AI to solve business problems. You are someone who takes initiative, works independently, and drives projects forward despite obstacles. Your ability to navigate uncertainty with adaptability and a clear focus on value creation is one of your strengths.\n\nAn inclusive and collaborative attitude, along with strong facilitation skills, are essential to bring stakeholders together effectively. Your curiosity and eagerness to understand the complexities of vehicle manufacturing are key assets. You have strong communication skills and the ability to present complex topics in a simple and understandable manner. Perseverance and resilience are necessary to drive transformation in a slow-changing, budget-conscious environment. You are a creative problem-solver with a practical mindset, balancing innovation with cost constraints. High energy, curiosity, and a drive to learn and grow within a global manufacturing context are important.\n\nRequired knowledge:\n\n  *  MSc or BSc with strong academic achievements in Computer Science, Data Science, Artificial Intelligence, Industrial Engineering & Management, Information Technology, or a related field. Specialization in AI/ML, Data Analytics, Digital Transformation, Industrial Digitalization (Industry 4.0), or Smart Manufacturing.\n  *  Knowledge of Industry 4.0 concepts (IoT, AI/ML, automation, digital twins).\n  *  Familiarity with data analytics tools (PTC tools, Python, R, Power BI, or similar).\n  *  Understanding of agile methodologies and product-oriented work.\n  *  Ability to perform gap analysis and business process mapping.\n  *  Comfort with stakeholder management and cross-functional collaboration.\n  *  Maximum two years of previous full-time working experience, prior to or after graduation. Work during studies are not included.\n  *  In this truly global program, communication will be in English, hence you need to be fluent in both speaking and writing in Swedish & English.\n  *  Valid work or study permit for Sweden, if not a citizen.\n\n\nCurious, and have some questions?\n\nManager: Priscila Lovato, +46313278005, priscila.lovato@volvo.com\nHRBP: Louise Karlsson, +46 765534974, louise.karlsson.3@volvo.com",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43735676",
        "published": "2025-10-24T02:25:20",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30182874",
        "title": "Finance Graduate Program - Business Controller skilled in Digital Tools",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nThe Finance Graduate Program\nIf you are up for the challenge of developing our future Finance function and want to be a part of the innovative world of Volvo Group, this is the graduate program for you! \nDuring 12 intense months, you will get an end-to-end perspective of our Finance functions and how we co-drive the business, both from a local as well as from a Volvo Group perspective. From day one, you will have a permanent role in one of our organizations, where you will play an active role in daily deliveries. In parallel, you will participate in a number of common training weeks with the other Finance graduates throughout the year, do various job rotations to increase your insights of the Volvo Group and last but not least you will grow as a person. Your professional and personal growth will be supported through individual and team development sessions, mentoring, coaching and feedback. \nYou will take a deep dive into some specific areas of our business, which will help you get a holistic view and build your future career within the Volvo Group. Besides your manager, who will guide and support you in your daily job, you will have a supportive network of peer graduates, colleagues across the globe and senior leaders to help you excel. We hope you will learn as much from us as we will from you! \n\nOur Organization - Volvo Group Digital & IT\n\nVolvo Group Digital & IT is an interesting place to be, especially during periods of change and transformation. We have a clear commitment to enable value creation at scale for the entire Volvo Group. With a new product-centric operating model and digital technologies, we produce digital offerings that are profitable, scalable, and differentiated. At Volvo Group Digital & IT, you will be part of a global and diverse team of highly skilled professionals, who learn continuously and embrace change to stay ahead.  \n\nYour Future Team\n\nOur global Business Control function supports Volvo Group Digital & IT with financial insights that enable sound planning, efficient operations, and informed decision-making. We work closely with colleagues across Digital & IT, Finance, and other functions within the Volvo Group, ensuring a holistic perspective on business performance. In addition, collaboration and knowledge sharing are central to how we operate.\n\nHow you will make an impact\n\nAs a Business Controller, you play a key role in driving financial excellence and supporting the strategic direction of Volvo Group Digital & IT. You will work with follow-up, planning and estimates of IT cost and deliveries as well as providing proactive financial analysis and advice to management, helping guide decisions that strengthen business results and operational efficiency. Beyond traditional controlling activities, you will contribute to the Volvo Group’s digital transformation, supporting initiatives within automation, innovation, and advanced analytics that shape the future of how we work.  \n\nWho are you?\n\nWe are looking for next-generation experts and leaders within the Finance field who want to make a real difference to society. You are passionate about what you do, have a curious mind, and are willing to learn. Just like us, you thrive on teamwork. In this role, you should be able to cooperate with various stakeholders in a multicultural environment.  You have a strategic, long-term mindset and great skills in telling a story based on financial information in a way that is understood and actionable. \nQualifications for this role \n  *  BSc or MSc degree in Finance, Business Administration or similar fields. Meritorious if you have read courses in AI, machine learning and deep learning. \n  *  Excellent analytical skills as well as visualization and communication skills.\n  *  Strong digital literacy, with the ability to quickly adapt to new tools and systems, including AI solutions, and engaged in driving automation through their use.   \n  *  Good knowledge Microsoft Excel and PowerPoint\n  *  Fluency in business English, both spoken and written\n  *  Knowledge in Power BI or SAP are a merit\n  *  You should not have more than two years of full-time working experience prior to, or after graduation, excluding work during studies. \n  *  A valid study or work permit for the country to which you apply (if you are not a citizen)",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43730228",
        "published": "2025-10-24T02:25:17",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30182862",
        "title": "Operations Graduate Program 2026 - Business Controller",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity.\r\n\r\nIf you are up for the challenge of developing our future Operations and want to be a part of the innovative world of Volvo Group, this is the graduate program for you!   \n\nDuring 15 intense and exciting months, our Operations Graduate Program will give you a holistic view of our operational and logistic activities, including both the local and global perspective. You will be working with the technologies of tomorrow, building the products of the future – electric, connected and automated. In parallel, you will grow as a person, through individual and team development sessions.\n\nYou will have a permanent position from day one, with a manager and mentor to support you. You will experience several local and international on the job-rotations and work on business-critical projects developing your competencies for tomorrow. You will take a deep dive into some specific areas of our business such as manufacturing, health and safety, quality, and continuous improvements, while also learning about the end-to-end supply chain, aftermarket parts and our remanufacturing operations. In addition, you will gather with other program participants to take part in trainings and events designed to help you grow into your future career at the Volvo Group.\nWe offer the opportunity for you to be part of our digital transformation, applying new technologies to connect and automate our processes. Together we work with AI, data science, machine learning, circular systems, virtual manufacturing and more, to build our full electric or autonomous products.\n\nIf rotational development, a global set up and designing the world of tomorrow are aspects you are looking for in your next job context, this position might be something for you.\n\nOur organization \n\nTuve Plant, located in Gothenburg at the heart of Volvo, produces premium heavy-duty diesel, gas and electric trucks. Additionally, we produce frame members not only for ourselves but also for Ghent and our knock-down assembly plants. Furthermore, we are the introduction plant for all new models for Volvo Brand, meaning we are first out!\n\nThis is us, your new team\n\nHere at Tuve Plant, we are 2800 employees, so come join our Business Controller Team where we manage all financial aspects of the operations.\n\nWe deliver on our promises. At Tuve we are a curious team, work with passion and embrace challenges to stay ahead. We work KPI oriented, both in goal setting and follow up.\n\nMain activities and responsibilities: \n\nAs a Business Controller, you will deliver financial support and guidance to our Tuve organization, with the aim of enhancing our business performance. You should be a good storyteller and provide transparent information. You will work with digitalization to optimize existing processes and develop good visualizations for the organization. We focus on continuous improvements, and we hope you will be able to bring new aspects into our way of working.\n\nIn addition, you will participate in several common training weeks with the other participants in the program and do various job rotations to broaden your horizon within the Volvo Group.\n\nWho are you? \n\nTo be successful in this role, you bring a reflective and structured approach, along with strong analytical abilities. You have a holistic, end-to-end understanding of business and enjoy working closely with others to create impact. Additionally, you find energy in collaborative environments and are a supportive and engaged team member. Your passion for new technologies and digital tools inspires you to explore innovative ways of working. You are naturally curious, creative, and communicate with clarity and empathy.\n\n Required knowledge/experience:\n\n  *  BSc or MSc in business administration specialized in business control or accounting.\n  *  Knowledge in Lean manufacturing.\n  *  Knowledge in BI-tools.\n  *  You understand the basics of lean manufacturing and continuous improvement methodologies.\n  *  Maximum two years of previous full-time working experience, prior to or after graduation. Work during studies are not included.\n  *  In this truly global program, communication will be in English, hence you need to be fluent in both speaking and writing in Swedish and English.  \n  *  Valid work permit for Sweden if not a citizen. \n\n\nCurious, and have some questions? Contact us!\n\nManager: Olga Landstrom, +46 739022252, olga.landstrom@volvo.com \nHRBP: Louise Karlsson, +46 739022252, louise.karlsson.3@volvo.com \n\nKindly note that due to GDPR, we will not accept applications via mail. Please use our career site. \n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43724375",
        "published": "2025-10-24T02:25:09",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "AI",
        "relevance_score": 60
    },
    {
        "id": "30108410",
        "title": "Doctoral student in physics-informed machine learning for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided and data-driven foundation models for multivariate time series in safety-critical systems such as automotive. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering at Chalmers and University of Gothenburg in Sweden employs approximately 300 employees from more than 30 countries. The department is divided into four divisions and is widely recognized for excellent research and education, with activities on two campuses in the city of Gothenburg. Research in the department has a wide span, from theoretical foundations to applied systems development. We provide high quality education at the bachelor's, master's, and graduate levels, offering over 120 courses each year. We also have extensive national and international collaborations with academia, industry and society.\n\nWe are announcing a PhD position that is placed at the Computing Science division with Chalmers University of Technology as the employer. \n\nThis project is a collaboration between the AIXLab@Chalmers and Volvo Group. At AIXLab, we focus on developing AI solutions that are usable and applicable in real-world settings. We are part of the Computing Science division at the Department of Computer Science and Engineering.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other domains. You do not need extensive experience with physics-guided modeling; strong interest in time series machine learning and the ambition to learn are what matter most. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent.\n• You will need strong written and verbal communication skills in English.\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning.\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch). \n• Engineering skills: GPU/cluster training, experiment tracking, data engineering.\n• Ability to formulate research questions, run empirical studies at scale.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience with physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Experience with academic research and publications\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files. Please note the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than December 1st 2025\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nEmail: yinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nEmail: secarl@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14252&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-10-06T10:43:01",
        "deadline": "2025-12-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30096280",
        "title": "Data Warehouse Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "About Us\nEtraveli Group is the globally leading company for tech solutions and fulfilment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travellers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nDo you want to be part of the next step in our growth journey?\nAt Etraveli Group we use a lot of data for decision making processes, analysis and machine learning. Users of the data can be found in different departments like Finance, Customer Service, Sales, Data Science and Research. In alignment with our growing targets we are looking for experienced data engineers to become part of our Data Solutions team to get more data into our data lakehouse platform and prepare it in order to be used by the users. \nWho You Are\nWith the right skill set and motivation you will be setting up, maintaining and evolving our data warehouse solution as well as participating in driving a large portion of our future data engineering.\nIn this primarily technical role, there will be close interaction with database administrators and operations’ engineers, but there will also be collaboration with stakeholders from other parts of our organization (e.g data analysts, business intelligence teams and business stakeholders). The data sources we use are located both in cloud environments as well as on-prem. Working with us means you'll have access to a team of highly competent professionals and ample resources to foster your personal and professional growth. We face the challenges of the day working for a company that goes the extra mile to ensure that we have fun at, and outside, the office. \nRequirements\nTo thrive and succeed in this role we believe that you have:\nA strong interest in maintain and evolve our data warehouse solution\nAbility to analyze and take on tasks, both individually and together with others\nAbility to design and implement tasks from scratch, individually gathering the necessary information where needed\nStrong foundation in data warehousing concepts and data modeling (e.g., Star and Snowflake Schemas, Incremental Loads, Slowly Changing Dimensions)\nPrevious experience working with data processing and distributed query engines, like Spark, Dremio/Trino, Databricks\nPrevious experience working as a data engineer, with different ETL (e.g., dbt, Airflow) and CDC tools (e.g., Debezium, Flink CDC, Kafka Connect)\nPrevious experience working with multiple scripting languages, like Bash, Python, SQL, etc\n\nIt is also desirable that your skills match one or more of the following:\nPrevious experience to ensure high-performance data processing with techniques like indexing, partitioning, and caching.\nPrevious experience working with data integrations\nPrevious experience working with data modelling for efficient query performance, data quality and optimization\nPrevious experience working as a database administrator\nComfortable working with Linux, Docker, and preferably also Kubernetes\nExperience with data lakehouse table formats like Apache Iceberg or Delta Lake, enabling features like ACID transactions and time-travel on object storage\n\nBenefits\nAt Etraveli Technology, you will be part of a gang of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard.\nEtraveli Group is a company that really wants to contribute to you reaching your full potential.\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\nWe love gaming and after work activities.\nWe know the value of personal development and continuous training.\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\nWellness allowance - Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities.\nThrough partners, we offer comprehensive pension and health insurance so that you can quickly get help if the accident occurs.\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\nAnd we serve breakfast every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/206B865709/apply",
        "published": "2025-10-02T09:24:25",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]