[
  {
    "id": "29699546",
    "title": "Sektionschef inom IT!",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "published": "2025-05-13",
    "deadline": "2025-06-03",
    "url": "https://www.aplitrak.com/?adid=cC5zdmVuc3Nvbi44NzA2My4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
    "description": "Vi tror att framsteg och möjligheter skapas bäst tillsammans. Välkommen till en plats där samarbete gör skillnad. \n\nDin roll \n\nBusiness IT jobbar med tjänster för att stödja verksamhetens omedelbara behov och därefter standardisera och automatisera skapandet, driften och förvaltningen av specialiserade IT-miljöer. Dessa miljöer kan vara allt från enkla testmiljöer till komplexa utvecklingsplattformar. Vårt arbete gör det möjligt för verksamheten att utveckla, producera och leverera produkter til..."
  },
  {
    "id": "29734097",
    "title": "Javautvecklare inom identitet och åtkomst",
    "employer": "GÖTEBORGS KOMMUN",
    "location": "Göteborg",
    "published": "2025-05-27",
    "deadline": "2025-06-10",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=3f0e134e-ce14-467e-8b99-020911e36336&publishCode=AMS&TK=38598f32-9d64-44a5-96e8-832bf6694614",
    "description": "Intraservice levererar tjänster och digital infrastruktur som hjälper medarbetare och chefer i Göteborgs Stad att arbeta smart och effektivt. På så vis gör vi det enklare att arbeta i staden och skapar förutsättningar för en god service till göteborgarna. Vi har en central roll i stadens digitalisering och automatisering och våra kunder är Göteborgs alla förvaltningar och bolag.\nVi är drygt 700 medarbetare som arbetar i centrala Göteborg. Hoppas du vill bli en av oss!\nMer information: http://www..."
  },
  {
    "id": "29719328",
    "title": "Javautvecklare till bolag inom cybersäkerhet",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-05-21",
    "deadline": "2025-06-20",
    "url": "https://jobnet.se/systemutvecklare-zacco?utm_source=arbetsformedlingen&utm_medium=annons&utm_content=zacco&utm_term=systemutvecklare",
    "description": "Är du en kommunikativ utvecklare med stort intresse för digital säkerhet och Java? Jobba tillsammans med kompetenta kollegor mot det gemensamma målet att göra Zacco Digital Trust till Europas främsta cybersäkerhetspartner.  \nZacco Digital Trust arbetar med spännande och innovativa kunder – allt ifrån nystartade företag till internationella storföretag. Här använder vi OWASP som det första steget mot säkrare kod och främjandet av en säkerhetsmedveten kultur.\nDin främsta uppgift blir att hjälpa ku..."
  },
  {
    "id": "29713951",
    "title": "Västtrafik söker Systemutvecklare .NET till Team To Go",
    "employer": "VÄSTRA GÖTALANDSREGIONEN",
    "location": "Göteborg",
    "published": "2025-05-19",
    "deadline": "2025-06-15",
    "url": "https://vgregion.varbi.com/what:job/jobID:828689/type:job/where:1/apply:1",
    "description": "Västtrafik söker Systemutvecklare .\r\n\r\nNET till Team To Go\n\nVill du utveckla innovativa lösningar som påverkar miljontals användare? Vill du vara en del att skapa hållbart resande för vår Region? Vi söker nu en systemutvecklare .NET, till Team To Go – en spännande roll där du kombinerar backend, testning och systemarkitektur i en agil och samarbetsinriktad miljö där vi har kul tillsammans. Låter detta intressant? Ansök idag och bli en del av vårt team!  \n\nRollbeskrivning:\n\nSom systemutvecklare i..."
  },
  {
    "id": "29713829",
    "title": "Javautvecklare med lösningsarkitektur, krav- eller testkunskap",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-05-19",
    "deadline": "2025-06-09",
    "url": "https://kronofogden.varbi.com/what:job/jobID:829096/type:job/where:1/apply:1",
    "description": "Är du en skicklig systemutvecklare inom Java som också har erfarenhet av lösningsarkitektur, kravhantering- och/eller testautomatisering?  Tycker du om att ha ett jobb som räknas?  Då måste du läsa vidare!\n\nHos oss bidrar du till ett välfungerande samhälle för allmänhet och företag samtidigt som du får möjlighet att bidra och utveckla dina kunskaper! Kronofogden erbjuder ett modernt och hållbart arbetsliv där t.\r\n\r\nex. distansarbete är en möjlighet i den omfattning verksamheten beslutar.\n\nJust n..."
  },
  {
    "id": "29696381",
    "title": "Embedded Utvecklare",
    "employer": "Nexer AB",
    "location": "Göteborg",
    "published": "2025-05-12",
    "deadline": "2025-06-12",
    "url": "https://nexergroup.teamtailor.com/jobs/5918702-embedded-utvecklare?promotion=1465825-arbetsformedlingen",
    "description": "Erfaren Embedded utvecklare \nTill en av våra kunder inom försvarsindustrin söker vi nu en erfaren Embedded Utvecklare  till Göteborg. Som en erfaren Embedded Utvecklare kommer du spela en viktig roll i vår kunds projekt. Här får du chansen att utveckla dina färdigheter som att vässa din förmåga att hantera komplexa system.\nDina arbetsuppgifter:\n Ta ansvar för helheten och kommunicerar lösningar\n Arbeta med komplexa system där målet är att ta fram effektiva lösningar\n  Analysfunktioner av data.\n ..."
  },
  {
    "id": "29694239",
    "title": "Utvecklare C# och .NET till polisen.se",
    "employer": "Polismyndigheten",
    "location": "Göteborg",
    "published": "2025-05-12",
    "deadline": "2025-06-02",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29694239",
    "description": "Vi söker dig som vill vara med och utveckla polisen.se. Polisens hemsida får ca 1 miljon besök per vecka och som systemutvecklare på Polismyndigheten är du med och tar fram IT-lösningar som bidrar till ett tryggare och säkrare samhälle.\nArbetsplatsbeskrivning\nIT-avdelningen består av ca 1300 anställda som ansvarar för all IT som används av myndighetens 40 000 medarbetare över hela landet. Hos oss deltar och ansvarar varje grupp för hela sin produktlivscykel – från idé till implementation och vid..."
  },
  {
    "id": "29690299",
    "title": "Systemutvecklare med fokus på frontend",
    "employer": "Göteborgs Universitet",
    "location": "Göteborg",
    "published": "2025-05-09",
    "deadline": "2025-06-01",
    "url": "https://go.talentech.io/zBO5X",
    "description": "Göteborgs universitet möter samhällets utmaningar med mångsidig kunskap. 56 000 studenter och 6 600 medarbetare gör universitetet till en stor och inspirerande arbetsplats. Stark forskning och attraktiva utbildningar lockar forskare och studenter från hela världen. Med ny kunskap och nya perspektiv bidrar Göteborgs universitet till en bättre framtid.Göteborgs universitetsbibliotek är ett av landets största bibliotek och består av åtta bibliotek med olika ämnesinriktningar samt Digitala tjänster...."
  },
  {
    "id": "29586801",
    "title": "IT-tekniker med koll på drift och nätverk? Vi har jobbet för dig!",
    "employer": "Studieinst Sverige AB",
    "location": "Göteborg",
    "published": "2025-03-29",
    "deadline": "2025-06-30",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29586801",
    "description": "Vill du använda dina IT-kunskaper i uppdrag som faktiskt gör skillnad – där du både får utvecklas och jobba med teknik på riktigt? Hos oss får du arbeta som IT-tekniker i den offentliga sektorn, där du blir en nyckelperson i organisationens dagliga IT-drift.\nDet här är en perfekt möjlighet för dig som arbetat några år inom IT och nu vill ta nästa steg. Du kommer in i en miljö där dina kunskaper tas på allvar, där du får ta ansvar – men också stöd i uppdragets alla delar.\nVi ser till att du får e..."
  }
]