[
  {
    "id": "29754063",
    "title": "Systemingenjör inom IT infrastruktur",
    "employer": "Luftfartsverket",
    "location": "Göteborg",
    "published": "2025-06-05",
    "deadline": "2025-06-29",
    "url": "https://go.talentech.io/xNgvi",
    "description": "Har du erfarenhet av arbete med infrastruktur, datacenter och virtuella miljöer och vill ta nästa steg i din karriär? Vill du vara med att bidra till en växande organisation? Då har vi en fantastisk möjlighet för dig! \n \n Vi söker nu flera Systemingenjörer IT Infrastruktur till nya uppdrag inom kritisk kommunikation som omfattar drift, underhåll och övervakning av bland annat det nationella radiokommunikationssystemet Rakel.\n\nPå LFV kommer du och dina kollegor att säkerställa pålitlig och säker ..."
  },
  {
    "id": "29754279",
    "title": "Systemutvecklare till team Butler",
    "employer": "Trafikverket",
    "location": "Göteborg",
    "published": "2025-06-05",
    "deadline": "2025-06-30",
    "url": "https://trv.heroma.se/prod/TRVpp01/ExternWebbV2/LedigaJobb/EW2PageAnnons.aspx?arenderef=8015547615929533887&benamning=Systemutvecklare+till+team+Butler",
    "description": "Brinner du för ny teknik och användarupplevelser som gör vardagen enklare? Då är det dig vi söker som vår nya kollega i team Butler, som ansvarar för Trafikverkets beställnings- och självbetjäningsplattform.\n\r\n\r\nSystemutvecklare till team Butler\r\n\r\nArbetsuppgifter\n\nI rollen som systemutvecklare hos oss jobbar du i ett team som har ansvar för leveranser kopplade till Beställningsportalen Butler, en egenutvecklad portal som bygger på Optimizely CMS och Commerce. Under de kommande åren har vi en he..."
  },
  {
    "id": "29719328",
    "title": "Javautvecklare till bolag inom cybersäkerhet",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-05-21",
    "deadline": "2025-06-20",
    "url": "https://jobnet.se/systemutvecklare-zacco?utm_source=arbetsformedlingen&utm_medium=annons&utm_content=zacco&utm_term=systemutvecklare",
    "description": "Är du en kommunikativ utvecklare med stort intresse för digital säkerhet och Java? Jobba tillsammans med kompetenta kollegor mot det gemensamma målet att göra Zacco Digital Trust till Europas främsta cybersäkerhetspartner.  \nZacco Digital Trust arbetar med spännande och innovativa kunder – allt ifrån nystartade företag till internationella storföretag. Här använder vi OWASP som det första steget mot säkrare kod och främjandet av en säkerhetsmedveten kultur.\nDin främsta uppgift blir att hjälpa ku..."
  },
  {
    "id": "29754538",
    "title": "Leveranskoordinator",
    "employer": "Kriminalvården",
    "location": "Göteborg",
    "published": "2025-06-05",
    "deadline": "2025-06-25",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=899afb03-2bde-4c98-ac34-90492b914cb7&publishCode=AMS&TK=7fd1ab79-e677-4c70-816d-7cd19f968669",
    "description": "Kriminalvården växer – vi bygger nytt, bygger om och bygger till och söker nu fler medarbetare. Vårt viktigaste mål är att minska återfall i brott – att bryta den onda cirkeln. Lyckas vi med det blir samhället tryggare och säkrare för alla. Vi är den myndighet som ansvarar för anstalter, frivård, häkten och klienttransporter.\n\nVill du vara med och bidra till ett tryggare samhälle? Vår IT-avdelning genomför en stor satsning med fokus på en digital Kriminalvård. Tillsammans jobbar vi för att skapa..."
  },
  {
    "id": "29754023",
    "title": "Systemingenjör inom Transmission",
    "employer": "Luftfartsverket",
    "location": "Göteborg",
    "published": "2025-06-05",
    "deadline": "2025-06-29",
    "url": "https://go.talentech.io/11x0v",
    "description": "Vill du ta nästa steg i din karriär och jobba med teknik som ger dig möjlighet att bidra till samhällets säkerhet och funktion?\n\nTill vår driftcentral i Göteborg söker vi Systemingenjörer inom Transmission (TRM) till nya uppdrag inom kritisk kommunikation som omfattar drift, underhåll och övervakning av bland annat det nationella radiokommunikationssystemet Rakel.\n\nPå LFV kommer du och dina kollegor att säkerställa pålitlig och säker kommunikation för samhällsviktiga funktioner inom områden som ..."
  },
  {
    "id": "29586801",
    "title": "IT-tekniker med koll på drift och nätverk? Vi har jobbet för dig!",
    "employer": "Studieinst Sverige AB",
    "location": "Göteborg",
    "published": "2025-03-29",
    "deadline": "2025-06-30",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29586801",
    "description": "Vill du använda dina IT-kunskaper i uppdrag som faktiskt gör skillnad – där du både får utvecklas och jobba med teknik på riktigt? Hos oss får du arbeta som IT-tekniker i den offentliga sektorn, där du blir en nyckelperson i organisationens dagliga IT-drift.\nDet här är en perfekt möjlighet för dig som arbetat några år inom IT och nu vill ta nästa steg. Du kommer in i en miljö där dina kunskaper tas på allvar, där du får ta ansvar – men också stöd i uppdragets alla delar.\nVi ser till att du får e..."
  }
]