[
  {
    "id": "29780547",
    "title": "Fullstack.NET utvecklare",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-19",
    "deadline": "2025-08-22",
    "url": "https://kronofogden.varbi.com/what:job/jobID:838724/type:job/where:1/apply:1",
    "description": "Ett jobb som räknas! Hos oss bidrar du till ett välfungerande samhälle för all­män­het och företag.\r\n\r\nVi söker nu en fullstackutvecklare som har ett stort intresse för front-end och Angular. Just nu anställer vi medarbetare i Stockholm, Göteborg, Malmö och Kalmar. Vill du skapa samhällsnytta och bidra till att utveckla Kronofogdens it-avdelning? Vill du ha möjlighet att kombinera familjeliv/fritid med arbetsliv? Bra, läs vidare.\n\nVi är närmare 200 kollegor på Kronofogden som arbetar med IT-utve..."
  },
  {
    "id": "29778998",
    "title": "Javautvecklare i början av karriären",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-18",
    "deadline": "2025-07-31",
    "url": "https://kronofogden.varbi.com/what:job/jobID:838503/type:job/where:1/apply:1",
    "description": "Ett jobb som räknas! Hos oss bidrar du till ett välfungerande samhälle för all­män­het och företag.\r\n\r\nVi söker dig som är i början av din karriär som java-utvecklare och som vill fortsätta växa i rollen hos oss. Du har grunderna och vill utvecklas vidare med oss, vi erbjuder stöd i form av erfarna kollegor och kompetensutveckling.\n\nJust nu anställer vi medarbetare i Göteborg, Malmö och Kalmar/Karlskrona. \n\nOm jobbet\nI rollen som Java-utvecklare blir du en del av något av våra utvecklingsteam dä..."
  },
  {
    "id": "29773978",
    "title": "Javautvecklare med lösningsarkitektur, krav- eller testkunskap",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-16",
    "deadline": "2025-08-29",
    "url": "https://kronofogden.varbi.com/what:job/jobID:837730/type:job/where:1/apply:1",
    "description": "Är du en skicklig systemutvecklare inom Java som också har erfarenhet av lösningsarkitektur, kravhantering- och/eller testautomatisering?  Tycker du om att ha ett jobb som räknas?  Då måste du läsa vidare!\n\nHos oss bidrar du till ett välfungerande samhälle för allmänhet och företag samtidigt som du får möjlighet att bidra och utveckla dina kunskaper! Kronofogden erbjuder ett modernt och hållbart arbetsliv där t.\r\n\r\nex. distansarbete är en möjlighet i den omfattning verksamheten beslutar.\n\nJust n..."
  },
  {
    "id": "29773389",
    "title": "Riksarkivet söker en Junior Data Scientist",
    "employer": "Riksarkivet",
    "location": "Göteborg",
    "published": "2025-06-16",
    "deadline": "2025-07-04",
    "url": "https://go.talentech.io/6GsL6",
    "description": "Riksarkivet har särskilt ansvar för den statliga arkivverksamheten och för arkivvården i landet. Vi ska kontrollera den offentliga arkivverksamheten och ha nationell överblick över arkivfrågorna. Vi tar emot statliga myndigheters arkiv och arkiv från andra typer av organisationer.\n\nVi säkrar samhällets långsiktiga informationsförsörjning och garanterar innehåll, sammanhang och äkthet. Vi fokuserar på användarnas behov när vi beskriver och vårdar arkiven, när vi gör dem tillgängliga och när vi re..."
  }
]