[
  {
    "id": "29690981",
    "title": "Systemspecialist, IT Drift",
    "employer": "GÖTEBORGS KOMMUN",
    "location": "Göteborg",
    "published": "2025-05-09",
    "deadline": "2025-05-23",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=d07b8fb4-34bc-44bf-9f6e-570fc76ea014&publishCode=AMS&TK=7143b591-94fb-4775-b077-285ed698c31a",
    "description": "Stadsmiljöförvaltningen har ett helhetsansvar för stadens offentliga rum och samlade framkomlighet. Vi arbetar för att skapa tillgängliga, attraktiva och levande stadsmiljöer och naturområden. Förvaltningen äger och förvaltar spårvagnsnätet i Göteborg. På förvaltningen arbetar cirka 900 personer.\n\nStadsmiljöförvaltningen är en del av de stadsutvecklingsförvaltningar som finns i Göteborgs Stad. Gemensamt arbetar vi med att skapa förutsättningar för en fungerande infrastruktur, bostäder och lokale..."
  },
  {
    "id": "29645871",
    "title": "Leveransområdesansvarig IT inom Basplattformar",
    "employer": "Länsstyrelsen i Västra Götalands län",
    "location": "Göteborg",
    "published": "2025-04-22",
    "deadline": "2025-05-11",
    "url": "https://lansstyrelsen.varbi.com/what:job/jobID:820359/type:job/where:1/apply:1",
    "description": "Länsstyrelsernas IT-avdelning är i en spännande utvecklingsfas där digitalisering, innovativa lösningar och säkerhets- och beredskapsfrågor är i fokus.\r\n\r\nVår IT-miljö är omfattande och varierande. Den innefattar allt från modern infrastruktur till system som vi utvecklar själva. Framför allt kommer våra idéer hela samhället till nytta. Det ger en alldeles speciell känsla som är svår att slå.\n\nLänsstyrelsernas verksamhet har en stor bredd och verkar inom områden som är högst aktuella i dagens sa..."
  },
  {
    "id": "29690299",
    "title": "Systemutvecklare med fokus på frontend",
    "employer": "Göteborgs Universitet",
    "location": "Göteborg",
    "published": "2025-05-09",
    "deadline": "2025-06-01",
    "url": "https://go.talentech.io/zBO5X",
    "description": "Göteborgs universitet möter samhällets utmaningar med mångsidig kunskap. 56 000 studenter och 6 600 medarbetare gör universitetet till en stor och inspirerande arbetsplats. Stark forskning och attraktiva utbildningar lockar forskare och studenter från hela världen. Med ny kunskap och nya perspektiv bidrar Göteborgs universitet till en bättre framtid.Göteborgs universitetsbibliotek är ett av landets största bibliotek och består av åtta bibliotek med olika ämnesinriktningar samt Digitala tjänster...."
  },
  {
    "id": "29686433",
    "title": "Systemvetare inriktning C-ITS",
    "employer": "Trafikverket",
    "location": "Göteborg",
    "published": "2025-05-08",
    "deadline": "2025-05-26",
    "url": "https://trv.heroma.se/prod/TRVpp01/ExternWebbV2/LedigaJobb/EW2PageAnnons.aspx?arenderef=7987035635937709720&benamning=Systemvetare+inriktning+C-ITS",
    "description": "Är du en nyexad systemvetare som vill bidra till ett mer tillgängligt och effektivt transportsystem? Läs nedan och sök detta spännande jobb!\n\r\n\r\nSystemvetare inriktning C-ITS\r\n\r\nArbetsuppgifter\n\nInom avdelningen Digitalisering och vägsystem på verksamhetsområdet IKT har vi den spännande uppgiften att skapa ett säkert och stabilt vägtrafiksystem för oss och kommande generationer. Som systemvetare inom C-ITS (Cooperative Intelligent Transport Systems) blir du en viktig del av ett team där vi utred..."
  },
  {
    "id": "29678101",
    "title": "Systemutvecklare Sharepoint",
    "employer": "VÄSTRA GÖTALANDSREGIONEN",
    "location": "Göteborg",
    "published": "2025-05-05",
    "deadline": "2025-05-25",
    "url": "https://vgregion.varbi.com/what:job/jobID:823595/type:job/where:1/apply:1",
    "description": "Vill du vara med och bidra till att skapa Sveriges bästa hälso-och sjukvård och ett hållbart samhälle med tillväxt i hela Västra Götaland? Västra Götalandsregionen är Sveriges största offentliga arbetsgivare med ambitionen att bli Sveriges bästa offentliga arbetsgivare.\r\n\r\nPå Koncernkontoret arbetar vi dagligen med att göra skillnad för patienter, medarbetare, besökare och invånare.  \n\nNu söker vi en systemutvecklare Sharepoint för att stärka vårt team i enheten Information och arkivering. Här k..."
  },
  {
    "id": "29668403",
    "title": "Mångsidig fullstack-utvecklare till Digital utveckling och Innovation",
    "employer": "VÄSTRA GÖTALANDSREGIONEN",
    "location": "Göteborg",
    "published": "2025-04-30",
    "deadline": "2025-05-15",
    "url": "https://vgregion.varbi.com/what:job/jobID:822825/type:job/where:1/apply:1",
    "description": "Tillsammans utvecklar vi Sahlgrenska Universitetssjukhuset för en hållbar framtid. Vi ställer om hälso- och sjukvården med målet att vara Europas ledande universitetssjukhus 2032. Tillsammans med patienterna arbetar vi för kvalitet, tillgänglighet, patientsäkerhet, forskning, utbildning och innovation – i ett sammanhållet hälso- och sjukvårdssystem i Västra Götalandsregionen. Vår vision och våra mål tar sikte mot en vård av yttersta kvalitet, där patienten alltid är i fokus. Vi erbjuder hälso- o..."
  },
  {
    "id": "29666864",
    "title": "Systemutvecklare .NET",
    "employer": "Sopra Steria Sweden AB",
    "location": "Göteborg",
    "published": "2025-04-29",
    "deadline": "2025-10-26",
    "url": "https://easyapply.jobs/r/5sAQGm52470ZO562RSCN",
    "description": "Vi söker .NET-utvecklare till Stockholm, Malmö, Östersund och Göteborg! 💻\n\n  Vill du vara en del av ett av Sveriges bästa arbetsgivare och hjälpa våra kunder att ta nästa steg i sin digitala resa? Sopra Steria söker fler .NET-utvecklare till våra agila team – här möts trygghet, flexibilitet och en kultur präglad av kunskapsdelning. Vi kallar det Power of Sharing!\nOm rollen\n\n  Som .NET-utvecklare hos oss kommer du att bli en viktig del av våra kunders digitala transformation. Du arbetar nära både..."
  },
  {
    "id": "29656838",
    "title": "Junior Supportingenjör Inom Satellitkommunikation!",
    "employer": "Friday Väst AB",
    "location": "Göteborg",
    "published": "2025-04-25",
    "deadline": "2025-05-25",
    "url": "https://pnty-apply.ponty-system.se/friday?id=3255&pnty_src=arbetsformedlingen",
    "description": "Vill du vara med och bidra till en samhällsviktig funktion som gör det möjligt för läkare, journalister och andra viktiga aktörer att snabbt etablera en satellitbaserad internetanslutning? Vår kund, som är verksam inom satellitkommunikationsbranschen, söker nu en Junior Supportingenjör med stort tekniskt intresse. Kanske är det du? Varmt välkommen med din ansökan – vi tillämpar löpande urval!\n\nOm tjänsten: \nVår kunds mål är att tillhandahålla högportabla satellitkommunikationsenheter som kan anv..."
  },
  {
    "id": "29654525",
    "title": "Systemspecialist - Övervakning med Zabbix",
    "employer": "Trafikverket",
    "location": "Göteborg",
    "published": "2025-04-24",
    "deadline": "2025-05-14",
    "url": "https://trv.heroma.se/prod/TRVpp01/ExternWebbV2/LedigaJobb/EW2PageAnnons.aspx?arenderef=7974075265911695428&benamning=Systemspecialist+-+%c3%96vervakning+med+Zabbix",
    "description": "Är du en teknikintresserad och nyfiken person med erfarenhet av Zabbix som vill bidra till att säkra Sveriges transportsystem? Då kan du vara den vi söker!\n\r\n\r\nSystemspecialist - Övervakning med Zabbix\r\n\r\nArbetsuppgifter\n\nDitt arbete handlar om att övervaka IT-infrastruktur och telekommunikation längs vägar, broar, tunnlar och järnvägar i hela Sverige, och säkerställa att dessa system fungerar stabilt och effektivt. Vi på Övervakning IT inom Operativt Center ansvarar för implementering, utveckli..."
  },
  {
    "id": "29645242",
    "title": "Erfaren Systemutvecklare, frontend",
    "employer": "Länsstyrelsen i Västra Götalands län",
    "location": "Göteborg",
    "published": "2025-04-22",
    "deadline": "2025-05-11",
    "url": "https://lansstyrelsen.varbi.com/what:job/jobID:820277/type:job/where:1/apply:1",
    "description": "Länsstyrelsernas IT-avdelning är i en spännande utvecklingsfas där digitalisering, innovativa lösningar och säkerhets- och beredskapsfrågor är i fokus.\r\n\r\nVår IT-miljö är omfattande och varierande. Den innefattar allt från modern infrastruktur till system som vi utvecklar själva. Framför allt kommer våra idéer hela samhället till nytta. Det ger en alldeles speciell känsla som är svår att slå.\n\nLänsstyrelsernas verksamhet har en stor bredd och verkar inom områden som är högst aktuella i dagens sa..."
  },
  {
    "id": "29644935",
    "title": "JavaScript-utvecklare för Digitala tjänster ",
    "employer": "GÖTEBORGS KOMMUN",
    "location": "Göteborg",
    "published": "2025-04-22",
    "deadline": "2025-05-15",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=4e9fd4d0-a331-40aa-8c8c-d25b8e1c193f&publishCode=AMS&TK=540e80df-8d77-4a80-adf9-715c506e2db5",
    "description": "Intraservice levererar tjänster och digital infrastruktur som hjälper medarbetare och chefer i Göteborgs Stad att arbeta smart och effektivt. På så vis gör vi det enklare att arbeta i staden och skapar förutsättningar för en god service till göteborgarna. Vi har en central roll i stadens digitalisering och automatisering och våra kunder är Göteborgs alla förvaltningar och bolag.\nVi är drygt 700 medarbetare som arbetar i centrala Göteborg. Hoppas du vill bli en av oss!\nMer information: http://www..."
  },
  {
    "id": "29641145",
    "title": "ServiceNow developer",
    "employer": "Skatteverket",
    "location": "Göteborg",
    "published": "2025-04-17",
    "deadline": "2025-05-19",
    "url": "https://skatteverket.varbi.com/what:job/jobID:813845/type:job/where:1/apply:1",
    "description": "Arbetar du som ServiceNow utvecklare idag? Vill du arbeta i en organisation där du tillsammans med kunniga och utvecklingsinriktade kollegor får möjlighet att driva en av Sveriges största it-miljöer framåt? Hos oss får du intressanta arbetsuppgifter i samhällets hjärta, kombinerat med utvecklingsmöjligheter och balans mellan arbete och fritid.\r\n\r\nVar med och gör samhället möjligt!\n\nOm jobbet\nSkatteverkets it-avdelning ansvarar för drift, förvaltning och utveckling av myndighetens it-system. Skat..."
  },
  {
    "id": "29627975",
    "title": "Javautvecklare till bolag inom cybersäkerhet",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-04-14",
    "deadline": "2025-05-14",
    "url": "https://jobnet.se/systemutvecklare-zacco?utm_source=arbetsformedlingen&utm_medium=annons&utm_content=zacco&utm_term=systemutvecklare",
    "description": "Är du en kommunikativ utvecklare med stort intresse för digital säkerhet och Java? Jobba tillsammans med kompetenta kollegor mot det gemensamma målet att göra Zacco Digital Trust till Europas främsta cybersäkerhetspartner.  \nZacco Digital Trust arbetar med spännande och innovativa kunder – allt ifrån nystartade företag till internationella storföretag. Här använder vi OWASP som det första steget mot säkrare kod och främjandet av en säkerhetsmedveten kultur.\nDin främsta uppgift blir att hjälpa ku..."
  },
  {
    "id": "29528627",
    "title": "Lead Developer med ansvar för Backend till vårt team i Göteborg",
    "employer": "Kvdbil AB",
    "location": "Göteborg",
    "published": "2025-03-10",
    "deadline": "2025-08-27",
    "url": "https://jobb.kvdbil.se/jobs/5641031-lead-developer-med-ansvar-for-backend-till-vart-team-i-goteborg?promotion=1376017-arbetsformedlingen",
    "description": "Kvdbil är Sveriges största marknadsplats för begagnade bilar. Årligen säljer vi runt 26 000 bilar. När vi går till jobbet varje dag gör vi det med strävan om att jobba mot en schysstare bilbransch – med ärlighet och transparens. Vi drivs av att ge god service och hitta lösningar som underlättar våra kunders bilaffärer. Och kul på jobbet, det har vi mycket av! \nNu söker vi en Lead Developer med ansvar för Backend.\nOm jobbet\nSom Lead Developer för Backend ansvarar du, i samarbete med arkitekt och ..."
  },
  {
    "id": "29494205",
    "title": "C++ / EC++ utvecklare",
    "employer": "Tech Talents Consulting i Sverige AB",
    "location": "Göteborg",
    "published": "2025-02-25",
    "deadline": "2025-06-30",
    "url": "https://techtalents.se/jobb/240-c-ec-utvecklare/?pnty_src=arbetsformedlingen",
    "description": "Om uppdraget\n\nVi vill jobba med dig som har arbetat ett tag med C++ eller EC++ helt enkelt 👩‍💻👨‍💻🦄\n\nHar du programmerat applikationer, jobbat med nätverkskommunikation, programmerat spel, experimenterat med Arduino, byggt mobilappar, skapat bibliotek eller ramverk, you name it, så hör av dig. Våra partners inom tech, fordon och spel med flera är i behov av din guidning, stöttning, nya synvinklar, idéer och kunskap för att driva utvecklingen framåt.\n\nVi söker dig som\n\nHar en akademisk utbildning ..."
  },
  {
    "id": "29405869",
    "title": "Erfaren systemutvecklare inom IT och industri",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-01-23",
    "deadline": "2025-05-22",
    "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
    "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa ef..."
  },
  {
    "id": "29293175",
    "title": "Developer CRM",
    "employer": "Sopra Steria Sweden AB",
    "location": "Göteborg",
    "published": "2024-12-02",
    "deadline": "2025-05-31",
    "url": "https://easyapply.jobs/r/4oGqDX423bBIO43lhxZQ",
    "description": "Om rollen\n\nSom utvecklare hos oss på Sopra Steria arbetar du med alla delar av utvecklingsprocessen, från koncept till implementation och förvaltning. Du får bryta ner komplexa problem och skapa anpassade lösningar till kunder med den allra senaste tekniken, med grund i Microsofts hela portfölj av tjänster. Som utvecklare i .NET rör vi oss över hela stacken, vilket gör att arbetsuppgifterna under en vecka kan variera. Att arbeta med Microsofts paraply av molntjänster, som dessutom ständigt utöka..."
  },
  {
    "id": "29641262",
    "title": "ServiceNow developer",
    "employer": "Skatteverket",
    "location": "Östersund",
    "published": "2025-04-17",
    "deadline": "2025-05-19",
    "url": "https://skatteverket.varbi.com/what:job/jobID:820006/type:job/where:1/apply:1",
    "description": "Arbetar du som ServiceNow utvecklare idag? Vill du arbeta i en organisation där du tillsammans med kunniga och utvecklingsinriktade kollegor får möjlighet att driva en av Sveriges största it-miljöer framåt? Hos oss får du intressanta arbetsuppgifter i samhällets hjärta, kombinerat med utvecklingsmöjligheter och balans mellan arbete och fritid.\r\n\r\nVar med och gör samhället möjligt!\n\nOm jobbet\nSkatteverkets it-avdelning ansvarar för drift, förvaltning och utveckling av myndighetens it-system. Skat..."
  },
  {
    "id": "29641193",
    "title": "ServiceNow developer",
    "employer": "Skatteverket",
    "location": "Sundbyberg",
    "published": "2025-04-17",
    "deadline": "2025-05-19",
    "url": "https://skatteverket.varbi.com/what:job/jobID:820001/type:job/where:1/apply:1",
    "description": "Arbetar du som ServiceNow utvecklare idag? Vill du arbeta i en organisation där du tillsammans med kunniga och utvecklingsinriktade kollegor får möjlighet att driva en av Sveriges största it-miljöer framåt? Hos oss får du intressanta arbetsuppgifter i samhällets hjärta, kombinerat med utvecklingsmöjligheter och balans mellan arbete och fritid.\r\n\r\nVar med och gör samhället möjligt!\n\nOm jobbet\nSkatteverkets it-avdelning ansvarar för drift, förvaltning och utveckling av myndighetens it-system. Skat..."
  },
  {
    "id": "29678854",
    "title": "IT-Tekniker",
    "employer": "Onitio Sverige AB",
    "location": "Göteborg",
    "published": "2025-05-05",
    "deadline": "2025-06-04",
    "url": "https://onitio.onecruiter.com/jobs/294492-it-tekniker?ref=platsbanken",
    "description": "IT-tekniker\n\nGillar du att jobba självständigt, drivs av att ge god service samt att ställas inför tekniska utmaningar?\n\nSom onsite-tekniker kommer du att arbeta med IT-support på plats ute hos kund. Du hjälper kunderna med olika IT-relaterade problem och utmaningar/uppdrag. Det kan handla om allt ifrån att installera nya datorer, hantera upplåsning av konton, /koppling av skrivare, uppgradering av programvaror till hantering av nätverksproblem eller att felsöka befintliga datorer och skrivares ..."
  },
  {
    "id": "29654575",
    "title": "Systemtekniker - Övervakning med Zabbix",
    "employer": "Trafikverket",
    "location": "Göteborg",
    "published": "2025-04-24",
    "deadline": "2025-05-14",
    "url": "https://trv.heroma.se/prod/TRVpp01/ExternWebbV2/LedigaJobb/EW2PageAnnons.aspx?arenderef=7974075265911580817&benamning=Systemtekniker+-+%c3%96vervakning+med+Zabbix",
    "description": "Är du en teknikintresserad och nyfiken person med erfarenhet av Zabbix som vill bidra till att säkra Sveriges transportsystem? Då kan du vara den vi söker!\n\r\n\r\nSystemtekniker - Övervakning med Zabbix\r\n\r\nArbetsuppgifter\n\nDitt arbete handlar om att övervaka IT-infrastruktur och telekommunikation längs vägar, broar, tunnlar och järnvägar i hela Sverige, och säkerställa att dessa system fungerar stabilt och effektivt. Vi på Övervakning IT inom Operativt Center ansvarar för implementering, utveckling..."
  },
  {
    "id": "29637505",
    "title": "Integrationstekniker/specialist inom applikation",
    "employer": "Länsstyrelsen i Västra Götalands län",
    "location": "Göteborg",
    "published": "2025-04-16",
    "deadline": "2025-05-13",
    "url": "https://lansstyrelsen.varbi.com/what:job/jobID:817015/type:job/where:1/apply:1",
    "description": "Länsstyrelsernas IT-avdelning är i en spännande utvecklingsfas där digitalisering, innovativa lösningar och säkerhets- och beredskapsfrågor är i fokus. Vår IT-miljö är omfattande och varierande. Den innefattar allt från modern infrastruktur till system som vi utvecklar själva. Framför allt kommer våra idéer hela samhället till nytta. Det ger en alldeles speciell känsla som är svår att slå.\n\n\n\nLänsstyrelsernas verksamhet har en stor bredd och verkar inom områden som är högst aktuella i dagens sam..."
  },
  {
    "id": "29586801",
    "title": "IT-tekniker med koll på drift och nätverk? Vi har jobbet för dig!",
    "employer": "Studieinst Sverige AB",
    "location": "Göteborg",
    "published": "2025-03-29",
    "deadline": "2025-06-30",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29586801",
    "description": "Vill du använda dina IT-kunskaper i uppdrag som faktiskt gör skillnad – där du både får utvecklas och jobba med teknik på riktigt? Hos oss får du arbeta som IT-tekniker i den offentliga sektorn, där du blir en nyckelperson i organisationens dagliga IT-drift.\nDet här är en perfekt möjlighet för dig som arbetat några år inom IT och nu vill ta nästa steg. Du kommer in i en miljö där dina kunskaper tas på allvar, där du får ta ansvar – men också stöd i uppdragets alla delar.\nVi ser till att du får e..."
  }
]