[
  {
    "id": "29747495",
    "title": "Senior Utvecklare | Lernia AB | Göteborg",
    "employer": "Lernia AB",
    "location": "Göteborg",
    "published": "2025-06-03",
    "deadline": "2025-07-03",
    "url": "https://www.lernia.se/?jobid=296112&ref=platsbanken",
    "description": "Om rollen \n\nVi söker en senior utvecklare, en skicklig och driven fullstackutvecklare som vill vara en del av ett team där kvalitet, samarbete och teknisk innovation står i fokus. \n\nSom senior systemutvecklare hos oss blir du en nyckelspelare i vårt utvecklingsteam som ansvarar för arkitektur, tekniska val och implementation av våra digitala plattformar. Vi arbetar i Microsoftstacken och bygger moderna webb- och mobilapplikationer i Azure-miljö med Umbraco CMS. Tillsammans med teamet utvecklare ..."
  },
  {
    "id": "29802424",
    "title": "Fullstackutvecklare med känsla för UX och grafisk form",
    "employer": "Gröna gårdar AB",
    "location": "Göteborg",
    "published": "2025-06-30",
    "deadline": "2025-08-29",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29802424",
    "description": "Vill du vara med och utmana livsmedelsbranschen – tekniskt, visuellt och affärsmässigt?\nGröna gårdar är ett innovativt e-handelsföretag som tror på hållbar matproduktion, där djuren är en del av ett större kretslopp. Nu tar vi nästa steg mot att bli ett renodlat digitalt bolag – och söker dig som vill bidra till en bättre framtid genom teknik, design och smarta lösningar.\nVi är ett litet team med stora ambitioner – här får du vara med från idé till verklighet. Gillar du att jobba nära besluten, ..."
  },
  {
    "id": "29796260",
    "title": "Mjukvaru-/Systemutvecklare till våra Utvecklingsteam",
    "employer": "Combitech AB",
    "location": "Göteborg",
    "published": "2025-06-27",
    "deadline": "2025-08-14",
    "url": "https://www.aplitrak.com/?adid=dGNvbGxpbi43MDA0My4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
    "description": "Enheten Kritiska System på Combitech i Göteborg arbetar idag i huvudsak med in-houseteam och teamleveranser. Hos oss är du en del av ett dynamiskt team som ansvarar för hela leveransen, planeringen och problemlösning gentemot våra kunder. \n\n \n\nIdag har vi ett flertal team som behöver utöka med nya engagerade systemutvecklare eller mjukvaruutvecklare. Vi hoppas att du kommer hitta spännande utmaningar i något av dem! \n\n \n\nTeam Alfa fokuserar på radarplattformar och -system inom försvarsindustrin,..."
  },
  {
    "id": "29786070",
    "title": "Linux och Open Source entusiast",
    "employer": "Combitech AB",
    "location": "Göteborg",
    "published": "2025-06-23",
    "deadline": "2025-08-12",
    "url": "https://www.aplitrak.com/?adid=am9sc3Nvbi4wMzczMi4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
    "description": "Vi söker Linux och open source entusiaster till Combitech i Göteborg. Hos oss får du möjlighet att växa i en företagskultur som uppmuntrar både professionell och personlig utveckling samt anställningstrygghet och balans i livet. Som medarbetare på Combitech i Göteborg är du med och utvecklar framtidens digitaliseringslösningar för industri och samhälle.\n\n \n\n \n\nDin roll som utvecklare\n\nDu kommer att vara en del av ett team som tillsammans utvecklar mjukvarulösningar för datainsamling, datalagring..."
  },
  {
    "id": "29784180",
    "title": "Erfaren systemutvecklare inom IT och industri",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-06-22",
    "deadline": "2025-07-10",
    "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
    "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa ef..."
  },
  {
    "id": "29780547",
    "title": "Fullstack.NET utvecklare",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-19",
    "deadline": "2025-08-22",
    "url": "https://kronofogden.varbi.com/what:job/jobID:838724/type:job/where:1/apply:1",
    "description": "Ett jobb som räknas! Hos oss bidrar du till ett välfungerande samhälle för all­män­het och företag.\r\n\r\nVi söker nu en fullstackutvecklare som har ett stort intresse för front-end och Angular. Just nu anställer vi medarbetare i Stockholm, Göteborg, Malmö och Kalmar. Vill du skapa samhällsnytta och bidra till att utveckla Kronofogdens it-avdelning? Vill du ha möjlighet att kombinera familjeliv/fritid med arbetsliv? Bra, läs vidare.\n\nVi är närmare 200 kollegor på Kronofogden som arbetar med IT-utve..."
  },
  {
    "id": "29778998",
    "title": "Javautvecklare i början av karriären",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-18",
    "deadline": "2025-07-31",
    "url": "https://kronofogden.varbi.com/what:job/jobID:838503/type:job/where:1/apply:1",
    "description": "Ett jobb som räknas! Hos oss bidrar du till ett välfungerande samhälle för all­män­het och företag.\r\n\r\nVi söker dig som är i början av din karriär som java-utvecklare och som vill fortsätta växa i rollen hos oss. Du har grunderna och vill utvecklas vidare med oss, vi erbjuder stöd i form av erfarna kollegor och kompetensutveckling.\n\nJust nu anställer vi medarbetare i Göteborg, Malmö och Kalmar/Karlskrona. \n\nOm jobbet\nI rollen som Java-utvecklare blir du en del av något av våra utvecklingsteam dä..."
  },
  {
    "id": "29773978",
    "title": "Javautvecklare med lösningsarkitektur, krav- eller testkunskap",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-06-16",
    "deadline": "2025-08-29",
    "url": "https://kronofogden.varbi.com/what:job/jobID:837730/type:job/where:1/apply:1",
    "description": "Är du en skicklig systemutvecklare inom Java som också har erfarenhet av lösningsarkitektur, kravhantering- och/eller testautomatisering?  Tycker du om att ha ett jobb som räknas?  Då måste du läsa vidare!\n\nHos oss bidrar du till ett välfungerande samhälle för allmänhet och företag samtidigt som du får möjlighet att bidra och utveckla dina kunskaper! Kronofogden erbjuder ett modernt och hållbart arbetsliv där t.\r\n\r\nex. distansarbete är en möjlighet i den omfattning verksamheten beslutar.\n\nJust n..."
  },
  {
    "id": "29773389",
    "title": "Riksarkivet söker en Junior Data Scientist",
    "employer": "Riksarkivet",
    "location": "Göteborg",
    "published": "2025-06-16",
    "deadline": "2025-07-04",
    "url": "https://go.talentech.io/6GsL6",
    "description": "Riksarkivet har särskilt ansvar för den statliga arkivverksamheten och för arkivvården i landet. Vi ska kontrollera den offentliga arkivverksamheten och ha nationell överblick över arkivfrågorna. Vi tar emot statliga myndigheters arkiv och arkiv från andra typer av organisationer.\n\nVi säkrar samhällets långsiktiga informationsförsörjning och garanterar innehåll, sammanhang och äkthet. Vi fokuserar på användarnas behov när vi beskriver och vårdar arkiven, när vi gör dem tillgängliga och när vi re..."
  },
  {
    "id": "29666864",
    "title": "Systemutvecklare .NET",
    "employer": "Sopra Steria Sweden AB",
    "location": "Göteborg",
    "published": "2025-04-29",
    "deadline": "2025-10-26",
    "url": "https://easyapply.jobs/r/5sAQGm52470ZO562RSCN",
    "description": "Vi söker .NET-utvecklare till Stockholm, Malmö, Östersund och Göteborg! 💻\n\n  Vill du vara en del av ett av Sveriges bästa arbetsgivare och hjälpa våra kunder att ta nästa steg i sin digitala resa? Sopra Steria söker fler .NET-utvecklare till våra agila team – här möts trygghet, flexibilitet och en kultur präglad av kunskapsdelning. Vi kallar det Power of Sharing!\nOm rollen\n\n  Som .NET-utvecklare hos oss kommer du att bli en viktig del av våra kunders digitala transformation. Du arbetar nära både..."
  },
  {
    "id": "29721626",
    "title": "IT-tekniker till bolag i Göteborg!",
    "employer": "Academic Work Sweden AB",
    "location": "Göteborg",
    "published": "2025-05-22",
    "deadline": "2025-07-13",
    "url": "http://www.academicwork.se/jobad/it-tekniker-till-bolag-i-goteborg/15112564?apply=1",
    "description": "Vill du bidra med teknisk kompetens och ett trevligt kundbemötande har vi en passande tjänst för dig! Just nu söker vi på Academic Work en IT-tekniker som kommer arbeta kundnära i tekniska miljöer och hjälpa kunder att hitta smarta lösningar. Välkommen med din ansökan redan idag - vi tillämpar löpande urval!\n\nOM TJÄNSTEN \nVår kund är ett IT-företag som arbetar med helhetsansvar för sina kunders IT-funktioner, infrastruktur och säkerhet. Det vill säga support, drift och underhåll av såväl datakom..."
  },
  {
    "id": "29560444",
    "title": "System- och Verksamhetspecialist inom fastighetsbranschen sökes!",
    "employer": "Professionals Nord Rekrytering AB",
    "location": "Göteborg",
    "published": "2025-03-20",
    "deadline": "2025-07-13",
    "url": "https://pn.zerolime.se/show.aspx?src=AMS&id=040D616F-2F0E-491D-9BA3-579F9FBC3B9C",
    "description": "Drivs du av att hjälpa kunder att optimera och effektivisera sina processer? Har du även ett stort intresse för IT-system, service och fastighetsförvaltning?\n\nProfessionals Nord söker nu för Service Works Globals räkning System- och Verksamhetspecialister som vill vara med på deras pågående tillväxtresa. Urval kommer att ske löpande, så ta chansen och sök redan idag!\n\nService Works Global:\nService Works Global utvecklar lösningar inom fastighetsbranschen för att ge fastighetsägare ett helhetsstö..."
  }
]