[
  {
    "id": "29699546",
    "title": "Sektionschef inom IT!",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "published": "2025-05-13",
    "deadline": "2025-06-03",
    "url": "https://www.aplitrak.com/?adid=cC5zdmVuc3Nvbi44NzA2My4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
    "description": "Vi tror att framsteg och möjligheter skapas bäst tillsammans. Välkommen till en plats där samarbete gör skillnad. \n\nDin roll \n\nBusiness IT jobbar med tjänster för att stödja verksamhetens omedelbara behov och därefter standardisera och automatisera skapandet, driften och förvaltningen av specialiserade IT-miljöer. Dessa miljöer kan vara allt från enkla testmiljöer till komplexa utvecklingsplattformar. Vårt arbete gör det möjligt för verksamheten att utveckla, producera och leverera produkter til..."
  },
  {
    "id": "29690981",
    "title": "Systemspecialist, IT Drift",
    "employer": "GÖTEBORGS KOMMUN",
    "location": "Göteborg",
    "published": "2025-05-09",
    "deadline": "2025-05-23",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=d07b8fb4-34bc-44bf-9f6e-570fc76ea014&publishCode=AMS&TK=7143b591-94fb-4775-b077-285ed698c31a",
    "description": "Stadsmiljöförvaltningen har ett helhetsansvar för stadens offentliga rum och samlade framkomlighet. Vi arbetar för att skapa tillgängliga, attraktiva och levande stadsmiljöer och naturområden. Förvaltningen äger och förvaltar spårvagnsnätet i Göteborg. På förvaltningen arbetar cirka 900 personer.\n\nStadsmiljöförvaltningen är en del av de stadsutvecklingsförvaltningar som finns i Göteborgs Stad. Gemensamt arbetar vi med att skapa förutsättningar för en fungerande infrastruktur, bostäder och lokale..."
  },
  {
    "id": "29715513",
    "title": "Javautvecklare Till Bolag Inom Cybersäkerhet",
    "employer": "Friday Väst AB",
    "location": "Göteborg",
    "published": "2025-05-20",
    "deadline": "2025-07-15",
    "url": "https://pnty-apply.ponty-system.se/friday?id=3071&pnty_src=arbetsformedlingen",
    "description": "Är du en kommunikativ utvecklare med ett brinnande intresse för Java och digital säkerhet? För vår kunds räkning söker vi en Javautvecklare där du arbetar tillsammans med kunniga kollegor i spännande projekt. Välkommen in med din ansökan!\n\nOM TJÄNSTEN:\n\nNu söker vi en serviceinriktad Java utvecklare som gillar att arbeta i dynamiska miljöer och vill hjälpa kunder ta sitt nästa steg i utvecklingen av sin verksamhet. I rollen kommer du huvudsakligen hjälpa kunder i deras systemutvecklingsarbete. D..."
  },
  {
    "id": "29713951",
    "title": "Västtrafik söker Systemutvecklare .NET till Team To Go",
    "employer": "VÄSTRA GÖTALANDSREGIONEN",
    "location": "Göteborg",
    "published": "2025-05-19",
    "deadline": "2025-06-15",
    "url": "https://vgregion.varbi.com/what:job/jobID:828689/type:job/where:1/apply:1",
    "description": "Västtrafik söker Systemutvecklare .\r\n\r\nNET till Team To Go\n\nVill du utveckla innovativa lösningar som påverkar miljontals användare? Vill du vara en del att skapa hållbart resande för vår Region? Vi söker nu en systemutvecklare .NET, till Team To Go – en spännande roll där du kombinerar backend, testning och systemarkitektur i en agil och samarbetsinriktad miljö där vi har kul tillsammans. Låter detta intressant? Ansök idag och bli en del av vårt team!  \n\nRollbeskrivning:\n\nSom systemutvecklare i..."
  },
  {
    "id": "29713829",
    "title": "Javautvecklare med lösningsarkitektur, krav- eller testkunskap",
    "employer": "Kronofogdemyndigheten",
    "location": "Göteborg",
    "published": "2025-05-19",
    "deadline": "2025-06-09",
    "url": "https://kronofogden.varbi.com/what:job/jobID:829096/type:job/where:1/apply:1",
    "description": "Är du en skicklig systemutvecklare inom Java som också har erfarenhet av lösningsarkitektur, kravhantering- och/eller testautomatisering?  Tycker du om att ha ett jobb som räknas?  Då måste du läsa vidare!\n\nHos oss bidrar du till ett välfungerande samhälle för allmänhet och företag samtidigt som du får möjlighet att bidra och utveckla dina kunskaper! Kronofogden erbjuder ett modernt och hållbart arbetsliv där t.\r\n\r\nex. distansarbete är en möjlighet i den omfattning verksamheten beslutar.\n\nJust n..."
  },
  {
    "id": "29696381",
    "title": "Embedded Utvecklare",
    "employer": "Nexer AB",
    "location": "Göteborg",
    "published": "2025-05-12",
    "deadline": "2025-06-12",
    "url": "https://nexergroup.teamtailor.com/jobs/5918702-embedded-utvecklare?promotion=1465825-arbetsformedlingen",
    "description": "Erfaren Embedded utvecklare \nTill en av våra kunder inom försvarsindustrin söker vi nu en erfaren Embedded Utvecklare  till Göteborg. Som en erfaren Embedded Utvecklare kommer du spela en viktig roll i vår kunds projekt. Här får du chansen att utveckla dina färdigheter som att vässa din förmåga att hantera komplexa system.\nDina arbetsuppgifter:\n Ta ansvar för helheten och kommunicerar lösningar\n Arbeta med komplexa system där målet är att ta fram effektiva lösningar\n  Analysfunktioner av data.\n ..."
  },
  {
    "id": "29694239",
    "title": "Utvecklare C# och .NET till polisen.se",
    "employer": "Polismyndigheten",
    "location": "Göteborg",
    "published": "2025-05-12",
    "deadline": "2025-06-02",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29694239",
    "description": "Vi söker dig som vill vara med och utveckla polisen.se. Polisens hemsida får ca 1 miljon besök per vecka och som systemutvecklare på Polismyndigheten är du med och tar fram IT-lösningar som bidrar till ett tryggare och säkrare samhälle.\nArbetsplatsbeskrivning\nIT-avdelningen består av ca 1300 anställda som ansvarar för all IT som används av myndighetens 40 000 medarbetare över hela landet. Hos oss deltar och ansvarar varje grupp för hela sin produktlivscykel – från idé till implementation och vid..."
  },
  {
    "id": "29693898",
    "title": "Systemutvecklare med inriktning Smart Stad",
    "employer": "GÖTEBORGS KOMMUN",
    "location": "Göteborg",
    "published": "2025-05-12",
    "deadline": "2025-05-26",
    "url": "https://recruit.visma.com/spa/public/apply?guidAssignment=9fdce4e8-6881-45da-b2b0-5fd2db037e7c&publishCode=AMS&TK=e68a34a6-7746-42d3-aaf4-6fd1748c97dd",
    "description": "Intraservice levererar tjänster och digital infrastruktur som hjälper medarbetare och chefer i Göteborgs Stad att arbeta smart och effektivt. På så vis gör vi det enklare att arbeta i staden och skapar förutsättningar för en god service till göteborgarna. Vi har en central roll i stadens digitalisering och automatisering och våra kunder är Göteborgs alla förvaltningar och bolag.\nVi är drygt 700 medarbetare som arbetar i centrala Göteborg. Hoppas du vill bli en av oss!\nMer information: http://www..."
  },
  {
    "id": "29690299",
    "title": "Systemutvecklare med fokus på frontend",
    "employer": "Göteborgs Universitet",
    "location": "Göteborg",
    "published": "2025-05-09",
    "deadline": "2025-06-01",
    "url": "https://go.talentech.io/zBO5X",
    "description": "Göteborgs universitet möter samhällets utmaningar med mångsidig kunskap. 56 000 studenter och 6 600 medarbetare gör universitetet till en stor och inspirerande arbetsplats. Stark forskning och attraktiva utbildningar lockar forskare och studenter från hela världen. Med ny kunskap och nya perspektiv bidrar Göteborgs universitet till en bättre framtid.Göteborgs universitetsbibliotek är ett av landets största bibliotek och består av åtta bibliotek med olika ämnesinriktningar samt Digitala tjänster...."
  },
  {
    "id": "29686433",
    "title": "Systemvetare inriktning C-ITS",
    "employer": "Trafikverket",
    "location": "Göteborg",
    "published": "2025-05-08",
    "deadline": "2025-05-26",
    "url": "https://trv.heroma.se/prod/TRVpp01/ExternWebbV2/LedigaJobb/EW2PageAnnons.aspx?arenderef=7987035635937709720&benamning=Systemvetare+inriktning+C-ITS",
    "description": "Är du en nyexad systemvetare som vill bidra till ett mer tillgängligt och effektivt transportsystem? Läs nedan och sök detta spännande jobb!\n\r\n\r\nSystemvetare inriktning C-ITS\r\n\r\nArbetsuppgifter\n\nInom avdelningen Digitalisering och vägsystem på verksamhetsområdet IKT har vi den spännande uppgiften att skapa ett säkert och stabilt vägtrafiksystem för oss och kommande generationer. Som systemvetare inom C-ITS (Cooperative Intelligent Transport Systems) blir du en viktig del av ett team där vi utred..."
  },
  {
    "id": "29678101",
    "title": "Systemutvecklare Sharepoint",
    "employer": "VÄSTRA GÖTALANDSREGIONEN",
    "location": "Göteborg",
    "published": "2025-05-05",
    "deadline": "2025-05-25",
    "url": "https://vgregion.varbi.com/what:job/jobID:823595/type:job/where:1/apply:1",
    "description": "Vill du vara med och bidra till att skapa Sveriges bästa hälso-och sjukvård och ett hållbart samhälle med tillväxt i hela Västra Götaland? Västra Götalandsregionen är Sveriges största offentliga arbetsgivare med ambitionen att bli Sveriges bästa offentliga arbetsgivare.\r\n\r\nPå Koncernkontoret arbetar vi dagligen med att göra skillnad för patienter, medarbetare, besökare och invånare.  \n\nNu söker vi en systemutvecklare Sharepoint för att stärka vårt team i enheten Information och arkivering. Här k..."
  },
  {
    "id": "29666864",
    "title": "Systemutvecklare .NET",
    "employer": "Sopra Steria Sweden AB",
    "location": "Göteborg",
    "published": "2025-04-29",
    "deadline": "2025-10-26",
    "url": "https://easyapply.jobs/r/5sAQGm52470ZO562RSCN",
    "description": "Vi söker .NET-utvecklare till Stockholm, Malmö, Östersund och Göteborg! 💻\n\n  Vill du vara en del av ett av Sveriges bästa arbetsgivare och hjälpa våra kunder att ta nästa steg i sin digitala resa? Sopra Steria söker fler .NET-utvecklare till våra agila team – här möts trygghet, flexibilitet och en kultur präglad av kunskapsdelning. Vi kallar det Power of Sharing!\nOm rollen\n\n  Som .NET-utvecklare hos oss kommer du att bli en viktig del av våra kunders digitala transformation. Du arbetar nära både..."
  },
  {
    "id": "29656838",
    "title": "Junior Supportingenjör Inom Satellitkommunikation!",
    "employer": "Friday Väst AB",
    "location": "Göteborg",
    "published": "2025-04-25",
    "deadline": "2025-05-25",
    "url": "https://pnty-apply.ponty-system.se/friday?id=3255&pnty_src=arbetsformedlingen",
    "description": "Vill du vara med och bidra till en samhällsviktig funktion som gör det möjligt för läkare, journalister och andra viktiga aktörer att snabbt etablera en satellitbaserad internetanslutning? Vår kund, som är verksam inom satellitkommunikationsbranschen, söker nu en Junior Supportingenjör med stort tekniskt intresse. Kanske är det du? Varmt välkommen med din ansökan – vi tillämpar löpande urval!\n\nOm tjänsten: \nVår kunds mål är att tillhandahålla högportabla satellitkommunikationsenheter som kan anv..."
  },
  {
    "id": "29528627",
    "title": "Lead Developer med ansvar för Backend till vårt team i Göteborg",
    "employer": "Kvdbil AB",
    "location": "Göteborg",
    "published": "2025-03-10",
    "deadline": "2025-08-27",
    "url": "https://jobb.kvdbil.se/jobs/5641031-lead-developer-med-ansvar-for-backend-till-vart-team-i-goteborg?promotion=1376017-arbetsformedlingen",
    "description": "Kvdbil är Sveriges största marknadsplats för begagnade bilar. Årligen säljer vi runt 26 000 bilar. När vi går till jobbet varje dag gör vi det med strävan om att jobba mot en schysstare bilbransch – med ärlighet och transparens. Vi drivs av att ge god service och hitta lösningar som underlättar våra kunders bilaffärer. Och kul på jobbet, det har vi mycket av! \nNu söker vi en Lead Developer med ansvar för Backend.\nOm jobbet\nSom Lead Developer för Backend ansvarar du, i samarbete med arkitekt och ..."
  },
  {
    "id": "29494205",
    "title": "C++ / EC++ utvecklare",
    "employer": "Tech Talents Consulting i Sverige AB",
    "location": "Göteborg",
    "published": "2025-02-25",
    "deadline": "2025-06-30",
    "url": "https://techtalents.se/jobb/240-c-ec-utvecklare/?pnty_src=arbetsformedlingen",
    "description": "Om uppdraget\n\nVi vill jobba med dig som har arbetat ett tag med C++ eller EC++ helt enkelt 👩‍💻👨‍💻🦄\n\nHar du programmerat applikationer, jobbat med nätverkskommunikation, programmerat spel, experimenterat med Arduino, byggt mobilappar, skapat bibliotek eller ramverk, you name it, så hör av dig. Våra partners inom tech, fordon och spel med flera är i behov av din guidning, stöttning, nya synvinklar, idéer och kunskap för att driva utvecklingen framåt.\n\nVi söker dig som\n\nHar en akademisk utbildning ..."
  },
  {
    "id": "29405869",
    "title": "Erfaren systemutvecklare inom IT och industri",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "published": "2025-01-23",
    "deadline": "2025-05-29",
    "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
    "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa ef..."
  },
  {
    "id": "29293175",
    "title": "Developer CRM",
    "employer": "Sopra Steria Sweden AB",
    "location": "Göteborg",
    "published": "2024-12-02",
    "deadline": "2025-05-31",
    "url": "https://easyapply.jobs/r/4oGqDX423bBIO43lhxZQ",
    "description": "Om rollen\n\nSom utvecklare hos oss på Sopra Steria arbetar du med alla delar av utvecklingsprocessen, från koncept till implementation och förvaltning. Du får bryta ner komplexa problem och skapa anpassade lösningar till kunder med den allra senaste tekniken, med grund i Microsofts hela portfölj av tjänster. Som utvecklare i .NET rör vi oss över hela stacken, vilket gör att arbetsuppgifterna under en vecka kan variera. Att arbeta med Microsofts paraply av molntjänster, som dessutom ständigt utöka..."
  },
  {
    "id": "29678854",
    "title": "IT-Tekniker",
    "employer": "Onitio Sverige AB",
    "location": "Göteborg",
    "published": "2025-05-05",
    "deadline": "2025-06-04",
    "url": "https://onitio.onecruiter.com/jobs/294492-it-tekniker?ref=platsbanken",
    "description": "IT-tekniker\n\nGillar du att jobba självständigt, drivs av att ge god service samt att ställas inför tekniska utmaningar?\n\nSom onsite-tekniker kommer du att arbeta med IT-support på plats ute hos kund. Du hjälper kunderna med olika IT-relaterade problem och utmaningar/uppdrag. Det kan handla om allt ifrån att installera nya datorer, hantera upplåsning av konton, /koppling av skrivare, uppgradering av programvaror till hantering av nätverksproblem eller att felsöka befintliga datorer och skrivares ..."
  },
  {
    "id": "29586801",
    "title": "IT-tekniker med koll på drift och nätverk? Vi har jobbet för dig!",
    "employer": "Studieinst Sverige AB",
    "location": "Göteborg",
    "published": "2025-03-29",
    "deadline": "2025-06-30",
    "url": "https://arbetsformedlingen.se/platsbanken/annonser/29586801",
    "description": "Vill du använda dina IT-kunskaper i uppdrag som faktiskt gör skillnad – där du både får utvecklas och jobba med teknik på riktigt? Hos oss får du arbeta som IT-tekniker i den offentliga sektorn, där du blir en nyckelperson i organisationens dagliga IT-drift.\nDet här är en perfekt möjlighet för dig som arbetat några år inom IT och nu vill ta nästa steg. Du kommer in i en miljö där dina kunskaper tas på allvar, där du får ta ansvar – men också stöd i uppdragets alla delar.\nVi ser till att du får e..."
  },
  {
    "id": "29560444",
    "title": "System- och Verksamhetspecialist inom fastighetsbranschen sökes!",
    "employer": "Professionals Nord Rekrytering AB",
    "location": "Göteborg",
    "published": "2025-03-20",
    "deadline": "2025-06-13",
    "url": "https://pn.zerolime.se/show.aspx?src=AMS&id=040D616F-2F0E-491D-9BA3-579F9FBC3B9C",
    "description": "Drivs du av att hjälpa kunder att optimera och effektivisera sina processer? Har du även ett stort intresse för IT-system, service och fastighetsförvaltning?\n\nProfessionals Nord söker nu för Service Works Globals räkning System- och Verksamhetspecialister som vill vara med på deras pågående tillväxtresa. Urval kommer att ske löpande, så ta chansen och sök redan idag!\n\nService Works Global:\nService Works Global utvecklar lösningar inom fastighetsbranschen för att ge fastighetsägare ett helhetsstö..."
  },
  {
    "id": "29691406",
    "title": "It-tekniker inom Windowsområdet",
    "employer": "Migrationsverket",
    "location": "Norrköping",
    "published": "2025-05-09",
    "deadline": "2025-05-30",
    "url": "https://migrationsverket.varbi.com/what:job/jobID:811939/type:job/where:1/apply:1",
    "description": "På Migrationsverket arbetar vi med en av vår tids stora samhällsfrågor – migrationen. Totalt är vi cirka 6 000 personer här, och vi har ett ovanligt viktigt jobb!\n\n\n\r\n\r\nMigrationsverket har inlett en resa, en digitaliseringsresa.\r\n\r\nDetta innebär att gamla system ska avvecklas, nya ska utvecklas och implementeras samtidigt som vi måste hålla gamla system igång med hög driftsäkerhet.  Det innebär också att vårt arbetssätt och kultur förändras. Migrationsverket befinner sig i en period av stora fö..."
  }
]