[
  {
    "id": "29405869",
    "title": "Erfaren systemutvecklare inom IT och industri",
    "employer": "Jobnet AB",
    "location": "Göteborg",
    "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa effektiva stöd för industriella processer. Här tar du hjälp av dina kunskaper i .NET och din förståelse för systemintegration för att identifiera behov och fastställa kravspecifikationer. Du deltar i allt ifrån tekniska förstudier, design, utveckling och installation till support, underhåll och vidareutveckling samt förvaltning av mjukvara för effektiv produktion. I stora drag kan man säga att du kommer jobba med både systemering och programmering.\n\nI ditt arbete får du uppbackning av kollegor som Olle, Björn, Martin, Robert, Elisabeth och Helena.\n\nÄr det här du?\n\nFör att passa i rollen behöver du ha en civilingenjör/högskoleingenjörsexamen och minst fem års erfarenhet av utveckling och leverans av IT-lösningar inom kritisk drift. Du får gärna ha känsla för både .NET, SQL Server och Oracle Server. Om du dessutom förstår det här med systemintegration och kan tillämpa olika datautbytesmetoder är det ett stort plus.\n\nDitt engagemang och stora intresse för teknik är vad som sporrar dig att hitta nya lösningar och effektiva stöd. Det är bra om du har lätt för att kommunicera, interagera med andra och känner igen dig i egenskaper som kundorienterad och lösningsorienterad Känner du dig dessutom som en kreativ person med förmågan att vara analytisk och ha ett öga för detaljer så har du hamnat rätt.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Prevas. Det är viktigt att klargöra att rollen är för Prevas och att Jobnet endast fungerar som plattform för din ansökan.",
    "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
    "published": "2025-01-23T14:34:15",
    "deadline": "2025-06-19T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7597560975609756,
    "category": "IT"
  },
  {
    "id": "29759256",
    "title": "Software Developer  with C++ experience",
    "employer": "Göteborg int8 Technology AB",
    "location": "Göteborg",
    "description": "Location: Göteborg\nEmployment Type: Full-time \nDepartment: Embedded Software Development\nJob Summary:\nWe are seeking a skilled and motivated Software Developer with strong experience in C++ to join our development team. The ideal candidate will have experience working in a Linux environment, using Gtest for unit testing, and managing code with Git. \nThe role also requires hands-on experience testing software on Hardware-in-the-Loop (HIL) systems and actual vehicles, making it essential to have both software development expertise and a solid understanding of embedded systems and testing frameworks.\nKey Responsibilities:\nDesign, develop, and maintain high-quality C++ software for embedded systems.\nWrite and maintain unit tests using Gtest to ensure software reliability and correctness.\nWork in a Linux-based development environment.\nUse Git for version control and collaboration.\nConduct and support software testing on HIL setups and real vehicles to validate domain-specific functionalities.\nCollaborate with cross-functional teams including hardware engineers, test engineers, and system architects.\nParticipate in code reviews and contribute to continuous improvement of software development practices.\nRequirements:\nStrong   Experience in C++ development.\nExperience working in a Linux environment.\nSolid understanding of unit testing using Gtest.\nProficiency with git for source control and workflow management.\nHands-on experience with Hardware-in-the-Loop (HIL) systems and in-vehicle software testing.\nFamiliarity with embedded systems, control systems, or automotive domains is a plus.\nStrong problem-solving skills and the ability to work independently and in a team environment.\nPreferred Qualifications:\nBachelor’s or Master’s degree in Computer Science, Electrical Engineering, or a related field.\nExperience in automotive or aerospace domains.\n\n\nFamiliarity with software development lifecycle (Agile/Scrum).",
    "url": null,
    "published": "2025-06-09T22:18:48",
    "deadline": "2025-11-09T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7597560975609756,
    "category": "IT"
  },
  {
    "id": "29192430",
    "title": "Senior Software/DevOps Engineer",
    "employer": "Baronit AB",
    "location": "Göteborg",
    "description": "Shaping the Future with Brilliant Minds\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Airline, Fintech, Healthcare, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Senior DevOps Engineer to join our client’s team. This role requires a strong foundation in in cloud platforms and DevOps practices. You will collaborate closely with cross-functional teams to deliver scalable, reliable solutions that align with our client’s goals.\nHere's what we’re looking for in an ideal candidate:\nAcademic degree in Computer Science, Engineering, or a related field.\n6+ years of experience in a DevOps, or/and Software Engineering role.\nProven expertise in CI/CD automation using tools like Jenkins, Git, GitOps, Github , GitLab and Gerrit.\nStrong hands-on experience with AWS\nProficiency in Python, Bash/Shell scripting\nExperience with containerization and orchestration tools like Docker and Kubernetes.\nDeep understanding of monitoring and observability using Grafana, Prometheus, ElasticStack\nSolid background in Infrastructure as Code (IaC) with tools like Terraform.\nKnowledge of backend development with Java, JavaScript, and frameworks such as Spring Boot.\nExperience with database technologies such as PostgreSQL, MongoDB, and Redis.\nExpertise in security aspects, especially in CI/CD pipelines and cloud deployments.\nExperience with Agile/Scrum methodologies and working in a fast-paced, collaborative environment.\nExcellent communication and problem-solving skills, with a focus on continuous improvement and innovation.\n\nPreferred Qualifications:\nExposure to Site Reliability Engineering (SRE) principles.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSports and social activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
    "url": null,
    "published": "2024-10-20T18:16:33",
    "deadline": "2025-06-28T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7539634146341463,
    "category": "IT"
  },
  {
    "id": "29573819",
    "title": "Systemutvecklare",
    "employer": "Sylog Väst AB",
    "location": "Göteborg",
    "description": "Systemutvecklare/DevOps Ingenjör med mer än 6 års erfarenhet inom nedan område: \n Java, .NET/C#, Spring, Golang, TypeScript, React, SQL, Oracle, CI/CD tools, Kubernetes, Docker, AWS, Azure",
    "url": null,
    "published": "2025-03-25T13:48:05",
    "deadline": "2025-09-01T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7442073170731707,
    "category": "IT"
  },
  {
    "id": "29745599",
    "title": "Software Developer",
    "employer": "Ericsson AB",
    "location": "Göteborg",
    "description": "Ericsson AB\r\n\r\nJoin our Team\n\n\nAbout this opportunity\nEricsson Enterprise Wireless Solutions (BEWS) is the group responsible for leading Ericsson’s Enterprise Networking and Security business. Our growing product portfolio spans across wide area networks, local area networks and enterprise security. We are the #1 global market leader in Wireless-WAN based enterprise connectivity solutions and are growing fast in enterprise Private 5G networks and Secure Access Services Edge (SASE) solutions.\nHow Will You Contribute to the Company?\nWe are looking for a Backend Engineer who wants to join the most dynamic and fast-moving team in Ericsson! Someone who wants to build and create new paths for Ericsson in Industry 4.0. Our team has a key role in creating new business within local cellular connectivity. You will be engaged in the whole process from creating customer scenarios to translating into technology. \nWe are creating the future of global connectivity & community. Come join us. You belong here.\n\nWhat Will You Do\nWork in a team responsible for developing Golang based cloud software to manage Ericsson Private 5G networks. \nThe duties of your role will include:\n•    Golang software development\n•    Implement and verify technical solutions based upon Ericsson and 3PP (Third Party Product) products \n•    Work on the existing code base as well as new feature development within a cross-functional team\n•    Contribute to an innovative culture/environment\n\nThe skills you bring\n•    2 years of development experience\n•    Golang (or Java/C/C++) expertise\n•    High communication and collaboration skills\n•    Understanding of agile development methodologies\n•    Experience with SQL, RESTful APIs, Kubernetes (or Docker)\n•    Experience working with Gitlab (or similar code repository services based on GIT)\n•    Experience with testing practices and continuous integration\n•    University degree of Bachelor or Master\n•    Team player capabilities with an extraordinary \"can do\" attitude and positive approach! \n•    Thrives in a dynamic work environment \n•    Enterprise IT and/or Telecom experience\n•    Experience with Linux, Scripting, Cloud platform (Google Cloud, AWS or Azure), TCP/IP",
    "url": "https://ericsson-ab.contactrh.com/jobs/9669/43427256",
    "published": "2025-06-02T21:25:03",
    "deadline": "2025-06-13T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7442073170731707,
    "category": "IT"
  },
  {
    "id": "29736280",
    "title": "Fullstack developer for Air Traffic Management Tower Systems",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "description": "Your role\n\nAs part of the development team, you will collaborate closely with other developers and system engineers in the design and development of video capture, analysis and presentation for our Air Traffic Management products. You will design, implement, test and document software that will be used in our Integrated Digital Tower Suite (I-DTS).\n\n \n\nTherefore, you need to have a broad knowledge and ambition to learn and develop. We believe in an open and flat organisation where everyone's opinions are welcome and that this is a prerequisite for our future development. We value commitment and an outgoing and creative personality.\n\nThe main tasks are:\n\n * \n\nProposing and implementing software architecture and designs based on requirements and/or customers' needs as part of a product development team\n * \n\nSupport test engineer with software development of test automation frameworks\n * \n\nWriting well-structured, testable, efficient and maintainable full-stack code\n * \n\nCollaborating and adding value through participating in peer code reviews, providing comments and suggestions\n * \n\nTailoring and deploying software tools, processes and metrics\n\n \n\nSaab ATM AB develops world-leading air traffic management systems. The systems are used to conduct airport operations and manage air traffic as efficiently and safely as possible at everything from the smallest to the largest airports in the world. This places very high demands on our products to maintain a high quality.\n\nOur ATM operations are currently located in Gothenburg and Växjö. Our offices are characterised by employees with drive, commitment and professionalism. We believe that a diversity of experience, different perspectives and backgrounds contribute to a stimulating workplace and better products for our customers and users.\n\n \n\nYour profile\n\nFor this role we see that you have:\n\n * \n\nMinimum Bachelor's degree in software engineering, mathematical or science-based subject or equivalent working experience\n * \n\nExcellent communication skills in English, verbal and written\n * \n\nGreat collaboration skills\n * \n\nAt least 5 years' experience in a similar role\n * \n\nProficient in Typescript/Javascript\n * \n\nExperience with React or similar web framework\n * \n\nExperience in complex software systems with agile development methodologies\n\n \n\nDesired skills:\n\n * \n\nKnowledge in C++\n * \n\nKnowledge in Git, Jenkins, Jira, Artifactory\n * \n\nExperience with Node.js\n * \n\nExperience with Cuda\n * \n\nKnowledge of Kubernetes\n * \n\nExperience with DirectX11 and/or Vulcan\n * \n\nAviation interest\n\n \n\nAs a person, we would like you to be creative, self-driven and outgoing with a high motivation to solve problems and have a genuine interest in programming.\n\n \n\nWilling to take up the task that is most important for the team to progress.\n\nYou are passionate about learning new technology, acquire domain knowledge and are happy to share your knowledge with both customers and employees.\n\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.\n\n \n\nWhat will you be a part of\n\nBehind our innovations stand the people who make them possible. Brave pioneers and curious minds. Everyday heroes and inventive troubleshooters. Those who share deep knowledge and those who explore sky-high. And everyone in between. ​\n\n \n\nJoining us means making an impact together, contributing in our own unique ways. From crafting complex code and building impressive defence and security solutions to simply sharing a coffee with a colleague, every action counts. We encourage you to take on challenges, to create smart inventions and grow in our friendly and tech-savvy workspace. We have a solid mission to keep people and society safe.\n\n \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 25,500 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here",
    "url": "https://www.aplitrak.com/?adid=YW0uNzM5ODEuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
    "published": "2025-05-28T10:11:03",
    "deadline": "2025-06-25T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7393292682926829,
    "category": "IT"
  },
  {
    "id": "29758170",
    "title": "DevOps Engineer",
    "employer": "Visit Group International AB",
    "location": "Göteborg",
    "description": "Are you a problem-solver who thrives on improving systems, streamlining workflows, and building reliable infrastructure? We’re looking for a skilled DevOps Engineer to help shape the foundation of our platform. At Visit Group, you'll be part of a curious and collaborative team solving real-world problems for thousands of users in the travel and tourism industry. \nIf you're excited about building the backbone that powers seamless deployments and scalable platforms and want to work where experimentation is encouraged and success is shared, you’ll feel right at home. \nKey Responsibilities  As a DevOps Engineer, you’ll play a vital role in modernizing our platform infrastructure, accelerating developer workflows, and enhancing service reliability. You will: \n Design, maintain, and scale our hybrid cloud infrastructure (public/private). \n  Champion Infrastructure as Code and CI/CD using tools like Ansible and Terraform. \n  Operate and improve Kubernetes clusters for workload orchestration and scalability. \n  Build tools and frameworks to boost developer productivity and enable self-service deployments. \n  Collaborate closely with development teams to automate provisioning, configuration, and deployments. \n  Contribute to disaster recovery planning and high availability strategies. \n \n Your Profile \n 5+ years of experience \n  Experience working with Kubernetes for orchestration and scalability \n  Experience managing both Windows and Linux environments \n  Experience with virtualization technologies (e.g., VMware, Hyper-V) \n  Experience working with cloud technologies (Azure, AWS) \n  Experience with IaC (e.g Terraform) \n  Automation using Python, Bash, or PowerShell. \n  Experience working with networking, DNS, AD, certificates, and security best practices. \n  Experience working with both relational and non-relational databases, including SQL Server and MongoDB \n  Experience working with observability and monitoring (Grafana, Prometheus or similar). \n  Knowledge about message brokers (e.g., RabbitMQ, ServiceBus) would be advantageous \n  Are passionate about DevOps culture, automation, and making life easier for developers. \n  Enjoy knowledge sharing, experimenting, and learning by doing. \n \n Why Visit Group?  At Visit Group, we value a unique blend of professionalism, personality, and passion. We seek individuals who bring self-confidence, problem-solving skills, and an interest in sustainable development practices. Our office culture emphasizes collaboration, learning, and creating enjoyable experiences for our team and our clients. \nInterested? - We’d love to hear from you! Apply now and let’s build the future of payment technology together. \nAbout Visit Group  Visit Group is a leading European software provider specializing in technology solutions for the tourism industry. Founded in 1999 and headquartered in Gothenburg, Sweden, the company has grown to become a leader in the travel technology sector. We offer a comprehensive digital ecosystem that includes property management systems, booking systems, ticketing and e-commerce platforms, and travel switches for various segments of the tourism industry. Our product portfolio includes Citybreak, BookVisit, iTicket, VisBook, and WebX. \nWith over 20 years of experience, we serve more than 3,000 customers across 25 countries, including tourism organizations, accommodations, tours, and activity vendors worldwide. Our solutions enable inbound tourism businesses, such as hotels, ski resorts, tour operators, and destination marketing companies, to sell, combine, and distribute tourism products sourced from hundreds of external inventory platforms.",
    "url": "https://superstar.visitgroup.com/jobs/6027637-devops-engineer?promotion=1505352-arbetsformedlingen",
    "published": "2025-06-09T14:23:03",
    "deadline": "2025-11-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7393292682926829,
    "category": "IT"
  },
  {
    "id": "29742759",
    "title": "Software Developer",
    "employer": "Ericsson AB",
    "location": "Göteborg",
    "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:\nWe are now looking for a Software Developer to join our small and high performing cross-functional team, working with Session Management Function (SMF). The team is operating from our lively office at Lindholmen in Göteborg, with a stunning view of the Göta Älv river, where we blend technical expertise with a dedication to improve the world. Our facilities serve as an innovation hub, hosting tech days, hackathons and other events that foster creative approaches to address future challenges.\nWith our team you will get to work with cutting-edge technology and shape the future of telecom. We do research and development that includes AI, cloud and containerization as we advance 5G and look ahead to 6G. You’ll work in an agile environment, using methods and principles like Kanban and Scrum. We are focusing on early costumer and stakeholder feedback for our development process, which is based on Continuous Integration practices.\n\n\nWhat you will do:\n\nWith us you will accelerate your growth by solving complex challenges and broadening your skillset, alongside a fun and supporting team. You will be involved in designing, implementing and testing the feature, product and system from requirements for production and commercial deployment. As a part of your role, you will also learn to develop knowledge in using CI/CD (Continuous Integration/Development) flow and philosophy.\n\n\nThe skills you bring:\n\nAs you will be working with a multi-functional, self-organizing and highly independent team you need to be a curious person with the drive to research and learn new technologies to stay up to date with the latest trends. You have a passion for continuing to develop your knowledge and are proactive and always ready to seek out information, bring your ideas to the table and collaborate with Product Owners and others. \n\nWe will be looking for these qualifications:\n  *  BSc/ MSc level in Computer Science with communication, network and telecom focus.\n  *  0 - 3 years of related experience in SW development and architecture (we welcome university graduates who want to start their professional careers).\n  *  Exposure to object-oriented programming.\n  *  Open mindset, asking for help, sharing knowledge and a team-first approach.\n  *  Curiosity to understand customer needs and how to address them.\n  *  Interest in understanding the whole product and its environment.\nEffortless communication in English, written and spoken.\n\n\nHere are some technologies we use, and we value candidates who are eager to learn: C++ 20, Python, Gerrit / Git, Telecom (Packet Core), Kubernetes, TDD, Codeium, Scrum.\n\nWhat happens once you apply?\n\nClick Here to find all you need to know about what our typical hiring process looks like.\nWe truly believe that by collaborating with people with different experiences we drive innovation, which is essential for our future growth. We encourage people from all backgrounds to apply and realize their full potential as part of our Ericsson team.\nLast application: 13/6-2025",
    "url": "https://ericsson-ab.contactrh.com/jobs/9669/43425134",
    "published": "2025-06-02T09:25:03",
    "deadline": "2025-06-13T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7320121951219511,
    "category": "IT"
  },
  {
    "id": "29727183",
    "title": "Senior DevOps Engineer",
    "employer": "Explipro Group AB",
    "location": "Göteborg",
    "description": "We are looking for an experienced DevOps engineer who want to enhance security and performance through reliable and scalable solutions. \nYou will be working closely with architects and engineers to manage applications that deliver critical services across organizations.\nAbout You\nWe seek a customer-focused DevOps engineer with expertise in Elastic Stack and a strong background in cloud operations. You have solid Java skills, enjoy simplifying complex problems, and thrive in collaborative environments.\n\nRequirements:\n- 7+ years in implementing and managing modern CI/CD pipelines in AWS or Azure\n- Strong experience in Elastic Stack (Elasticsearch, Kibana etc)\n- Programming experience (Java, Python etc)\n- IAAC knowledge (Ansible, Terraform)\n- Modern tools for Monitoring and Orchestration (Docker, Kubernetes and Grafana etc)\n- Solid Linux experience \n- Fluent English skills, in both speech and writing\n \nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
    "url": "https://career.explipro.com/jobs/5753749-senior-devops-engineer?promotion=1484622-arbetsformedlingen",
    "published": "2025-05-23T14:48:03",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7320121951219511,
    "category": "IT"
  },
  {
    "id": "29527392",
    "title": "Fullstack Developer",
    "employer": "Danda AB",
    "location": "Göteborg",
    "description": "PlanIT is the next generation of Sparepart management planning for Automotive customer. The digital product is build on Azure with a frontend built on Neptune. What we need is a person to drive the transformation from Neptune into REACT. This is a long term assignment and we want the person to stay in our team to maintain the application. Primarily the front end but also contribute in the maintenance team in general.\n\nMain technical skills:\n React (including Hooks, Context API and component composition etc.)\n TypeScript\n State management solutions (like Redux or React Query)\n HTML5, CSS3 and modern styling techniques (ex. Styled Components)\n Understanding of RESTful APIs (or GraphQL)\n Unit and integration testing (React Testing Library, Jest, Playwright)\n \n\nMigration-Specific Skills\n Experience in rewriting legacy frontend systems to React\n Ability to analyze old codebases (Neptune in this case) and identify reusable logic\n Understanding of gradual migration strategies\n Refactoring skills to modernize UX/UI patterns during the migration\n Knowledge of performance optimizations in React during rewrites\n \n\nTools/Ecosystem:\n Build tools (ex. Vite)\n Linting, formatting and code quality tools (ESLint, Prettier)\n Git\n Design systems and component libraries (Storybook, MUI, etc.)\n Understanding of accessibility (a11y) best practices\n Experience with CI/CD pipelines (ex. Azure DevOps)\n Work is to be performed from office in Arendal - Göteborg",
    "url": "https://jobb.danda.se/jobs/5658763-fullstack-developer?promotion=1375561-arbetsformedlingen",
    "published": "2025-03-10T10:51:50",
    "deadline": "2025-08-27T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7295731707317072,
    "category": "IT"
  },
  {
    "id": "29734496",
    "title": "Backend Developer",
    "employer": "Icomera AB",
    "location": "Göteborg",
    "description": "Icomera is a leading global innovator in connectivity solutions within the transportation sector. We are at the forefront of transforming public transport, making it smarter, safer, greener, and more connected than ever before. At Icomera you work with products used by many users around the world, including passengers on some of the world's largest train and bus operators. \nAre you looking for a new challenge as a backend developer? Our ISS team is expanding!\nAbout the Role:\nAs a Backend Developer at Icomera you will be a part of a team that develops software for modern and advanced backend systems and web platforms, processing large amounts of data. The Integrated Software Solutions team focuses on developing the market leading platform for tracking and visualization of user data, giving valuable insight to customers all around the world. The product that you would be mainly working on is an innovative system for big data, and key to long-term company success.\nThe ISS team is a diverse group of people with the aim to develop a best-in-class experience for our customers. You would be joining a diverse and international group of professionals that currently are expanding – hop on the train and join in the fun!\nKey responsibilities:\n—    Write high-quality code with focus on performance and maintainability for modern web applicartions.\n—    Communicate with and support team members and other stakeholders within the business.\n—    Follow established development processes and related standards.\n—    Contribute to a positive working environment and help optimise performance of the team.\nRequirements: \n—    B.sc / M.sc degree, in computer science, engineering physics or equivalent.\n—    Minimum 3 years of experience in backend development using for example Python.\n—    Experience in building API’s and working with SQL databases\n—    Fluent in writing and speaking English \n—    Familiarity with Kubernetes, DevOps practices and Cloud services is considered meritorious but not critical\n—    Being able to speak Swedish is considered meritorious\nWho You Are:\nTo thrive in this role, you love working with people and you enjoy working in a constantly evolving international company. Collaborating with others comes naturally to you, and you enjoy working with different stakeholders in cross functional projects. Your code is going to be used by several of the worlds largest train operator companies – having a customer centric approach to your work is on the top of your agenda.\nOur Offer:\n—    The opportunity to work with cutting edge technology in a market leader where we design and build everything in-house—from hardware to software\n—    Health is important – we offer a comprehensive health benefit package to all employees\n—    Flexible work arrangements – work from our modern office space five minutes from Gothenburg Central station, or work from home for up to two days a week \n—    Electrical bike lease agreement via net salary deduction\n—    ITP Pension and collective bargaining agreement\n—    A social work environment if you desire one – board game nights, after works, seasonal parties… The list goes on! \nReady to be part of something exciting and make a real difference in the connected future of transport? We’d love to hear from you!\nApply via this link: Backend Developer\nThe process:\nWe will be reviewing applicants ongoing. Icomera welcomes candidates from all backgrounds, and we value a diverse and inclusive work environment. \nFor some position we might perform a more extensive background check. We carry out a reference check for all positions.\nIcomera is an employer with a collective agreement with TechSverige. If you have questions to our local union representatives, you may contact them at unionen@icomera.com or saco@icomera.com.\n About Icomera:\nIcomera is the world’s leading provider of integrated connectivity solutions for trains, trams, buses, and coaches, serving millions of passengers and tens of thousands of vehicles on a daily basis. The IcoCrew now consist of 300+ employees globally. Icomera is headquartered in Gothenburg, Sweden, with main offices in the United States, Canada, the United Kingdom, Germany, France, Ireland, and Italy.\nIcomera’s vision for green mobility within the public transport industry perfectly complements the wider mission of our parent company, Equans. As the global leader in multi-technical services with 74,000 employees working across 17 country hubs, Equans delivers customised solutions which connect, protect and energise territories, cities, buildings, industries and transport infrastructures, empowering their energy, industrial and digital transitions. Visit www.icomera.com for further information.",
    "url": "https://enfrench-equans.icims.com/jobs/72969/backend-developer/job?mode=view&mobile=false&width=768&height=500&bga=true&needsRedirect=false&jan1offset=60&jun1offset=120",
    "published": "2025-05-27T15:18:48",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7271341463414633,
    "category": "IT"
  },
  {
    "id": "29670257",
    "title": "Mjukvaruutvecklare med intresse för AI",
    "employer": "Karriärguiden Group Sweden AB",
    "location": "Göteborg",
    "description": "Vi söker för kunds räkning. För att ansöka till tjänsten, vänligen besök https://karriarguiden.se/sv/jobb/mjukvaruutvecklare-med-intresse-for-ai. Vi ser fram emot din ansökan!\n                        \nDärför är detta jobb för dig\n\nFör oss är det viktigt att du gillar programmering. De språk vi använder varierar från projekt till projekt, så vare sig du är en mästare på Java, Kotlin, C, C++, C# eller Python, tror vi att du har stora möjligheter hos oss.\n\nVi kan erbjuda uppdrag inhouse i våra egna lokaler där du blir en del av ett utvecklingsteam.\n\nDu kommer att arbeta inom affärsområdet Software och Cloud, där vi hjälper kunder att utveckla framtidssäkra, storskaliga dator- och mjukvarusystem – från inbyggda system och elektronik till datadrivna företagsapplikationer, AI och molnbaserade lösningar.\n\nArbetsuppgifter\n\nVi har i dagsläget ett stort antal uppdrag där vi arbetar både ute hos kund och i egna lokaler där vi levererar lösningar med fokus på slutanvändaren. Huvudsaklig kompetens ligger inom programmering, mjukvaruutveckling och arkitektur. Våra kunder finns inom branscher såsom fordon, medicinteknik, energi, industri och telekommunikation. Vi erbjuder dig personlig utveckling genom att få jobba i olika projekt, med olika kunder inom olika branscher och i olika språk. Så länge du har en hög ambitionsnivå kan Semcon ge dig de bästa förutsättningarna för att utvecklas.\n\nKvalifikationer\n\nDå Knightec Group är ett teknikföretag som utvecklar produkter i teknikens framkant tror vi att du har en avslutad akademisk ingenjörsexamen. Du har också några års erfarenhet av utvecklingsjobb efter avlagd examen från tidigare arbetsgivare. De flesta av våra kunder finns i Göteborg med omnejd, så därför behöver du goda kunskaper i både svenska och engelska.\n\nEn spännande resa med Knightec Group\n\nSemcon och Knightec har gått samman som Knightec Group. Tillsammans bildar vi Norra Europas ledande strategiska partner inom produkt- och digital tjänsteutveckling – hur häftigt är inte det?\n\nMed en unik kombination av tvärfunktionell expertis och en holistisk förståelse för affärer hjälper vi våra kunder att förverkliga sina strategier – från idé till färdig lösning. På Knightec Group finns kompetensen, attityden och drivkraften som krävs för att anta de mest utmanande och innovativa projekten.\n\nFör våra medarbetare innebär detta fantastiska möjligheter att vara med och forma framtiden genom meningsfulla projekt i teknikens absoluta framkant. Här får du inte bara utvecklas och växa, utan också bli en del av något större.\n\nLåter det som platsen för dig? Häng med på en spännande resa!\n\nPraktisk information\n\nDetta är en tillsvidareanställning med en provanställning på sex månader,placerad på vårt kontor i Göteborg, Lindholmsallén 2. Resor i tjänsten kan förekomma till våra kunder. Startdatum är så snart som möjligt eller enligt överenskommelse.\n\nSkicka in din ansökan så snart som möjligt, men senast 2025-06-30. Om du har några frågor om tjänsten är du välkommen att kontakta Albert Lindfors, Talent Acquisition Partner. Observera att vi, på grund av GDPR, endast tar emot ansökningar via vår karriärsida.\n\nVi ser fram emot att höra från dig!",
    "url": "https://karriarguiden.se/sv/jobb/mjukvaruutvecklare-med-intresse-for-ai",
    "published": "2025-04-30T14:45:09",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7271341463414633,
    "category": "IT"
  },
  {
    "id": "29709548",
    "title": "Android Automotive Software Developer",
    "employer": "AFRY AB",
    "location": "Göteborg",
    "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nWithin AFRY, we develop and deliver solutions for vehicles, systems, functions and attributes to customers in the automotive industry. Our customers are both established OEM's, startup companies and system suppliers (Tier 1). \nWe are now looking for experienced software developers who is passionate in developing the next generation infotainment system based on Google's Android automotive OS.\nAs an Android Automotive Software Developer, you will be doing Software development in application and native layers of Android stack for the infotainment system. You will collaborate with UX, Designers and other stakeholders to define a coherent end-to-end solution. You will be part of a team that has end-to-end responsibility including design, architecture, documentation, development, verification and validation. As part of organization you will have the opportunity to actively contribute for generating innovative ideas and solutions.\n\n\nQualifications\nM.Sc in Software Engineering or equivalent experience through years of practice\nExperience of Android app and Android platform development along with experience in AOSP and the AOSP build system.\nFamiliar with modern app architectural patterns (MVP, MVVM, layered architecture, refactoring)\nExperience in Automotive communication buses\nGood knowledge in Android Java, C++, Python\nGood knowledge of Android testing frameworks (Junit, Espresso, Mockito)\nVery good knowledge of English (written and spoken) \n\nMeritorious if you have:   \nExperience of Embedded Linux Development\nExperience of working with CI (Continuous Integration)\nSwedish driving license (B) \n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 6/7.\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
    "url": "https://jobs.smartrecruiters.com/AFRY/744000059723644-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
    "published": "2025-05-16T14:32:23",
    "deadline": "2025-06-15T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7246951219512194,
    "category": "IT"
  },
  {
    "id": "29733800",
    "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
    "employer": "Syntronic AB",
    "location": "Göteborg",
    "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Det tar en minut att ansöka och vi tar kontakt med dig inom två... eller så snart vi kan!\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\n”Storslaget! Ett riktigt bra gäng!” Så svarade en medarbetare som blev ombedd att beskriva Syntronic. Hos oss blir du en del av en härlig gemenskap. Du arbetar med spännande projekt tillsammans med kollegor som delar dina intressen. Här har du stora möjligheter att växa i den riktning som du själv önskar.\nVi beskrivs ofta som en platt organisation som har högt i tak. Här kommer din röst att höras och dina idéer att lyssnas på. Vi vet att livet består av mer än jobb och värnar om att du ska ha en bra balans mellan arbete och fritid. Därför erbjuder vi flextid och frihet under ansvar. Vi gör också roliga saker tillsammans efter arbetsdagens slut – allt från olika sportaktiviteter till afterwork-event mm.\nDen del av livet som består av jobb tycker vi ska vara rolig, spännande och utvecklande. Du erbjuds regelbundna karriärutvecklingssamtal och är välkommen att delta i våra interna workshops. För att du ska må så bra som möjligt ger vi dig ett fördelaktigt paket med förmåner och försäkringar.\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 25 juni.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
    "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1488777-arbetsformedlingen",
    "published": "2025-05-27T13:17:43",
    "deadline": "2025-06-25T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7246951219512194,
    "category": "IT"
  },
  {
    "id": "29736315",
    "title": "Frontend developer",
    "employer": "Icomera AB",
    "location": "Göteborg",
    "description": "Icomera is a leading global innovator in connectivity solutions within the transportation sector. We are at the forefront of transforming public transport, making it smarter, safer, greener, and more connected than ever before. At Icomera you work with products used by many users around the world, including passengers on some of the world's largest train and bus operators. \nAre you looking for a new challenge as a frontend developer? Our ISS team is expanding!\nAbout the Role:\nAs a Frontend Developer at Icomera you will be a part of a team that develops software for modern and advanced systems and web platforms, processing large amounts of data. The Integrated Software Solutions team focuses on developing the market leading platform for tracking and visualization of user data, giving valuable insight to customers all around the world. The product that you would be mainly working on is an innovative system for big data, and key to long-term company success.\nThe ISS team is a diverse group of people with the aim to develop a best-in-class experience for our customers. You would be joining a diverse and international group of professionals that currently are expanding – hop on the train and join in the fun!\nKey responsibilities:\n—    Write high-quality code with focus on performance and maintainability for modern web applicartions.\n—    Communicate with and support team members and other stakeholders within the business.\n—    Follow established development processes and related standards.\n—    Contribute to a positive working environment and help optimise performance of the team.\nRequirements: \n—    B.sc / M.sc degree in computer science or equivalent, alternatively an applicable YH-education or similar\n—    Minimum 3 years of experience in frontend development using for example Javascript and React.\n—    Experience in working with Figma\n—    Experience with frontend testing tools is considered meritorious\n—    Fluent in writing and speaking English \n—    Being able to speak Swedish is considered meritorious\n Who You Are:\nTo thrive in this role, you love working with people and you enjoy working in a constantly evolving international company. Collaborating with others comes naturally to you, and you enjoy working with different stakeholders in cross functional projects. Your code is going to be used by several of the worlds largest train operator companies – having a customer centric approach to your work is on the top of your agenda.\n Our Offer:\n—    The opportunity to work with cutting edge technology in a market leader where we design and build everything in-house—from hardware to software\n—    Health is important – we offer a comprehensive health benefit package to all employees\n—    Flexible work arrangements – work from our modern office space five minutes from Gothenburg Central station, or work from home for up to two days a week \n—    Electrical bike lease agreement via net salary deduction\n—    ITP Pension and collective bargaining agreement\n—    A social work environment – board game nights, after works, seasonal parties… The list goes on!\n Ready to be part of something exciting and make a real difference in the connected future of transport? We’d love to hear from you!\nThe process:\nWe will be reviewing applicants ongoing. Icomera welcomes candidates from all backgrounds, and we value a diverse and inclusive work environment. \nFor some position we might perform a more extensive background check. We carry out a reference check for all positions.\nIcomera is an employer with a collective agreement with TechSverige. If you have questions to our local union representatives, you may contact them at unionen@icomera.com or saco@icomera.com.\n About Icomera:\nIcomera is the world’s leading provider of integrated connectivity solutions for trains, trams, buses, and coaches, serving millions of passengers and tens of thousands of vehicles on a daily basis. The IcoCrew now consist of 300+ employees globally. Icomera is headquartered in Gothenburg, Sweden, with main offices in the United States, Canada, the United Kingdom, Germany, France, Ireland, and Italy.\nIcomera’s vision for green mobility within the public transport industry perfectly complements the wider mission of our parent company, Equans. As the global leader in multi-technical services with 74,000 employees working across 17 country hubs, Equans delivers customised solutions which connect, protect and energise territories, cities, buildings, industries and transport infrastructures, empowering their energy, industrial and digital transitions. Visit www.icomera.com for further information.",
    "url": "https://enfrench-equans.icims.com/jobs/72978/frontend-developer/job?mode=view",
    "published": "2025-05-28T10:20:38",
    "deadline": "2025-06-15T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7246951219512194,
    "category": "IT"
  },
  {
    "id": "29538714",
    "title": "Senior Mjukvaruutvecklare",
    "employer": "Professional Galaxy AB",
    "location": "Göteborg",
    "description": "Du kommer att ingå i ett utvecklingsteam som arbetar med forskning och utveckling av testutrustning, testmetodik och testmiljöer. Syftet är att möjliggöra avancerade tester av automatiserade och uppkopplade fordon för att säkerställa en trygg och hållbar trafikmiljö i framtiden.\nDu förväntas ha en god samarbetsförmåga, vara ansvarstagande och ha en analytisk förmåga med intresse för att sätta dig in i olika forskningsfrågor.\nObligatoriska krav: MSc. inom elektro, mekatronik eller motsvarande.\n \nErfarenhet:\n Minst 5 års erfarenhet som mjukvaruutvecklare i industrin.\n \nProgrammeringskunskaper:\n Goda kunskaper i C++ och Python.\n \nLinux-kunskaper:\n Van att arbeta med olika varianter av Linux-distributioner.\n \nB-körkort:\n Svenskt B-körkort.\n \nSpråkkunskaper:\n Behärska både svenska och engelska i tal och skrift.\n Mervärden (önskvärda kvalifikationer): Kunskaper i MatLab.\n Erfarenhet av sensorfusion och sensorutveckling.\n Erfarenhet av CARLA eller Unreal Engine är meriterande.\n Dokumentation: CV med kompetensbeskrivning.\n Beskrivning av genomförda uppdrag.\n Uppdragsperiod:\n20250407 - 20260406 , 1 år med möjlighet till förlängning om 3 år.\nPlacering:Uppdraget är placerat i Göteborg med en del arbete på en testbana utanför Borås.",
    "url": "https://careers.progalaxy.se/jobs/5674587-senior-mjukvaruutvecklare?promotion=1381054-arbetsformedlingen",
    "published": "2025-03-12T18:39:32",
    "deadline": "2025-08-29T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7222560975609755,
    "category": "IT"
  },
  {
    "id": "29608970",
    "title": "Senior Network Engineer",
    "employer": "Danda AB",
    "location": "Göteborg",
    "description": "Automotive customer develops and produces world-class hybrid engines and transmissions. With factories on two continents - Sweden and China - we're a pioneering global supplier of propulsion technology, development services and contract manufacturing. The brand brings together over 9,000 dedicated and determined people that design, develop, and manufacture next-generation powertrain solutions for a global market.\nCustomer is part of HORSE Powertrain Limited, a global leader in powertrain solutions. The Group has 19,000 employees, 17 plants and 5 R&D centers across three continents. We partner with OEM customers around the world and offer innovative solutions that can cater to up to 80% of the growing hybrid and combustion powertrain market, enabling a faster transition toward cleaner mobility.\n \nAt Customer, we are committed to diversity and inclusion. We welcome applicants from all backgrounds and believe that different perspectives and experiences make for a stronger, more innovative company.\n\nAssignment description\nFor Customer We are seeking highly skilled Senior Network Engineers to join the Global Team responsible for designing, implementing, and managing the organization’s network infrastructure. As part of this collaborative and dynamic team, you will contribute to ensuring the security, reliability, and performance of both wired and wireless network systems.\nAdditionally, you will play a critical role in optimizing solutions such as Cisco ISE, Catalyst Center, and PRTG, leveraging your expertise with these tools - or equivalent technologies - to drive operational excellence. There is a rotating on-call schedule which is required in this position.\n\n\nRequired skills:\n Bachelor's degree in Computer Science, Information Technology, or a related field.\n Professional certifications such as CCNA, CCNP, or their equivalent.\n Proficiency in network protocols and technologies—especially 802.1X.\n Hands-on monitoring and automation experience.\n Solid experience managing firewalls (e.g., Fortigate, Palo Alto).\n In-depth knowledge of technologies like SD-WAN and MPLS.\n \n\nDesired skills:\n Comprehensive understanding of network security principles and best practices.\n Proficiency with network monitoring and management tools.\n Solid experience in wireless networking technologies, including:\n 802.11 standards\n WiFi security protocols (e.g., WPA2, WPA3)\n WiFi deployment best practices\n Hands on experience with Infrastructure as Code e.g., Terraform\n Experience with Software-Defined Networking (SDN)",
    "url": "https://jobb.danda.se/jobs/5780193-senior-network-engineer?promotion=1416958-arbetsformedlingen",
    "published": "2025-04-07T10:49:46",
    "deadline": "2025-09-24T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.7149390243902438,
    "category": "IT"
  },
  {
    "id": "29670255",
    "title": "CI/CD Data Platform Developer",
    "employer": "Karriärguiden Group Sweden AB",
    "location": "Göteborg",
    "description": "Vi söker för kunds räkning. För att ansöka till tjänsten, vänligen besök https://karriarguiden.se/sv/jobb/cicd-data-platform-developer. Vi ser fram emot din ansökan!\n                        \nDärför är detta jobb för dig\n\nPå Knightec Group är vi övertygade om att digitala lösningar har möjligheten att göra vår framtid ännu bättre. Det är när vi lyfter blicken, ser på problemen från ett annat håll och tillför nya perspektiv som vi kan skapa den förändring som krävs. Vi hjälper våra kunder med just de nya perspektiv som behövs och vi utgår alltid ifrån slutanvändarens behov och beteenden när vi utvecklar produkter och tjänster.\n\nDu kommer att arbeta inom affärsområdet Software och Cloud, där vi hjälper kunder att utveckla framtidssäkra, storskaliga dator- och mjukvarusystem – från inbyggda system och elektronik till datadrivna företagsapplikationer, AI och molnbaserade lösningar.\n\nArbetsuppgifter\n\nVi jobbar med fokus på device-to-cloud lösningar för kunder i en mängd olika domäner som industri, medicin, fordon och försvar och söker nu en driven mjukvaruutvecklare med intresse för CI/CD data platform och som har industrierfarenhet och en stor kunskapsbank att dela med sig av. För oss är det viktigt att du gillar programmering. De språk vi använder varierar från projekt till projekt, så vare sig du är en mästare i Python, C, C++, Rust eller C# tror vi att du har stora möjligheter hos oss. Vi kan erbjuda uppdrag inhouse i våra egna lokaler där du blir en del av ett utvecklingsteam alternativt ute hos kund.\n\nKvalifikationer\n\nVi söker efter skickliga mjukvaruutvecklare som har en utbildning på universitetsnivå inom en relevant ingenjörsdisciplin med intresse för CI/CD och mjukvara i stort och gillar utmaningar.:\n• Akademisk examen inom data, elektroteknik eller motsvarande.\n• Flera års erfarenhet av mjukvaruutveckling.\n• Flytande kunskaper i engelska och svenska, i tal och skrift.\n\nVi tror också att det är en stor fördel om du har erfarenhet inom ett antal av nedan områden:\n• Scalable CI/CD data pipeline development(Git, Gerrit, Jenkins, Zuul, Basel etc.)\n• Data Warehouse / Lake / Lakehouse concepts\n• ETL (Extract, Transform, Load) process\n• Data platform tools (Snowflake, Databricks)\n• Relational Databases (SQL etc)\n• IaC (Infrastructure as Code)\n• Real time analytics\n• Power BI, Tableau\n• AWS and Azure cloud platforms\n• Python\n• C/C++\n• Software testing /test automation (Robot framework, Google test etc)\n• Erfarenhet av AI i kod och testmiljö\n\nNågra av våra uppdrag omfattas av försvarssekretess och beroende på uppdrag kan du behöva ha svenskt medborgarskap samt genomgå och godkännas i en säkerhetsprövning.\n\nEn spännande resa med Knightec Group\n\nSemcon och Knightec har gått samman som Knightec Group. Tillsammans bildar vi Norra Europas ledande strategiska partner inom produkt- och digital tjänsteutveckling – hur häftigt är inte det?\n\nMed en unik kombination av tvärfunktionell expertis och en holistisk förståelse för affärer hjälper vi våra kunder att förverkliga sina strategier – från idé till färdig lösning. På Knightec Group finns kompetensen, attityden och drivkraften som krävs för att anta de mest utmanande och innovativa projekten.\n\nFör våra medarbetare innebär detta fantastiska möjligheter att vara med och forma framtiden genom meningsfulla projekt i teknikens absoluta framkant. Här får du inte bara utvecklas och växa, utan också bli en del av något större.\n\nLåter det som platsen för dig? Häng med på en spännande resa!\n\nPraktisk information\n\nDetta är en tillsvidareanställning med en provanställning på sex månader, placerad på vårt kontor i Göteborg, Lindholmsallén 2. Resor i tjänsten kan förekomma till våra kunder. Startdatum är så snart som möjligt eller enligt överenskommelse.\n\nSkicka in din ansökan så snart som möjligt, men senast 2025-06-30. Om du har några frågor om tjänsten är du välkommen att kontakta Albert Lindfors, Talent Acquisition Partner. Observera att vi, på grund av GDPR, endast tar emot ansökningar via vår karriärsida.\n\nVi ser fram emot att höra från dig!",
    "url": "https://karriarguiden.se/sv/jobb/cicd-data-platform-developer",
    "published": "2025-04-30T14:45:07",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6692073170731707,
    "category": "IT"
  },
  {
    "id": "29744036",
    "title": "System/Performance Test Engineer at Appgate",
    "employer": "Software Skills International AB",
    "location": "Göteborg",
    "description": "Are you a Test Engineer with an interest in cyber security? Software Skills is recruiting on behalf of our client, Appgate, for skilled developers to join their growing team in Gothenburg. \nAbout the role \nAs a System / Performance Test Engineer at Appgate, you will be part of a creative, cross-functional team in cybersecurity and play a critical role in ensuring the high performance, scalability and reliability of Appgate SDP solutions.  \nTheir Gothenburg office serves as the innovation center for the SDP product - a security solution that is transforming network access for organisations worldwide. With a rapidly growing international presence, Appgate currently employs around 450 people, including 160 software engineers from over ten different countries. \nWhy join Appgate? \nWork in a cutting-edge field with the latest technologies.  \nBe part of a collaborative and innovative team. \nEnjoy a high degree of autonomy and creative freedom within an agile and open environment. \nCompetence development. \nFun colleagues and many activities. \nStable work / life balance. \nHybrid workplace. \nWork in a brand-new office in the heart of Gothenburg. \n\nResponsibilities \nThe role includes designing, implementing and running performance tests to validate the resilience of Appgate’s Zero Trust Network Access (ZTNA) solutions across cloud, hybrid, and on-premises environments: \nDevelop and execute detailed performance testing plans and strategies for Appgate SDP components, including Controllers, Gateways and Connectors to ensure they meet or exceed predefined performance benchmarks. \nUse various testing tools and methodologies to simulate real-world scenarios, measure system throughput, latency and resource utilisation and identify bottlenecks. \nCollaborate with development teams to understand system architecture and design, and to provide feedback on performance issues and optimization opportunities. \nAnalyse test results, generate performance reports and work closely with engineers to troubleshoot and resolve identified issues. \nStay up to date with new technologies and testing tools that can enhance the performance testing process. \n\nYour profile \nWe are looking for engineers who are passionate about software development and cybersecurity. Ideal candidates will have: \nBachelor’s degree in Computer Science, Engineering or related field. \n3+ years of work experience in performance testing/engineering, preferably with a focus on cloud-based and distributed systems. \nStrong understanding of networking concepts and protocols and experience with network performance testing tools. \nProficiency in performance testing tools and frameworks. \nExperience with cloud platforms (e.g., AWS, Azure, Google Cloud) and understanding of cloud architecture. \nKnowledge of virtualisation platforms and containerisation technologies.  \nPython programming skills. \nExcellent analytical, problem-solving and communication skills \nProficient in English, both written and spoken \n\nBonus qualifications \nFamiliarity with Appgate SDP or similar Zero Trust Network Access (ZTNA) solutions. \nProficiency in Golang and/or C programming languages is a strong plus. \nUnderstanding of security best practices and secure coding techniques. \n\nAbout Appgate \nAppgate is a global cybersecurity company providing solutions for secure network access. Their flagship product, Appgate SDP, is an identity-centric access control solution that surpasses traditional security approaches by providing “a software-defined perimeter” that increases resilience, simplifies management complexity and reduces cost. It is currently deployed by over 100 customers, including Fortune 100 companies and governments. \nHow to apply \nDoes this sound like the right role for you? Please follow the link and press the Apply button at the top right corner of the page. Any questions about the position? Contact our recruiter Ingelin Glimstedt at ingelin.glimstedt@softwareskills.se for more information. We consider candidates on a rolling basis, which means the role might be filled before the application deadline.",
    "url": "https://softwareskills.se/jobs/67d96387305872019d066866?source=af",
    "published": "2025-06-02T13:11:33",
    "deadline": "2025-07-02T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6570121951219512,
    "category": "IT"
  },
  {
    "id": "29748451",
    "title": "Senior Software Engineer",
    "employer": "Qliktech International AB",
    "location": "Göteborg",
    "description": "What makes us Qlik?\nA Gartner® Magic Quadrant™ Leader for 15 years in a row, Qlik transforms complex data landscapes into actionable insights, driving strategic business outcomes. Serving over 40,000 global customers, our portfolio leverages pervasive data quality and advanced AI/ML capabilities that lead to better decisions, faster.\nWe excel in integration and governance solutions that work with diverse data sources, and our real-time analytics uncover hidden patterns, empowering teams to address complex challenges and seize new opportunities.\nThe Senior Software Engineer  \nJoin Qlik as a Senior Software Engineer and be at the forefront of shaping the future of AI in the data and analytics field. Contribute to developing innovative AI products, solving complex challenges, and pioneering the responsible and ethical implementation of AI.   \nWhat makes this role interesting? \nDiverse Use Cases: Design, develop, and maintain software systems that support a variety of AI applications, such as predictive, generative, and classification tasks.\nCollaborative Innovation: Work closely with AI engineers and software developers to build scalable solutions for AI-driven products. While your primary focus will be software development, you’ll have the opportunity to contribute to AI-related work and innovations as part of the team.\nEnd-to-End Ownership: Take full responsibility for the development, deployment, and monitoring of microservices. Ensure performance, reliability, and the real-world impact of the solutions you create for large global customers.\nMulticultural Environment: Join a diverse, dynamic team that fosters creativity, collaboration, and open communication.\nHere’s how you’ll be making an impact: \n• Collaborative Partnership: Work closely with colleagues across Development, Architecture, Data Science, Site Reliability Engineering (SRE), and Product Management throughout the software development lifecycle. Contribute to the analysis, design, and implementation of AI-powered tools and services.\n• Shaping Technology: Help define the architecture and infrastructure of AI-driven products by evaluating and implementing technologies that enhance scalability, maintainability, and reliability. Rapidly prototype and assess ideas to explore feasibility and drive innovation.\n• Software Development: Design, implement, test, troubleshoot, and debug software. Play an active role in defining and implementing test strategies with your team.\n• Best Practices & Quality: Drive high standards in performance, security, automation, and CI/CD to ensure robust and maintainable solutions.\nWe’re looking for a teammate with: \n• Education: Degree in Computer Science, Software Engineering, or a related field.\n• Experience: 7+ years in software development with a proven track record of delivering impactful solutions.\n• Programming Skills: Proficiency in Go, TypeScript, or Python, with the ability to adapt to new technologies.\n• Software Architecture: Experience with microservice development, writing clean, well-documented, and tested code.\n• Cloud & Infrastructure: Familiarity with cloud-native environments, container orchestration, and monitoring frameworks.\nThe location for this role is: \nGothenburg, Sweden   \n More about Qlik and who we are: \nFind out more about life at Qlik on social: Instagram, LinkedIn, YouTube, and X/Twitter, and to see all other opportunities to join us + our values, check out our Careers Page.\nWhat else do we offer?\nGenuine career progression pathways and mentoring programs\nCulture of innovation, technology, collaboration, and openness\nFlexible, diverse, and international work environment\n\n\n\nGiving back is a huge part of our culture. Alongside an extra “change the world” day plus another for personal development, we also highly encourage participation in our Corporate Responsibility Employee Programs \nQlik is an Equal Opportunity/Affirmative ActionEmployer, and we value the diversity of our workforce. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Click here to review the US Department of Labor’s Equal Employment Opportunity Posters, including the EEO is The Law notice and the Pay TransparencyNondiscrimination Provision.\nIf you need assistance due to disability during the application and/or recruiting process, please contact us via theAccessibility Request Form.\nQlik is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Qlik via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Qlik. No fee will be paid in the event the candidate is hired by Qlik as a result of the referral or through other means.",
    "url": "https://jobs.jobvite.com/qlik/job/oHdEvfwN",
    "published": "2025-06-05T10:26:08",
    "deadline": "2025-06-16T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6545731707317073,
    "category": "IT"
  },
  {
    "id": "29741322",
    "title": "SOFTWARE ENGINEER",
    "employer": "SPEEDY TYRES SWEDEN AB",
    "location": "Göteborg",
    "description": "Key Responsibilities:\nDevelop, test, and maintain Android applications for smartphones and tablets.\nCollaborate with product managers, designers, and backend developers to deliver new features.\nWrite clean, maintainable, and efficient code following best practices.\nOptimize applications for maximum performance and scalability.\nFix bugs and improve application performance based on user feedback and analytics.\nParticipate in code reviews and contribute to the team’s coding standards.\nStay up-to-date with the latest Android development trends, tools, and technologies.\nWork with RESTful APIs and third-party libraries/integrations.\nRequired Skills and Qualifications:\nBachelor’s degree in Computer Science, Engineering, or related field (or equivalent experience).\nProven experience in Android app development using Java and/or Kotlin.\nFamiliarity with Android SDK, Android Studio, and build tools (Gradle).\nExperience with REST APIs and JSON parsing.\nUnderstanding of mobile UI/UX best practices.\nKnowledge of offline storage, threading, and performance tuning.\nFamiliarity with version control tools like Git.\nExperience with testing frameworks (JUnit, Espresso).\nGood problem-solving and communication skills.\nExperience with Xcode, iOS SDK, and Apple Human Interface Guidelines.\nFamiliarity with RESTful APIs, JSON, and network programming.\nKnowledge of Core Data, SQLite, or other local data storage solutions.\nExperience with Git or other version control systems.",
    "url": null,
    "published": "2025-05-30T15:23:23",
    "deadline": "2025-07-31T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6545731707317073,
    "category": "IT"
  },
  {
    "id": "29522482",
    "title": "Network & Datacenter Engineer",
    "employer": "Consilium Safety Group AB",
    "location": "Göteborg",
    "description": "About Consilium Safety Group Consilium Safety Group is a global leader in fire, flame, and gas safety solutions for marine, energy, rolling stock, and buildings. With over 55 offices worldwide and 1,000 employees, we combine innovation with intelligent detection to protect lives, values, and the planet.\nAbout Consilium Digital Core Our mission is to build a secure, cloud-driven IT organization that supports our global operations. The Digital Core team drives cloud-first strategies, automation, and AI-powered operations, ensuring a scalable and secure digital infrastructure.\nThe Role Network & Datacenter Engineer Join our Platform Team and play a key role in managing our global datacenter, network, and Azure cloud environment. You'll ensure optimal performance, security, and connectivity across our infrastructure.\nYour Key Responsibilities\n Design, implement, and maintain global network infrastructure (LAN, WAN, SD-WAN, VPN, wireless).\n Configure and troubleshoot enterprise networking equipment (Cisco, Juniper, Fortinet, Palo Alto).\n Oversee firewalls, IDS/IPS, VPN solutions, and Azure networking (VNet, ExpressRoute, NSG, Load Balancers).\n Manage datacenter infrastructure, virtualization (Hyper-V, VMware, Azure Stack HCI), and cloud migration.\n Automate provisioning using Terraform, Bicep, and PowerShell.\n Monitor network and cloud performance using Azure Monitor and AI-driven analytics.\n Collaborate with Cloud Architects, Security Engineers, and DevOps teams.\n \nWhat You Bring\n 5+ years in network engineering, cloud networking, and datacenter operations.\n Proficiency in network protocols (TCP/IP, BGP, OSPF, VLAN, VXLAN, MPLS).\n Expertise in Azure networking and security best practices.\n Experience with automation tools (Terraform, Bicep, PowerShell).\n Understanding of Zero Trust Security principles.\n \nBonus Certifications (Not Required)\n Azure Network Engineer Associate, Cisco CCNP/CCIE, Fortinet NSE4, Palo Alto PCNSE, VMware VCP.\n \nWhy Join Us?\n  Strategic Impact – Drive cloud adoption and network transformation.\n  Hybrid/Remote Work – Enjoy flexibility.\n  Career Growth – Access training, certifications, and development opportunities.\n  Tech Leadership – Work with AI-driven automation and security-first architectures.\n  Competitive Package – Strong salary, benefits, and incentives.\n \nApply Now \nIf this sounds like the opportunity you’ve been waiting for, we’d love to hear from you. Apply today and take the first step in joining a team that’s committed to making a difference. Applications are reviewed on a rolling basis, so don’t delay—your next adventure awaits!\nReady to learn more about our journey? Click to hear from our CEO!\nPhilip Isell Lind af Hageby, Consilium, en mästare på turnarounds - Värdeskaparna | En podd om riskkapital av OPX Partners | Podcast on Spotify",
    "url": "https://careers.consiliumsafety.com/jobs/5645903-network-datacenter-engineer?promotion=1371523-arbetsformedlingen",
    "published": "2025-03-06T14:26:38",
    "deadline": "2025-08-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6521341463414634,
    "category": "IT"
  },
  {
    "id": "29372954",
    "title": "Senior Cloud Developer - Fullstack (.Net, C#, React, AWS)",
    "employer": "Professional Galaxy AB",
    "location": "Göteborg",
    "description": "Assignment description\nFor our client we are looking for a SeniorCloud Developer.Our client is delivering the complete charging experience and solutions to make life easier for electric vehicle owners. They are at the forefront of optimizing distributed energy resources and smart devices through advanced algorithms, forecasting, and innovative management strategies. These teams also develop APIs for the partners and connect hardware such as wallboxes and home batteries to the cloud, enabling integration and management of energy resources. The mission is to enhance energy efficiency at multiple levels—ranging from individual homes to local grids, and up to the national grid—ultimately benefiting customers, the energy system, and the planet.\nWhat will you do?\nAs a cloud developer with a focus on device integration and cloud infrastructure management, you will play a key role in contributing to the future of the energy ecosystem. There are five collaborative teams, each offering a creative, self-organizing environment where your tasks will align with your skills and experience.\nFour of their teams focus on backend development, working on optimizing charging sessions, building backends for wallboxes and home batteries, aggregating vehicle fleets, and creating third-party APIs, while the fifth team—your prospective team—specializes in full-stack development, focusing on web portals and support tools that simplify issue identification and resolution, such as tools for customer care agents and wallbox installers.\nIn this role, they encourage you to take ownership of your work while maintaining clear communication and contributing to a supportive team environment. Whether working on backend solutions or full-stack projects, you’ll have the chance to grow and learn as part of a company making strides in the evolving energy landscape.\nDo you fit the profile?\nYou are an experienced cloud developer with expertise in .NET, C#, AWS, Kubernetes, MongoDB, Terraform, Grafana, Kafka, React, Remix, Tailwind, GraphQL and related technologies. You have a proven history of integrating complex systems in cloud environments, with strong skills in AWS management, DevOps practices, and optimizing system performance. Familiarity with cloud security in distributed systems is important, along with experience in event-driven architecture and using Infrastructure as Code (IaC) to automate and manage cloud infrastructure.\nOur client values experience in energy systems, and a general understanding of vehicle technology is a bonus. You are passionate about sustainability, have a strong analytical mindset, and work in an organized, structured way. Driven by curiosity, you continuously seek improvement, challenge the status quo, and explore new technologies. You communicate well, thrive in collaborative, fast-paced environments, and embrace working in diverse teams.\nYou have over 4 years of experience and a bachelor’s degree (or equivalent knowledge). A driver’s license (level B) is helpful but not required.\nWe offer continuously. That means that we sometimes remove the assignments before deadline. If you are interested we recommend that you apply immediately.\nPlease note! All CV’s must be in English.\nRequired skills:IAC, Devops, GraphQL, Kafka, Terraform, C#, Grafana, MongoDB, React, Cloud Security, AWS, Kubernetes, cloud infrastructure management, .Net\nPreferred skills:Driver’s license B\nLanguages: English (Proficient)Location: Gothenburg (SE)\nRemote: 25%\nAssignment period:20 Jan 2025- 31 Dec 2025\nApplication deadline:14 Jan 2025",
    "url": "https://careers.progalaxy.se/jobs/5419478-senior-cloud-developer-fullstack-net-c-react-aws?promotion=1294776-arbetsformedlingen",
    "published": "2025-01-10T15:47:13",
    "deadline": "2025-06-29T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.651219512195122,
    "category": "IT"
  },
  {
    "id": "29670256",
    "title": "Senior Embedded Software Engineer",
    "employer": "Karriärguiden Group Sweden AB",
    "location": "Göteborg",
    "description": "Vi söker för kunds räkning. För att ansöka till tjänsten, vänligen besök https://karriarguiden.se/sv/jobb/senior-embedded-software-engineer-1. Vi ser fram emot din ansökan!\n                        \nDärför är detta jobb för dig\n\nSemcon och Knightec Group är med och utvecklar den nya generationen av inbyggda system. Detta kommer med outforskade utmaningar men också med enorma möjligheter att vara med och skapa nytt inom elektrifiering, försvarsindustrin och med-tech.\n\nVi söker dig som vill utvecklas och växa tillsammans med oss och som vill hjälpa oss att lyfta vår kund till nästa nivå och skapa enastående produkter.\n\nDu kommer att arbeta inom affärsområdet Software och Cloud, där vi hjälper kunder att utveckla framtidssäkra, storskaliga dator- och mjukvarusystem – från inbyggda system och elektronik till datadrivna företagsapplikationer, AI och molnbaserade lösningar.\n\nArbetsuppgifter\n\nVi söker en skicklig embedded mjukvaruutvecklare som har industrierfarenhet och en stor kunskapsbank att dela med sig av. Du kommer vara en del av ett team som med sin utveckling gör skillnad för hundratusentals människor varje dag! Du kommer att jobba både nära dina kollegor och även samarbeta med större projektteam.\n\nKvalifikationer:\n• Är embedded mjukvaruutvecklare, med goda kunskaper inom C, C++, Python.\n• Erfarenhet av arbete inom ex försvarsindustri, elektrifiering eller med-tech är meriterande.\n• Har erfarenhet av mjukvarukravarbete, automatiska tester, CI/CD och gärna erfarenhet av ASPICE eller liknande standarder och guidelines från andra industrier.\n• Har kvalité och dokumentation som självklara delar av din ”definition of done”.\n• Trivs att jobba med projekt där du kan experimentera och prova något nytt.\n• Du finner det självklart för dig att samarbeta med dina teammedlemmar och är van att jobba i cross-functional agile teams.\n\nEn spännande resa med Knightec Group\n\nSemcon och Knightec har gått samman som Knightec Group. Tillsammans bildar vi Norra Europas ledande strategiska partner inom produkt- och digital tjänsteutveckling – hur häftigt är inte det?\n\nMed en unik kombination av tvärfunktionell expertis och en holistisk förståelse för affärer hjälper vi våra kunder att förverkliga sina strategier – från idé till färdig lösning. På Knightec Group finns kompetensen, attityden och drivkraften som krävs för att anta de mest utmanande och innovativa projekten.\n\nFör våra medarbetare innebär detta fantastiska möjligheter att vara med och forma framtiden genom meningsfulla projekt i teknikens absoluta framkant. Här får du inte bara utvecklas och växa, utan också bli en del av något större.\n\nLåter det som platsen för dig? Häng med på en spännande resa!\n\nPraktisk information\n\nDetta är en tillsvidareanställning med en provanställning på sex månader,placerad på vårt kontor i Göteborg, Lindholmsallén 2. Resor i tjänsten kan förekomma till våra kunder. Startdatum är så snart som möjligt eller enligt överenskommelse.\n\nSkicka in din ansökan så snart som möjligt, men senast 2025-06-30. Om du har några frågor om tjänsten är du välkommen att kontakta Albert Lindfors, Talent Acquisition Partner. Observera att vi, på grund av GDPR, endast tar emot ansökningar via vår karriärsida.\n\nVi ser fram emot att höra från dig!",
    "url": "https://karriarguiden.se/sv/jobb/senior-embedded-software-engineer-1",
    "published": "2025-04-30T14:45:08",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6496951219512195,
    "category": "IT"
  },
  {
    "id": "29758108",
    "title": "Software Architect,  Giraffe 1x Command and Control",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "description": "Saab is a place where teamwork makes things fly. Literally. Join us and experience our supportive and friendly workplace.\n\n \n\nYour role\n\nGiraffe 1X - Command and Control is growing and we need to strengthen our team of software architects. You will have a central and vital role in defining and designing our present and future Command and Control systems for Saabs ground based radar systems. We work closely with our customers both when releasing finished products and working with new concepts and prototypes.\n\n \n\nAs a software architect, you will be responsible for architectural decisions in the development of command, control and communication software in Java and your main tasks are:\n\n * \n\nTechnical leader for development teams\n * \n\nDesign solutions in close cooperation with stakeholders (internal and external)\n * \n\nSupport project management with planning and cost estimates\n\n \n\nYour profile\n\nTo succeed in this role, you need to be interested in the development of new solutions while being able to grasp and adhere to a large and complex framework. You are already a leader but seek to continuously improve your technical leadership with the purpose to make others grow and take responsibility for the complete system solution. You take a systematic approach to visualizing and handling architectural issues.\n\n \n\nYou are communicative and can explain complex technical concepts in dialogue with both product managers and software developers. You possess strong computer science fundamentals: network protocols, API design, programming languages and distributed systems.\n\n \n\nAs a person, you are positive, approachable and enjoy teamwork!\n\nRequired skills:\n\n * \n\nM.Sc in Computer Engineering and/or Software Engineering or similar relevant experience\n * \n\nAt least 10 years of experience from working with software development, committing code as well as and handling requirements within software projects (Java, C++, C etc)\n * \n\n5 years of documented experience in a leading software engineering role\n * \n\nDocumented experience from working with network protocols, Java and Linux\n * \n\nAgile software development\n * \n\nFluent communication skills in Swedish and English, verbal and written\n\n \n\nDesired skills:\n\n * \n\nExperience from working with military command, control and communication systems\n * \n\nExperience from development of safety critical systems, and working with standards such as RTCA DO-278A or IEC 61508\n\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.\n\n \n\nWhat you will be part of\n\nBehind our innovations stand the people who make them possible. Brave pioneers and curious minds. Everyday heroes and inventive troubleshooters. Those who share deep knowledge and those who explore sky-high. And everyone in between. ​\n\n \n\nJoining us means making an impact together, contributing in our own unique ways. From crafting complex code and building impressive defence and security solutions to simply sharing a coffee with a colleague, every action counts. We encourage you to take on challenges, to create smart inventions and grow in our friendly and tech-savvy workspace. We have a solid mission to keep people and society safe.\n\n \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 25,500 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here\n\nPlease note that the screening and interview process will begin after the summer holidays, in early August.",
    "url": "https://www.aplitrak.com/?adid=YS5vc3RlcmJlcmcuMjY5NDMuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
    "published": "2025-06-09T14:11:43",
    "deadline": "2025-07-28T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6496951219512195,
    "category": "IT"
  },
  {
    "id": "29751132",
    "title": "Senior Software Engineer",
    "employer": "Baronit AB",
    "location": "Göteborg",
    "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Fintech, Healthcare, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Fullstack Engineer to join our dynamic team. This role requires a strong foundation in both backend and frontend development, coupled with extensive experience in cloud platforms and DevOps practices. You will collaborate closely with cross-functional teams to deliver scalable, reliable solutions that align with our clients’ goals.\nKey Responsibilities:\nDesign, build, and maintain robust backend and frontend applications, ensuring high performance and scalability.\nDevelop and manage scalable CI/CD pipelines to automate software delivery and deployment processes using tools like Jenkins, Git, and Azure DevOps.\nOptimize and manage cloud infrastructure on AWS, ensuring high availability, performance, and cost-efficiency.\nContainerization & Orchestration: Deploy, manage, and monitor containerized applications using Docker and Kubernetes.\nUtilize Infrastructure as Code (IaC) tools like Terraform, Biceps, and Ansible for cloud resource provisioning and automation.\nImplement and maintain observability solutions using Grafana, Prometheus to ensure system health and performance.\nWork within Agile/Scrum environments, closely collaborating with cross-functional teams to deliver high-quality products.\n\nRequirements:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in full-stack development or similar.\nProficiency in backend languages such as Java (Spring Framework, Spring Boot), JavaScript, Go, NodeJS and Python.\nFrontend frameworks like React or Angular.\nCloud technologies primary Azure or AWS but also Google Cloud\nDevOps methodologies e.g. Continuous Integration (CI) and Continuous Delivery (CD) like Jenkins, GitLab, GI, pipelines, Kubernetes or similar\nMicroservice architecture, e.g. AWS cloud services\nREST and RESTFUL API\nContainer runtime and orchestration e.g. Kubernetes and Docker in AWS and/or Azure\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
    "url": "baronit.se",
    "published": "2025-06-04T15:33:13",
    "deadline": "2025-11-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6439024390243903,
    "category": "IT"
  },
  {
    "id": "29706898",
    "title": "System Development and Validation Engineers in Electromobility / ADAS",
    "employer": "EGEMS AB",
    "location": "Göteborg",
    "description": "WHO ARE WE?\nEGEMS AB is founded in 2020 and a young company with full of energy with headquarters in Gothenburg, Sweden and support locations aiming to be established in Istanbul and Izmir, Turkey.\nThe focus is on providing consultancy and employment solutions with result oriented mindset in interim management, project & program management, production & quality management, system engineering, hardware, software development while understanding time, cost and quality balance within automotive, heavy vehicle, telecom, energy and multiple various industry areas.\nJOB DESCRIPTION\nWe are now looking for different skillsets such as Technical Project Leader / System & Validation (Test) Engineers in ADAS / Active Safety and Electromobility.\nIn addition, we are interested in SW, Production, Quality engineers as well as per customer needs and always interested in receiving your application within ADAS, Active Safety and Electromobility.\nPast experiences in ISO26262 functional safety is a merit\n- System Engineer / System Validation (test) Engineer: Requirement clarification and management, know-how working with requirement management tools such as Polarion, Doors, understanding industrialization and homologation processes, system architecture design, understanding design for manufacturing, quality and production experience, test, validation planning & execution, proven history in similar roles. Experience within electromobility (e-mobility), power electronics, Autonomous driving (ADAS), active safety, infotainment, test, validation, quality and production are merits.\n- Technical Project Manager: Proven history with leadership skills, understanding team development, project management professional, result and solution oriented, role model for the team members. Experience within electromobility (e-mobility), power electronics, Autonomous driving (ADAS), active safety, infotainment, test, validation, quality and production are merits.\n- 5-10 years of experience\n- Self-driven, outgoing, result oriented\nPlease submit your CV together with your application to candidate@egems.se, interviews are being held actively.",
    "url": null,
    "published": "2025-05-15T17:23:39",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6423780487804878,
    "category": "IT"
  },
  {
    "id": "29706853",
    "title": "PM/System & Validation Engineers in ADAS/Active Safety and Electromobility ",
    "employer": "EGEMS AB",
    "location": "Göteborg",
    "description": "Technical Project Leader / System & Validation (Test) Engineers in ADAS / Active Safety and Electromobility\n\n\nWHO ARE WE?\n\n\nEGEMS AB is founded in 2020 and a young company with full of energy with headquarters in Gothenburg, Sweden and support locations aiming to be established in Istanbul and Izmir, Turkey.\n\n\nThe focus is on providing consultancy and employment solutions with result oriented mindset in interim management, project & program management, production & quality management, system engineering, hardware, software development while understanding time, cost and quality balance within automotive, heavy vehicle, telecom, energy and multiple various industry areas.\n\n\nJOB DESCRIPTION\nWe are now looking for different skillsets such as Technical Project Leader / System & Validation (Test) Engineers in ADAS / Active Safety and Electromobility.\n\n\nIn addition, we are interested in SW, Production, Quality engineers as well as per customer needs and always interested in receiving your application within ADAS, Active Safety and Electromobility.\n\n\nPast experiences in ISO26262 functional safety is a merit\n\n\n- System Engineer / System Validation (test) Engineer: Requirement clarification and management, know-how working with requirement management tools such as Polarion, Doors, understanding industrialization and homologation processes, system architecture design, understanding design for manufacturing, quality and production experience, test, validation planning & execution, proven history in similar roles. Experience within electromobility (e-mobility), power electronics, Autonomous driving (ADAS), active safety, infotainment, test, validation, quality and production are merits.\n\n\n- Technical Project Manager: Proven history with leadership skills, understanding team development, project management professional, result and solution oriented, role model for the team members. Experience within electromobility (e-mobility), power electronics, Autonomous driving (ADAS), active safety, infotainment, test, validation, quality and production are merits.\n\n\n- 5-10 years of experience\n\n\n- Self-driven, outgoing, result oriented\n\n\nPlease submit your CV together with your application to candidate@egems.se, interviews are being held actively.",
    "url": null,
    "published": "2025-05-15T17:24:09",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6423780487804878,
    "category": "IT"
  },
  {
    "id": "29755187",
    "title": "Software Engineer",
    "employer": "Volvo Personvagnar Aktiebolag",
    "location": "Göteborg",
    "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\n\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent.\n\nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nPropulsion and Energy is one of the corner stones of Volvo Cars Engineering. We are at the heart of electrification and energy engineering with a clear purpose to develop state of the art propulsions and energy solutions.\n\nOur Charging Software group delivers critical software functionality for the on-board charger (OBC) in our electrified vehicles. The OBC is essential for electrified vehicles, enabling grid-to-battery charging.\n\nChallenges and Vision\nAC-charging is important for building a sustainable and user-friendly EV. Our mission is to optimize our software and hardware to ensure seamless vehicle charging.\n\nTo lead the market in Charging Software functionality. We’re committed to evolving our approach, embracing modular software platforms that adapt to global charging standards.\n\nWhat you'll do\n\nAs a Software Developer, you’ll be part of a team delivering Application Software for the on-board charger and our energy system. Key responsibilities include:\n  *  Model-Based Development (MBD): Utilize Matlab/Simulink and AUTOSAR to implement charging functionality for different standards and logics\n  *  Testing and Calibration: Work with vehicle calibration, Hardware-In-the-Loop (HIL) and vehicle testing\n\n  *  Bug Analysis and Resolution: Diagnose and resolve software issues to maintain system reliability\n  *  Collaboration and Mentorship:\n  *  Partner with cross-functional teams, including testers, designers, and stakeholders\n\n  *  Continuous Improvement: Identify bottlenecks, propose enhancements, and contribute to process optimization\n\n\nWhat you'll bring\n\nYou would carry a B.Sc. in Engineering (Electronics, Software, or equivalent). You would bring a background in model-based development for embedded systems. In this role you should be fluent in English as well as carry a drivers license preferably B-category license.\n\nBelow are preferred skills and experience that would benefit you in this role:\n  *  Software/function development experience\n  *  Embedded system development background\n  *  Knowledge of automotive product development and power electronics (OBC functionality)\n  *  Familiarity with AUTOSAR architecture and software component development\n  *  Understanding of charging standards like IEC-61851, J1772, SAE J3400 (NACS)\n  *  Knowledge and understanding of simple HW-Circuits\n\n\nSome personal traits that would benefit you in this role would be a structured approach, detail-oriented, and driven by innovation. You are an effective communicator and team player as well as an adaptable with a business-oriented mindset.\n\nIn this role you would collaborate with a global team of innovators. Lead projects that shape the future of sustainable mobility. Thrive in a culture that values integrity, courage, and energy.\n#LI-DNP\n#LI-DNI",
    "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43438568",
    "published": "2025-06-06T12:25:04",
    "deadline": "2025-06-16T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6399390243902439,
    "category": "IT"
  },
  {
    "id": "29749596",
    "title": "Senior fullstack-utvecklare till Lokalguiden i centrala Göteborg",
    "employer": "Lokalguiden Sverige AB",
    "location": "Göteborg",
    "description": "Lokalguiden växer och vi söker nu vår nästa IT-stjärna.\nHos oss sitter du i centrala Göteborg tillsammans med fantastiska kollegor och nära till affärer, restauranger och kollektivtrafik. \nOm tjänsten\nSom utvecklare på Lokalguiden har du en viktig roll i verksamheten där du tar fram användarvänlig och kvalitativ kod för att, tillsammans med dina kollegor på IT och i övriga företaget, ta företaget till nästa nivå. I en innovativ arbetsmiljö kommer du under en dag exempelvis att:\n- Arbeta med PHP (8+), Symfony, React, TypeScript, MySQL och AWS\n- Vidareutveckla Lokalguidens marknadsplats\n- Vara delaktig i Lokalguidens framtida utveckling\nNär du inte arbetar kan du spela pingis eller dart med dina kollegor eller bara slappa i en skön soffa. Är det vår eller sommar kan du njuta på takterrassen. Har du ärenden som behöver fixas tar det inte mer än några minuter, eftersom alla affärer finns i närheten, du behöver inte ens ta på dig ytterkläderna. På måndagar startar vi veckan med att äta en gemensam frukost.\nMedarbetare på Lokalguiden erbjuds utöver flextid och en blandning av kontors- och distansarbete, ett generöst friskvårdsbidrag och ett grymt geografiskt läge. Självklart får du också möjligheten att välja din tekniska utrustning och dina arbetsverktyg.\nOm dig\nTjänsten passar dig som har ett driv att utvecklas och som trivs med frihet under ansvar. Det är viktigt att du är proaktiv, initiativtagande och har en förmåga att se verksamhetens olika utmaningar och hur IT kan vara med och lösa dessa. \nAtt samarbeta med kollegor är en självklarhet för dig, samtidigt som du behöver vara trygg och bekväm med att självständigt arbeta i och utvecklas i vår IT-miljö och våra system.\nDu behöver\n- Ha god kunskap om PHP och/eller Typescript/react\n- Ha god kunskap om MySQL\n- Ha erfarenhet av att arbeta med molntjänster\n- Tala och skriva svenska och engelska obehindrat \nDet är också meriterande, men inget krav, med erfarenhet av:\n- Symfony, Laravel eller liknande ramverk\n- Automatiserad testning, CI/CD\n- AWS, Docker\n- Google analytics, tag manager, utfallsmätning\nOm Lokalguiden\nI över 30 år har vi på Lokalguiden visat företag vägen till den perfekta lokalen.\nVarje dag besöker tusentals användare vår marknadsplats, där det stora utbudet från fastighetsägare över hela landet gör att det alltid går att hitta en lokal som passar.  \nLokalguiden finns för att göra sökandet efter rätt lokal, eller rätt hyresgäst, så enkelt som möjligt. Det har gjort oss till den självklara länken mellan fastighetsägare och lokalsökande bolag.\nAnsök idag då urval sker löpande\nLåter detta som en arbetsplats för dig? Ansök redan idag då urval sker löpande.\nAnställningen startar så snart som möjligt eller enligt överenskommelse.",
    "url": null,
    "published": "2025-06-04T09:43:58",
    "deadline": "2025-07-04T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6268292682926829,
    "category": "IT"
  },
  {
    "id": "29603157",
    "title": "Data Engineer / Machine Learning / AI / Cloud",
    "employer": "Combine Control Systems AB",
    "location": "Göteborg",
    "description": "About Combine At Combine Control Systems, we are passionate about technology and innovation. We specialize in creating innovative technology that empowers industries and shapes the world around us. Our pursuit of staying at the forefront of the rapidly changing tech world drives us to develop and work with the latest tools and techniques in areas such as Data Science, AI, embedded systems, and control engineering. We offer exciting and diverse challenges at the cutting edge of technology and create an inspiring work environment where our employees thrive and have the opportunity to grow and develop. Together, we form a team of dedicated and skilled engineers and experts who are passionate about technology and innovation. As we continue to expand our horizons, we are seeking a passionate and talented Data Science Engineer to join our dynamic team in Gothenburg. \nWhat can we offer you? Joining our team means becoming part of a community that values openness, creativity, and trust. We embrace teamwork and welcome your contribution. At Combine, we encourage personal development, provide opportunities to explore new domains, and offer an inspiring and inclusive workplace.\nTechnically challenging projects - You will be part of exciting and technically challenging projects. You will work with the latest technologies and tools in Data Science and AI/Machine Learning. We give you the opportunity to challenge yourself and grow in specialized areas.\nInspiring work environment - Here, you will be surrounded by like-minded and enthusiastic colleagues. We promote collaboration and knowledge sharing to create a dynamic and rewarding work environment.\nProfessional development - We invest in our employees and provide opportunities for skills development and further education to help you grow in your career.\nYour role As a Data Engineer at Combine, you are a crucial part of our team. You will work with clients from various industries and sectors, where data is at the core of every project. Your role involves adapting existing tools/packages to create automated pipelines in the cloud, following industry best practices. You will analyze data to address stakeholders' questions, monitor data, and create/update reports or dashboards. Additionally, you will collaborate closely with stakeholders and support cross-functional teams.\nQualifications\n  Master's degree in areas related to computer science, information technology, or equivalent. \n Proficiency in Python and/or Scala. Experience with SQL and NoSQL databases.\n Experience with Git, CI/CD, and Data/DevOps. \n At least two years of experience working with large datasets using cloud technologies such as AWS, GCP, or Azure. \n Very good skills within the English language, both spoken and written.  Preferred Qualifications \n Experience with Databricks, Spark, Snowflake, etc., is advantageous. \n \nWho are you? We are looking for a versatile and talented individual who enjoys collaboration, embraces challenges, and appreciates a holistic approach to problem-solving. If you enjoy exploring new areas, value teamwork and can communicate technical knowledge to colleagues and stakeholders at different domains and technical levels, you are the right person for our team. \nWe look forward to receiving your application!",
    "url": "https://combine.teamtailor.com/jobs/4961523-data-engineer-machine-learning-ai-cloud?promotion=1413941-arbetsformedlingen",
    "published": "2025-04-04T09:03:45",
    "deadline": "2025-09-21T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6268292682926829,
    "category": "IT"
  },
  {
    "id": "29759105",
    "title": "Senior Software Engineer, Fullstack",
    "employer": "Bokio Group AB",
    "location": "Göteborg",
    "description": "Bokio is on a mission to make the world a better place for small businesses. We want to make it super easy for everyone to run a business through automation of financial services, accounting, payments, and taxes. At Bokio, we believe in the power of diversity and creative freedom to foster innovation.\nWe are now looking for a Senior Software Engineer to join our product teams. Product teams are empowered to shape the product direction, guided by clear company-wide objectives, and supported by everyone. We focus on building a user-friendly, reliable, and secure product that helps our users to manage their finances more efficiently, impacting user satisfaction, retention, and acquiring new customers. \nAs a Senior Software Engineer at Bokio, you will be providing technical leadership within the team, fostering a culture of continuous learning and improvement, promoting software craftsmanship for code quality, design, and testing. More details can be found below, but in a nutshell:\n  \nYou will be part of a small, cross-functional team that has full responsibility and accountability for their product area.\n\n \nYour main playground will be: C#, .NET, and React/TypeScript/CSS.\n\n \nYou will be expected to collaborate with other seniors to solve complex problems.\n\n \nYou'll play a vital role in mentoring and guiding other engineers. \n\n \nYou will be expected to communicate across the organization in spoken and written English.\n\n \n Sounds exciting? Join the team and help us make an already awesome product even better! \n Who you are \nYou really care about users and improving their experience when using a product. We use data and analytics to learn and adapt, and you'll play a crucial role in that process.\n\n \nYou bring energy and ideas to your work, ideating with project managers and designers, shaping the product direction and exploring technical approaches to solve user problems.\n\n \nYou are curious and are looking for ways to improve and grow.\n\n \nYou are a proactive communicator, comfortable sharing your ideas and challenging the status quo.\n\n \nYou promote close collaboration and mentorship with all of your colleagues.\n\n \nYou care about and use sound engineering practices to develop stable and maintainable software that can be relied on by others.\n\n What’s in your backpack You are knowledgeable and have experience of: \n.NET, C#\n\n \nReact, HTML, CSS, and TypeScript/JavaScript\n\n \nCI/CD\n\n \nMicrosoft Azure or similar infrastructure.\n\n \n It would be considered a bonus if: \nYou have/had your own company and understand the perils of running a small business.\n\n \nYou are familiar with accounting or fintech.\n\n \nYou have worked with single-page applications (SPA).\n\n \nYou have worked with applications where information security was critical.\n\n \nYou have experience of working with AI tools such as Windsurf or Cursor.\n\n \n \n \nWhat's in it for you \nAn opportunity to grow and learn from knowledgeable colleagues.\n\n \nA diverse workplace, with skilled and kind people from all over the world.\n\n \nA community of 5000+ Product Development professionals in fellow companies of Visma Group with active guilds in Software Engineering & Architecture, AI/ML, Cyber Security, Product Design, Product Management, etc.\n\n \nWe invest in your growth and learning by weekly dedicated learning time, training budget, learning platforms, etc.\n\n \nFlexible working hours and freedom to work in a hybrid-remote setup.\n\n \nAwesome offices in central Gothenburg & Stockholm.\n\n \n30 days vacation, comprehensive wellness grant, pension according to ITP levels, and other benefits.\n\n Location\nWe have a Hybrid work model with central offices in Gothenburg and Stockholm. This position is located in Gothenburg with the possibility to work hybrid remote.\nFinallyYou are welcome at Bokio for who you are, no matter where you come from or what you look like. Our platform is for everyone, and so is our workplace! We are creating a culture at Bokio where empathy, diversity, respect, and courage are front and center. Get a glimpse of what we are up to on our Linkedin or Instagram: Life at Bokio and Bokio App. \nAre you the one we are looking for? Apply now!\n Please note that Bokio conducts background screenings as a final part of all employment processes; detailed information will be shared closer upon or per request.",
    "url": "https://jobs.bokio.se/jobs/6028304-senior-software-engineer-fullstack?promotion=1505736-arbetsformedlingen",
    "published": "2025-06-09T18:08:03",
    "deadline": "2025-11-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.624390243902439,
    "category": "IT"
  },
  {
    "id": "29744021",
    "title": "Fullstack Software Engineer at Appgate",
    "employer": "Software Skills International AB",
    "location": "Göteborg",
    "description": "Are you a Fullstack Engineer with an interest in cyber security? Software Skills is recruiting on behalf of our client, Appgate, for skilled developers to join their growing team in Gothenburg. \nAbout the role \nAs a Fullstack Engineer at Appgate, you will be part of a creative, cross-functional team in cybersecurity. You will have the opportunity to work in an agile environment with a high degree of autonomy while collaborating with top level developers, machine learning experts and network security engineers. \nTheir Gothenburg office serves as the innovation center for the Appgate SDP product - a security solution that is transforming network access for organisations worldwide. With a rapidly growing international presence, Appgate currently employs around 450 people, including 160 software engineers from over ten different countries. \nWhy join Appgate? \nWork in a cutting-edge field with the latest technologies.  \nBe part of a collaborative and innovative team.   \nEnjoy a high degree of autonomy and creative freedom within an agile and open environment. \nCompetence development.    \nFun colleagues and many activities.  \nStable work / life balance. \nHybrid workplace.    \nWork in a brand-new office in the heart of Gothenburg. \n\nResponsibilities \nContribute to the development of Appgate SDP, a leading security product.  \nWork closely together with our other international teams of software and security experts. \nBuilding automated tests and integrating your code within a DevOps environment. \nAlways learn and bring new concepts and technologies to your team. \n\nYour profile \nWe are looking for engineers who are passionate about software development and cybersecurity. Ideal candidates will have: \nExperience working with one or more of the following languages: C#, Java, Python, React, TypeScript. \nDesire to learn and adapt to new tools and technologies. \nA focus on writing readable, efficient, reliable and secure code. \nA fullstack mindset: designing, developing, testing, reviewing, documenting and deploying software solutions. \n3+ years of experience (or a strong willingness to learn quickly). \nFluency in English. \n\nBonus qualifications \n Experience in any of the following: Windows, macOS, Linux, Android or iOS development. \n Knowledge of computer networks and cybersecurity. \n\nAbout Appgate \nAppgate is a global cybersecurity company providing solutions for secure network access. Their flagship product, Appgate SDP, is an identity-centric access control solution that surpasses traditional security approaches by providing “a software-defined perimeter” that increases resilience, simplifies management complexity and reduces cost. It is currently deployed by over 100 customers, including Fortune 100 companies and governments. \nHow to apply \nDoes this sound like the right role for you? Please press the Apply button at the top right corner of the page. Any questions about the position? Contact our recruiter Ingelin Glimstedt at ingelin.glimstedt@softwareskills.se for more information. We consider candidates on a rolling basis, which means the role might be filled before the application deadline.",
    "url": "https://softwareskills.se/jobs/67d81d561e3f4427a0156f21?source=af",
    "published": "2025-06-02T13:13:33",
    "deadline": "2025-07-02T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.624390243902439,
    "category": "IT"
  },
  {
    "id": "29668991",
    "title": "Software Engineer- Billiant",
    "employer": "Telavox AB",
    "location": "Göteborg",
    "description": "Join Billiant in Gothenburg as a Software Engineer! \nWe are looking for a Software Engineer to join the engineering team with us at Billiant- a Telavox company. Billiant BSS enables a feature-rich, future-proof billing and support system for mobile, fixed, broadband, and TV services. As a key team member, you will be crucial in designing and developing a diverse and advanced BSS platform. You will be involved from the initial stages of understanding our customers’ challenges to creating and implementing effective solutions. If you’re excited about working with Java, designing distributed systems, and contributing to an innovative team, we’d love to hear from you! \nAbout the job \nAs a Software Engineer at Billiant, you’ll work on our feature-rich and future-proof Billing and Support System (BSS). You’ll collaborate with a team of talented engineers and be involved in the entire development process—from understanding customer challenges to implementing robust solutions.\nA typical day in this role involves:\n \nDesigning and developing: Contributing to the design and development of scalable features for our advanced BSS platform, handling large data sets like millions of subscriptions and billions of events.\n\n \nProblem-solving: Tackling complex technical challenges while continuously improving system performance.\n\n \nCollaborating with the team: Engaging in code reviews, brainstorming sessions, and team retrospectives to refine workflows and deliver high-quality results.\n\n \nWorking with customers: Understanding their needs and translating them into effective technical solutions.\n\n \nThis role is based in our Gothenburg office, a welcoming and modern space near the city center, easily accessible via public transport or car.\n About you \nWe’re looking for a Software Engineer with 2+ years of experience in software development. You’re a curious and collaborative problem-solver who enjoys diving into complex challenges and crafting innovative solutions. \nTechnical competencies:\n \nProficiency in Java, SQL, and RESTful APIs.\n\n \nExposure to distributed systems and an interest in scalable architecture.\n\n \nFamiliarity with React/TypeScript.\n\n \nGood-to-have skills:\n \nExperience with Agile methodologies like SCRUM.\n\n \nKnowledge of modern DevOps practices.\n\n \nYou’ll fit right in if you thrive in a collaborative environment, enjoy learning new technologies, and value teamwork and communication. We welcome a proactive mindset and a drive to continuously improve yourself and the products you work on.\nApply today and join us at Billiant in shaping the future of telecom solutions! \n\nJoin us at Billiant?\nAt Billiant, we have been working with BSS solutions and developing our own BSS platform since early 2000—for more than twenty years! Today, the product is an extensive and advanced framework for creating solutions for telecom operators in several countries throughout Europe. We are constantly developing new and enhanced features based on our customers’ needs and market trends, where quick time to market and flexibility are our guiding principles. Today, Billiant is part of the Telavox group, which is fast-growing and profitable. The group has +1.9b in revenue, +500 Telavoxers in nine countries, and +160 people working in Product and Engineering. We pride ourselves on creating an inclusive, supportive culture where everyone can thrive. By joining us, you will not only contribute to our technology but also be part of a company that values work-life balance, continuous learning, and community. Plus, you will enjoy our legendary company events, personal development opportunities, and much more \n How to apply! At Telavox, we don't focus on fitting in; we focus on making room for everyone. We’re always on the lookout for great talent, so applications are reviewed continuously. If you're ready to be part of an innovative, AI-driven telecom company, apply today with your CV and cover letter in English.  \nFor any questions, feel free to reach out to Talent Acquisition Partner Ami Faraguna at ann-marie.faraguna@telavox.com  \nLearn more about what we do!",
    "url": "https://career.telavox.com/jobs/5878141-software-engineer-billiant?promotion=1451303-arbetsformedlingen",
    "published": "2025-04-30T12:13:55",
    "deadline": "2025-10-17T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6219512195121951,
    "category": "IT"
  },
  {
    "id": "29749821",
    "title": "Data Engineer - CoDev Data",
    "employer": "Volvo Personvagnar Aktiebolag",
    "location": "Göteborg",
    "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nVolvo Cars is on an ambitious journey to redefine the customer experience in automotive through digital technology. One success factor is to continuously get fast feedback from our consumers and cars, on our products and services. For this purpose, our consumers of our Volvo Cars CoDev car fleet play a major role.\nOur department, Product Validation, we create a future where everyone developing our products empathizes with our users. We deliver CoDev data products to enable data driven development.\n\nWhat you'll do\n\nAs a Data Engineer, you will be part of the CoDev Data Team and you will deliver quality assured and privacy compliant CoDev data product in raw and refined formats adapted to the users, to enable data driven development cross the whole company.\n\nYou will maintain data pipelines ingesting CoDev driver feedback combined with meta data, from other systems, into tables displayed in different places. Both uptime and data quality are important to secure value for all stakeholders and development teams, reading and working with these reports. The team also delivers availability to signal and diagnostic vehicle data, in both rawer and refined formats.\n\nYou will also provide a descriptive overview of the datasets we own for stakeholders to understand our deliveries at a quick glance.\n\nYou will work in close collaboration with Data Engineers, software development teams building applications used for collecting and distributing CoDev data, as well as architects in the development of products and platforms, and not to forget, users of our products, with various level of knowledge into the data area.\n\nWhat you'll bring\n\nWe aim to develop products that are scalable. You are comfortable in a wide variety of system and software development disciplines, programming, system design and interfacing with databases. You have a big autonomy in how to design solutions and drive improvements and development of datasets. You enjoy exploring new ways to solve problems, including tools to choose, to improve the way to deliver value to stakeholders.\n\nYou are very experienced in Python language, version control using Git and CI/CD pipeline development using tools like GitHub Actions, GitLab CI/CD or similar. You have experience working containerized with Docker and building modern data pipelines using tools like Jenkins, Databricks or Airflow.\n\nYou have a strong analytical mindset and solid experience working with large data sets, developing robust data pipelines, and managing data workflows. Your technical expertise includes working with Azure cloud services and Databricks, with additional skills in Snowflake, visualization in power bi, API management, and SQL. Experience in developing test programs is also considered a valuable asset.\n\nIt is an asset if you have experience in UDS diagnostic communication protocol, used within the automotive industry.\n\nYou have a MSc degree in Data Science, Computer Science, Data Engineering, Mathematics, or equivalent area, as well as fluent in English.",
    "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43431499",
    "published": "2025-06-04T10:25:03",
    "deadline": "2025-06-13T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6219512195121951,
    "category": "IT"
  },
  {
    "id": "29740874",
    "title": "Fullstack Engineer",
    "employer": "Ecareer AB",
    "location": null,
    "description": "Har du erfarenhet av modern webbutveckling och trivs i team där samarbete, transparens och ständiga förbättringar står i fokus? Vi på Aveer söker nu en Fullstack Engineer till ett tekniktungt uppdrag inom en internationell produktmiljö.\n\nOm rollenDu kommer att arbeta i ett utvecklingsteam som ansvarar för två produkter – en som hanterar dokumentation av uppkopplade tjänster, och en nyutvecklad lösning för att möta regelverk kopplade till mjukvaruuppdateringar.\nTeamet jobbar agilt och tvärfunktionellt, med gemensamt ansvar för hela livscykeln: från design och utveckling till test, leverans och support. Du får bidra med teknisk kompetens, samtidigt som du är med och formar arbetssätt och tekniska lösningar framåt – inklusive hur AI och automatisering används för att effektivisera utvecklingsflöden.\n\nI rollen kommer du bland annat att: Arbeta med fullstackutveckling i .NET (.NET Core/.NET Framework) och moderna frontendramverk som Angular, React eller Vue\n Bygga och underhålla lösningar i en Azure-miljö, inklusive DevOps-pipelines\n Säkerställa kvalitet och testbarhet genom TDD och kodgranskning\n Samarbeta med arkitekter, produktägare och intressenter i planering och prioritering\n Dela kunskap, bidra till förbättringar och stötta teamets 3rd line-supportansvar\n \n\nVi söker dig som har: Gedigen erfarenhet av webbutveckling och .NET\n Goda kunskaper i JavaScript och något eller flera av Angular, React eller Vue\n Erfarenhet av DevOps och molnlösningar, gärna i Azure\n Intresse för AI och automatisering kopplat till utveckling\n Van att arbeta i agila, tvärfunktionella team\n Engagemang för kvalitet, säkerhet och lärande\n \n\nMeriterande erfarenheter: Testdriven utveckling (TDD)\n Kunskap om AI-ramverk eller automatiseringsverktyg\n Erfarenhet av komplexa eller reglerade systemmiljöer\n \n\nÖvrig information:Placeringsort: Göteborg (delvis distans)",
    "url": "https://jobb.ecareer.se/jobs/5994832-fullstack-engineer?promotion=1493503-arbetsformedlingen",
    "published": "2025-05-30T13:28:13",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6195121951219512,
    "category": "IT"
  },
  {
    "id": "29744678",
    "title": "Software Engineer",
    "employer": "WirelessCar Sweden AB",
    "location": "Göteborg",
    "description": "WirelessCar’s Journey\nWirelessCar drives the future of mobility by connecting vehicles and developing cutting-edge digital services. We help leading brands—like Volkswagen, Volvo, Subaru, and Jaguar Land Rover—innovate, enhance mobility, and accelerate their digital transformation. Join us and shape the next era of automotive technology!\nWe’re looking for a Software Engineer\nIn this role, you’ll continuously explore the latest technologies and develop cutting edge solutions and services to our customers and together with your team you are responsible for the entire lifecycle of our services. \nWe are looking for creative Software Engineer to join one of our development teams. The team is working closely with the customer and is using a broad tech stack. They are building software that runs in a containerized environment in the car as well as in the cloud.\nWe offer you\nHigh-tech company that offers an exciting working environment.\nInvolvement with services and products that drive safety and sustainability.\nTech fund where you pick your choice of tech tools.\nFlat organizational culture founded on trust and autonomy; at WirelessCar, you are not just a number.\nWork-life balance and free access to the gym at the Gothenburg office.\nFlexible working hours and a hybrid workplace.\n\n\n\nWe believe that you bring\nWe are looking for an open-minded and flexible person who thrives under challenging and changing conditions. You should have prior experience in Connected services, with a natural curiosity, innovative mindset, and a strong ability to analyze and solve problems.\nThe ideal candidate will have the following qualifications and skills:\n·        AWS Certification with hands-on experience in AWS services, including Kinesis, DynamoDB, Fargate, and API Gateway.\n·        Proficiency in Microsoft Azure Cloud, including cloud resources and architecture best practices.\n·        Experience with Azure DevOps, including pipelines and artifacts.\n·        Strong programming skills in Java and Golang, and experience with Docker and gRPC for containerization and microservice communication.\n·        Familiarity with Datadog for monitoring, Open API for building scalable APIs, and general cloud architecture best practices.\n·        Fluency in Swedish, English, Mandarin Chinese, and Spanish.\nBeneficial:\nJira\n\nLocation\nAt WirelessCar we believe in a Hybrid Remote work set-up. The location for this role is Gothenburg, Sweden.\nTo join our journey\nWirelessCar is always on the move, often into uncharted land. We are curious, believe in collaboration and are always open to new ideas on how we can make a difference. When you join our journey, you will be part of a great crew of highly competent and warm-hearted people from all over the world.\nApplication Information \nDoes this role sound like a good fit for you? Great! Please answer a few questions and upload your resume. We look forward to receiving your application. \nOur company language is English so please write your application and CV in English. \nLast Application Day is the 14th of June.",
    "url": "https://career.wirelesscar.com/jobs/6002004-software-engineer/882eae9b-2822-433c-aa9a-1d55c8401059",
    "published": "2025-06-02T17:11:13",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6195121951219512,
    "category": "IT"
  },
  {
    "id": "29757879",
    "title": "IT Arkitekt med fokus på Digital Workplace",
    "employer": "SAAB AB",
    "location": "Linköping",
    "description": "Drivs du av att se dina idéer bli verklighet? Välkommen till vår spännande och teknikintensiva värld.  \n\nDin roll:\n\nSom IT Arkitekt för Digital Workplace inom Saab's IT-avdelning kommer du i din roll agera som spindeln i nätet och hålla ihop helheten kring arkitektur. Du stöttar och hjälper team framåt i deras uppdrag, deltar i framtidsplanering och bidra till att vi inom Digital Workplace ligger i framkant vad gäller teknik.\n\nSom IT Arkitekt ansvarar du för att IT-lösningar designas och realiseras på ett korrekt sätt enligt regulatoriska krav, verksamhetens krav och behov samt i förhållande till andra IT-lösningar. Du säkerställer att de företagsövergripande arkitekturprinciperna och riktlinjer kring standarder följs i den tekniska arkitekturen och du gör medvetna val för att skapa maximalt värde till verksamheten.\n\nDina arbetsuppgifter kommer bland annat innefatta att:\n\n * Analysera krav och behovsbilder.\n * Utifrån behovsbild kunna designa och presentera olika lösningsförslag.\n * Agera sakkunnig och stötta tekniker, Service Managers och Service Owners.\n * Skapa beslutsunderlag både affärsmässiga beslut men även för tekniska vägval.\n * Säkerställa att krav, regler, lagar, processer och standarder efterlevs i de tekniska lösningar som tas fram.\n * Dokumentera lösningar.\n * Presentera och kommunicera lösningar mot olika målgrupper och i olika forum.\n\nDin profil:\n\nVi letar efter dig som har förmågan att växla mellan detalj och helhet. Du kan kommunicera och förklara scenarion för olika målgrupper. Du gillar att ta för dig och kan arbetsleda dig själv, i gengäld kommer du få fria ramar att agera inom för att på bästa sätt kunna lösa uppgiften du står inför. Du är prestigelös och van att arbeta i team där man delar med sig av kunskap och tar hjälp av varandra.\n\nDu har en bakgrund från att arbetat inom Infrastrukturområdet sedan tidigare och du har även stort intresse av säkerhet. Har du erfarenhet från att arbeta med tjänstedesign, IT arkitektur på flera nivåer samt modellering är det ett plus men inget krav. Tjänsten är placerad på någon av följande verksamhetsorter: Linköping eller Göteborg. Hybrid arbetsplats är möjlig och resor nationellt samt internationellt kan förekomma.\n\nVi söker en kandidat med nödvändiga färdigheter, erfarenheter och förmåga att hantera de utmaningar som beskrivs ovan. För att lyckas i rollen ser vi gärna att du har: \n\n * Arbetat med IT i minst 5 år, gärna i uttalad arkitektroll\n * Utmärkta analytiska färdigheter med problemlösningsförmåga.\n * Utmärkta kommunikationsfärdigheter på både svenska och engelska\n\nÖnskvärda färdigheter och erfarenheter:\n\n * Inneha en eller flera Microsoft, Google eller AWS certifieringar.\n * Arbetat med klient- eller kommunikationslösningar där fokus är på slutanvändaren och upplevelsen.\n * Arbetat inom DevOps/tvärfunktionellateam.\n * Erfarenhet från hybrid och cloud lösningar.\n * Arbetat med regulatoriska krav eller säkerhetskrav tidigare.\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap. \n\nVad du blir en del av:\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 25,500 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här.",
    "url": "https://www.aplitrak.com/?adid=cC5zdmVuc3Nvbi4xMTU4OS4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
    "published": "2025-06-09T13:36:43",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6170731707317073,
    "category": "IT"
  },
  {
    "id": "29603174",
    "title": "Control Systems Engineer / Vehicle Motion Control Engineer",
    "employer": "Combine Control Systems AB",
    "location": "Göteborg",
    "description": "We are expanding our team of skilled control engineers to strengthen our current services within Vehicle Motion Control in Gothenburg. We are looking for you who want to be part of this journey!\nWho are we? Combine Control Systems is a leading supplier of high-quality engineering services within Data Science and AI, Software development, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking for a technical expert within the domain of Vehicle Motion Control to our Gothenburg office to take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Gothenburg, Lund, and Linköping, with our headquarter being in Gothenburg.\nWhat can we offer? Exciting assignments within various industries, ranging from the automotive industry to the railway industry. The flexibility of taking on the most exciting assignments without being locked to a single product. The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about control systems, Data Science, and AI. The flexibility and friendly atmosphere of a smaller company. Our employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks, and projects and expand their knowledge in a supportive and helpful way.\nWhich skills do you need to join the team? We are looking for someone with extensive and hands-on experience within the field of vehicle motion control for automotive applications. We believe you have experience from model based design and are a true believer that virtual verification is the way to go. We believe that you appreciate working within, or leading project teams. You like having fun and respect and trust your team as much as your knowledge. For us, personality speaks loudest and we are strong believers that knowledge can be taught.\nQualifications\n Master’s degree or PhD in relevant field.\n Extensive experience from the field of Vehicle Motion Control\n Experience from several of the following: Stability Control, Vehicle State Estimation, Longitudinal Control, Lateral Control\n MPC, EKF, UKF, Kalman Filter\n Matlab/Simulink, Dymola, Modelon Impact, FMU, Co-simulation\n  \n Strong communication and teamwork abilities.\n \nWho are you? We believe that you are positive and social. For you, the work-life balance is important and you like to share your hobbies and interests which you are passionate about with others. You believe in never stop learning and love the challenge that comes with it.\nIf you want to join our team, do not hesitate to apply!",
    "url": "https://combine.teamtailor.com/jobs/4741171-control-systems-engineer-vehicle-motion-control-engineer?promotion=1413957-arbetsformedlingen",
    "published": "2025-04-04T09:08:15",
    "deadline": "2025-09-21T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6097560975609756,
    "category": "IT"
  },
  {
    "id": "29718390",
    "title": "Data Analyst and PowerBI developer",
    "employer": "SENSIXE AB",
    "location": "Göteborg",
    "description": "Are you passionate about turning raw data into actionable insights that power smarter decisions? \nWe’re looking for a Data Analyst to join a high-impact, collaborative team in an organization committed to data-driven transformation across its operations.\nWith a strong presence in the industry, our client is at the forefront of innovation, leveraging cutting-edge technologies to stay competitive and deliver outstanding value to customers. As part of this journey, data is at the heart of every decision—and we’re looking for someone who can bring that data to life.\nAbout the Role\nAs a Data Analyst, you’ll be instrumental in unlocking the power of data through effective analysis, reporting, and visualization. You’ll work closely with stakeholders across departments to translate business questions into analytical solutions, design impactful dashboards in Power BI and Tableau, and work with large-scale datasets using tools like Apache Spark, Kafka, and Hadoop.\nThis is an exciting opportunity to work with a modern data stack, contribute to enterprise-scale data projects, and directly influence business performance.\nKey Responsibilities\nAnalyze complex datasets to uncover insights, trends, and business opportunities\nDesign and develop interactive dashboards and reports in Power BI and Tableau\nWrite and optimize SQL queries to extract and transform complex data\nCollaborate with cross-functional teams to define KPIs and deliver data-driven solutions\nWork with Apache Spark, Kafka, and Hadoop for large-scale data processing and streaming\nAutomate data workflows and support data pipelines using Python\nCommunicate findings clearly to both technical and non-technical stakeholders\nEnsure high data quality and contribute to data governance initiatives\n\nRequired Skills & Experience\nBachelor's degree in Computer Science, Data Analytics, Statistics, or a related field\n3+ years of experience in data analytics or a similar role\nStrong proficiency in Power BI, Tableau, and SQL\nSolid experience with Python for data analysis and scripting\nExposure to big data tools: Apache Spark, Hadoop, Kafka\nExperience handling large datasets and building data visualizations\nStrong analytical thinking with excellent problem-solving skills.\nExcellent verbal and written communication abilities\nExperience working in cross-functional and agile environments is a plus\n\nWhat We Value\nCuriosity: A natural drive to dig into data and explore what it reveals\nClarity: Ability to communicate complex insights in a clear, compelling way\nTeam Spirit: Work collaboratively across teams and departments\nTechnical Agility: Willingness to learn and work with evolving data tools and platforms\nBusiness Impact: Focus on translating data into real-world outcomes\n\nWhat’s in It for You\nCompetitive compensation based on experience\nOpportunity to work with modern data technologies and cloud platforms\nA learning-driven environment with room for professional growth\nFlexible work options and generous paid time off\nInclusive culture with strong emphasis on collaboration and innovation\n\n\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
    "url": null,
    "published": "2025-05-20T23:31:34",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6097560975609756,
    "category": "IT"
  },
  {
    "id": "29759069",
    "title": "Embedded System Engineer (FPGA)",
    "employer": "Emickers AB",
    "location": "Göteborg",
    "description": "Job Description: \nIn this role, you will develop and optimize software-defined radio (SDR) solutions using Xilinx Zynq UltraScale+ RFSoC platform. You’ll be responsible for system-level design, FPGA programming, and integration with mmWave RF front-end components. This is an exciting opportunity to work at the intersection of embedded systems, FPGA design, and advanced wireless technologies in a fast-paced, research-driven environment.\n \nKey Responsibilities:\n·      Design and implement mmWave OFDM-based software-defined radio (SDR).\n·      Configure and program Xilinx Zynq UltraScale+ RFSoC using MATLAB/Simulink and Vivado.\n·      Perform algorithm partitioning between the FPGA logic (PL) and the ARM Cortex cores (PS).\n·      Integrate the RFSoC board with mmWave RF front-end components for end-to-end system functionality.\n·      Develop and implement advanced wireless communication systems with DSP algorithms on RFSoC\nQualifications:\n·      Master’s degree in Embedded Systems, Wireless Communication Engineering, or a related field, with relevant industry experience.\n·      Strong proficiency in MATLAB/Simulink, HDL Coder, and FPGA design using Vivado and Vitis.\n·      Hands-on experience with embedded Linux and interactive Python workflows, including Jupyter Notebooks.\n·      Experience with the PYNQ open-source framework for programming and interacting with Xilinx Zynq RFSoC.\n·      Solid understanding of AXI interfaces, including AXI-Lite, AXI-Stream, and AXI DMA for PS–PL communication.\n·      Familiar with digital signal processing in wireless communication systems",
    "url": null,
    "published": "2025-06-09T17:43:18",
    "deadline": "2025-07-09T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6097560975609756,
    "category": "IT"
  },
  {
    "id": "29760753",
    "title": "Product, System & PLM Engineer",
    "employer": "Capgemini Engineering Sverige AB",
    "location": "Göteborg",
    "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
    "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
    "published": "2025-06-10T13:37:03",
    "deadline": "2025-10-31T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29753551",
    "title": "EMC System Design Engineer",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "About us\nWhy work with us at Electromobility? \nIn this position, you will be part of a growing organization dedicated to technology as well as empowering and developing our employees. We always use customer satisfaction as the ultimate performance measurement.  \nYou will be part of an agile and approachable organization with skilled teams consisting of passionate people. We work in an optimistic atmosphere, where joy, knowledge sharing and openness are key characteristics. With us, you will have a diverse, friendly and open-minded team on your side, always providing you the help needed to manage tasks you cannot imagine today.\r\n\r\nEMC System design engineer \n\nThe Role\nYou will work as a system designer with a focus on electromagnetic compatibility for components connected to the 800V DC link. With good knowledge of regulations (UN R10), international standards (CISPR, IEC, and ISO) , and actual component performance , you will develop and maintain Volvo's internal standards. The tasks will stretch from requirement writing, discussions, and reviews of supplier test results to involvement in in-house testing. You are to secure cross-functional and business anchoring as well as support another engineer within the area when needed. Being part of a system team, your electrical engineering skills will also contribute to the overall platform requirement work and joint decisions on system and component designs.   \n\nResponsability\n  *  Develop and maintain Volvo requirements and standards  \n  *  Review supplier component designs, testing methods and results  \n  *  Develop and participate in in-house EMC testing  \n  *  Review and develop system designs: installation of components  \n  *  Cooperate with other experts for alignment, processes, and education  \n  *  Review and comment on drafts of new regulations and international standards  \n\n\nFor further information about the position, please contact the hiring manager, Johan Ramert, E-mail: johan.ramert@volvo.com \nKindly note that due to GDPR, we will not accept applications via mail. Please use our career site. \n\nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.\r\n\r\nWho you are\nA person who is an innovative and solution-oriented team player. You look for improvements in our way of working and can drive things forward in an organized way. You make decisions based on facts and demonstrate persistence, structure, inventiveness, and motivation when it comes to your work. With your knowledge and experience, you are comfortable with communicating and supporting your team and different stakeholders. We also believe that you are a person who dares to challenge the current technology and are excited by the fast pace that is in the Electromobility field. \nRequirements \n  *  MSc degree in Electrical Engineering, Electronics, Physics, or equivalent knowledge from other educational programs or work life experience \n  *  6 - 8 years of experience from high voltage integrated power system design & development \n  *  Hands-on experience in planning and performing EMC testing \n  *  Hands-on experience in performing tests with live high-voltage components \n  *  Documented experience from working in an Agile development environment \n  *  Fluent in English, both verbal and written \n\nMeritorious knowledge \n  *  Skilled in EMC design and testing: conductive and radiated, emissions vs. immunity, requirements vs. test limitations \n  *  Good knowledge of electrical hazards and test principles in order to test in a safe manner \n  *  Experience from propulsion systems in battery electric vehicles",
    "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43435627",
    "published": "2025-06-05T13:25:03",
    "deadline": "2025-06-22T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29668279",
    "title": "Automotive System/Requirement Engineer",
    "employer": "EDAG Engineering Scandinavia AB",
    "location": "Göteborg",
    "description": "ARE YOU READY TO REINVENT MOBILITY? JOIN US AT EDAG AND BE PART OF OUR AGILE AND INTERNATIONAL TEAM\nEDAG, one of the leading global engineering experts with heritage from the automotive industry, serves its customers with complete development responsibility, ranging from concept work to even building prototypes. Whether it is software development, development of future mobility solutions, sustainability, design engineering, quality assurance, manufacturing engineering or various other engineering requests, EDAG has for more than 50 years successfully helped its clients taking the next technology leap.\nWe at EDAG simply claim to be our customer’s global mobility engineering experts!\nEDAG Engineering Scandinavia AB is the Scandinavian subsidiary of the EDAG Group. With an origin from Gothenburg, we have naturally become an important partner to the western region of Sweden. More and more customers are discovering our ability to deliver local engineering capabilities within a wide range of areas – not seldom in combination with other global EDAG sites, colleagues, and competences to accommodate larger projects and undertakings.\n We are looking for System/Requirement Engineers who will work on E-mobility, Electronics and Software Development areas, such as Autonomous Drive, Power Electronics, Active Safety, Functional Safety, Cyber Security, Vehicle Mode Management, Infotainment Systems, and more. You will be part of a global team of dynamic and innovative team that is preferred solution partner for the industry.\n\n\nYour Responsibilities\nDefining and analyzing system requirements and technical specifications\nReviewing electronics/software requirements-specifications\nManaging suppliers in an international environment\nDesigning and developing test requirements-specifications\nResponsible for issuing and changing management on developed models\nSecuring deliveries are ready in time, updated and released\nBuild and maintain personal network within R&D Organization\n\n\n\nOur Requirements\nM.Sc. or B.Sc. degree within Electrical, Electronics, Computer Engineering, or equivalent education\n5 years of working experience in the related field\nKnowledge in developing software algorithms and specifications\nKnowledge in electronics and microprocessors (embedded systems)\nKnowledge in automotive communication protocols (CAN, LIN, MOST, FlexRay and Ethernet)\nKnowledge in Agile Product Development (Scrum, SAFe)\nKnowledge in AUTOSAR\nKnowledge in Automotive Functional Safety Standard ISO 26262\nKnowledge in Automotive Cyber Security Standard ISO 21434\nThe experience with commercial vehicles is meritorious.\nFluent in English (written and spoken), Swedish is meritorious\nB driving license\n\n\n\nWe Offer:\nWe can provide you exciting tasks with great colleagues developing your skills in true global EDAG project teams. Your base will be inhouse in our own facilities in Gothenburg, but you will have daily contacts with many more colleagues in other EDAG sites around the globe and of course great customers and suppliers.",
    "url": null,
    "published": "2025-04-30T10:50:39",
    "deadline": "2025-08-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29738812",
    "title": "Senior System Verification Engineer - Traction Batteries",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nAre you a passionate and skilled engineer with expertise in Energy Storage Systems (ESS) and high-voltage traction batteries? We invite you to be part of our innovative team, where you will contribute to developing cutting-edge energy storage solutions that are transforming the future of sustainable transport!\nWhat you will do\nAt Volvo Group Trucks Technology, we develop world-class electromobility solutions for Volvo Group products, tackling exciting technical challenges in a collaborative environment characterized by knowledge-sharing and enthusiasm. \nAs a System Verification Engineer for Traction Batteries, you will play a vital role in verifying battery packs to ensure they meet the highest standards of safety, performance, and functionality. Your responsibilities will include hands-on testing to evaluate the characteristics of complete battery pack configurations. Collaboration is key, as you'll work closely with development teams, suppliers, and various functions. Strong communication skills and the ability to thrive in a cross-functional, international setting are essential for success in this role, driving innovation in sustainable transport solutions.\nWho are you? \nWe are seeking experienced System Verification Engineers who are passionate about electromobility and verification. To excel in this role, you should have prior knowledge of energy storage system testing and a proactive mindset focused on continuous improvement. You bring hands-on experience in battery hardware testing, including test planning, method development, and creating Design Verification Metrices (DVMs). You have conducted tests in both rig and vehicle environments, collecting and analyzing data related to thermal and electrical performance, legal certifications, functional verification, and durability. \nQualifications \n• Bachelor’s or Master’s degree in Engineering, preferably in Electrical, Power Electronics, Mechatronics, or a related field.\n• At least 3 years of experience in energy storage systems, particularly high-voltage traction batteries.\n• Several years of experience in the automotive industry\n• Proficiency in programming languages such as Python and MATLAB, and experience with Vector Tools for data analysis and visualization.\n• Strong knowledge of measurement technology and equipment used in battery testing.\nMeritorious \n• Experience in electromobility and AVL testing environments for battery packs.\n• Knowledge of commercial vehicle or automotive product development (DVP), and Alpha testing support.\n• Experience with PILs, benchmarking, and reliability tests.\n• Truck or bus driving license \nWhat can we offer\nElectromobility is changing the way we travel, commute and transport goods. In our different teams of committed and diverse engineers we are fighting the environmental challenges of the future. By joining us, you will be able to contribute with your skills and knowledge alongside be an active participant in developing test methods for our future battery platforms. We also offer many opportunities to grow and develop, and a wide variety of career paths to follow within the group.\nIf you have any questions, please do not hesitate to contact\nTalent Acquisition Partner: Smita Shree\nEmail: smita.shree@volvo.com\nLast Application Date: 13th June 2025\nDoes this sound like your next challenge? Welcome with your application today! \nWe value your data privacy and therefore do not accept applications via mail. \nWho we are and what we believe in \nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination.  \nApplying to this job offers you the opportunity to join Volvo Group. Every day, across the globe, our trucks, buses, engines, construction equipment, financial services, and solutions make modern life possible. We are almost 100,000 people empowered to shape the future landscape of efficient, safe and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents with sharp minds and passion across the group’s leading brands and entities. \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
    "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43418025",
    "published": "2025-05-28T18:25:03",
    "deadline": "2025-06-13T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29729288",
    "title": "Systemingenjör inom informationssäkerhet",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "description": "Har du grundkunskap inom informationssäkerhet, erfarenhet av säkra plattformar eller vill du utveckla din förståelse hur vi skyddar system från cyberhot? I takt med att vårt digitala samhälle utvecklas uppkommer också nya typer av hot inom området. För att möta dessa utmaningar är det avgörande att vi ständigt ligger i teknisk framkant.\n\nDin roll\n\nDu kommer ingå i ett team av ingenjörer som arbetar fokuserat med informationssäkerhet, både internt mot våra utvecklingsavdelningar och externt mot kund.\n\nFörbered dig på en roll där samarbete och teamet är i fokus, där du deltar i ett team som tillsammans stöttar verksamheten inom informationssäkerhetsområdet. Förbered dig även på att möta kunder som ställer hårda krav inom området och där vi tillsammans ska tillgodose kundens behov och möta dessa krav.\n\nDu deltar i hela utvecklingsprocessen från kund uttryckt behov avseende informationssäkerhet genom implementation till leverans av produkt. Du är ansvarig för att planera informationssäkerhetsarbetet i ett projekt samt designa säkerhetsarkitekturen för våra system. Du arbetar nära produktutvecklare, systemingenjörer och verifieringsingenjörer. \n\nDu är också med och bidrar till att utveckla hela vårt kompetensområde inom informationssäkerhet för att ständigt kunna möta förändrade intrångshot och förväntningar från våra kunder. Detta genom bland annat strategiarbete och utbildning.\n\nDina huvuduppgifter är:\n\n * Kommunicera löpande med bland annat kunder, projektledare, systemingenjörer, produktledare och utvecklare\n * Risk- och sårbarhetsanalys\n * Kravnedbrytning och kravanalys\n * IT-säkerhetsarkitektur och systemdesign\n\n \n\nSom stöd i ditt arbete har du din chef, dina närmsta kollegor i Informationssäkerhetsteamet samt det projektteam du ingår i.\n \n\nSpännvidden i våra uppdrag är mycket stor och då vi är en del i en stor organisation finns goda utvecklingsmöjligheter inom såväl teknik som ledarskap. Vi erbjuder dig en kreativ plattform för att kunna utvecklas mot det som passar just dig!\n\nDin profil\n\nDina personliga kvalifikationer har stor betydelse för oss.\n\nDu är förtroendeingivande och brinner för teknikområdet. Du är driven och vill ständigt anta nya utmaningar för att hjälpa både dig själv och verksamheten att utvecklas.\n\nDu självorganiserad och har ett stort intresse för att dyka ner på djupet i lösningar. I det dagliga arbetet är du strukturerad men du har även förmåga att bidra med kreativa lösningar. Du är även en lagspelare, där du har lätt att samarbeta med andra och du bidrar till ett bra arbetsklimat och en god teamkänsla.\n\n \n\nI grunden har du relevant teknisk utbildning, men dina erfarenheter och personliga egenskaper väger tyngre än en specifik examen. Som person är du öppen, social och prestigelös.\n\n * Kandidat/masterutbildning inom datavetenskap, högskole-/civilingenjörsexamen inom datateknik eller liknande, gärna med inriktning mot informationssäkerhet\n * Arbetslivserfarenhet inom t.ex teknisk informationssäkerhet, riskhantering, systemutveckling, mjukvaruutveckling\n * Arbetet ställer krav på goda kunskaper i svenska och engelska, både i tal och i skrift.\n\n \n\nDet är meriterande om du har erfarenhet av att ha arbetat med:\n\n * Standarder inom informationssäkerhet som tex ISO/IEC 27000\n * IT-säkerhetsutveckling enligt KSF eller motsvarande standard\n * Design av IT-säkerhet för system\n * Governance och compliance inom informationssäkerhet\n * Penetrationstestning t.ex CEH\n * Relevanta certifieringar tex CISSP, CSSLP\n\n \n\nDu måste även vara beredd på att kunna resa i tjänsten då kunderna ofta finns i andra länder.\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nVad du blir en del av\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 25,500 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här.",
    "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjM3MjEyLjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
    "published": "2025-05-26T09:30:23",
    "deadline": "2025-06-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29376303",
    "title": "Senior IT Business analyst",
    "employer": "Professional Galaxy AB",
    "location": "Göteborg",
    "description": "Assignment description\nFor our client we are looking for a Business Analyst.\nExperience:\nSeveral years' experience in an equivalent position as an IT Business Analyst with proven track record in the business.\nPreferably with strong supply chain / logistics (customs would be an advantage) domain knowledge and experience.\nExperience within Automotive is a bonus.\nExperience with leading investigations and projects.\nExperience with analyzing commonly used file formats like, xml , Json, Yaml etc.,\nExperience of PDM /Bom structures is a plus.\nExperience Interviewing key stakeholders and facilitating workshops for identifying business needs and process/information modelling.\nExperience with Data modelling, Preferable with Power BI.\nSkills:\nExcellent analytical and documentation skills.\nExcellent in navigating and understanding complex digital ecosystems with multiple integrations.\nExcellent understanding of dependencies and interfaces between processes and solutions.\nA good understanding of agile development.\nExperience of creating features and user stories and acceptance criteria's/scenarios.\nLocation: Gothenburg, on site\n Please note! All CV’s must be in English.\nLanguages: English(Proficient)\nAssignment period: 17 Jan 2025- 30 Sep 2025\nApplication deadline:14 Jan 2025",
    "url": "https://careers.progalaxy.se/jobs/5423397-senior-it-business-analyst?promotion=1296237-arbetsformedlingen",
    "published": "2025-01-13T12:13:23",
    "deadline": "2025-07-02T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6073170731707317,
    "category": "IT"
  },
  {
    "id": "29753552",
    "title": "System Design Engineer - Traction Voltage System",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\r\n\r\nSystem Design Engineer - Traction Voltage System \nVolvo Group Trucks Technology – Electromobility is the global, strategic center for electric vehicle development within the Volvo Group. By 2040 the entire sales of Volvo Group vehicles shall be fossil free and already by 2030 the annual sales of Electric Trucks will be 100 000 vehicles. \nElectromobility is a key area for us to keep on being in the forefront of environmentally friendly transport solutions for a more sustainable tomorrow. We design a system where we provide world class solutions for AC and DC charging, distribute current to a powerful propulsion system as well as auxiliary loads and customer equipment. By doing so, we deliver end customer value for all Volvo business units such as trucks, buses, construction equipment and marine applications! \nOur group consists of highly skilled professionals with a background from power electronics / high voltage engineering, who share a passion for technology and developing products that make a difference for the Volvo Group’s customers and society. \nWould you like to be a part of our growing area, Then apply today! \n\nWhat will you do\n\nYou will work with the complexity of electrically connecting several components with different functionality and design on a voltage class B DC link, and all aspects that follow with it. Such as compatibility, requirement balancing, harmonizing HW design with system/vehicle functionality, and electrical safety. \nAdd to this: combinations with AC circuits and relation to voltage class A circuits to further extend the system complexity. A big part of the responsibility is to make a design aligned with regulations and standards such as UN R100, ADR, ISO 6469, ISO 17409, SAE J2910, IEC 61140, IEC 60664, etc. The design should also be cost-efficient and meet high performance requirements with quality over time. \n\nTypical tasks within the team \n  *  Write and release platform requirement specifications \n  *  Review component designs and deviation handling \n  *  Develop and maintain S-FMEA \n  *  Concept studies: e.g., fault protections, functionality SW vs. HW \n  *  Roadmap and platform development \n  *  Product knowledge management, i.e., product ownership over time: education, problem solving, verification and log data \n  *  Secure the Volvo product portfolio by participation in international standard committees \n  *  Develop Volvo internal standardization work \n\n\nAre we a match for you? \nWe believe that we create a competitive advantage by having a diverse team. It is the individuals in the team and our ability to cooperate that make the difference. Do you want to contribute to the future and be a part of our team? Apply Now! \nDue to summer vacations, all applications will be reviewed from the 21st of August. Please do not expect any communication earlier than this. \n\nKindly note that due to GDPR, we will not accept applications via mail. Please use our career site.\r\n\r\nWho are you? \n\nAs a System Design Engineer, you will drive changes on your own and in a team with other system designers. You are expected to take decisions based on facts and engineering judgements, but you also need to have strong communication skills and the ability to balance needs, follow up on different tasks and linking people together. You have a structured way of working where it is easy for other engineers to participate in the system and component design development. \n\nWe believe that to be successful, you will possess the following skills and competencies: \n  *  Master of Science in Electrical Engineering (preferably within the high voltage area) or similar work experience \n  *  Documented work experience from high voltage or voltage class B integrated power system design & development \n  *  Documented experience from working with functional safety in automotive products and applications \n  *  Experience from propulsion systems in battery electric vehicles \n  *  Experience from the development of high voltage or voltage class B power systems and components",
    "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43435599",
    "published": "2025-06-05T13:25:04",
    "deadline": "2025-06-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6048780487804878,
    "category": "IT"
  },
  {
    "id": "29729031",
    "title": "Senior System Engineer, System Engineer @ Design, Surveillance",
    "employer": "SAAB AB",
    "location": "Göteborg",
    "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll!\n\n \n\nDin roll\n\nSom Systemingenjör på Saab kommer du och ditt team vara involverade under hela produktens livscykel och vara en viktig pusselbit i vår resa mot nästa generations försvarssystem.\n\n \n\nSom systemingenjör har du en central roll i våra projekt, där du bidrar med ett helhetsperspektiv och får möjlighet att analysera och förstå kundens behov, kravhantera samt dokumentera tekniska specifikationer för att vägleda utvecklingsprocessen. Andra uppdrag inkluderar att ha tekniskt ansvar och vara ägare för ett system, samt analysera funktioner och prestanda. Du kommer att vara en viktig länk mellan kunder och utvecklare, och se till att systemet uppfyller höga kvalitetsstandarder.\n\n \n\nDu kommer att röra dig inom många teknikområden och dina kontaktytor inom företaget kommer att vara breda.\n\n \n\nDin profil\n\nFör att trivas hos oss tror du på en kultur av nyfikenhet, tillit och lagarbete. Vi tror att du har en kandidat- och/eller masterexamen inom ett tekniskt område, exempelvis teknisk fysik, datateknik, eller liknande. Det viktigaste däremot är att du delar vår passion för utveckling och ny spännande teknik!\n\n \n\nSom en del av vårt team kommer du att få möjlighet att arbeta med de senaste verktygen och teknologierna inom branschen. Vi ser att du har en stark teknisk nyfikenhet och ett öga för detaljer. Vi tror att du stimuleras av att förstå tekniskt komplexa lösningar, samtidigt som du trivs med den sociala kontakten. Erfarenhet och kunskap inom algoritmutveckling, produktutveckling och teknisk dokumentation kan vara fördelaktigt beroende på roll och inriktning.\n\n \n\nÄven kunskap och erfarenhet inom bland annat verktyg som; Doors, Matlab är meriterande. Vårt team är mångsidigt och vi tror på att olika perspektiv och erfarenheter kan bidra till att skapa ännu bättre lösningar. Så oavsett tidigare erfarenhet och arbetsbakgrund är du mer än välkommen att vara med och forma framtidens teknologi.\n\n \n\nDet är önskvärt att du har tidigare erfarenhet av utveckling av Radarsytem och god kunskap kring hur Saabs nuvarande Radarsystem är uppbyggda. Ett nätverk inom verksamheten och en övergripande förståelse för Surveillance produkt portfölj är också önskvärt\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nDet du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\n \n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 25,500 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här.",
    "url": "https://www.aplitrak.com/?adid=YW0uMDgwMTEuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
    "published": "2025-05-26T08:43:23",
    "deadline": "2025-06-16T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6048780487804878,
    "category": "IT"
  },
  {
    "id": "29753990",
    "title": "System Deisgn Engineer Electromobility",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nSenior System Design Engineer, Electromobility\n\nWhat you will do\nVolvo Group Electromobility is changing the automotive world, and we are now looking for those who want to be part of making this change happen in our industry! The Electromobility organization is responsible for the complete development of the lifecycle of our electric powertrains – from advanced engineering through product development into the maintenance phase. The function has a truly purpose-driven leadership and together we drive Electromobility transition based on cutting-edge engineering and state-of-the-art research within the Volvo Group. By joining us, you’ll be part of a global and diverse team of highly skilled professionals. We make our customers; the planet and our future generations win. At the Electromobility System Complete department, we are responsible for developing system solutions and balancing strategies for the complete Electric Propulsion Systems to be realized by hardware and software solutions.\n\nYour responsibilities will include requirement specifications, collecting and breakdown of requirements. Working together with technology teams and system teams to define the system design to meet the requirements. Balancing of the technical solution and support for verification. Involving in the technical decisions towards projects and design engineers, making sure that we continuously improve quality.\n\nWe value your data privacy and therefore do not accept applications via mail.\r\n\r\nWho are you?\nWe believe that to be successful in this position, you are a pragmatic team player who loves to develop system designs with the customer in focus. Managing the balance between securing a long-term platform and pragmatically solving the project needs. It is important that you are flexible and enjoy working in a changing environment. You have a broad knowledge and experience in Electric Powertrains both HW and SW domains and especially linked to control strategies for complex systems. Confident in leading system solutions towards product teams. We also believe that you feel comfortable owning and taking responsibility for your system and do so with a great attitude.\n\nRelevant Experience\n  *  Minimum 8 years of product development experience (preferably automotive, aerospace) whereof at least 3 years within Electric Propulsion Systems design work.\n  *  Ability to find solutions across domains on complicated topics.\n  *  · Experience in the development of High Voltage Systems, Low Voltage Systems, Charging, Motor Control Systems, Power Electronics Systems, and DCDC Systems is a merit.\n  *  Experience in defining and balancing requirements between stakeholders and technical solutions.\n  *  Experience in working with Requirement documentation tools like System Weaver, IBM DOORS, and Rhapsody is a merit.\n  *  Experience in working with the System, Software, and Verification team is a merit.\n  *  Masters degree in Mechatronics, Electrical or Mechanical Engineering, or similar.",
    "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43435764",
    "published": "2025-06-05T14:25:15",
    "deadline": "2025-06-19T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6048780487804878,
    "category": "IT"
  },
  {
    "id": "29753998",
    "title": "Experienced System Design Engineer, Electromobility",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\nExperienced System Design Engineer, Electromobility\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\nWhat you will do\nVolvo Group Electromobility is changing the automotive world, and we are now looking for those who want to be part of making this change happen in our industry! The Electromobility organization is responsible for the complete development of the lifecycle of our electric powertrains – from advanced engineering through product development into the maintenance phase. The function has a truly purpose-driven leadership and together we drive Electromobility transition based on cutting-edge engineering and state-of-the-art research within the Volvo Group. By joining us, you’ll be part of a global and diverse team of highly skilled professionals. We make our customers; the planet and our future generations win. At the Electromobility System Complete department, we are responsible for developing system solutions and balancing strategies for the complete Electric Propulsion Systems to be realized by hardware and software solutions.\n\nYour responsibilities will include requirement specifications, collecting and breakdown of requirements. Working together with technology teams and system teams to define the system design to meet the requirements. Balancing of the technical solution and support for verification. Involving in the technical decisions towards projects and design engineers, making sure that we continuously improve quality.\n\nWho are you?\nWe believe that to be successful in this position, you are a pragmatic team player who loves to develop system designs with the customer in focus. Managing the balance between securing a long-term platform and pragmatically solving the project needs. It is important that you are flexible and enjoy working in a changing environment. You have a broad knowledge and experience in Electric Powertrains both HW and SW domains and especially linked to control strategies for complex systems. Confident in leading system solutions towards product teams. We also believe that you feel comfortable owning and taking responsibility for your system and do so with a great attitude.\n\nRelevant Experience\n· Minimum 4 years of product development experience (preferably automotive, aerospace) whereof at least 3 years within Electric Propulsion Systems design work.\n· Ability to find solutions across domains on complicated topics.\n· Experience in the development of High Voltage Systems, Low Voltage Systems, Charging, Motor Control Systems, Power Electronics Systems, and DCDC Systems is a merit.\n· Experience in defining and balancing requirements between stakeholders and technical solutions.\n· Experience in working with Requirement documentation tools like System Weaver, IBM DOORS, and Rhapsody is a merit.\n· Experience in working with the System, Software, and Verification team is a merit.\n· Masters degree in Mechatronics, Electrical or Mechanical Engineering, or similar.\n\nWe value your data privacy and therefore do not accept applications via mail.\n\n\n\nWho we are and what we believe in \nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination. \n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, across the globe, our trucks, buses, engines, construction equipment, financial services, and solutions make modern life possible. We are almost 100,000 people empowered to shape the future landscape of efficient, safe and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents with sharp minds and passion across the group’s leading brands and entities. \n\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
    "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43435672",
    "published": "2025-06-05T14:25:14",
    "deadline": "2025-06-19T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6048780487804878,
    "category": "IT"
  },
  {
    "id": "29743646",
    "title": "Data Architect",
    "employer": "Ecareer AB",
    "location": null,
    "description": "Vill du ta din karriär till nästa nivå och arbeta tillsammans med fantastiska kollegor världen över? Vi söker nu en Data Architect med stark strategisk och teknisk kompetens för ett uppdrag till en av våra kunder. I denna ledande roll ansvarar du för att forma, driva och implementera vår domänarkitektur för data – i nära samarbete med verksamheten och andra tekniska funktioner.\nOm rollenDu kommer att ha en nyckelroll i att definiera och leda dataarkitekturstrategin för vår organisation. Rollen kombinerar strategiskt ledarskap med teknisk expertis inom Azure-miljöer och innebär ansvar för att säkerställa att vår dataarkitektur är skalbar, säker och anpassad till verksamhetens långsiktiga mål.\nAnsvarsområden Utveckla och implementera en domänarkitekturstrategi samt tillhörande riktlinjer och standarder.\n Definiera organisationens dataarkitektur i linje med affärsmål och tekniska principer.\n Utforma fysiska datamodeller i samarbete med informationsarkitekter.\n Säkerställa dataintegration från flera källor för att möjliggöra realtidsanalys och beslutsfattande.\n Implementera styrningsprocesser i samarbete med Data Governance & Management-teamet.\n Leda införandet av nya teknologier i samverkan med vår centrala plattformsorganisation.\n Driva migreringen av analyslösningar till den gemensamma Unified Data Platform.\n Agera mentor och förebild för arkitekter, dataingenjörer och modellutvecklare.\n Leda tvärfunktionella team och driva samsyn i dataarkitekturfrågor.\n  Skapa och underhålla leverantörsrelationer samt driva kontinuerliga förbättringsprogram.\n Kvalifikationer Universitetsexamen eller motsvarande arbetslivserfarenhet.\n Flera års erfarenhet som dataarkitekt, med djup kunskap i Azure-miljöer (ex. Azure Data Factory, Synapse, Databricks, Data Lake).\n Förmåga att designa skalbara end-to-end-lösningar i linje med enterprisearkitektur och branschstandarder.\n Erfarenhet av att arbeta med datamodellering, styrning och säkerhetskrav.\n Van att kommunicera professionellt på olika organisatoriska nivåer, inklusive ledningsgrupper.\n Strukturerad, faktabaserad och lösningsorienterad med hög social kompetens och tydlig kommunikationsstil.\n Flytande engelska i tal och skrift.\n Vi söker dig som är... Strategisk tänkare med förmåga att driva förändring.\n Proaktiv, nyfiken och bra på att bygga relationer i komplexa organisationer.\n En naturlig ledare som kan inspirera, coacha och skapa förtroende.\n En duktig pedagog med förmåga att anpassa budskap till olika målgrupper.\n \n\nÖvrig information Plats: Göteborg",
    "url": "https://jobb.ecareer.se/jobs/5999858-data-architect?promotion=1494994-arbetsformedlingen",
    "published": "2025-06-02T11:51:43",
    "deadline": "2025-07-02T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6048780487804878,
    "category": "IT"
  },
  {
    "id": "29680311",
    "title": "Software Engineer",
    "employer": "Software by QUOKKA AB",
    "location": "Göteborg",
    "description": "Software by Quokka AB is a subsidiary of Quokka AB, and part of Hans Andersson Group. Our company offers high-end software engineering services to enterprises within Automotive, Telecom, MedTech and Fintech. Moreover we offer an innovation hub for our employees. Within the group of over 30 companies we have vast experience from starting new companies and a genuine interest to invest in ideas and people we believe in. We know that our success is based on enabling the full potential of our employees – our most important asset! The basis for our culture is a strong employee focus. On top of this, we grow a culture based on three pillars: Joy, Curiosity and Innovation.\nWe are inspired by the Quokka – known for its curiosity and for being the happiest animal on the planet!\n \nWe are now looking for talented software engineers with experience and competence in Big Data & AI,  DevOps, Android/iOS, Fullstack Cloud and/or Embedded development. #jobbjustnu.\n \nWho are you?\nWe believe that you are curious, flexible, open-minded and eager to continuously improve your skills. You have an innovative, pragmatic, collaborative and creative mind-set of handling technical challenges. You enjoy team-work but at the same time you are able to work independently and drive development on your own. You have a positive attitude and the willingness and ability to take initiatives to progress and deliver.\nEducation\nMSc/BSc Computer Science or equivalent\nLanguages\nEnglish, professional level",
    "url": null,
    "published": "2025-05-06T11:40:54",
    "deadline": "2025-11-01T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6024390243902439,
    "category": "IT"
  },
  {
    "id": "29706895",
    "title": "System Design Engineer",
    "employer": "EGEMS AB",
    "location": "Göteborg",
    "description": "WHO ARE WE?\nEGEMS AB is founded in 2020 and a young company with full of energy with headquarters in Gothenburg, Sweden and support locations aiming to be established in Istanbul and Izmir, Turkey.\nThe focus is on providing consultancy and employment solutions with result oriented mindset in interim management, project & program management, production & quality management, system engineering, hardware, software development while understanding time, cost and quality balance within automotive, heavy vehicle, telecom, energy and multiple various industry areas.\n\n\nJOB DESCRIPTION\n\n\nWe are now looking for System Design Engineer that will play active role on cyber security risks and development of security requirements including monitoring and detection of cyber security attacks;\nSupport and drive Battery Management System different functions both hardware and Software\nFollow and implement upcoming Cyber ​​​​Security regulations (UNECE R155) and standards (ISO / SAE 21434 Road vehicles - Cybersecurity engineering)\nPerforming TARA analysis\nPast experiences in automotive are meritorious\nPast experiences in TargetLink, C / C ++, Embedded SW / HW, C / D, CAN, LIN, ISO 26262, J1939, Autosar, Systems Engineering, TARA is meritorious\n\n\n\nPlease submit your CV together with your application to candidate@egems.se, interviews are being held actively.",
    "url": null,
    "published": "2025-05-15T17:22:54",
    "deadline": "2025-06-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.6024390243902439,
    "category": "IT"
  }
]