[
    {
        "id": "30323280",
        "title": "Embeddedutvecklare med inriktning mot FPGA",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\n \n\nDin roll\n\nVälkommen till ett härligt korsfunktionellt team som har till uppdrag att leverera embeddedmjukvara för antenner i våra världsledande radarprodukter. Som embeddedutvecklare har du en central roll i utvecklingen av sensornära funktioner. Du följer produkten hela resan, från kravställning till verifiering och slutligen integrationen i ett helt radarsystem. \n\nVi söker personer med olika nivåer av erfarenhet till teamet och välkomnar ansökningar både från dig som är en senior embeddedutvecklare och kan bidra med din expertis, men också från dig som är junior och vill växa in i rollen.\n\n \n\nDin profil\n\nI rollen som embeddedutvecklare ser vi att du har relevant högskoleutbildning och några års erfarenhet av FPGA-utveckling (VHDL). Du har driv, teknikintresse och kan stärka vårt team genom att dela din kunskap. Vi ser också att du har god förmåga att uttrycka sig i såväl tal som skrift, både på svenska och engelska.\n\nDet är också meriterande om du har erfarenhet av:\n\n * C++\n * GIT, Jenkins, Artifactory\n * Arbete i agila team\n * Grundläggande kunskaper inom signalbehandling och/eller kommunikationsteori\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här",
        "url": "https://www.aplitrak.com/?adid=cy5zdmVuc3Nvbi4wNDg5Mi4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-12-01T13:29:03",
        "deadline": "2025-12-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235210",
        "title": "Erfaren systemutvecklare inom mjukvaruutveckling",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Syntronic är en ledande design- och utvecklingspartner inom avancerade tekniklösningar. \nVi är stolta över att vara i framkant av teknologisk innovation och söker nu en erfaren systemutvecklare inom mjukvaruutveckling till vårt team i Göteborg.\nSom systemutvecklare hos oss:\nKommer du att vara involverad i allt från design, programmering, testning och implementation av mjukvarulösningar. Du får möjlighet att arbeta med varierande uppdrag hos olika kunder. \nVi använder moderna programmeringsspråk och ramverk såsom C#, Java, Python, .NET, och vi värdesätter erfarenhet av både SQL-databaser. \nVad vi söker hos dig som systemutvecklare:\n Högskole- eller civilingenjörsutbildning inom mjukvaruutveckling, systemutveckling, IT eller liknande\n Minst 5 års erfarenhet av systemutveckling och mjukvaruutveckling, med djup kunskap inom något eller flera programmeringsspråk (t.ex. C#, Java, Python, .NET)\n Erfarenhet av agil utveckling, Scrum, eller liknande metoder\n Erfarenhet av molntjänster som AWS, Azure, eller Google Cloud är ett stort plus\n Kommunicerar flytande på svenska och engelska, i tal och skrift.\n \nVi letar inte efter en perfekt lista av kvalifikationer, utan efter rätt person som vill utvecklas tillsammans med oss och våra kunder. \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354308-erfaren-systemutvecklare-inom-mjukvaruutveckling?promotion=1703512-arbetsformedlingen",
        "published": "2025-11-07T08:21:53",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30335963",
        "title": "System Simulation Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.  \nPosition Description\nDevelop electrical simulation models by measuring in trucks. Sometimes adjusting models from suppliers, some times black-box models and for some components also modelling based on internal HW modelling.\nDevelop System Modeling, by combining multiple models, and exploring use of Test Cases that can be repeated rather than ’manual evaluation’.\nMeritorious to have:\nAs the person on the team performing most measurements in trucks, you are also supposed to be supportive and take CAN-logs etc needed for SW debugging, as majority of the Power Management engineers are located in Bangalore. So a supportive mindset is highly appreciated and Driving Licence, C, makes it easy for you to take trucks into various garages to measure indoors when applicable.\nEducation span: B.Sc. or M.Sc Electronics, Mechatronics or similar\nExperience span: 2-10y\nDriving Licence: C\nKey Skills: Electrical Simulation (Simulink/Simscape) and Electrical Measurements\nWe value your data privacy and therefore do not accept applications via mail. \nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": null,
        "published": "2025-12-03T20:16:30",
        "deadline": "2025-12-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307403",
        "title": "Experienced Software Engineer",
        "employer": "Burt Intelligence AB",
        "location": "Göteborg",
        "description": "Overview\nWe are expanding our Tech team and are looking for an experienced software engineer to join us. If you want to work with smart and ambitious people, international customers, large datasets and solve valuable problems in a small and efficient team; Burt is for you.\nYou \nYou are an experienced developer who enjoys solving real problems, understanding complex systems and getting things done. You’re comfortable exploring unfamiliar code and figuring things out independently, but also enjoy collaborating with others to move projects forward. We believe programming is a craftsmanship that can be applied across languages and platforms. You share that mindset and can pick up new technologies as needed. We primarily work with Git, Ruby, Python, Java, AWS, SQL, and TypeScript, but value your ability to learn and reason about systems more than experience with specific tools. You have a few years of experience building and maintaining software products and take pride in writing clean, reliable code. You’re pragmatic, curious, and motivated by making an impact rather than following strict processes. We’re looking for someone based close to Gothenburg. The position is semi-remote, with regular collaboration both online and in person.\nThe team\nWe are a small and efficient team, which means we can avoid bureaucracy and get things done. Everyone in the team matters and has a direct impact on our customers. We constantly strive to get better and value everyone's ideas. We are a result oriented team, promoting a culture where freedom and responsibility go hand in hand.\nThe role\nYou will work cross functionally with product, success, and sales solving our current customer needs and building out our solutions.\nYou will participate in maintaining and improving our ETL platform. Customer data is spread out over hundreds of different systems, in various formats, accessed in a variety of ways. Data is downloaded, aggregated, normalised and combined into a single source of truth.\nYou will also participate in building the many products we provide on top of the data. Reporting, anomaly detection and forecasting are a few examples of areas you might be involved in. \nAbout Burt\nBurt is a Software-as-a-Service (SaaS) company headquartered in New York, USA with our Tech team based in Gothenburg, Sweden. We have some of the world's largest media companies on our list of customers, including Paramount, Nexstar, Yahoo, Ziff Davis, Hearst, Tripadvisor, and Vox Media.\nOur core product empowers media ad sales and operations to make quick, confident decisions by giving our customers a single point of access to explore, analyze and share insights from their advertising business.",
        "url": "https://career.burtintelligence.com/jobs/6719235-experienced-software-engineer?promotion=1729918-arbetsformedlingen",
        "published": "2025-11-26T10:19:33",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307021",
        "title": "System Engineer for Automotive Android Platform",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to shape the foundation of next-generation in-vehicle experiences – and see your system engineering expertise come alive in real machines – this could be your next step. We’re looking for a System Engineer who enjoys working between hardware and software, defining system requirements, and helping teams build world-class infotainment and operator-interface solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems.\nYour roleAs a System Engineer, you will play an important role in defining and integrating complex infotainment systems. You’ll work where hardware, the Android platform and customer requirements meet, making sure everything fits together into a reliable, well-performing system.\nYou will define system architecture and technical requirements, coordinate integration across hardware and software, and support teams with system-level knowledge throughout the development process. You’ll work closely with developers, testers and customers to ensure high-quality, user-friendly solutions for marine and industrial applications.\nThis is a hands-on role where you will influence design, drive integration and turn technical requirements into production-ready systems.\nResponsibilities Define system architecture and technical requirements for infotainment ECUs and integrated systems based on customer and supplier needs\n Coordinate integration between hardware, the Android platform and middleware components\n Analyze and solve system-level issues across hardware and software\n Work closely with developers, testers and customers to secure high-quality, user-focused solutions\n Maintain system documentation and interface specifications\n Key qualifications Strong system thinking and the ability to understand complex technical setups\n Good understanding of infotainment systems and ECU architecture\n Experience with system-level design and integration in embedded environments\n Familiarity with Android/AOSP and Linux-based systems\n Knowledge of automotive communication protocols such as Ethernet, CAN and GMSL\n Ability to read logs, debug system-level issues and suggest solutions\n Fluent in English \n Who you are\nYou see complex systems as full of possibilities and enjoy working hands-on to understand how each part connects. You stay current in your field and willingly share your knowledge with others. You appreciate having responsibility from start to finish and are comfortable challenging assumptions to find smarter and more efficient solutions. With a solid understanding of both hardware and software, and how they interact, you bring clarity, solve problems and help turn ideas into reliable real-world systems.\nHow to applySubmit your application today and feel free to reach out to David Andersson at david.andersson2@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6831015-system-engineer-for-automotive-android-platform?promotion=1729748-arbetsformedlingen",
        "published": "2025-11-26T09:37:22",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307024",
        "title": "Software Architect/Lead Engineer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to shape the foundation of next-generation in-vehicle experiences – and see your architectural decisions come alive in real machines – this could be your next step. We’re looking for a Software Architect/Lead Engineer who thrives on bridging hardware and software, guiding technical direction, and enabling teams to build world-class infotainment and operator-interface solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems. \nYour roleAs a Software Architect/Lead Engineer, you will shape and develop the architecture of our Android-based infotainment and operator-interface platform. You’ll work at the intersection of hardware, the Linux kernel and Android/AOSP, ensuring that all layers integrate seamlessly into a stable, scalable and high-performing system.\nIn this role, you will support teams across hardware development, Android platform engineering, system engineering and validation. You will help them stay aligned, make informed technical decisions and integrate their work smoothly throughout the entire development process. A key responsibility will be to guide Android OS upgrade projects and ensure that our platform remains future-proof across different machine segments.\nThis is a hands-on architecture role where you will influence design choices, mentor teams and turn ideas into production-ready platforms used in marine and industrial applications.\nResponsibilities Define and maintain the overall software architecture for an advanced Android-based infotainment/operator-interface ECU\n Ensure robust integration between hardware drivers, Linux kernel, Android/AOSP frameworks and application layers\n Support technical discussions across cross-functional teams and help drive informed decision-making\n Lead architectural reviews and secure compliance with relevant industry and automotive standards\n Collaborate with system engineers, hardware teams and customers to align architecture with requirements and project goals\n Guide Android OS upgrade projects (e.g., Android 12  Android 14) with a focus on compatibility, scalability and long-term maintainability\n Promote knowledge sharing and mentor developers in architectural methods, design patterns and platform understanding\n Key qualifications Proven experience as a Software Architect or Lead Engineer in embedded or automotive-adjacent systems\n Deep understanding of Android/AOSP internals and Linux kernel architecture\n Strong knowledge of hardware interfaces and communication protocols common in construction, marine and commercial vehicle applications (GMSL, Ethernet, FPD-Link)\n Proficiency in Java, Kotlin and C/C++ (Python for tooling is a plus)\n Experience working with CI/CD pipelines and system-level integration\n Hands-on experience with Android OS upgrades, platform migrations or BSP work is highly desirable\n Excellent communication skills and ability to support cross-functional collaboration and technical leadership\n Fluent in English\n Who you are\nYou see complex system architecture as a field full of possibilities, and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen.\nHow to applySubmit your application today and feel free to reach out to David Andersson at david.andersson2@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6830735-software-architect-lead-engineer?promotion=1729743-arbetsformedlingen",
        "published": "2025-11-26T09:36:02",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30306504",
        "title": "Junior AI Systems Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Systems Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking Systems Engineers to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nBased in Gothenburg, we're a compact, high-caliber team evolving Entropia Universe, a long-standing MMO built around a real-cash economy. We care about end-to-end ownership, fast execution, and ego-free collaboration, and we're looking for someone who wants to build seriously, move quickly, and help define the future of MMO games.\nWe value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Junior AI Systems Engineer, you will:\nBuild and integrate intelligent systems into Entropia Universe\nWork with automation, AI, and agentic frameworks to create new in-game behaviors and tools\nHelp optimize our CI/CD and runtime pipelines for performance and quality\nContribute to core systems engineering (C++ and related infrastructure)\nUse AI heavily in your own workflow to move faster and smarter\nTake pride and ownership of your work all the way through to the end user\nThis is a general engineering role, not tied to a single fixed team.\nYou: \nMaster's degree in Computer Science or a similar field, with strong grades preferred\nHuge interest in AI is crucial: you follow new models, tools, and trends and ideally build with them in your spare time\nComfortable with C++ 20; Python is a strong plus.\nStrong interest in:\nAI and agentic frameworks\nSystems engineering and creating great games\nAutomation and building intelligent systems\nProblem solving\nDatabases (SQL and NoSQL) and data-intensive systems\nBasic networking concepts and distributed systems\nContainerization and tooling such as Docker\nPassion for games and how AI can change the video game industry\nLow ego, end-to-end ownership, clear communication.\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field\nA few years of experience within the field\nCreative thinker with a passion for games and a drive to innovate within the gaming space\nProficiency in C++\nProficiency in Python is a strong plus\nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks\nKnowledge of game development principles and methodologies\nProblem-solving and communication skills\nBeing flexible and able to work with a larger technical ecosystem.\n\nWhy Join Mindark: \nWork on a live, large-scale MMO with a real-cash economy\nWork with cutting-edge systems and AI tooling that are still rare in the MMO space\nHigh-impact role in a small, focused team\nCompetitive compensation and plenty of room to grow in the new era of AI\nStrong support and mentorship from highly talented colleagues.\n\nThe opportunities are endless.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: Gothenburg, Sweden (hybrid, ~2 days/week in office)",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-11-26T09:09:10",
        "deadline": "2026-03-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30286983",
        "title": "Junior Software Developer",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:\nToday we stand at the forefront of agile software development, using methods like Lean and Scrum to create a product that excels. Early customer and stakeholder feedback is a key element in our development process which is based on Continuous Integration SW practices. Our product, tools and infrastructure places high technical requirements on the team, including high-performance application development, low latency requirements, multi-threaded/multi-process troubleshooting, and embedded system development in an environment with huge amounts of data.\n\nIn the role of Junior Software Developer, you will get the opportunity to work closely with your Product Owner and stakeholders in a collaborative environment, requiring both maturity and a strong ‘team first’ approach. Here, we embrace a culture of collective responsibility, ensuring that all tasks are completed according to the established backlog priority.  To expand our organization’s capacity, we are looking for ambitious, intelligent, creative and inspiring individuals who are in the early stage of their career. We provide a dynamic, fun and challenging environment where you can grow and help to inspire your colleagues to further growth. With us, you’ll be joining a small cross-functional development team working with feature development.  \n\nWhat you will do:\nThe team will design, implement and test the feature, product and system from requirements to production and commercial deployment. Each team has life cycle responsibility for a part of the product. Among other things, Unit/Component Test, Refactoring and Continuous Delivery are defining concepts and we are constantly improving our ways of working. We are not perfect and not afraid to say so. We are on a journey, and we know we have many problems to solve, and we need to learn new things on the way. We believe in trying new things connected to, e.g:\n  *  Software Craftsmanship\n  *  Analyze requirements and propose a software design\n  *  Analyze verification needs and develop test cases validating your design\n  *  Develop test case automation Execute tests, troubleshoot, and correct faults found\n  *  Reserved time for improvements and innovations, Hackathons\n  *  Knowledge sharing from external channels \n\n\nThe skills you bring:\n  *  MSc level in Computer Science or the equivalent level of knowledge\n  *  0 - 2 years of related experience in SW development\n  *  Fluent in English, written and oral\n  *  Skills in software development, preferably using Erlang, python or other functional language\n\n\nMeritorious qualifications:\n  *  Experience from verification, troubleshoot and debug software issues to ensure optimal performance\n  *  Experience of agile development and the Scrum framework.\nKnowledge of Git, Gerrit, Jenkins, HTTP2, TCP/IP, Linux, Containers\n\n\n\nThe characteristics we hope to see in you: We are looking for a person who enjoys working with software and product development in an environment driven by close collaboration. We work together to reach and even exceed our goals and continuously strive to improve ourselves and our output. We believe that you with your structured and disciplined approach, are not just ready to learn but eager to tackle complex challenges and redefine the boundaries of innovation alongside your team. You can communicate in a clear and effective way. With a focus on solutions, you bring a can-do attitude to challenges, working well both independently and with the team.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43794090",
        "published": "2025-11-20T11:25:02",
        "deadline": "2025-12-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30285768",
        "title": "Join Our Team as a SW Engineer",
        "employer": "FPT Software Sverige AB",
        "location": "Göteborg",
        "description": "About the Role\nWe are seeking a highly motivated and skilled Automotive Software Engineer to join our engineering team. In this role, you will be responsible for the full software development lifecycle of embedded systems for automotive applications, from requirement analysis through to qualification testing. You will collaborate closely with cross-functional teams and work independently to deliver high-quality software components.\nKey Responsibilities\n·      Analyze software and hardware requirements for automotive embedded systems.\n·      Design system architecture, detailed modules, and software interfaces.\n·      Develop, test, and integrate embedded software, including hardware drivers and bootloaders.\n·      Conduct unit testing, integration testing, and qualification testing in compliance with automotive standards.\n·      Collaborate with cross-functional teams to support system bring-up and debugging.\n·      Document design specifications and test procedures.\n·      Work efficiently both independently and as part of a collaborative team.\nWhat You'll Bring\n·      3+ years of experience in automotive embedded systems development.\n·      Proficient in C/C++ programming; scripting experience in Python, Shell, or Perl.\n·      Strong understanding of microcontrollers, device drivers, and embedded systems.\n·      Hands-on experience with bootloaders, cross compilers, and toolchains.\n·      Familiarity with software development lifecycle and working with hardware manuals, schematics, and data sheets.\n·      Practical experience with automotive communication protocols: SPI, CAN, LIN, FlexRay, Ethernet.\n·      Experience with debugging tools, simulators, emulators, and test equipment.\n·      Team player with excellent self-management and communication skills.\nNice to Have\n·      Experience with AUTOSAR Classic Platform development.\n·      Familiarity with AUTOSAR Configuration Tools (e.g., DaVinci, ECU Spectrum).\n·      Understanding of Functional Safety concepts (ISO 26262).\n·      Experience with multi-threaded and multitasking systems.\n·      Knowledge of Automotive SPICE or CMMI frameworks.\nBenefits & Perks:\n·      Competitive salary and performance-based bonuses.\n·      Health, dental, and vision insurance.\n·      Flexible work hours and remote work options.\n·      Learning and development opportunities\n.      Work with a talented and passionate team in a collaborative environment.",
        "url": null,
        "published": "2025-11-20T08:55:20",
        "deadline": "2025-12-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30219739",
        "title": "Senior DevOps Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "We are looking for an experienced DevOps engineer who wants to enhance security and performance through reliable and scalable solutions.\nYou will work closely with architects and engineers to run applications and services on AWS, build and maintain integrations in our CI/CD ecosystem, and support product teams in effectively utilizing the platform. You will also identify bottlenecks, drive improvements, and shape how we deliver critical services at enterprise scale.\n\nAbout You\nYou are a customer-focused DevOps engineer with a strong background in AWS and modern CI/CD practices. You enjoy simplifying complex problems, thrive in collaborative environments, and take ownership of solutions from design to delivery.\n\nRequirements:\n- 7+ years of experience with AWS cloud architecture and operations\n- Solid background in CI/CD pipelines, automation, and monitoring\n- Hands-on experience with containerization and Kubernetes\n- Knowledge of Infrastructure as Code (Terraform, CloudFormation, CDK, or similar)\n- Good understanding of secure and reliable system design\n- Fluent English, spoken and written \n\nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
        "url": "https://career.explipro.com/jobs/6361033-senior-devops-engineer?promotion=1697451-arbetsformedlingen",
        "published": "2025-11-03T17:12:02",
        "deadline": "2025-12-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30309554",
        "title": "Software Developer",
        "employer": "Alten Sverige AB",
        "location": "Göteborg",
        "description": "We are looking for a Software Developer with strong experience in Model-Based Development for an advanced R&D assignment within the automotive industry. You will work on developing core functionalities for next-generation vehicle platforms, using Simulink and AUTOSAR-compliant workflows.\n\n \n\nYour profile\nA degree in Mechatronics, Electrical, Computer or Automotive Engineering\nAt least 3 years of experience in model-based software development within the automotive domain\nExcellent knowledge of MATLAB / Simulink, Stateflow, and Embedded Coder\nDeep understanding of AUTOSAR architecture, including SW-Cs, RTE interfaces and BSW integration\nExperience generating production-ready AUTOSAR-compliant code from Simulink models\nFamiliarity with Simulink libraries, custom blocks and S-Functions\nAbility to design modular, reusable and scalable software components\nA structured, analytical and collaborative way of working\nMeritorious experience includes functional safety (ISO 26262), CI/CD integration for MBD, and performance optimization of Simulink models.\n\r\n\nWhat you will do\n\nAs a Model-Based Software Developer, you will be responsible for designing and implementing Simulink models that enable functional growth in the vehicle’s core computing system.\n\n \n\nTasks include:\nDeveloping new features in Simulink / Stateflow aligned with AUTOSAR standards\nDesigning and structuring application-layer software components (SW-Cs)\nConfiguring and generating AUTOSAR-compliant C-code using Embedded Coder\nEnsuring traceability from requirements to model design\nPerforming peer reviews and continuous model improvements\nSupporting integration by delivering well-structured, verified models\n\n \n\nDeliveries\nSimulink models aligned with AUTOSAR architecture and development guidelines\nModular and reusable design ensuring scalability and maintainability\nVerified and production-ready generated code through Embedded Coder\nDocumentation according to project standards and model review results",
        "url": "https://www.alten.se/career/15214-Software-Developer",
        "published": "2025-11-26T15:02:25",
        "deadline": "2025-12-25T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235250",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1703519-arbetsformedlingen",
        "published": "2025-11-07T08:26:13",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30235236",
        "title": "Senior mjukvaruutvecklare till Syntronic i Göteborg",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på teamet med ännu fler seniora mjukvaruutvecklare! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker seniora mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som senior mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Minst 5 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera flytande på både svenska och engelska, i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Syntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt.  \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 8 december. Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/6354252-senior-mjukvaruutvecklare-till-syntronic-i-goteborg?promotion=1703515-arbetsformedlingen",
        "published": "2025-11-07T08:23:02",
        "deadline": "2025-12-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30289631",
        "title": "Mjukvaruutvecklare till avancerade sensorsystem",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nHos oss bidrar du till att skapa trygghet för människor och samhällen - på riktigt. Här utvecklar du teknik som gör skillnad, i ett team där kunskap, innovation och samarbete står i centrum.\n\nDin roll\n\nSom mjukvaruutvecklare blir du en del av ett engagerat team som utvecklar programvara för signalbehandling och radarstyrning i avancerade sensorsystem för flygande plattformar.\n\nDu kommer att arbeta i en agil utvecklingsmiljö med stort utrymme för teknisk utveckling och personligt ansvar. Här får du möjligheten att påverka hela utvecklingskedjan - från idé till färdig lösning.\n\nDin profil\n\nVi söker dig som vill växa tillsammans med oss och bidra med både teknisk kompetens och drivkraft. Vi tror att du har:\n\n* Högskole- eller civilingenjörsexamen inom datateknik, elektroteknik, teknisk fysik eller motsvarande.\n\n* Goda programmeringskunskaper i exempelvis C++, C eller Java.\n\n* Starka matematiska färdigheter, gärna med erfarenhet av signalbehandling eller tracking.\n\n* Förmåga att arbeta i team men också kan arbeta självständigt och ta initiativ.\n\n* God kommunikativ och social förmåga - du gillar att samarbeta och dela kunskap.\n\nDet är meriterande om du har erfarenhet av agila arbetssätt och ett genuint intresse för teknik och problemlösning.\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n Vad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här",
        "url": "https://www.aplitrak.com/?adid=YS5vYmVyZy42Nzk1OC4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-11-20T17:20:03",
        "deadline": "2025-12-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30333490",
        "title": "Software Configuration and Release Manager",
        "employer": "Danda AB",
        "location": "Göteborg",
        "description": "We are looking for a skilled and proactive Software Configuration and Release Manager to join our core software platforms, a centre of excellence teams, developing the next generation products solutions with cutting edge technology within the automotive domain.\nThis position plays a key role in managing the end-to-end software integration, configuration, and release process for our core systems central physical ECU, which integrates three logical ECU stacks: Linux and Adaptive AUTOSAR deployed onto service-oriented SoC, and the Classic AUTOSAR onto signal-oriented SoC.\nBeneath service-oriented platforms, a QNX Host OS is deployed on top of hypervised HW resources. At the base, we run our boot software and HW near software components and configurations.\nAs part of our software delivery organization, you will work closely with domain architects, system engineers, software developers, and test teams to ensure stable, documented, traceable, and repeatable software builds and releases across different variants and platforms.\nWho are we?\nThe mission of Software Platforms within Computational Software Infrastructure (CSI) is to provide best in class embedded software platform & technologies, that enable’s software-driven transport solutions for Volvo. We believe in “Software-Defined Everything” and strive to be in the forefront. We foster teamwork and collaboration with continuous improvement mind-set.\nWe are responsible for the complete life cycle, from strategy to maintenance of the on-board SW platforms.\nWho are you?\nYou are a structured, detail-oriented engineer who thrives in complex embedded software environments. You understand the importance of consistency, traceability, and automation in the software development lifecycle, and you are driven by building reliable release pipelines and configuration baselines. You enjoy working collaboratively in cross-functional teams, and you take ownership of processes that ensure quality and compliance in every software release.\nYou’re aware of multi-layered software stacks and understand the nuances of integrating software components across Boot Software, Hypervisor, Software Download and Deployment orchestration, Linux, Adaptive AUTOSAR, Classic AUTOSAR platforms in safety-critical systems.\nYou are an Experienced Software Leader with a passion for automotive software development and baseline management and a deep understanding of dependencies between people and diligence, when it comes to time tracking and revision management. Your expertise lies in software configuration and CI/CD development, and you have a track record of successfully designing and implementing software solutions for automotive ECUs.\nYou thrive in a collaborative environment where you can improve development teams, by monitoring and drive regression testing, and govern bug fixes, and create and maintain the department release baseline. You will be a person that takes pride in proper release documentation and being an interface for information sharing of what content different software releases support.\nYour strong analytical and problem-solving skills enable you to make critical decisions and drive collaboration with other trains, to align time plans, and branch outs. software platform development processes.\nResponsibilities:\n Own and manage the software configuration and release management process for the core central ECU, consisting of Linux, Adaptive AUTOSAR, and Classic AUTOSAR logical ECUs.\n Define and maintain software versioning schemes, configuration baselines, and release strategies.\n Drive automation in build, integration, and packaging processes using industry-standard CI/CD tools.\n Coordinate and manage software branching, merging, and integration strategies across multiple software domains and suppliers.\n Ensure traceability of all software artifacts in accordance with automotive safety and cybersecurity standards (e.g., ASPICE, ISO 26262, ISO/SAE 21434).\n Maintain and manage configuration management tools (e.g., Git, GitLab, Jenkins, Artifactory).\n Ensure proper tagging, documentation, and release notes for all software deliveries.\n Facilitate regular release readiness reviews with cross-functional teams.\n Troubleshoot and resolve build/integration issues together with development and system teams.\n Collaborate with Product Owners and Product Managers to align release schedules with program milestones and vehicle development timelines.\n \nRequirements\n Bachelor’s or Master’s degree in Software Engineering, Computer Science, Electrical Engineering, or related field.\n 5+ years of experience in software configuration and release management within the automotive or embedded systems domain.\n Solid experience with Linux, Adaptive AUTOSAR, and Classic AUTOSAR software stacks.\n Deep understanding of Git-based workflows, CI/CD pipelines, and software version control principles.\n Hands-on experience with tools like Jenkins, Artifactory, GitLab, Bitbucket, and Yocto (preferred).\n Strong grasp of embedded build systems and toolchains for cross-compilation.\n Familiarity with ASPICE, ISO 26262, and software compliance requirements in the automotive industry.\n Excellent communication and organizational skills, with the ability to collaborate effectively across international and interdisciplinary teams.\n Experience working in agile software development environments.",
        "url": "https://jobb.danda.se/jobs/6875171-software-configuration-and-release-manager?promotion=1739752-arbetsformedlingen",
        "published": "2025-12-03T11:46:52",
        "deadline": "2026-05-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30312056",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-11-27T10:17:25",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307060",
        "title": "Android Platform Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to build the Android platform foundation for next-generation infotainment systems – and see your work run in real machines – this could be your next step. We’re looking for an Android Platform Developer who brings more than just coding skills. At CPAC Systems, we know that your background, interests and experiences shape how you solve problems – and that mix is what drives innovation here. When you approach challenges from new angles, you help us find smarter solutions that make life easier for our customers.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems.\nYour roleAs an Android Platform Developer, you will work on platform-level components that power modern automotive infotainment systems. You’ll contribute to Android system services, frameworks and platform features, ensuring performance, reliability and smooth integration across hardware and application layers.\nIn this role, you will implement new platform functionality in Java/Kotlin, integrate native C++ components, participate in design and code reviews, and support CI/CD pipelines. You will collaborate closely with customer projects and cross-functional engineering teams, contributing to both feature development and long-term platform evolution.\nYou will also be a key part of Android OS upgrade projects, making sure platform components migrate cleanly between versions and remain compatible with automotive hardware, APIs and system constraints.\nThis is a hands-on development role for someone who enjoys digging into AOSP internals, solving complex problems and shaping the backbone of the entire Android system.\nWhat you will do• Develop and maintain Android platform components for automotive infotainment • Implement features using Java/Kotlin and integrate with native C++ layers • Drive development of assigned Android platform work packages • Perform design and code reviews for platform components • Support CI/CD pipelines using Jenkins and maintain clear documentation • Collaborate closely with customer projects and cross-functional engineering teams • Lead or contribute to Android OS upgrade projects, securing compatibility with hardware and applications\nKey qualifications• Strong experience in Android and AOSP platform development • Proficiency in Java and Kotlin (C++ for native integration is a plus) • Familiarity with Python for scripting and automation • Experience with Jenkins and CI/CD workflows • Knowledge of automotive infotainment systems and hybrid development environments • Proven experience with Android version upgrades, API changes, platform migrations and validation in automotive or embedded settings • Fluency in English, written and spoken\nWho you areYou see complex systems as full of possibilities and enjoy working hands-on to understand how each part connects. You stay current in your field and willingly share your knowledge with others. You appreciate having responsibility from start to finish and are comfortable challenging assumptions to find smarter and more efficient solutions. With a solid understanding of both hardware and software, and how they interact, you bring clarity, solve problems and help turn ideas into reliable real-world systems.\nHow to applySubmit your application today and feel free to reach out to R&D Manager David Andersson at david.andersson2@cpacsystems.se if you have any questions regarding the job.",
        "url": "https://careers.cpacsystems.se/jobs/6832158-android-platform-developer?promotion=1729765-arbetsformedlingen",
        "published": "2025-11-26T09:40:42",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307030",
        "title": "Automotive Platform Software Engineer - Linux/Drivers/Android",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to work close to the hardware and help build the technical foundation for next-generation infotainment systems, this could be your next step. We’re looking for a Platform Software Engineer who enjoys deep technical problem-solving, low-level programming and making hardware and software work seamlessly together inside complex ECUs.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. With 250 employees, a portfolio of 50 patents and more than 500,000 delivered products per year, we drive innovation in everything from electrification to intelligent automation, always working at the intersection of safety, efficiency and user experience. As part of Volvo Group, our role is to lead advanced technology development and explore the next generation of smart control systems.\nYour roleAs a Platform Software Engineer you will focus on hardware integration and foundational software development for our Android-based infotainment ECUs. You will work hands-on with kernel components, device drivers and hardware interfaces such as GMSL, Automotive Ethernet and FPD-Link, ensuring reliable, stable and high-performing systems.\nIn this role, you will collaborate closely with system architects to define the hardware–software interaction layer, participate in design and code reviews, and contribute to the long-term maintainability and quality of low-level components. You will also support Android OS upgrade projects by securing driver compatibility and hardware stability across versions.\nThis is a role for someone who enjoys solving complex technical challenges, digging into kernel internals and building the solid foundation that the entire system depends on.\nResponsibilities Integrate and maintain automotive infotainment hardware such as GMSL, Automotive Ethernet and FPD-Link\n Develop and maintain Linux kernel components and device drivers\n Collaborate with system architects on hardware–software interface design\n Ensure maintainability, robustness and code quality for low-level components\n Participate in design and code reviews for hardware-related modules\n Maintain technical documentation for hardware and kernel layers\n Support Android OS upgrade projects and ensure driver stability and hardware compatibility\n Key qualifications Strong experience with automotive hardware solutions and communication protocols\n Solid experience in Linux kernel development and device driver programming\n Proficiency in C/C++ (Python for tooling is a bonus)\n Good understanding of embedded systems and ECU architecture\n Fluency in English, both written and spoken\n It’s a plus if you also bring Familiarity with Qualcomm CPUs\n Experience supporting Android platform upgrades or adapting hardware drivers for new Android versions\n Who you are\nYou enjoy working close to the hardware and are driven by understanding systems at their deepest levels. Solving complex technical problems motivates you, and you like digging into kernel behavior, driver interactions and hardware interfaces to find the root cause. You stay up to date with new tools and technologies, and you readily share your insights with others. You take ownership of your work, care about code quality and stability, and are comfortable challenging assumptions to create smarter, more robust low-level solutions. With a strong understanding of both hardware and software, you help ensure that every layer works together as a reliable and well-engineered system.\nHow to applySubmit your application today and feel free to reach out to David Andersson at david.andersson2@cpacsystems.se if you have any questions regarding the job.",
        "url": "https://careers.cpacsystems.se/jobs/6831471-automotive-platform-software-engineer-linux-drivers-android?promotion=1729760-arbetsformedlingen",
        "published": "2025-11-26T09:40:02",
        "deadline": "2026-05-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30301311",
        "title": "Software Engineer",
        "employer": "CELLINK Bioprinting AB",
        "location": "Göteborg",
        "description": "At Cellink, we Create the Future of Health by leveraging the power of 3D cell culture through award-winning 3D bioprinters and carefully sourced biomaterials and bioinks.\n\n\nAbout the role\nA Software Engineer develops and optimizes the communication layers that enable secure, real-time data exchange between embedded systems, high-level applications, and bio fabrication hardware. The role includes integrating embedded Linux, C++, Python, and CI/CD pipelines to ensure reliable and high-performance system behavior. They collaborate closely with firmware, hardware, and other teams to achieve seamless system interoperability and support the advancement of next-generation 3D Bio printing technology.\n\n\n\n\nResponsibilities and Duties\nDevelop and debug software across the entire product range, from low-level drivers and firmware interfaces to high-level application and service layers. Ensure smooth integration and functionality between embedded systems, middleware, and user-facing applications.\nDesign, build, and maintain middleware layers that enable robust, real-time communication between hardware components and cloud or desktop applications, ensuring compliance with cybersecurity, data integrity, and regulatory requirements.\nBuild and maintain automated test systems and simulation environments to validate middleware behavior, detect regressions, and ensure consistent code quality across software versions.\nMaintain clear and accurate documentation for both new and existing middleware components, including architecture diagrams, communication protocols and integration guides.\nTroubleshoot and resolve complex issues related to data synchronization, performance bottlenecks, memory usage, and system-level bugs, working closely with cross-functional teams.\nCollaborate with hardware engineers, firmware developers, and application developers to ensure seamless system interoperability.\nParticipate in code reviews, technical design discussions, and architecture planning to continuously enhance the scalability and maintainability of the codebase.\nAdvocate for best practices in software development, including version control, code reuse, modularity, and testability.\n\n\n\n\n\nQualifications\nBachelor's or Master’s degree in Computer Science, Software Engineering, or a related field.\nCertifications in relevant technologies (e.g., AWS Certified Developer, Microsoft Azure Developer) are a plus.\nApproximately 3 years of industry experience in software or systems engineering, with at least 2 years focused on systems integration.\nExperience working in high-performance environments involving hardware-software interactions, such as robotics or medical devices.\n\n\n\nCandidates should have strong embedded software development experience for resource-constrained and real-time systems. Proficiency in C++ is required, with knowledge of at least one additional language, preferably Python. Experience with Marlin or other 3D-printing firmware, as well as slicer software, is a strong advantage.\n\n\nThe role spans the full software stack, including low-level drivers, communication protocols, service layers, and desktop or embedded UIs. Familiarity with Qt is beneficial.\n\n\nExperience with CI/CD pipelines using tools like Jenkins is expected, along with developing test systems and writing unit, integration, and regression tests for both simulated and hardware environments. Knowledge of secure boot, certificate-based authentication, and secure key storage is valuable. Expertise with over-the-air update solutions such as Mender and custom Linux builds using Yocto is highly beneficial.\n\n\nAs we also believe, having a strong attention to detail and a quality-driven mindset is essential for achieving high standards and effectively overcoming challenges. Equally important are excellent communication skills, creative thinking, and the ability to solve problems analytically with a structured approach to tasks.\n\n\n\n\nPractical conditions\nThis role primarily requires onsite presence, with remote work allowed only as needed and with manager approval.\nFlexibility to adjust work hours for collaboration across multiple time zones, including periods that may exceed the standard work week.\n\n\n\n\n\nEqual Employment Opportunity Statement\nBICO is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other characteristic protected by law.\n\n\nCellink a part of BICO GROUP\nBICO is a lab automation partner and provider of selected workflows to pharma and biotech.\nWith 46,000+ instruments installed in over 65 countries, BICO products, software, and solutions are found in more than 3,500 laboratories, including the world’s top 20 pharmaceutical companies, and have been cited in over 12,000 publications.\nOperating through two business areas – Lab Automation and Life Science Solutions – BICO strive towards the vision to enable and automate the life science lab of the future.\nBICO is listed on Mid-Cap, Nasdaq Stockholm under BICO.",
        "url": null,
        "published": "2025-11-25T07:00:25",
        "deadline": "2025-12-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30300547",
        "title": "Senior Software Engineer till Profundus",
        "employer": "Bravura Sverige AB",
        "location": "Göteborg",
        "description": "Looking to shape the future of MedTech? Join Profundus and drive innovation while ensuring quality in life-changing healthcare solutions! Profundus is a medical device company on an exciting journey to revolutionize retinal imaging with cutting-edge technology. \n\nAbout the job\nThis is a direct recruitment, which means that the recruitment process takes place through Bravura and you are employed directly by Profundus.  About the company\n Profundus is a life science start-up specializing in the development of a groundbreaking camera and software system for advanced retinal imaging, utilizing adaptive optics. The primary mission is to enable early detection, prevention, and treatment of various diseases by identifying changes in retinal microstructures. With a strong vision to make a significant impact in retinal imaging diagnostics, the goal is to benefit patients worldwide. \nThe company is located in modern, spacious offices at Krokslätts Fabriker, where the team works closely together in a collaborative environment. The production facilities are also on-site, ensuring seamless interaction between development and manufacturing. \nTasks and responsibilities\nAs a Senior Software Engineer, you will be maintaining and improving a highly specialized medical device used in advanced imaging applications. Your focus will be on product care and improvements, ensuring stability and adapting the software to integrate with customer systems. Beyond technical execution, you’ll help shape workflows, maintain high standards, and prepare for future innovation as the company moves toward developing new products.\nIn this role, you will work in an agile, cross-functional R&D setup alongside passionate and purpose-driven colleagues. You will collaborate closely with hardware engineers and contribute to processes and documentation in line with regulatory requirements. This means working strategically and without prestige, ensuring compliance and quality at every step.\nYou will be part of a small, dynamic team where your ideas and decisions will contribute to the company’s success. \n \nEducation, experience and personal characteristics\n• Master’s degree in engineering within relevant field\n• Experience with Python development\n• Experience working with software that interacts with a physical product\n• Experience of software verification and validation\n• Experience from working in a regulated industry according to a Quality Management System, for example ISO 13485\n• Fluent in English, written and spoken. Swedish is a bonus\nWe are looking for someone with a proactive, solution-oriented mindset who takes pride in delivering high quality value-adding work. You are comfortable planning and executing tasks independently while ensuring transparency and clarity for the team.\nYou thrive in a small, dynamic environment where adaptability and collaboration are key. While you work autonomously, you also value knowledge sharing and contribute to a positive, team-oriented culture.\nDriven and target-oriented, you approach challenges with curiosity and initiative. You actively seek improvements, share insights, and help move both the team and the product forward. \nIts a plus if you have\n• Experience in Medical device development as well as software development according to IEC 62304 \n• Cybersecurity relating to medical devices\n• Experience with C/C++ development\nOther information\nStart: Upon agreement\nLocation: Gothenburg\nSalary: Upon agreement \nWe use a competency-based methodology in all our recruitment processes to ensure impartial selection. We also work with continuous selection, which means that we take down the advertisement when enough candidates have applied. If you are suitable for the position, we will contact you for an initial telephone interview.\nRegardless of whether you proceed in the process or not, you will receive feedback on your application.\nDo you have any questions? Please get in touch!\n info@bravura.se\n 010-171 47 10\nWe recommend that you submit your application immediately as we make a continuous selection.\nWelcome with your application! #Brillante",
        "url": "https://ledigajobb.bravura.se/jobs/6813178-senior-software-engineer-till-profundus?promotion=1726918-arbetsformedlingen",
        "published": "2025-11-24T16:19:54",
        "deadline": "2026-05-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30299484",
        "title": "Embedded Systems Engineer",
        "employer": "EcoPhi AB",
        "location": "Göteborg",
        "description": "Ecophi is digitializing the electrical grid. Our QMU 800 is a high-precision, software-defined merging unit used in modern digital substations. We’re looking for a hands-on engineer who loves low-level embedded programming, board bring-up, and working side-by-side with hardware to ship robust, real-time systems.\nWhat you’ll do\nDevelop and optimize low-level firmware in C (bare-metal/RTOS) for data-acquisition, time-sync, and high-speed I/O on QMU 800.\nWrite device drivers (SPI, I²C, UART, Ethernet), DMA/ring buffers, and ISR-driven data paths for high-resolution ADCs.\nImplement and harden substation protocols/time sync (e.g., IEC 61850 Sampled Values/GOOSE, PTP/IEEE 1588); contribute to PQ/PMU features.\nBoard bring-up & hardware validation: read schematics, probe signals, characterize performance with scopes/logic analyzers.\nCollaborate with hardware on Altium Designer projects; review schematics/PCB layouts; suggest SI/PI-aware changes and test points.\nBuild automated tests, HW-in-the-loop rigs, calibration flows; contribute to CI and coding standards.\n\nMust-haves\nSolid experience with embedded C for microcontrollers/SoCs (interrupts, timers, peripherals, memory, concurrency);\nComfortable with low-level debugging: oscilloscopes, logic analyzers, JTAG/SWD, power measurements;\nVery comfortable working in linux environments;\nStrong grasp of data acquisition basics: ADCs, sampling theory, filtering, fixed- vs floating-point trade-offs;\nGit-based workflows and disciplined engineering habits (reviews, documentation, reproducible builds).\n\nNice-to-haves\nFPGA experience (VHDL/Verilog);\nAltium Designer familiarity and the ability to read/modify schematics & PCB designs (basic layout understanding);\nEMC/robustness for industrial gear (IEC 60255/61850-3), secure boot/DFU, factory test fixtures\nPython for test automation; CMake; static analysis.\n\nWhy EcoPhi\nEcophi is a startup located in Gothenburg, founded by researchers at Chalmers University of technology. We have a deep technical core and strive to deliver solutions that are best in the industry.\nBuild cutting edge technological products used by leading utilities to modernize the grid;\nHardware lab with proper tools, real field feedback, and fast iteration;\nCompetitive pay, stock options, flexible work, and big ownership over your domain.\n\n\n\nHow to apply: Send your CV/LinkedIn, transcript and a short note about a low-level project you’re proud of (what you optimized, how you measured it) to jakob@ecophi.ai with the subject “Embedded Engineer — QMU800”.",
        "url": null,
        "published": "2025-11-24T14:30:30",
        "deadline": "2025-12-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30282246",
        "title": "Software Engineer",
        "employer": "Einride AB",
        "location": "Göteborg",
        "description": "Want to be part of transforming road freight – for good? Einride is showing the world a new way to move, based on the latest digital, electric and autonomous technologies. Through freight capacity as a service, we enable businesses around the world to accelerate towards their sustainability goals.\nFounded in 2016, Einride became the first company in the world to deploy a cab-less autonomous electric vehicle on a public road (Sweden, 2019). In 2022, we were the first to successfully operate such a vehicle on a US public road. Today our award-winning technology has been launched across 8 countries (and counting). Our clients are some of the world’s biggest shippers, including Fortune 500 companies. We are also operating Sweden’s largest truck dedicated public charging network and counting.\nWe are looking for a Software Engineer specialized in multi-modal perception systems for autonomous driving applications. The ideal candidate has strong software engineering skills and experience in designing, developing and transitioning R&D solutions into final products.\nYou will:\nResearch and develop state-of-the-art perception algorithms for autonomous vehicles to advance our perception stack.\nImplement solutions for multi-modal sensor fusion, 3D object detection, segmentation, tracking in complex dynamic environments, sensor degradation, and other safety-critical systems.\nIntegrate, validate, and deploy production-ready solutions.\nCollaborate closely with experts from System Engineering, Localization, Planning, and other teams to build a safe, deployable system.\n\n\n\nWe expect you to have:\nStrong technical background: PhD or highly qualified MS in one of the following: Robotics, Computer Science, Artificial Intelligence, Mathematics, or a related field.\n3-5+ years research or industry experience in one or more of the following: Perception, Sensor Fusion, Computer Vision, SLAM, Calibration.\nStrong foundation in linear algebra, data structures, algorithm design, and complexity analysis.\nExperience in C/C++ and Python, and strong problem-solving skills. You are passionate about solving real-world robotics challenges in the context of autonomous driving.\n\n\n\nThis is a full-time position based in Stockholm or Gothenburg. You will be part of a truly diverse, high performing team with a common passion for sustainability and making things happen in an innovative way. We recommend that you submit your application as soon as possible since selection and interviews are held continually.\nAt Einride, we are innovators, building solutions the world has never seen before – but urgently needs. That’s why we take action, and it’s why we are always eager to be challenged. We know that our best innovations come from having a diverse mix of people, including those of different experiences, career paths, and walks of life. By coming together and sharing our perspectives openly – by disagreeing, discussing, and committing – we deliver greater impact.\nPlease note that as part of our standard recruitment process, we conduct a background control on the final candidate for this role. This may include verification of education, employment history, any relevant professional certifications or other information that may be of our interest.\nBorn autonomous. Born electric.\nSince 2016, our technology has connected global communities with the things they need – and all without the emissions. We’re made up of experts in multiple fields and that’s how we’ve developed a new way to move goods. This is technology purpose-built for the industry. This is safer, cleaner, and more reliable movement.\nWe are Einride and this is how we build a better future.",
        "url": "https://emp.jobylon.com/jobs/290140-einride-senior-perception-engineer/",
        "published": "2025-11-19T11:18:00",
        "deadline": "2025-12-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30215604",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-11-03T10:06:55",
        "deadline": "2025-12-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-12-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30330877",
        "title": "BI-utvecklare, Umeå eller Göteborg",
        "employer": "PostNord Sverige AB",
        "location": "Göteborg",
        "description": "Vill du vara med och driva utvecklingen av framtidens People Analytics på PostNord Sverige? PostNord står mitt i en spännande transformation där data, analys och AI-tillämpningar är avgörande för att skapa värde för både medarbetare och verksamhet. Som BI-utvecklare inom HR Shared Service Center (HR SSC) får du en nyckelroll i att utveckla och framtidssäkra våra lösningar för People Analytics. \n\nGrunderna är satta, men mycket återstår att göra – här får du chansen att påverka och skapa nästa generations BI-stöd för HR och hela PostNord. Med nyligen uppgraderade HR-system och en modern analysplattform får du en unik möjlighet att utveckla BI-lösningar som lyfter HR-förmågan till nya nivåer. Du blir en del av ett engagerat team på cirka 50 personer i Umeå och Göteborg, som tillsammans stöttar över 17 000 medarbetare och chefer.\n\nVad du kommer att göra \n\nUtveckla vår förmåga inom People analytics genom att:\n\n - Ansvara för att utveckla och implementera BI-lösningar som stödjer HR-funktionens och övriga affärsenheters behov av HR-data\n - Tillsammans med vår HR-analytiker bidrar du starkt till att utveckla lösningar som tillgängliggör HR-data och insikter inom PostNord\n - Utforska och implementera AI-tillämpningar inom BI och analys för att skapa framtidens analysstöd\nVerksamhetsnära BI-utveckling:\n\n - Underhålla, förbättra och utveckla nya semantiska modeller och rapporter i nära samråd med HR-specialister, IT, HR-analytiker och verksamheten\n - Utveckla avancerade datamodeller och användarvänliga visualiseringar i Power BI för att leverera insiktsfulla rapporter och analyser som möjliggör datadrivna beslut inom HR-området\n - Effektivisera dataflöden samt kravställa integrationer från nya datakällor och datamodeller till kollegor inom IT\r\nVem du är\n\n - Proaktiv och initiativrik – du har en stark drivkraft till att driva förbättringar och har ett väl utvecklat självledarskap.\n - Samarbetsorienterad och prestigelös – du bygger nätverk och trivs i tvärfunktionella team.\n - Nyfiken på ny teknik – du håller dig uppdaterad och vill ligga i framkant inom BI och AI.\n - Analytisk och lösningsorienterad – du ser möjligheter i data och har förmåga att omsätta insikter till affärsvärde.\n - Kommunikativ – du kan förklara komplexa datakoncept på ett pedagogiskt sätt till olika målgrupper.\n - Vi lägger stor vikt vid dina personliga egenskaper\nVad du tar med dig Vi ser gärna att du har erfarenhet av en liknande roll inom analytics och flerårig erfarenhet av BI-utveckling i Power BI inklusive:\n\n - God förståelse för ETL-processer, integrationer och kravställning av datalager\n - Kunskap om att optimera prestandan för Power BI-lösningar, inklusive datamodellering, rapportdesign och DAX-beräkningar\n - Intresse eller erfarenhet av AI-tillämpningar inom BI och analys, t.ex. prediktiv analys, automatisering eller generativ AI\n - Erfarenhet av SQL\n - Vana från att arbeta med verksamhetsnära utveckling för att stödja affärsstrategi och beslutsfattande\n - Att ha arbetat inom eller gentemot HR-området är en fördel\n - Relevant högskoleutbildning inom BI, datavetenskap, systemutveckling eller motsvarande\n - Mycket goda kunskaper i svenska och engelska i tal och skrift\nVälkommen med din ansökan Vi gör ett urval av kandidater löpande, så vänta inte med att skicka din ansökan. Undrar du något över tjänsten? Mejla till susanna.aronson@postnord.com. Vi ser fram emot att höra från dig!\n\nFör fackliga kontaktpersoner se Fackliga kontakter.\n\nDygnet runt är vi på väg – från en människa till en annan, från ett företag till ett annat. Varje dag levererar vi över 4,5 miljoner brev och 600 000 paket. Varje försändelse är viktig – post, paket och logistik möjliggör relationer och affärer. Här får du vara med och påverka!\n\nPostNord är den ledande leverantören av paket- och logistiktjänster till, från och inom Norden. Vi är över 26 500 medarbetare och som en av Nordens största arbetsgivare tar vi ett stort socialt ansvar. Vi erbjuder en attraktiv och utvecklande arbetsplats där medarbetarna kan växa och trivas. Hos oss får du schyssta arbetsvillkor enligt kollektivavtal, tjänstepension, friskvårdsbidrag och andra förmåner via vår egen personalstiftelse PostNord Plus. Vi prioriterar både våra kunder och våra medarbetare där vi tror att utvecklings- och karriärmöjligheter är grunden för att vara en attraktiv arbetsplats för anställda och helhetsleverantör för våra kunder. \n\nVi leder branschen in i den koldioxidsnåla ekonomin, med målet att bli fossilfria till 2030. Vi arbetar kontinuerligt med att minska vår miljöpåverkan genom att investera i fossilfria transporter och utveckla hållbara lösningar för våra kunder och medarbetare. Med vår expertis och vårt unika distributionsnät utvecklar vi förutsättningar för framtidens kommunikation och handel.",
        "url": "https://emp.jobylon.com/applications/jobs/324174/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-12-02T16:44:12",
        "deadline": "2025-12-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30334850",
        "title": "Project Manager – Video, Printed & Digital Materials",
        "employer": "Zinzino Operations AB",
        "location": "Göteborg",
        "description": "Zinzino is a global direct sales company from Scandinavia specializing in test-based, personalized nutrition and scientific skincare. It is a public limited company with its shares listed on Nasdaq First North Premier Growth Market. Their scientifically proven nutritional supplements are available on more than 100 markets across the world. Zinzino owns the Norwegian research and production units BioActive Foods AS and Faun Pharma AS. The company headquarters is in Gothenburg, Sweden with additional offices in Europe, Asia, the US and Australia.\r\n\r\nDo you thrive at the intersection of creativity, structure, and global brand execution?\n\nZinzino, one of the world’s fastest-growing direct-sales companies in personalized nutrition, is looking for a highly organized Project Manager – Video, Printed & Digital Materials to join our Global Marketing team.\n\nIn this role, you will be part of an international, high-performing group committed to delivering meaningful communication to our customers and distributors worldwide. You will drive the production and localization of high-quality content for our 100+ markets. From video adaptation and AI-driven content workflows to printed sales assets and digital presentations, you will be the orchestrator ensuring that all materials are polished, consistent, and ready for 25+ international markets.\n\nAt Zinzino, we believe in empowering people to take charge of their health. Every message we share and every story we tell is part of that mission. This is a unique opportunity to shape how a global preventative health and wellness brand communicates across languages, cultures, and digital platforms.\n\nIf you have a passion for creating clarity, quality, and consistency across languages and channels, this is your opportunity to make a difference.\n\nWhat You Will Do\n\nCreate Local Relevance at Global Scale\n\n• Lead the localization of all videos, digital, and printed materials in 25+ languages.\n• Ensure every market receives content that feels polished, trustworthy, and culturally relevant.\n• Work closely with our in-house design and content production teams, as well as external partners.\n\nBring Our Brand Stories to Life Through Video\n\n• Project-lead new video productions from concept to global delivery.\n• Coordinate timelines, resources, and suppliers - ensuring a smooth production journey for everyone involved.\n• Deliver the English master and all localized versions on time for launches and campaigns.\n\nElevate Our Digital & Printed Assets\n\n• Manage updates to global presentations, toolkits, and digital materials.\n• Oversee the production of brochures, flyers, roll-ups, and printed marketing assets.\n• Ensure all materials reflect our brand, our science, and our commitment to quality.\n\nStrengthen Our Asset Ecosystem\n\n• Upload and maintain videos, presentations, and printed materials in our digital asset systems.\n• Act as the main contact for our DAM provider, ensuring the platform evolves with our needs.\n• Support our global community with accurate, accessible, up-to-date materials.\n\nWho You Are\n\nYou are calm, structured, and solution-oriented—even when juggling multiple deadlines. You love working across cultures and time zones, and you have a natural ability to keep people aligned and projects moving forward.\n\n• A structured, solution-oriented project manager with 5+ years of experience in multi-language content production, ideally from an advertising, media, or translation agency.\n• Skilled in using AI tools for content adaptation (voice-over, subtitles, localization workflows).\n• A natural coordinator with strong communication, stakeholder-management abilities and a “we can solve this” attitude..\n• Comfortable juggling multiple deadlines with precision and calm.\n• Fluent in English and Swedish; additional languages are a plus.\n• Skilled in MS Office and Acrobat; experience with InDesign or Photoshop is an advantage.\n• Passionate about global brand building—and excited to contribute to Zinzino’s mission to inspire healthier lifestyles worldwide. \n\nMost importantly: you care about delivering meaningful, high-quality work that helps people live healthier lives.\n\nWhy Zinzino?\n\nAt Zinzino, you’ll be part of a dynamic global marketing team shaping the future of personalized nutrition. We combine cutting-edge science with heart-driven entrepreneurship, operating in more than 100 markets. Here, your work will make a visible impact on a fast-growing brand and an engaged international community.\n\nJoin Our Mission\n\nIf you want to help us inspire the world to live healthier and more balanced lives, we’d love to hear from you.\n\nInterviews will take place on an ongoing basis and the position may be filled before the application deadline, so don’t wait, send your application already today!",
        "url": "https://career.zinzino.com/jobs/305357-project-manager-video-printed-and-digital-materials?ref=platsbanken",
        "published": "2025-12-03T15:19:12",
        "deadline": "2026-01-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30319799",
        "title": "Delivery Manager/Project Manager at Kognic",
        "employer": "Kognic AB",
        "location": "Göteborg",
        "description": "Kognic helps car manufacturers & suppliers develop self-driving vehicles. Our software merges and visualizes sensor data from vehicles that is analyzed and labeled by people, turning raw data into valuable input for autonomous machines. We are on an exciting path towards profitability and are actively building marketing momentum as we achieve product-market-distribution fit across our target markets. That's why we need you!\nThe role\nWe are seeking a Delivery Manager/Project Manager to coordinate customer projects and ensure Kognic delivers high-quality annotation on time and with a high level of service. You'll work with customers, internal stakeholders, and suppliers: setting goals, communicating progress, and building relationships.\nYou will primarily work with automotive customers at the forefront of autonomous driving and Physical AI model development. Together with the account team, you will play a crucial role in ensuring high-quality training data for these models.\nYou'll own project success by meeting deadlines and staying within budget. You'll collaboratively identify and solve problems early, ensuring our suppliers deliver what customers need on time. Your work directly impacts customer relationships and experience of working closely together with Kognic, meaning you will have an impact on our success and future growth. You, alongside the team, will work to enhance efficiency and actively share ideas, contributing to Kognics' ongoing evolution.\nWe are looking for you!We think you tick off most of the following items:\n At least a Bachelor's degree in a technical discipline and/or project management\n At least 5 years of Project management experience or equivalent, including driving supplier and customer management\n Solid collaboration skills and proven experience in leading, motivating, and aligning competing demands - internally and externally.\n Meritorious: having experience working in the tech or automotive industry\n \nWe're looking for someone who is excited by:\n Guiding and coordinating our suppliers to secure workforce capacity, timelines, and performance.\n Resolving risks and challenges with confidence, keeping momentum across all project phases.\n Communicating progress with clarity, delivering meaningful updates to both internal and external stakeholders.\n Why Kognic?\nWe are in it to win, and have a lot of fun while doing it! To be part of Kognic is to be part of a purpose-driven company with strong values where we, together, create what Kognic will be tomorrow. Besides working with around 100 talented and humble people from many different nationalities, in a fun and creative environment, we also have many other great benefits!\n Working in the exciting field of AI and playing an important part in the world’s next great technological leap\n A hybrid work model and an employer that prioritises life-work balance\n Lots of team and office events, parental pay, salary exchange, great health benefits, order your own computer, place your own pension - to name a few\n \nFrom our early days as a pure start-up to our current life as a scale-up, we work in a dynamic environment, which means that every day might be different from the next, but that is exactly how we want it. Kognicians all have a strong desire to explore uncharted territory and a willingness to constantly be learning.\nJoin us\nWe recommend that you submit your application as soon as possible since we select and perform interviews continuously. We do not require any cover letter but ask you to share your resume and answer a couple of questions in the application\nYou are more than welcome to have a look at our career website to read more about our recruiting process. If you have any questions regarding the position, please contact our Hiring Manager, Per Kvillsjö (per.kvillsjo@kognic.com) \n--\nAbout Kognic\nKognic was conceived in the curious minds of Daniel Langkilde and Oscar Petersson, two engineering students, who dared to dream big and help machines make sense of our messy, chaotic, and unstructured world. Kognic's pioneering dataset management solution helps companies accelerate the development of high-performing and trusted AI products, focusing on bringing the most advanced driver-assistance systems (ADAS) and autonomous driving (AD) to market.",
        "url": "https://careers.kognic.com/jobs/6858046-delivery-manager-project-manager-at-kognic?promotion=1734714-arbetsformedlingen",
        "published": "2025-11-28T17:44:03",
        "deadline": "2026-05-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30307897",
        "title": "Automation Engineer to Rebl Industries",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Rebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us here https://www.rebl.industries/\r\n\r\nAre you an automation engineer who loves robotics, thrives in hands-on problem solving and wants to help scale the next generation of AI-powered automation? \n\nJoin the team that’s redefining industrial automation\nRebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us here https://www.rebl.industries/\n\nWhat you will do\nAs an Automation Engineer at Rebl, you turn cutting-edge technology into reliable automation. You’ll build and integrate control systems, tune robot performance, test and validate installations, as well as ensure our solutions run smoothly in demanding operational environments. You’ll collaborate closely with mechanical, electrical and software engineers – from early concepts to deployment and continuous improvement as systems scale across customer sites.\n\nWhat we’re looking for\n\n• Post-secondary education in Automation, Mechatronics, Robotics, or a related engineering field (university degree or vocational/technical school)\n• Minimum 5 years of professional experience in automation, mechatronics or similar engineering roles\n• Proven experience designing, implementing and commissioning automation systems in real-world environments\n• Strong PLC programming skills (Siemens TIA Portal preferred) and hands-on control system knowledge\n• Experience integrating sensors, actuators and mechatronic components into cohesive systems\n• Proficiency in Python for automation, data communication, or system integration\n• Familiarity with CAD and simulation tools to support mechanical and system design\n• Ability to troubleshoot complex systems, optimize performance, and ensure reliable operation in production\n• A proactive problem-solving mentality with the ability to work independently and drive projects forward\n\nYour mindset\nYou’re pragmatic, curious and energized by solving real-world automation challenges. You move fluidly between design, implementation and hands-on testing. You take ownership, communicate clearly and enjoy collaborating across disciplines. You thrive in a scaling environment where speed matters, structure evolves and every engineer has real influence. Most importantly, you want to build things that work – in production, at scale, with measurable impact.\n\nWhy Rebl Industries\nAt Rebl Industries, you join a sharp, driven and supportive team where your work has immediate effect. You help define the future of robotic automation — not in theory, but in real industrial use. Your ideas shape both the product and the company as we scale to new markets and new levels of performance.\n\nApply now!\nIn this recruitment process Rebl Industries collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Talent Advisor Nadine Gneiser at +46 731-489 899 or nadine.gneiser@mpyascitech.com. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=305014&ref=platsbanken",
        "published": "2025-11-26T11:14:33",
        "deadline": "2025-12-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30304374",
        "title": "Solution Architect & Digital Product Manager BI/Analytics & Automation",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Who we are\nVolvo Autonomous Solutions (V.A.S.) is the business area within Volvo Group that accelerates the development, commercialization, and sales of autonomous solutions. The vision for Volvo Group is to be the most desired and successful transport and infrastructure solution provider in the world. We don’t sell trucks and machines: we operate the solutions through the full life cycle to maximize the improvements achievable through autonomy. \n \nThat goes hand in hand with our long-term ambitions: 100% Safe, 100% Fossil free and 100% more productive. The automation of our vehicles is seen as a natural step towards reaching that goal. Joining the Volvo Group means contributing to a large global company that is transforming itself towards these ambitions. We are committed to diversity and inclusion, fostering a team culture where differences are seen as a steppingstone to better results.\n \nHow we work\nThe Digital & IT team empowers V.A.S. to scale up by designing a modern, cloud-first IT landscape that maximizes synergies with Volvo Group. We take a holistic approach—balancing ambitious strategies with hands-on implementation—to ensure our tools and integrations work seamlessly together. Security and data are at the core of everything we do, with a zero-trust mindset and a strong focus on making data one of our most valuable assets.\n \nWe optimize where V.A.S. is unique and aligns with Volvo Group where it makes sense, adopting a multi-platform data strategy. This means using Microsoft Fabric for transport company-related analytics and Volvo Group’s platform (UDP) for other analyses. Our DPM BI/Analytics role is key to getting the most value from each platform, including ownership of MS Fabric, and collaborating closely with our Technology organization to leverage vehicle-centric data from sensors and other sources.\n \nWith a greenfield approach, we have the opportunity to embed high levels of automation into our processes, driving efficiency and reducing manual work as we grow. By combining advanced analytics, automation tools like Power Automate, AI agents, and API orchestration, we’re building a highly integrated, data-driven environment.\n \nBecause data and automation are so closely linked, we’re now bringing them together under one DPM, managing both end-to-end to unlock new insights and enable smarter, faster decisions across V.A.S.\n \nWho are you?\nWhile we haven’t met you yet, we picture you as a versatile professional—a connector and influencer who thrives in complex ecosystems. You bring a holistic perspective to Digital & IT, with broad expertise across solution architecture and BI/Analytics, spanning multiple domains and technologies.\n \nYou’re comfortable navigating the entire data value chain, from source systems to business insights, and you’re fluent in APIs, integration, orchestration, and automation. Embracing AI is second nature to you, and you’ve likely delivered real-world AI use cases.\n \nWe’re looking for someone who is both a strategic thinker and a hands-on doer—someone who can plan for the future but isn’t afraid to roll up their sleeves when needed. Your curiosity, adaptability, and can-do attitude mean you’re always ready to learn and take on new challenges. You communicate with ease, whether you’re engaging with C-suite leaders or collaborating with developers, architects, and analysts.\n \nAbove all, you’re a true generalist with a specialist’s depth—a “jack of all trades” who can bridge gaps across roles and disciplines. Your background might include experience as a solution architect, data platform owner, data scientist, data architect, hyper automation architect, or technical project manager, supported by a relevant university degree or equivalent professional experience.\n \nResponsibilities:\nAs a Solution Architect and DPM for BI/Analytics & Automation, you will play a pivotal role in shaping a modern, scalable, and efficient IT landscape that supports our transformation into an autonomous Transport-as-a-Service provider. You will work at the intersection of technology, data, and business—designing architectural solutions and leading digital product development that unlocks data-driven insights and automation opportunities.\n \nYou will be responsible for managing architecture roadmaps within your domain, ensuring alignment with V.A.S. target architecture and compliance with functional, non-functional, and security requirements. Acting as the end-to-end responsible architect, you will support architectural governance and guide ongoing projects with expert advice on implementation, configuration, and integration.\n \nIn parallel, you will lead the vision, strategy, and development of our Business Intelligence, Analytics, and Automation platforms. This includes championing modern technologies such as cloud-based data lakes, real-time analytics, and scalable automation tools. You will collaborate closely with executive leadership and business stakeholders to understand their data and automation needs, translating them into actionable solutions that deliver measurable business value.\n \nKey responsibilities include:\nActing as a translator between business needs and technical solutions, ensuring clarity and alignment.\nDesigning and evolving the organization’s data and automation platforms, fostering innovation and scalability.\nPartnering with stakeholders to identify high-value opportunities and articulate the business impact of key design choices.\nBuilding and leading a high-performing team of developers, data engineers, analysts, and data scientists.\nDriving a culture of continuous learning, innovation, and performance through data and automation.\n\n \nQualifications\nBachelor’s or Master’s degree in Business, Data Science, Computer Science, or related field.\n5+ years’ experience as a product owner, product manager, or similar role in BI, analytics, or data-driven environments or in hyper automation.\nExcellent communication, stakeholder management, and leadership abilities; skilled at influencing decision-makers and collaborating across teams.\nDemonstrated ability to translate business requirements into high-impact digital products.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=25040&company=volvoinfor&st=EFD78530443E46D099F3B1EC0DEA0A101C2B8622",
        "published": "2025-11-25T14:10:15",
        "deadline": "2025-12-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30096280",
        "title": "Data Warehouse Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "About Us\nEtraveli Group is the globally leading company for tech solutions and fulfilment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travellers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nDo you want to be part of the next step in our growth journey?\nAt Etraveli Group we use a lot of data for decision making processes, analysis and machine learning. Users of the data can be found in different departments like Finance, Customer Service, Sales, Data Science and Research. In alignment with our growing targets we are looking for experienced data engineers to become part of our Data Solutions team to get more data into our data lakehouse platform and prepare it in order to be used by the users. \nWho You Are\nWith the right skill set and motivation you will be setting up, maintaining and evolving our data warehouse solution as well as participating in driving a large portion of our future data engineering.\nIn this primarily technical role, there will be close interaction with database administrators and operations’ engineers, but there will also be collaboration with stakeholders from other parts of our organization (e.g data analysts, business intelligence teams and business stakeholders). The data sources we use are located both in cloud environments as well as on-prem. Working with us means you'll have access to a team of highly competent professionals and ample resources to foster your personal and professional growth. We face the challenges of the day working for a company that goes the extra mile to ensure that we have fun at, and outside, the office. \nRequirements\nTo thrive and succeed in this role we believe that you have:\nA strong interest in maintain and evolve our data warehouse solution\nAbility to analyze and take on tasks, both individually and together with others\nAbility to design and implement tasks from scratch, individually gathering the necessary information where needed\nStrong foundation in data warehousing concepts and data modeling (e.g., Star and Snowflake Schemas, Incremental Loads, Slowly Changing Dimensions)\nPrevious experience working with data processing and distributed query engines, like Spark, Dremio/Trino, Databricks\nPrevious experience working as a data engineer, with different ETL (e.g., dbt, Airflow) and CDC tools (e.g., Debezium, Flink CDC, Kafka Connect)\nPrevious experience working with multiple scripting languages, like Bash, Python, SQL, etc\n\nIt is also desirable that your skills match one or more of the following:\nPrevious experience to ensure high-performance data processing with techniques like indexing, partitioning, and caching.\nPrevious experience working with data integrations\nPrevious experience working with data modelling for efficient query performance, data quality and optimization\nPrevious experience working as a database administrator\nComfortable working with Linux, Docker, and preferably also Kubernetes\nExperience with data lakehouse table formats like Apache Iceberg or Delta Lake, enabling features like ACID transactions and time-travel on object storage\n\nBenefits\nAt Etraveli Technology, you will be part of a gang of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard.\nEtraveli Group is a company that really wants to contribute to you reaching your full potential.\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\nWe love gaming and after work activities.\nWe know the value of personal development and continuous training.\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\nWellness allowance - Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities.\nThrough partners, we offer comprehensive pension and health insurance so that you can quickly get help if the accident occurs.\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\nAnd we serve breakfast every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/206B865709/apply",
        "published": "2025-10-02T09:24:25",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]