[
    {
        "id": "29931022",
        "title": "Software Developer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n \nWho are we? \nVolvo Autonomous Solutions (VAS) is the business area within Volvo Group that accelerates the development, commercialization, and sales of autonomous solutions. The vision for Volvo Group is to be the most desired and successful transport and infrastructure solution provider in the world. We don’t sell trucks and machines: we operate the solutions through the full life cycle to maximize the improvements achievable through autonomy.\n \nThat goes hand in hand with our long-term ambitions: 100% Safe, 100% Fossil free and 100% more productive. The automation of our vehicles is seen as a natural step towards reaching that goal. Joining the Volvo Group means contributing to a large global company that is transforming itself towards these ambitions. We are committed to diversity and inclusion, fostering a team culture where differences are seen as a stepping-stone to better results.\n \nWe are now looking for innovative, committed individuals to join us in our endeavor to create customer solutions that enhance safety, flexibility and productivity.\n \nThe Vehicle Control and Motion Models team, part of the V.A.S. Technology organization, is responsible for developing core functionalities and providing simulation models for various applications, including autonomous customer solutions. Our work spans the entire product lifecycle—from early specification and development to maintenance and quality assurance during customer operations.\n \nWe collaborate closely with colleagues at Group Trucks Technology (GTT) and Volvo Construction Equipment (VCE) to ensure base vehicle and machine readiness. Once prepared, we develop and integrate onboard autonomous driving systems, ensuring that vehicles and machines operate safely and efficiently under autonomous control.\n \nThis is a view of the products that we work on: https://www.youtube.com/watch?v=T-TOCGC6Uuc \n \nPosition description \nImagine a future where trucks and machines are driving around without a physical operator in the cab. Normal operation is completely autonomous, and vehicles are stopping automatically for electrical charging. Everything is under surveillance from a central control tower, where operators can teleoperate vehicles based on video feedback when needed. This will change people’s daily work environment and eliminate dangerous work conditions. \nSounds fantastic, doesn’t it? You now have the chance to join our team and make this a reality!\n\n\nAs a Software Developer in the V.A.S. Technology Vehicle team, you will be responsible for developing core functionalities for both trucks and machines. In this role, you will collaborate closely with Volvo’s product companies, including GTT and VCE. You'll also have the opportunity to work hands-on with vehicles and machines. Most of our development is done using C programming.\n\n\nYou can look forward to an inspiring journey alongside enthusiastic and skilled colleagues across the Volvo Group organization. If you enjoy working with new technology and strive to continuously improve ways of working, you’ll feel right at home. We also value a strong team spirit and look forward to your contribution in fostering a positive and collaborative environment.\n\n\nQualifications\nYou will have the opportunity to work with different cultures cross functionally, with internal as well as external stakeholders and therefore we see that you have good interpersonal and communication skills. Being fluent in English, spoken and written, is also important to succeed in this position. Other requirements that we also see as beneficiary but not limited to for the role are:\n \nExperience in embedded Software development\nExperience from setting up test strategies and automate test as part of release process for embedded software system\nExperience from Interface communication such as CAN, Ethernet, DDS, UDS\nExperience within the automotive industry\n\n \nWhat's in it for you?\nAt Volvo Autonomous Solutions, you'll be part of a pioneering team shaping the future of autonomous transport. You’ll work with cutting-edge technology, collaborate with industry experts, and have hands-on opportunities to develop innovative solutions. We offer a dynamic and inclusive work environment, continuous learning, and the chance to make a real impact in transforming mobility. Join us and drive the future of autonomy!",
        "url": null,
        "published": "2025-08-20T16:31:55",
        "deadline": "2025-09-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29909554",
        "title": "Associate Principal AI Data Scientist",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you a driven Data Scientist with a robust foundation in traditional data science methods and a passion for Agentic AI, and human-in-the-loop (HITL) multi-agent systems? If so, an exciting opportunity awaits you at AstraZeneca! \n\n \n\nWe are looking for Associate Principal AI Data Scientists eager to utilize their expertise in these advanced technologies to revolutionise our drug development processes. In the Pharmaceutical Technology and Development (PT&D) department, you will be a key player in transforming molecules into groundbreaking medical treatments. PT&D leads the charge in developing cutting-edge synthetic routes, drug formulations and delivery technologies, ensuring our products are effective, safe, and of the highest quality. \n\n \n\nYour role involves contributing data science expertise into cross functional global pharmaceutical development projects in support of transforming the way we deliver medicines to patients. You'll play a pivotal role in shaping our AI strategy and driving the co-development of sophisticated HITL multi-agent systems. \n\nThis is an individual contributor role and will be based at our dynamic sites in Gothenburg (Sweden) or Macclesfield (UK). \n\n \n\nAccountabilities: \n\n * \n\nDrive innovation in agentic AI, multi-agent systems, and digital twins, exploring new methodologies and applications. \n\n * \n\nDesign, implement, and optimize algorithms for autonomous decision-making, coordination, and policy learning among agents and digital twins. \n\n * \n\nEvaluate agent performance in the context of decision making, collaboration, competition, uncertainty. \n\n * \n\nDrive machine learning initiatives focused on applications within drug development projects. \n\n * \n\nCollaborate with cross-functional teams ensuring knowledge transfer to IT engineering teams for IT solution builds and deployment. \n\n * \n\nKeep pace with industry advancements by reviewing academic papers and attending conferences. Publish findings in peer-reviewed journals and represent the company at scientific forums. \n\n * \n\nCommunicate technical concepts and results to technical and non-technical audiences. \n\n \n\nEssential skills/Experience: \n\n * \n\nAdvanced degree in computer science, data science, artificial intelligence, machine learning or related fields. \n\n * \n\nExcellent coding skills in languages such as Python, R. \n\n * \n\nHands-on industrial experience designing multi-agent patterns, digital twins and experience with agentic AI design patterns, reinforcement learning. \n\n * \n\nExtensive industrial experience with AI and ML frameworks like TensorFlow, PyTorch, \n\n * \n\nHands-on experience with GenAI orchestration frameworks such as LangGraph, CrewAI. \n\n * \n\nHands-on industrial experience with applied machine learning domains such as deep learning, causal machine learning, transfer learning. \n\n \n\nDesirable skills/experience: \n\n * \n\nContributions to open-source projects. If you meet these criteria, please highlight merged GitHub PRs in your application. \n\n * \n\nStrong publication record in the field of AI. \n\n * \n\nExperience designing multi-agent systems in the pharmaceutical sector. \n\n * \n\nExperience delivering machine learning projects with applications in pharmaceutical development, chemical engineering or chemistry. \n\n * \n\nExperience with one or more of the following applied machine learning domains such as federated learning, few/zero shot learning, meta learning, explainable AI. \n\n \n\nWhen we put unexpected teams in the same room, we unleash bold thinking with the power to inspire life-changing medicines. In-person working gives us the platform we need to connect, work at pace and challenge perceptions. That's why we work, on average, a minimum of three days per week from the office. But that doesn't mean we're not flexible. We balance the expectation of being in the office while respecting individual flexibility. Join us in our unique and ambitious world. \n\n \n\nAstraZeneca is a place where change is embraced, and new solutions are trialled with patients and business in mind. Here, technology is a key lever for delivering medicines quickly, affordably, and sustainably. Our diverse workforce is united by curiosity, sharing learnings to scale fast. Be part of a digitally-enabled environment that impacts all parts of the business-from robotic process automation to machine learning for quality batches-while contributing to society and the planet. \n\n \n\nReady to make a difference? Apply now to join our team! \n\nWelcome with your application no later than August 28th 2025. \n\n \n\nCompetitive salary and benefits package on offer.\n\nOpening date: August 14th, 2025\nClosing date: August 28th, 2025",
        "url": "https://www.aplitrak.com/?adid=ZWxlb25vci5laHJtYW4uNDQ4NDUuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2025-08-14T15:01:27",
        "deadline": "2025-08-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29862918",
        "title": "HIL Developer - Automotive",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "HIL rig developer for AD system verification and validation\n\n\nThe right candidate should have the following key competencies for the position:\n* Experience of HIL development in HIL rigs for real-time systems\n* Good knowledge of equipment for electronics system or component testing\n* Experience with development of high-quality, production-level software\n* Skilled C/C++ programmer in Linux environments\n* Very good understanding of software tool chains\n* Be proactive in suggesting enhancements and technological choices in HIL rig development and HIL testing as well as experience in automation to ease the day to day tasks\n* Should have had exposure to large scale simulation environment & DevOps\n* Preferably experience in communication protocol, DDS, REST API, UDS, Ethercat\n* Basics of CAN (e.g. J1939) protocol and Canalyzer, CANOE, CAPL\n* Preferably knowledge of perception sensors autonomous driving such as lidar, radar and camera\n* Experience of simulation for AD/ADAS, HIL rigs, and test automation tools, i.e. Carla, from dSpace, Vector, or NI",
        "url": "http://www.skillhuset.se",
        "published": "2025-07-28T21:57:50",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29862916",
        "title": "Senior Embedded Software Engineer",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "Mid- Senior Embedded Software Engineer with Android, C++ and Python as their main language as well us an understanding of system architecture.\nTeam works with Build configuration, Android version bring up and SW complexity reduction\nTo be successful in this role, your experience must include: \n\t•\tEmbedded Software Development of complex software products using C++ and Python.\n\t•\tEmbedded OS or Linux experience.\n\t•\tDevelopment within android platform\n\t•\tWorking experience in a CI environment.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n\t•\tCoordinate and communicate with the CI teams to enable the new hardware support quickly and smoothly.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n \nWe'd also prefer if you have: \n\t•\tA Driver’s license (B-level) will also be ideal.\n\t•\tExperience from Automotive Infotainment domain\n\t•\tTest automation experience using Pytest\n\t•\tPrevious working experience with android uplift",
        "url": null,
        "published": "2025-07-28T21:57:05",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29806984",
        "title": "DevOps Engineer",
        "employer": "Opera Sweden AB",
        "location": "Göteborg",
        "description": "Opera Sweden is looking for a DevOps Engineer with a passion for learning and technology to join our team in Gothenburg where you get to build great products together with our best engineers. Experimenting with new technology is in our DNA and our collaborative team is constantly trying to find better ways to build quality products. In the current project we have chosen to go with AWS and invested a lot in SaaS and CI/CD. You will be working in a supportive team with an agile workflow. Together with the rest of the engineering team you will be part of design reviews, sprint planning, weekly sprints and delivery. The team is currently located in Gothenburg in a cozy office in the city center.\nRole & Responsibilities:\nSupport the engineering team when it comes to tools, CI and CD\nBuild monitoring and reporting for the project\nSet up the framework for incident management and recovery\nCooperate with the development team to build the SDLC framework for the project\nCreate a release plan with the management team and developers\nMaintain existing infrastructure and create new solutions\nAdvocate DevOps best practices in the organization\n\nJob Requirements:\nBS or MS in Computer Science or equivalent degree\nAt least 2 years of recent employment in a DevOps role in the enterprise environment\nSolid knowledge of AWS is a must\nExperience with deployment and delivery of web and generic server applications\nAbility to build the infrastructure from scratch\nFamiliarity with mainstream CI/CD and SaaS: Docker, Jenkins, Kubernetes, Terraform\nExperience with load balancing and CDN, administration of Linux systems\nFluent in English\n\nAn Ideal Candidate’s Profile:\nFamiliar with monitoring tools such as Grafana, Loki, Prometheus\nClose-to-expert knowledge of git, experience with python, shell scripting and high availability systems\nCurrently living in Gothenburg or willing to relocate\n\nWhat’s on Offer:\nFlat organizational structure with short decision-making processes that boost your creativity and drive\nA team of experienced and supportive individuals that fosters a friendly work atmosphere\nProfessional skill development\nA diverse and inclusive workplace\nSmart working technology",
        "url": "https://jobs.opera.com/jobs/6060392-devops-engineer",
        "published": "2025-07-02T12:29:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795902",
        "title": "Game Engineer (AI Team)",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Game Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking a Game Engineer to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nMindark is the pioneering force behind Entropia Universe, a dynamic and evolving virtual world where players engage in a vast array of activities, from commerce to exploration and beyond. With a strong emphasis on player-driven economies and real cash economy integration, we're at the forefront of shaping the future of MMORPG games. We value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Game Engineer, you'll play a pivotal role in developing and enhancing game features to take Entropia Universe to the next level. Your responsibilities will include designing, implementing, and optimizing game systems. A key aspect of this role is working extensively with new AI technologies inside our dedicated AI Team. This includes Transformer tech, large language models, and agentic frameworks, as well as current gamesystems. Your interest and expertise in these cutting-edge AI technologies and games will be crucial as you collaborate closely with multidisciplinary teams, to deliver high-quality features and advancements.\n\n\nResponsibilities: \nWork extensively with advanced AI technologies, such as Transformers and agentic frameworks, to innovate and improve current and new AI features in the game.\nDevelop and integrate current and new game systems to support and enhance gameplay features and functionalities.\nParticipate in code reviews and contribute to maintaining high coding standards.\nCollaborate with cross-functional teams to integrate new game mechanics and features.\nImplement security protocols and measures to safeguard game-related data.\nTroubleshoot and resolve technical issues related to game systems.\nBe flexible and open to work with all parts of the technical ecosystem.\n\n\n\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field.\nA few years of experience within the field. \nCreative thinker with a passion for games and a drive to innovate within the gaming space.\nProficiency in C++.\nProficiency in Python is a strong plus. \nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks.\nKnowledge of game development principles and methodologies.\nProblem-solving and communication skills.\nBeing flexible and able to work with a larger technical ecosystem.\n\n\n\nWhy Join Mindark: \nWork on a massively multiplayer online role-playing game with active players from around the globe.\nCollaborate with a talented and diverse team of gaming enthusiasts.\nCompetitive compensation package with opportunities for growth and development.\nA dynamic work environment that fosters creativity and innovation.\nAn inclusive work culture that values diversity and innovation.\nBeing able to work with cutting edge technologies that have not even hit the MMORPG games field yet.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: We would like you to be able to come into the office two days a week to Mindark Headquarters in Gothenburg, Sweden.",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-06-26T16:17:35",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787419",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-06-24T07:59:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784165",
        "title": "Java-utvecklare till innovativt företag",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Bli en del av Yoin Technologies, ett ungt och snabbväxande techbolag som erbjuder IT-tjänster. Vi söker en engagerad systemutvecklare med kunskaper inom Java. Kom och bli en del av vårt team.\n\nDitt jobb på Yoin Technologies\n\nDitt främsta uppdrag blir att assistera kunder och ta deras tekniska miljöer till nästa nivå. Beroende på din erfarenhetsnivå kommer du antingen hantera uppdateringar och vidareutveckling av kunders miljöer eller få ett större ansvar och sköta processen när kunden byter från en klassisk driftsmiljö till en modernare cloud/azure-miljö. Oavsett vilken del av processen du tar dig an kommer du att stötta kundens utvecklingsteam med best practices för deployment, migrering av applikationer och tjänster samt miljöuppsättning.\n\nDå Yoin Technologies bedriver inkubatorverksamhet kan du se fram emot en hel del spännande projekt. Genom sina breda kunskaper och sitt stora nätverk gör man det möjligt för drivna entreprenörer att förverkliga sina idéer. Här blir du en viktig pusselbit i arbetet med att testa gångbarheten och ta fram prototyper för att se om idén har bärkraft. \n\nI dagsläget består Yoin Technologies av 20 stycken erfarna utvecklare och du kommer jobba tätt ihop med alla. Vilket team du jobbar i beror på projektet, men målet är att alltid arbeta i ett team om minst 3-4 personer som tillsammans jobbar mot samma projekt och kund. \nFrån start kommer några av dina närmsta kollegor bli Marcus, Peter och Fredrik.\n\nÄr det här du?\n\nFör att lyckas i den här rollen har du minst en 3-årig akademisk utbildning och 5 års erfarenhet inom utveckling i Java efter examen. Du behöver också behärska svenska flytande i tal och skrift.\n\nPå Yoin Technologies är vi övertygade om att en stark laganda och samarbete är nyckeln till framgång. Som systemutvecklare hos oss kommer du att vara en del av en engagerad och hjälpsam grupp som stöttar varandra. Vi tror på din förmåga att vara självgående och ta egna initiativ. Här får du inte bara möjlighet att utveckla dina tekniska färdigheter, utan också vara en del av en trivsam arbetsmiljö där vi värdesätter arbetsglädje och social sammanhållning.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Yoin Technologies. Det är viktigt att klargöra att rollen är för Yoin Technologies och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:33",
        "deadline": "2025-09-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784180",
        "title": "Erfaren systemutvecklare inom IT och industri",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa effektiva stöd för industriella processer. Här tar du hjälp av dina kunskaper i .NET och din förståelse för systemintegration för att identifiera behov och fastställa kravspecifikationer. Du deltar i allt ifrån tekniska förstudier, design, utveckling och installation till support, underhåll och vidareutveckling samt förvaltning av mjukvara för effektiv produktion. I stora drag kan man säga att du kommer jobba med både systemering och programmering.\n\nI ditt arbete får du uppbackning av kollegor som Olle, Björn, Martin, Robert, Elisabeth och Helena.\n\nÄr det här du?\n\nFör att passa i rollen behöver du ha en civilingenjör/högskoleingenjörsexamen och minst fem års erfarenhet av utveckling och leverans av IT-lösningar inom kritisk drift. Du får gärna ha känsla för både .NET, SQL Server och Oracle Server. Om du dessutom förstår det här med systemintegration och kan tillämpa olika datautbytesmetoder är det ett stort plus.\n\nDitt engagemang och stora intresse för teknik är vad som sporrar dig att hitta nya lösningar och effektiva stöd. Det är bra om du har lätt för att kommunicera, interagera med andra och känner igen dig i egenskaper som kundorienterad och lösningsorienterad Känner du dig dessutom som en kreativ person med förmågan att vara analytisk och ha ett öga för detaljer så har du hamnat rätt.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Prevas. Det är viktigt att klargöra att rollen är för Prevas och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:31",
        "deadline": "2025-09-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661571",
        "title": "Verification Engineer HIL - Göteborg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Är du en metodisk och nyfiken ingenjör med passion för problemlösning och HIL-verifiering? Nu har du chansen att bli en del av ett högteknologiskt team hos vår kund inom fordonsindustrin, där du får arbeta i framkant med framtidens styrsystem och testmiljöer.\nOm uppdraget: I rollen som Verification Engineer HIL kommer du att arbeta med utveckling och underhåll av HIL-simuleringsmiljöer, skriva testspecifikationer, skapa testfall samt genomföra och analysera tester. Du kommer att samarbeta tätt med funktionsutvecklare och bli en nyckelperson i att säkerställa kvaliteten i fordonets dynamiksystem.\nKravprofil:\n- Civilingenjörsexamen inom elektronik, mekatronik, mekanik eller fysik - Erfarenhet av modellbaserad utveckling och verifiering - Grundläggande kunskap om HIL-hårdvara - God kännedom om dSPACE-verktyg: ControlDesk, AutomationDesk, MotionDesk/Aurelion och ASM - Erfarenhet av CI/CD-processer, gärna med Jenkins - Kunskaper i Python och Matlab/Simulink \nMeriterande:\n- Erfarenhet av att sätta upp CI/CD-flöden i Jenkins - Fordonsdynamikkompetens - Erfarenhet av simulering av mekatroniska/pneumatiska system",
        "url": "https://careers.progalaxy.se/jobs/5858126-verification-engineer-hil-goteborg?promotion=1447500-arbetsformedlingen",
        "published": "2025-04-28T13:20:15",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603174",
        "title": "Control Systems Engineer / Vehicle Motion Control Engineer",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are expanding our team of skilled control engineers to strengthen our current services within Vehicle Motion Control in Gothenburg. We are looking for you who want to be part of this journey!\nWho are we? Combine Control Systems is a leading supplier of high-quality engineering services within Data Science and AI, Software development, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking for a technical expert within the domain of Vehicle Motion Control to our Gothenburg office to take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Gothenburg, Lund, and Linköping, with our headquarter being in Gothenburg.\nWhat can we offer? Exciting assignments within various industries, ranging from the automotive industry to the railway industry. The flexibility of taking on the most exciting assignments without being locked to a single product. The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about control systems, Data Science, and AI. The flexibility and friendly atmosphere of a smaller company. Our employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks, and projects and expand their knowledge in a supportive and helpful way.\nWhich skills do you need to join the team? We are looking for someone with extensive and hands-on experience within the field of vehicle motion control for automotive applications. We believe you have experience from model based design and are a true believer that virtual verification is the way to go. We believe that you appreciate working within, or leading project teams. You like having fun and respect and trust your team as much as your knowledge. For us, personality speaks loudest and we are strong believers that knowledge can be taught.\nQualifications\n Master’s degree or PhD in relevant field.\n Extensive experience from the field of Vehicle Motion Control\n Experience from several of the following: Stability Control, Vehicle State Estimation, Longitudinal Control, Lateral Control\n MPC, EKF, UKF, Kalman Filter\n Matlab/Simulink, Dymola, Modelon Impact, FMU, Co-simulation\n  \n Strong communication and teamwork abilities.\n \nWho are you? We believe that you are positive and social. For you, the work-life balance is important and you like to share your hobbies and interests which you are passionate about with others. You believe in never stop learning and love the challenge that comes with it.\nIf you want to join our team, do not hesitate to apply!",
        "url": "https://combine.teamtailor.com/jobs/4741171-control-systems-engineer-vehicle-motion-control-engineer?promotion=1413957-arbetsformedlingen",
        "published": "2025-04-04T09:08:15",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603157",
        "title": "Data Engineer / Machine Learning / AI / Cloud",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "About Combine At Combine Control Systems, we are passionate about technology and innovation. We specialize in creating innovative technology that empowers industries and shapes the world around us. Our pursuit of staying at the forefront of the rapidly changing tech world drives us to develop and work with the latest tools and techniques in areas such as Data Science, AI, embedded systems, and control engineering. We offer exciting and diverse challenges at the cutting edge of technology and create an inspiring work environment where our employees thrive and have the opportunity to grow and develop. Together, we form a team of dedicated and skilled engineers and experts who are passionate about technology and innovation. As we continue to expand our horizons, we are seeking a passionate and talented Data Science Engineer to join our dynamic team in Gothenburg. \nWhat can we offer you? Joining our team means becoming part of a community that values openness, creativity, and trust. We embrace teamwork and welcome your contribution. At Combine, we encourage personal development, provide opportunities to explore new domains, and offer an inspiring and inclusive workplace.\nTechnically challenging projects - You will be part of exciting and technically challenging projects. You will work with the latest technologies and tools in Data Science and AI/Machine Learning. We give you the opportunity to challenge yourself and grow in specialized areas.\nInspiring work environment - Here, you will be surrounded by like-minded and enthusiastic colleagues. We promote collaboration and knowledge sharing to create a dynamic and rewarding work environment.\nProfessional development - We invest in our employees and provide opportunities for skills development and further education to help you grow in your career.\nYour role As a Data Engineer at Combine, you are a crucial part of our team. You will work with clients from various industries and sectors, where data is at the core of every project. Your role involves adapting existing tools/packages to create automated pipelines in the cloud, following industry best practices. You will analyze data to address stakeholders' questions, monitor data, and create/update reports or dashboards. Additionally, you will collaborate closely with stakeholders and support cross-functional teams.\nQualifications\n  Master's degree in areas related to computer science, information technology, or equivalent. \n Proficiency in Python and/or Scala. Experience with SQL and NoSQL databases.\n Experience with Git, CI/CD, and Data/DevOps. \n At least two years of experience working with large datasets using cloud technologies such as AWS, GCP, or Azure. \n Very good skills within the English language, both spoken and written.  Preferred Qualifications \n Experience with Databricks, Spark, Snowflake, etc., is advantageous. \n \nWho are you? We are looking for a versatile and talented individual who enjoys collaboration, embraces challenges, and appreciates a holistic approach to problem-solving. If you enjoy exploring new areas, value teamwork and can communicate technical knowledge to colleagues and stakeholders at different domains and technical levels, you are the right person for our team. \nWe look forward to receiving your application!",
        "url": "https://combine.teamtailor.com/jobs/4961523-data-engineer-machine-learning-ai-cloud?promotion=1413941-arbetsformedlingen",
        "published": "2025-04-04T09:03:45",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29573819",
        "title": "Systemutvecklare",
        "employer": "Sylog Väst AB",
        "location": "Göteborg",
        "description": "Systemutvecklare/DevOps Ingenjör med mer än 6 års erfarenhet inom nedan område: \n Java, .NET/C#, Spring, Golang, TypeScript, React, SQL, Oracle, CI/CD tools, Kubernetes, Docker, AWS, Azure",
        "url": null,
        "published": "2025-03-25T13:48:05",
        "deadline": "2025-09-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29701269",
        "title": "Lead Developer Dynamics 365 Customer Engagement",
        "employer": "Fellowmind Sweden AB",
        "location": "Malmö",
        "description": "Forma framtidens kundupplevelser tillsammans med oss på Fellowmind \nHär är chansen för dig som är redo att ta nästa kliv i din karriär som utvecklare – och samtidigt vara med och sätta din prägel på den tekniska standarden för hur framtidens digitala kundlösningar ser ut! Hos oss på Fellowmind får du en ledande roll i ett sammanhang där teknik och mänsklighet går hand i hand. Vi söker nu en Lead Developer inom Dynamics 365 CE som brinner för kvalitet, innovation och att inspirera andra! \nDin roll hos oss \nSom Lead Developer är du mer än en teknisk specialist – du är en vägvisare! Du är med och formar riktningen för hur vi bygger, utvecklar och levererar våra lösningar inom Dynamics 365 CE. En del av ditt uppdrag blir att säkerställa vår tekniska kompetens och var ett nav för kunskapsdelning, kvalitetssäkring och inspiration för våra utvecklare. \nDu kommer bland annat att: \n Jobba i teknikens framkant – särskilt inom Power Platform och Dynamics 365 CE. \n  Leda interna utvecklarforum – en kreativ samlingsplats för inspiration, idéutbyte och kompetenshöjning. \n  Granska kodbaser och leveranser för att säkra kvalitet, hållbarhet och skalbarhet. \n  Coacha kollegor genom code reviews, teknisk vägledning och mentorskap. \n  Samverka med arkitekter och andra experter i tvärfunktionella projekt – ibland leder du själv, ibland bidrar du i teamet.\n \nTekniken vi älskar att jobba med \nHos oss är tekniken ett medel för att skapa verkligt värde. Vi jobbar bland annat med: \n Power Platform (Power Automate, Power Apps) \n  JavaScript/TypeScript \n  C#.NET (t.ex. plugins, Custom APIs) \n  Power Apps Component Framework \n  React \n  Azure DevOps och CI/CD-pipelines\n Vi tror att du  Har gedigen erfarenhet av utveckling inom Dynamics 365 CE och Microsofts molnbaserade ekosystem - troligen 5 år eller mer. \n  Brinner för struktur, arkitektur och kod av hög kvalitet. \n  Är nyfiken och pedagogisk – du trivs med att både lära och lära ut. \n  Vill kombinera teknik med ansvar och samarbete – du gillar att se helheten.\n Vad vi erbjuder \nSom en ledande europeisk Microsoftpartner är Fellowmind en arbetsplats där tekniken får ett mänskligt ansikte. Vi tror på att digital transformation börjar med relationer – och att de bästa lösningarna föds i samarbetet mellan människor. Här får du en roll med verklig påverkan, i en kultur som präglas av: \n Always personal – Vi bygger relationer på äkta engagemang. \n  Better together – Vi tror på kraften i samarbete. \n  Act with courage – Vi vågar tänka nytt och utmana gamla sanningar. \n  Serious about fun – Vi kombinerar hög leveranskvalitet med en arbetsmiljö där du trivs, växer och skrattar.\n \nLägg därtill att vi i höstas blev utsedda till Sveriges Bästa Arbetsgivare vilket vi ser som ett kvitto på att vi gör mycket rätt – och vi kommer alltid att fortsätta arbeta för att vara en plats där alla ska må bra och känna sig hemma. \nDet praktiska  Omfattning: Heltid \n  Placering: Något av våra centrala kontor i Malmö, Göteborg, Stockholm, Jönköping eller Halmstad \n  Start: Snarast – men vi anpassar oss efter din kalender\n \nRedo att leda vägen för tekniken – och samtidigt göra skillnad för både kunder och kollegor? -Sök redan idag!",
        "url": "https://career.fellowmind.se/jobs/5927477-lead-developer-dynamics-365-customer-engagement?promotion=1468872-arbetsformedlingen",
        "published": "2025-05-14T09:30:15",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29937898",
        "title": "Senior systemutvecklare för Craftmanship inom sensorsystem",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\n \n\nVi söker en erfaren Senior System Developer som vill vara med och utveckla avancerade sensorsystem för både försvars- och civil verksamhet.\nI denna roll får du vara en del av en tekniskt utmanande och innovativ miljö där vi arbetar med avancerade systemlösningar som kräver hög precision och kvalitet.\nSom en del av vårt team får du möjlighet att bidra till framtidens sensorbaserade lösningar, där traditionell mjukvaruutveckling som hantverk \"Craftsmanship\" är en central del av vårt arbetssätt.\nVi är dessutom i en fas där vi i högre grad börjar använda kodagenter (MMLs) och AI i våra kodverktyg och processer, vilket skapar nya spännande möjligheter och utmaningar.\n\n \n\nDin roll\n\nDu blir en del av ett högpresterande team som arbetar med att utveckla avancerade sensorsystem i en dynamisk och tekniskt utmanande miljö. Här får du möjlighet att vara med och forma framtidens teknik, samtidigt som du samarbetar med experter inom olika tekniska områden. Som Senior System Developer kommer du att ha ett tekniskt ledande ansvar i utvecklingen av våra produkter och tjänster. Dina huvudsakliga uppgifter inkluderar:\n\n * Analysera, anpassa, uppgradera och totalrenovera mjukvarusystem för att möta interna och externa kundkrav\n * Implementera och optimera AI-baserade kodagenter och automatiseringslösningar i utvecklingsprocessen\n * Säkerställa att våra system och verktyg uppfyller krav på hög leveranstakt och spårbarhet\n * Arbeta med både mjukvara och dess integration i avancerade sensorsystem, ofta med höga krav på realtidsprestanda och säkerhet\n * Samverka med team inom hårdvara, mjukvara och systemintegration för att säkerställa en helhetslösning av högsta kvalitet\n\n \n\nDin profil\n\nVi söker dig som har erfarenhet av att arbeta med komplexa system som innefattar både mjukvara och hårdvara samt ett starkt tekniskt ledarskap och en drivkraft att driva utvecklingsprojekt framåt. Du trivs med att samarbeta med både interna och externa intressenter och ett engagemang att modernisera och uppgradera befintliga system med moderna teknologier. Vi tror att du har ungefär fem års erfarenhet av mjukvaruutveckling och systemarkitektur och ser gärna en god förståelse för traditionell craftsmanship inom systemutveckling.\n\nVi ser gärna att du har:\n\n * Relevant högskole- eller universitetsutbildning inom systemutveckling, datateknik eller liknande område\n * Dokumenterad erfarenhet av att arbeta med sensorsystem eller annan avancerad teknisk utrustning\n * Erfarenhet av att arbeta i komplexa utvecklingsprojekt med höga krav på kvalitet och leveranssäkerhet\n * Erfarenhet av att implementera och arbeta med AI och automatiserade kodverktyg\n * Erfarenhet av att arbeta med AI-stöd i utvecklingsmiljöer är meriterande\n\n \n\nVarför välja oss?\n\n * Möjlighet att arbeta med framtidens AI-drivna kodutveckling och automation\n * Flexibla arbetsförhållanden och en innovativ arbetsmiljö\n * Tillgång till avancerade forsknings- och utvecklingsresurser\n * Stora möjligheter att påverka teknikval och utvecklingsstrategier\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\n \n\nVad du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\n \n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\n \n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 25,500 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\n \n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här. \n\n \n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här",
        "url": "https://www.aplitrak.com/?adid=cy5zdmVuc3Nvbi41NDUzNS4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-08-22T10:43:36",
        "deadline": "2025-09-19T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29904492",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAt AFRY, we develop and deliver cutting-edge solutions for vehicles, systems, functions, and attributes to clients in the automotive industry. Our customers include both established OEMs, innovative startups, and Tier 1 system suppliers.\nWe are currently seeking experienced software developers who are passionate about shaping the next generation of infotainment systems based on Google’s Android Automotive OS.\nAs an Android Automotive Software Developer, you will work on software development across both application and native layers of the Android stack for infotainment systems. You will collaborate closely with UX designers and other stakeholders to define a seamless, end-to-end user experience. You’ll be part of a team with full responsibility—from design and architecture to documentation, development, verification, and validation. At AFRY, you’ll also have the opportunity to contribute actively to innovation by generating new ideas and solutions.\n\n\nQualifications\n\nWe are looking for candidates with the following background and skills:\n\nM.Sc. in Software Engineering or equivalent experience gained through years of professional practice\nSolid experience in Android application and platform development, including work with AOSP and the AOSP build system\nFamiliarity with modern app architectural patterns such as MVP, MVVM, and layered architecture\nExperience working with automotive communication buses\nStrong programming skills in Android Java, C++, and Python\nGood knowledge of Android testing frameworks such as JUnit, Espresso, and Mockito\nExcellent command of English, both written and spoken\nProven experience working with a Swedish OEM within the automotive industry\nCurrently residing in Sweden today\n\nMeritorious qualifications:\n\nExperience in Embedded Linux development\nFamiliarity with Continuous Integration (CI) tools and workflows\nPossession of a Swedish B-class driving license\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 15 September  2025\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000076085575-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-08-13T13:26:07",
        "deadline": "2025-09-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29815930",
        "title": "Experienced Machine Learning Developer for International Company!",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Do you have a passion for machine learning and a few years of professional experience in the field? Are you looking for an exciting opportunity to work with innovative technologies in an international environment? Then the role of Experienced Machine Learning Developer could be exactly what you are looking for!\n\nJOB DESCRIPTION\n\nAs a Machine Learning Developer at our client company, you will join a team within software development while collaborating closely across functions, including with teams focused on testing, integration, and software development. Your primary responsibility will be to develop and optimize machine learning and AI solutions, with a particular focus on neural networks. This includes methodology development, data collection and training, and performance optimization, for example, designing efficient neural networks suitable for devices with limited computational resources. This is a highly technical and hands-on role, where you will work closely with a colleague in the same position.\n\nThe role involves programming mainly in Python, with solutions also being converted to C for deployment on embedded systems. Beyond technical development, you will also participate in data acquisition, testing, and the full development lifecycle. Additionally, the role includes client interaction, where you will present and demonstrate solutions.\n\nIDEAL CANDIDATE:\nMaster’s degree in Engineering Physics, Software Engineering, or a related field.\nHave a minimum of five years of professional experience in machine learning, AI, neural networks, or similar areas.\nPossess strong programming skills in both Python and C++.\nAre proficient in both Swedish and English, as both languages are used in daily internal and external communication\n\n\nIt is a plus if you also have:\n\nPrevious experience in the automotive industry\n\n\nIn order to be a good fit , we think you have a professional approach towards customers and good communication skills. You are a fast learner, eager to learn and develop within the company. You are also flexible and focused on customer satisfaction. Though you work in a team with others you are a good team player with a positive and outgoing mindset and aim to help the team solve their tasks.\n\nEMPLOYMENT\n\nThe position is a direct recruitment, which means that the recruitment process takes place through Friday and you will be employed by the client.\n\nADDITIONAL INFORMATION\nEmployment type: Full time.\nStart date: September/October 2025.\nLocation: Gothenburg.\nSalary: Fixed monthly.\n\n\nApply by clicking the link below. Remember to be quick with your application as apply continuous selection of candidates and the position may be filled before the application deadline is due.\n\nABOUT FRIDAY\n\nBy being a partner to our clients and candidates, we strive to find the best match for both parties. We achieve this by really getting to know our clients and candidate’s needs! Of course, we will ensure that requirements and skillsets match. But above all, we focus on the importance to find harmony between values and corporate culture which both candidate and client considers optimal.\n\nOur passion is to help people to the right position, workplace and context within the IT and Technology field. That's also the reason to why we founded Friday, with the aim to help you find the job that gives you that Friday feeling – every day!\n\nWe mainly focus on young engineers who either are at the beginning of their career or soon graduating from university within the IT/Tech field.\n\nOur belief is that people reach their fullest potential when looking forward to going to work each morning. \"Friday - everyday\", how about that?",
        "url": "https://pnty-apply.ponty-system.se/friday?id=3249&pnty_src=arbetsformedlingen",
        "published": "2025-07-07T09:54:07",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29866377",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Det tar en minut att ansöka och vi tar kontakt med dig inom två... eller så snart vi kan!\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 29 augusti.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1571557-arbetsformedlingen",
        "published": "2025-07-30T10:48:37",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29934197",
        "title": "Product Leader - SW Platforms",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nAre you passionate about Embedded Software? We are on the journey to create outstanding software and technology that seamlessly integrates applications, making the Volvo Group drive prosperity through transport and infrastructure solutions.\n\nShaping tomorrow's technology\n\nAt Vehicle Technology, we are passionate about shaping tomorrow’s technology to create excellent sustainable transport and infrastructure solutions to make the world a better place for future generations. We provide innovative, safe, and driver-friendly solutions, we develop top quality services, and we make our customer operations more efficient by using excellent data insights. We support the Volvo Group engineering community with cutting edge tools and methods.\nSoftware Platforms is one of the technology areas within the Vehicle Technology organization at Volvo Group Trucks Technology. The vision for Software Platforms is to provide best in class-embedded base software and technologies for automated integration of application software, including test platforms that enable software-driven transport solutions for the Volvo Group.\nThe core areas of Software Platforms include (but not limited to):\n  *  Volvo Dynamic Software Platform (Adaptive Autosar, Linux, Hypervisors & BSP) development and maintenance.\n  *  Volvo Autosar Platform development and maintenance.\n  *  Integration of application and platform software.\n  *  Automation of integration and delivery of ECU build.\n  *  Delivery of integrated MSW and PBL to final integration.\n  *  Development of test automation framework.\n\n\n\nWhat you will do\n\nAs our Product Leader of the operational team, you will be responsible for ensuring the coordinated, timely, and high-quality delivery of one of the most complex central on-board computers in trucks – our centralized high-performance computer hosting several complex applications. You will act as the central anchor aligning cross-functional teams (Hardware, Release, Test & Support) under a unified delivery strategy across various agile teams (Platform and Application). In this role, you will play a key part in delivering a complete software platform fully integrated with hardware, utilizing modern Continuous Integration, and Continuous Delivery chains for application developers across the Volvo Group.\nKey responsibilities:\n  *  Delivery Oversight: Responsible for the end-to-end operational execution of delivering a fully integrated complex central ECU delivery, which includes planning, tracking execution, and enabling releases.\n  *  Cross-Team Alignment: Mandate to synchronize and align deliveries from different teams, highlighting dependencies, blockers, and any changes that need to be managed.​\n  *  Operational Governance: Mandate to enforce ways of working (WoW) such as release readiness, definition of done, branching strategy and tracking key performance indicators (KPIs).​\n  *  Reporting and Escalation: Authorized to escalate risks, provide delivery status reports to leadership, and make decisions that impact the success of releases.​\n  *  Contribute and drive topics to resolution as a key member of the Software Platforms management team.\n  *  Communicate effectively with stakeholders at all levels of the organization, including executives, team members, and external partners.\n\nYou will be part of the Software Platforms leadership team and report to the GTM/Director – Software Platforms.\n\n\nWho are you?\n\nWe believe that you are customer-focused, service-minded, and result-oriented. With a strong drive and high energy level, you thrive in dynamic, fast-paced environments and approach challenges with a positive, go-getter attitude. Taking initiative feels natural to you, and you adapt quickly when faced with new challenges. You lead others towards results with confidence and clarity. With your leadership and communication skills, you inspire and guide your team while building strong collaboration across departments and with external partners.\nRequirements:\n  *  University degree in Engineering, or related field.\n  *  Minimum 10 years of experience in the development and delivery of automotive embedded software.\n  *  Strong technical background in automotive engineering and software development.\n  *  Proven ability to lead and coach technical teams.\n  *  Hands-on experience in automating the full CI/CD chain for developing and releasing embedded software, overseeing the entire delivery pipeline to secure timely releases.\n  *  Solid understanding of industry trends, market demands, and regulatory requirements related to hardware systems.\n  *  Experience working in agile ways of working, preferably in a SAFe-inspired set-up.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43601864",
        "published": "2025-08-21T13:25:06",
        "deadline": "2025-09-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29905201",
        "title": "Software Engineer",
        "employer": "Evo Truck SDV AB",
        "location": "Göteborg",
        "description": "At Coretura, we’re all about shaking things up in our industry! We believe in empowering our team and creating a culture where innovation thrives.  \nWhen you join us, you won’t just be another employee; you’ll have the freedom to make decisions that drive our projects and tech forward. We encourage creativity and we know that diverse perspectives are key to solving the tough challenges we face.  \nOur focus is on making a real impact, and we prioritize what matters most to deliver value to our customers quickly. With a lean team that’s always learning and adapting, we’re ready to evolve with the latest technology and market trends. Come be a part of a workplace where your contributions truly matter!  \n \nAre you passionate about building intelligent, scalable software systems that power the next generation of vehicles? We’re looking for a Software Engineer to join our dynamic team shaping the future of mobility through cutting-edge technologies in embedded systems, middleware, and user experience.\nIn this role, you’ll contribute to the development of software platforms for commercial vehicles, working across domains such as infotainment, diagnostics, connectivity, and service-oriented architecture. You’ll collaborate with cross-functional teams to design and implement robust solutions using modern frameworks and tools, and help bring innovative features to life in real-world automotive environments.\nWe value engineers who are curious, hands-on, and eager to solve complex challenges. Whether you're optimizing communication protocols, developing HMI interfaces, or integrating Android Automotive and QNX systems, your work will directly impact how vehicles interact with drivers, the cloud, and each other.\n\n\n What you’ll bring:\nExperience in software development using C/C++, Rust, or Python.\nFamiliarity with embedded systems, real-time operating systems, or cloud-based architectures.\nA problem-solving mindset and eagerness to learn.\nAbility to work in cross-functional teams and communicate effectively.\nMaster's/bachelor's degree in computer science, Engineering, or related field, along with a proven track record as a Software Engineer or similar role.  \n\n \n Why us?  \n At Coretura, you’ll be part of a startup environment, in a vibrant team that values collaboration, innovation, and personal growth.",
        "url": null,
        "published": "2025-08-13T15:25:05",
        "deadline": "2025-08-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29889595",
        "title": "Firmware Engineer",
        "employer": "Elektron Music Machines Mav AB",
        "location": "Göteborg",
        "description": "Elektron builds state-of-the-art electronic music instruments with deep functionality and exceptional sonic capabilities. With a track record of iconic products such as the Machinedrum, Octatrack and Digitakt, Elektron has become uniquely positioned in the artist and producer community.\nWe’re now expanding our team, to push the edge of music creation and meet customer demand!\nWith small teams, flat hierarchy, and high emphasis on creativity, Elektron gives room for every idea to be heard! Joining the Elektron team means being trusted in your abilities.\nDo you want to be a part of the team that creates the best electronic music instruments in the world?\nRole Description\nWe are currently looking for a full-time Firmware Engineer to expand the R&D team. As a firmware engineer at Elektron you will work with the complete software design chain; from product ideas, through prototype stages, to released firmwares and updates in future releases.\nThe embedded software team is responsible for all the programmable aspects of the instruments, ranging from digital logic to high level data management. We develop software for products to come, and we continue to improve the software long after they have been released.\nOur instruments have multi-threading real-time operating systems, and may be composed of multiple micro-controllers and digital signal processors. You will be working at the application level, but you are required to interface the operating system at a lower level.\nYou are passionate about writing code which is reliable as well as efficient. You are comfortable working with a large existing codebase. You are self-motivated and have strong problem solving capabilities.\nThis is an on-site position based in Gothenburg, Sweden.\nRequired skills & experience\nMaster of Science in Computer Science, Electrical Engineering, or similar experience.\nSeveral years of experience with C++.\nSome experience with Python.\nExtensive embedded systems design knowledge - choosing components, reading schematics, interacting with hardware.\nGood knowledge about Operating Systems and Real-time Systems.\nGreat problem-solving skills.\nLow-level knowledge: knows about caches, stack/heap, allocation schemes.\nExperience with software architecture and knows how to write maintainable systems.\nKnows Git inside-out and is well familiar with code review.\nGood knowledge of algorithms and data structures.\nA structured way of working, using version control, issue trackers and similar tools.\nSeveral years of working experience in a similar field.\nFluent spoken and written English\nInterest in music instruments (preferably making music)\n\nValued skills\nKnowledge in Rust, Digital Signal Processing, USB communication\nExperience with production testing and a drive for testability.\nExperience with major real-time operating systems such as FreeRTOS, Zephyr etc.\nLow level ARM A/M architecture and ISA knowledge.\n\nWhat we offer\nA dynamic and multicultural workplace where you have the opportunity to make a real impact and take ownership. At Elektron, you’ll experience great team spirit and a warm atmosphere, with music at the heart of everything we do. You’ll work closely with all departments and gain a broad understanding of the company, opening doors for professional development and long-term growth. Along the way, you’ll enjoy regular social events, fresh fruit, free parking, a wellness benefit, and more — all backed by the security of a collective agreement.\nStart: As soon as possible, by agreement\nScope: Full-time, permanent position\nLocation: Banehagsliden 5, Gothenburg\nApplication deadline: August 31, 2025\nSince this ad is posted during the holiday season, we won’t be getting back to you until September — but rest assured, you haven’t been forgotten, and we promise to reach out as soon as we can.\nHave a wonderful summer — greetings from Elektron!",
        "url": "https://careers.elektron.se/jobs/6147177-firmware-engineer",
        "published": "2025-08-08T10:44:35",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29866181",
        "title": "Mjukvaruutvecklare – Utveckla framtidens avancerade system!",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Drömmer du om en karriär där du får arbeta med framtidens teknik och utmana din kompetens? Nu erbjuder vårt kontor i Göteborg en spännande möjlighet att bli en del av ett globalt företag med fokus på innovation och avancerade tekniska lösningar.\nVi söker nu efter en mjukvaruutvecklare till ett av våra projekt gentemot vår kund som arbetar med avancerade programvarusystem och simuleringar. Är du vår nästa stjärna?\nOm rollen\nSom mjukvaruutvecklare kommer du få arbeta i ett tvärfunktionellt utvecklingsteam med ansvar för både utveckling och underhåll av mjukvaruprodukter. Du kommer vara involverad i hela utvecklingskedjan – från kravhantering och design till implementering, testning och underhåll. Du kommer bland annat ansvara över följande:\n Utveckling och underhåll av programvara för avancerade system\n Design, implementation och testning av mjukvarulösningar\n Samarbete med andra team och avdelningar för att säkerställa hög kvalité\n Bidra till effektiva utvecklingsprocesser och kontinuerlig förbättring\n Arbeta med moderna utvecklingsmetoder och verktyg.\n \nVi söker en mjukvaruutvecklare som har:\n En högskole- eller civilingenjörsexamen inom data eller motsvarande\n Några års erfarenhet av mjukvaruutveckling och moderna utvecklingsverktyg\n Goda kunskaper inom Linux och versionshantering\n Erfarenhet utav CI/CD.\n \nUtöver detta så ser vi även det som positivt om du har erfarenhet av följande:\n C++\n Git\n Inbyggda system\n Simulering, signalbehandling samt radarstyrning.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande. \nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 29 augusti. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/5500131-mjukvaruutvecklare-utveckla-framtidens-avancerade-system?promotion=1571457-arbetsformedlingen",
        "published": "2025-07-30T10:14:47",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29860855",
        "title": "Embedded Developer",
        "employer": "Icomera AB",
        "location": "Göteborg",
        "description": "Icomera is a leading global innovator in connectivity solutions within the transportation sector. We are at the forefront of transforming public transport, making it smarter, safer, greener, and more connected than ever before. At Icomera you work with products used by many users around the world, including passengers on some of the world's largest train and bus operators. \nAre you looking for a new and challenge and want to make sure it is an exciting one? Our embedded team is looking for a new team member!\nJob type: Full-time   \nWorkplace conditions: Hybrid \nLocation:  Gothenburg, Sweden\nAbout the Role:\nAs an Embedded Software Developer at Icomera, you will help develop the next generation of network routers for vehicles. The embedded team is responsible for analysis, design, implementation, and testing of the router OS as well as its applications. You’ll work closely with hardware and web development teams, contributing to innovative solutions that are visible to millions of passengers around the world. If you enjoy working on the Linux platform, networking, and tackling firmware or hardware challenges, this is the role for you!\nKey responsibilities:\nWrite high-quality code with focus on performance and maintainability.\nCommunicate with and support team members and other stakeholders within the business.\nFollow established development processes and related standards.\nContribute to a positive working environment and help optimise performance of the team.\n\n \nRequirements: \nB.sc / M.sc degree, in computer science, physics or equivalent.\n3+ years of Linux-based software development experience in an agile environment (C/C++, Bash).\nDeep knowledge of computer networking.\nPassion for the Linux platform and software development.\nProficient in English, written and spoken. Working proficiency in Swedish, written and spoken, is a plus\n\nWho You Are:\nTo thrive in this role, you enjoy working with people and you are excited to be part of a constantly evolving international company. As an Embedded Software Developer, you are honest, driven, and solution-oriented, and you enjoy tackling technical challenges as part of a team. \nOur Offer:\n— The opportunity to work with cutting-edge technology in a market leader where we design and build everything in-house—from hardware to software\n— Health is important – we offer a comprehensive health benefit program to our employees\n— Flexible work arrangements – work from our modern and central office locations, or work from home up to two days a week\n— Electrical bike lease agreement via net salary deduction\n— ITP Pension and collective bargaining agreement\n— A social work environment – board game nights, after works, seasonal parties… The list goes on!\nReady to be part of something exciting and make a real difference in the connected future of transport? We’d love to hear from you!\nMore about the position:\nWe will be reviewing applicants ongoing. Icomera welcomes candidates from all backgrounds, and we value a diverse and inclusive work environment. \nIcomera is an employer with a collective agreement with TechSverige. If you have questions to our local union representatives, you may contact them at unionen@icomera.com or saco@icomera.com.\nAbout Icomera:\nIcomera is the world’s leading provider of integrated connectivity solutions for trains, trams, buses, and coaches, serving millions of passengers and tens of thousands of vehicles on a daily basis. The IcoCrew now consist of 300+ employees globally. Icomera is headquartered in Gothenburg, Sweden, with main offices in the United States, Canada, the United Kingdom, Germany, France, Ireland, and Italy.\nIcomera’s vision for green mobility within the public transport industry perfectly complements the wider mission of our parent company, Equans. As the global leader in multi-technical services with 74,000 employees working across 17 country hubs, Equans delivers customised solutions which connect, protect and energise territories, cities, buildings, industries and transport infrastructures, empowering their energy, industrial and digital transitions. Visit www.icomera.com for further information.",
        "url": "https://enfrench-equans.icims.com/jobs/75022/embedded-developer/login",
        "published": "2025-07-28T10:26:00",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29818976",
        "title": "Embedded Software Engineer within the Automotive Industry",
        "employer": "SiNIX Embedded AB",
        "location": "Göteborg",
        "description": "Are you an experienced embedded software developer looking to work with cutting-edge technology in the automotive domain?\nWe are looking for an experience Embedded Software Engineer to join our team!\nAs part of our embedded software team, you'll contribute to a variety of development projects—ranging from system architecture and software design to implementation, integration, and validation of embedded systems. The work is both technically challenging and rewarding, often involving modern platforms and real-world problem-solving in the fast-evolving automotive industry.\nWe offer a workplace where your voice is heard, your skills are developed, and where we have fun while solving challenging technical problems together.\nQualifications for this position\nSeveral years of experience in embedded software development\nM.Sc or B.Sc. in Computer Science Electronics, Mechatronics or related technical field\nProficiency C++ and embedded systems programming\nExperience with Linux, QNX and Yocto\nEnsure compliance with AUTOSAR, ISO 26262, and MISRA C++ guidelines\nFamilarity with tools such as GIT, JIRA, Vector tools (CANoe, CANalyzer)\nExperience working within the automotive industry\nIt’s a plus if you have experience working closely with suppliers and have been involved in cybersecurity-related aspects of embedded development\n\n\n\nAbout you\nWe believe that you are curious, driven and solution-oriented. You have a mindset of continuous learning and like to share knowledge with those around you. We value individuals who take ownership, enjoy working in teams, and actively contribute to a positive and open atmosphere.\nWho we are\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/jobs/6026679-embedded-software-engineer-within-the-automotive-industry",
        "published": "2025-07-08T10:28:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-09-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29662150",
        "title": "Senior Java Developer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 2300 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Canada, Greece, India and Poland.\nLife at Etraveli Group\nDepending on how you want to grow we want to listen in on your future career plan. To be able to inspire you to be your best within a fast moving industry we work hard to provide for the best prerequisites to make you feel that you belong together with us on our journey, by giving you a lot of work freedom, time for self studies, having recurring Hackatons, Dev weeks and a lot other fun activities together within the team and across the company to foster a great culture.\nDo you want to be part of the next step in our growth journey?\nIn alignment with the growing targets and needs, we are currently on the lookout for Java Developers to become part of our tight-knit teams in Gothenburg. In the teams, we are continuously looking to find new ways of working that decrease complexity and provide the tools for team members to do their best work.\nWhat will you be doing\nYou will be working on Java technologies, developing/maintaining our core back-end software system and facing fresh challenges along with your team members every day. Day to day tasks include new booking features and after sale support automations. The successful candidate must be knowledgeable in the field of software development and eager to contribute & work in a fast-paced, ever changing environment.\nYou will be part of designing and implementing features for our core back-end system, which handles millions of requests per day.\nYou will work closely with software and product developers.\nYou will test your code and write unit tests.\nDocument and communicate your work with your team in order to deliver weekly releases as well as estimate subsequent sprints.\nYou will participate in a stand-up meeting with your team every morning and participate in a weekly retro/planning session with your team.\nEnsure code quality and adherence to best practices, standards, and guidelines.\nCollaborate with cross-functional teams to implement new features and enhancements.\n\nOur stack\nJava, MySQL, MemSQL, Artemis, Kafka as well as Atlassians agile tools, Git, Jenkins, Docker, Kubernetes, Linux, Mac OS, IntelliJ.\nOf course you don't have to be familiar with all of our tech stack. We will support you in your journey with us.\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\nProven experience as a Java Developer, with a strong grasp of Java or Spring Framework.\nFamiliarity with RESTful web services and API development.\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\nStrong problem-solving skills and the ability to work independently and collaboratively.\nExcellent communication skills to interact effectively with team members and stakeholders.\nUnderstanding of the travel industry and a keen interest in keeping up with industry trends\n\nBenefits\nWhen working at Etraveli Group you will always feel that you are trusted and that you can rely on others to help you. To work together as a team and feel that you are challenged in a way that helps you evolve within your profession. You will have awesome colleagues together with whom you will solve complex problems in a fast-moving business. But not just that.\nWhat else do we offer?\nBrand New office in the City – We are located in Merkurhuset in central Gothenburg, just a stone's throw away from public transport and lunch restaurants.\nConferences – We believe in personal development and continuous education. We continuously organize internal trainings and workshops so that we can learn from each other.\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\nHackaton and Dev week – We believe in fostering creativity and testing new things.\nTo kick the day off just right, we serve breakfast at the office every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/52B77B692A/apply",
        "published": "2025-04-28T14:44:04",
        "deadline": "2025-08-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661465",
        "title": "Senior Python/Matlab Developer- Gothenberg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Professional Galaxy looking for an experienced Matlab and Python developer for one of our clients in Gothenburg. The role requires strong analytical skills, experience working in complex technical environments, and proven knowledge of microwave technology.\nYou will contribute to the creation and improvement of technical systems and analytical tools. Its beneficial if you have a great understanding of microwave technology, as well as the ability to manage technical documentation and databases.\nRequirements: - 3–5 years of experience in Matlab and Python development - Documented experience with microwave technology - Strong skills in handling technical documentation and databases - Excellent communication skills in English - Relevant educational background in engineering, electronics, computer science, or similar\nDuration: 2025-09-01 - 2025-02-28\nApplication deadline: 2025-04-30",
        "url": "https://careers.progalaxy.se/jobs/5857963-senior-python-matlab-developer-gothenberg?promotion=1447444-arbetsformedlingen",
        "published": "2025-04-28T12:59:35",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29538714",
        "title": "Senior Mjukvaruutvecklare",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Du kommer att ingå i ett utvecklingsteam som arbetar med forskning och utveckling av testutrustning, testmetodik och testmiljöer. Syftet är att möjliggöra avancerade tester av automatiserade och uppkopplade fordon för att säkerställa en trygg och hållbar trafikmiljö i framtiden.\nDu förväntas ha en god samarbetsförmåga, vara ansvarstagande och ha en analytisk förmåga med intresse för att sätta dig in i olika forskningsfrågor.\nObligatoriska krav: MSc. inom elektro, mekatronik eller motsvarande.\n \nErfarenhet:\n Minst 5 års erfarenhet som mjukvaruutvecklare i industrin.\n \nProgrammeringskunskaper:\n Goda kunskaper i C++ och Python.\n \nLinux-kunskaper:\n Van att arbeta med olika varianter av Linux-distributioner.\n \nB-körkort:\n Svenskt B-körkort.\n \nSpråkkunskaper:\n Behärska både svenska och engelska i tal och skrift.\n Mervärden (önskvärda kvalifikationer): Kunskaper i MatLab.\n Erfarenhet av sensorfusion och sensorutveckling.\n Erfarenhet av CARLA eller Unreal Engine är meriterande.\n Dokumentation: CV med kompetensbeskrivning.\n Beskrivning av genomförda uppdrag.\n Uppdragsperiod:\n20250407 - 20260406 , 1 år med möjlighet till förlängning om 3 år.\nPlacering:Uppdraget är placerat i Göteborg med en del arbete på en testbana utanför Borås.",
        "url": "https://careers.progalaxy.se/jobs/5674587-senior-mjukvaruutvecklare?promotion=1381054-arbetsformedlingen",
        "published": "2025-03-12T18:39:32",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29939769",
        "title": "Senior Expert Virtual Design Prototyping",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Are you ready?\r\n\r\nVolvo Group Design is embarking on a digital first, integrated and collaborative journey where physical twin assets will support only when relevant. The objectives are to primarily visualize, create and collaborate through augmented and immersive virtual realities.   This will enable new levels of creativity, quality and productivity as well as new ways for instant collaboration, verification and communication. This will make everything come together in one cohesive experience and user journey complemented with physical assets only when necessary for ergonomic, tactile, haptic reasons.  To spearhead this and secure that Designs needs are met in all phases in synch with other disciplines there is a need for a Senior Expert in Virtual Design Prototyping. You will be a high rank expert at the Brown belt level in Global Trucks Technology (GTT) Engineering Career Path (ECP) as a critical future core competence within Volvo Group Design.   \nYou will be a core competence in the long-term journey towards a Digital Spine of Volvo Group Design based on state of the art digital tools, integrated toolchains cross disciplines, a digital first processes, artificial intelligence, automation, external partnership networks etc.   \n\nWhat you will do \n\nDo you dream big? We do too, and we are excited to grow together. In this role, you will: \n  *  Define Vision and Strategy to make Augmented and Virtual prototyping the preferred solution by integrating all design aspects into one collaborative arena.   \n  *  Identify superior methods for innovative and game-changing shift and guidance on Augmented and Virtual platforms.   \n  *  Ensure quality and security in software platforms and data handling.   \n  *  Drive continuous improvement by staying updated on next-gen developments and engage with stakeholders for Design process improvements.   \n  *  Lead by showcasing the business impact of digital design and lead the transition to next-gen processes and define positive business cases for Design and the larger Volvo Group through productivity, quality and creativity improvements.   \n  *  Represent Design in internal and external forums related to virtual prototyping.      \n\n\nThis is you \n\nWe are looking for you who holds a Bachelor’s or Master’s degree in Industrial Design, Mechanical Engineering, or Digital Visual Communication. Additionally, specialized education in virtual prototyping and digital visualization is highly valued. Ideally, you have academic research or project experience in virtual prototyping, with a particular focus on method development and its impact on business. To really enjoy and succeed in this role, it’s good that you also bring along;\n•    Over 10 years of industrial experience in virtual prototyping, particularly in the transportation product industry. \n•    Experience in various design disciplines: Advanced, Physical, Interactive, CMF, and Services design. \n•    Preferably experience in a global design department, ideally in transportation/automotive. \n•    Connections in the Augmented and Virtual prototyping industry with a keen sense of future trends. \n•    Experience from advising higher management and influencing peers. \n•    Extensive participation in industry committees and fairs. \n•    Proven success in securing funding grants for advanced studies. \n•    Thorough experience from VR/AR developments, real-time 3D/spatial experiences, Varjo/Quest/Apple Vision Pro headsets, OS, system libraries, frameworks, 3D math, Obj-C/C++/C, Swift, GPU architecture, and optimizing process bottlenecks. \n\nThis is how you could make an impact \n\nYou demonstrate commitment through actions, creating concepts and prototypes that support visions and strategies. Outgoing and skilled at networking, you are collaborative, influential, and always willing to listen and learn. You build trust and credibility at any level.   You focus on long-term, strategic, and business impact. Humble yet driven, you over deliver consistently. Your disruptive mindset identifies opportunities for innovation. Curious, self-motivated, and enthusiastic, you bring energy to everything you do.   You will guide all global operational colleagues in Virtual Prototyping as well as the larger Volvo Group Design community, stakeholders and higher management on next steps, ways of working and behavioral change.  \nTo succeed, you are proactive, open-minded, and eager to learn. You thrive in dynamic environments, embrace challenges positively, and are committed to making a real impact. Your passion for collaboration and ability to inspire others will help you make a difference.   \nReady for the next step? \nFor further info please contact: Ulf Danertz, Group Manager Modeling & Viz. Mobile: +46 765536688 or Email: ulf.danertz@volvo.com. We value your data privacy and therefore do not accept applications via mail.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43604434",
        "published": "2025-08-22T14:25:06",
        "deadline": "2025-09-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29924313",
        "title": "Senior Product Manager- Eliq Intelligence",
        "employer": "Eliq AB",
        "location": "Göteborg",
        "description": "Hi there!\nHow would you like to work with a world-class team and help disrupt the energy industry and the way consumers use energy and interact with utility companies?\n\n\nEliq is seeking an exceptional Product Manager to lead our Eliq Intelligence Team. In this role, you'll shape and deliver innovative energy analytics solutions that help our utility customers make smarter, data-driven decisions based on deep insights into consumer behavior, energy usage, and home characteristics. This is a new team with a big mission, and we’re looking for someone with an entrepreneurial mindset who thrives in building from the ground up.\n\n\nAbout the Role\nAs a Product Manager for Eliq Intelligence, you'll drive the entire product lifecycle, from ideation to launch and beyond. You'll work closely with engineers, designers, and business stakeholders to build best-in-class data-driven products that support our mission: Making sense of energy data.\n\n\nWhat We’re Looking For\nWe’re looking for a technically inclined Product Manager with experience in data-driven products. You should be comfortable digging into documentation, APIs, and data models to map out technical requirements. Experience in the energy industry and hands-on work with analytics, data platforms, or ML-powered products is a strong plus.\n\n\nIf you have a passion for technology, a strategic mindset, and a proven track record of delivering great products, we'd love to hear from you!\n\n\nResponsibilities\nDefine & Execute Product Vision: Develop and own the strategy, roadmap, and execution plan for Energy Insights products.\nDrive Data-Driven Innovation: Use market research, customer insights, and industry trends to identify new opportunities and optimize existing solutions.\nOwn the End-to-End Product Lifecycle: Work from ideation to launch, collaborating with engineering, design, sales, and marketing teams.\nMeasure Success: Set and track product KPIs, analyze performance, and iterate based on data insights.\nCommunicate & Align Stakeholders: Act as the bridge between technical teams and business stakeholders, ensuring alignment on priorities and goals.\nSupport Go-to-Market Efforts: Work with marketing and sales teams to ensure a strong product launch and adoption strategy.\n\n\n\nQualifications\n3+ years of Product Management experience in a software or SaaS company (energy or data analytics experience is a plus).\nStrong technical acumen, comfortable working with APIs, data models, and system integrations.\nExperience from the Energy Industry, particularly energy retail business.\nExperience with data integration projects (e.g., smart meters, IoT, or utility data).\nAnalytical mindset with experience interpreting complex data to drive product decisions.\nExcellent communication & collaboration skills, able to work with cross-functional teams and align stakeholders.\nAgile & Iterative mindset, experience working in Agile/Scrum environments.\nUnderstanding of go-to-market strategies, including pricing, positioning, and adoption tactics.\n\n\n\nWhy Join Eliq?\nMake a Real Impact – Your work will help millions of people save energy and accelerate the clean energy transition.\nWork with Cutting-Edge Tech – We leverage AI, machine learning, and big data to deliver best-in-class energy insights.\nCollaborate with a Talented Team – Join a mission-driven company with a culture of innovation and ownership.\n\n\n\nAbout Eliq:\nEliq is a leading company in the energy insights space ⚡, serving 30+ utilities across 13 European markets. Founded in 2015, Eliq is a VC-backed business with approximately 40 employees, experiencing significant growth. We are dedicated to improving the way energy is used by making sense of the world’s energy data, enabling businesses to build digital energy products and users to avoid energy wastage. Join us in fast-tracking the planet’s 🌍transition to net zero.\nIf you read this far, it is time to apply:\nWe think you’re excited to work with a team that moves fast, takes risks, and comes to work every day excited about building a product that affects the lives of millions of people, while helping to accelerate the transition to clean energy. We would love to hear from you!\nPrivacy Notice: Your personal data will be processed in accordance with our Privacy Policy. By applying for this position, you agree to the processing of your personal data as described. For more details, please review our full privacy policy.",
        "url": "https://eliq.freshteam.com/jobs/Dwx_CpRZLL6E/product-manager-eliq-intelligence",
        "published": "2025-08-19T13:28:05",
        "deadline": "2025-09-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29916224",
        "title": "Data Warehouse & Integration Specialist till NTEX, Göteborg",
        "employer": "Jerrie AB",
        "location": "Göteborg",
        "description": "NTEX startades för att erbjuda ett svenskägt alternativ på marknaden. Genom förvärv och organisk tillväxt är NTEX nu ett av Sveriges största privatägda speditionsföretag med 3,7 miljarder kronor i omsättning. Bolaget äger runt 1350 trailers för godstransporter samt omlastnings- och logistikterminaler och egna dragbilar. Med över 1 000 medarbetare och ca. 800 000 uppdrag årligen har vi resurserna att ta hand om uppdrag i alla skalor och storlekar. Vi bryr oss. Hela vägen.\n\nOm rollen\n\nVi söker en erfaren och lösningsorienterad specialist som vill ta täten i utvecklingen av vår nya datawarehouselösning. I denna nyckelroll blir du motorn bakom att samla och konsolidera data från flera av våra Transport Management System (TMS) och vårt ekonomisystem Netsuite. Målet? Att skapa en robust och skalbar dataplattform som blir hjärtat i vår framtida kundportal – där våra kunder enkelt kan se historisk data och smidigt boka sina transporter online.\n\nArbetsuppgifter\n\nDesigna, bygga och underhålla en central datawarehouselösning som integrerar data från flera TMS-system och Netsuite samt eventuellt andra interna och externa datakällor.\nUtveckla och optimera ETL/ELT-processer för hög datakvalitet, prestanda och tillgänglighet.\nDefiniera datamodeller för analys, rapportering och realtidsapplikationer.\nSäkerställa datastyrning (data governance), säkerhet, åtkomstkontroller och regelefterlevnad.\nDelta i utvecklingen av en kundportal med historisk och realtidsdata, inklusive API-integrationer.\nSamarbeta med utvecklare och UX-designers för bästa prestanda och användarupplevelse.\nImplementera monitorering och larm för att upptäcka dataproblem proaktivt.\nDokumentera lösningar och utbilda interna användare.\n\n\nOm dig\n\nDu kombinerar teknisk expertis med affärsförståelse och trivs i en roll där du driver utveckling framåt. Du har god kommunikationsförmåga och är van att samarbeta över olika funktioner.\n\nKrav och kompetenser\n\n3–5 års erfarenhet av datawarehouse utveckling och integration.\nGoda kunskaper i SQL och minst en modern dataplattform (t.ex. Snowflake, Azure Synapse, Google BigQuery, AWS Redshift).\nErfarenhet av ETL/ELT-verktyg (t.ex. Fivetran, Talend, dbt, Azure Data Factory).\nFörståelse för molninfrastruktur (Azure, AWS eller GCP).\nFlytande svenska och engelska i tal och skrift.\n\n\nMeriterande\n\nErfarenhet av att använda AI och maskininlärning för:\nPrediktiv analys (t.ex. ETA-prognoser, kapacitetsplanering)\nAutomatiserad dataklassificering och anomalidetektion\nChatbotar eller smarta frågegränssnitt mot data\nErfarenhet av data visualisering (t.ex. Power BI, Tableau, Looker).\nKunskap om API-utveckling och REST/GraphQL-integrationer.\nErfarenhet från logistik- eller transportsektorn.\n\n\nErbjudande\n\nEn nyckelroll i en strategisk satsning som förändrar vårt datadrivna arbete.\nMöjlighet att bygga en plattform från grunden med moderna tekniker.\nInternationell arbetsmiljö med frihet att utforska AI-lösningar.\n\n\nNTEX erbjuder en trivsam arbetsmiljö med trevliga kollegor. Här får du de verktyg du behöver för att utföra ditt arbete på bästa möjliga sätt. På NTEX har vi ett stort hjärta för våra medarbetare och våra kunder. Vi tror på att vara branschledande genom att ständigt förbättra oss och ha ett nära samarbete med kunder och leverantörer. Vi bryr oss hela vägen!\n\nAnsök\n\nLåter detta som nästa steg i din karriär? Skicka in din ansökan redan idag – vi intervjuar löpande.\n\nÄr du nyfiken och vill ställa några frågor? Hör gärna av dig till Igor Glavan, igor.glavan@jerrie.se, 0701-765828. Välkommen med din ansökan!",
        "url": "https://jerrie.se/lediga-jobb/2737-data-warehouse-integration-specialist-till-ntex-goteborg?pnty_src=arbetsformedlingen",
        "published": "2025-08-18T02:16:25",
        "deadline": "2025-09-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29911800",
        "title": "Data Engineer Insight",
        "employer": "Nexer AB",
        "location": "Göteborg",
        "description": "Data Engineer\nDo you want to build the next datamodels för AI, ML and datawarehouse empowered solutions?\nNexer Insight, a Microsoft partner, invites you to embark on a journey as a Data Engineer where you'll be part of an extraordinary team, engage in exciting activities, work with fascinating clients, tackle varied and challenging tasks, and enjoy exceptional benefits. We are committed to leveraging cutting-edge technologies such as Databricks to drive innovation and excellence in everything we do.\nDo you want to be our next ”Data Ninja”?\nJoining Nexer Insight means becoming a vital part of a company that embodies entrepreneurship and innovation. Here, you'll have the chance to engage with cutting-edge technology from Microsoft, Databricks, and DBT Labs, as we proudly partner with them. We're committed to investing in our employees, empowering them to excel in their fields through professional growth and development opportunities. Collaboration is at the heart of our approach, as we value teamwork and foster a vibrant community spirit. Dive into the exciting intersection of data engineering and data science, where you'll have the chance to make a meaningful impact.\nKey Responsibilities:\n Develop and operate scalable and robust analytical models.\n Set up data platforms and build data models and pipelines.\n Innovate and collaborate with customers to learn and find new business opportunities.\n Become a champion in best practices regarding architecture, data quality, reliability, and performance.\n Be at the forefront of the latest data engineering technology.\n Leveraging Microsoft Azure services for data processing, transformation, and storage.\n You propel progress and ensure delivery by constructing top-tier cloud solutions, empowering our customers to adopt a data-driven approach.\n \nBased on our criteria för the role, we expect you to have:\n Hands-on project experience of working with cloud solutions (Azure, AWS or GCP)\n Experience working with ETL tools such as Azure Data Factory, Databricks, DBT, Snowflake\n Experience with Data Lakes or Lakehouse Architecture\n In-depth knowledge of SQL syntax\n Experience in information and dimensional modelling\n Good knowledge of DevOps processes with git version control and CI/CD methodology\n Speaks English and Swedish fluently\n \nMeritorious experience:\n Platform modernisation\n Tabular cubes and DAX\n Data Vault modelling\n Experience in setting up Azure, AWS or GCP Infrastructure",
        "url": "https://nexergroup.teamtailor.com/jobs/3229885-data-engineer-insight?promotion=1590007-arbetsformedlingen",
        "published": "2025-08-15T10:06:45",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29905203",
        "title": "Product Manager Lead",
        "employer": "Hirely AB",
        "location": "Göteborg",
        "description": "Product Marketing Lead - Severa\n\nDo you want to be part of an exceptional marketing team and build a growth story? Are you at your best with SaaS products, planning international growth and marketing strategies? Are you excited about the opportunities that AI brings to us marketers?\n\nWe are looking for a Product Marketing Lead for Severa, our Professional Services Automation (PSA) product. If you thrive on developing and executing international growth and marketing strategies for SaaS products, and are eager to contribute to building Severa’s success story, we want to hear from you!\n\nSevera is already a very well-known B2B SaaS product in its target group in Finland. We are also growing rapidly in Sweden and other Nordic markets through our partner network. The focus of our future growth and marketing efforts is strongly on the other Nordic countries, in addition to the existing presence in Finland.\n\n\nWhat can you expect when joining us?\n\nYour role as Product Marketing Lead for Severa is versatile and challenging. You are responsible for growth in the markets and the effectiveness of marketing across the entire customer journey. You are closely involved in Severa’s business development and decision-making, working as part of Severa's product management team.\n\nYour main responsibilities:\n\nLeading marketing efforts for Severa. You are responsible for marketing strategy, goal prioritisation, and marketing effectiveness.\n\nCreating demand generation and demand capture strategies, as well as increase the value for existing customers.\n\nSetting high-level marketing goals and your team priorities through the OKR model.\n\nBelonging to Severa product management team and are strongly involved in business decision-making from a marketing perspective.\n\nDeveloping marketing for the whole Visma Solutions together with the Marketing Director and Product Marketing Leads from other product lines.\n\nLeading the 4-person product marketing specialist team for Severa.\n\n\nYou will be supported by our marketing professionals and experts in various marketing areas, as well as members of your product management team.\n\nYour role as Product Marketing Lead for Severa is versatile and challenging. You are responsible for growth in the markets and the effectiveness of marketing across the entire customer journey. You are closely involved in Severa’s business development and decision-making, working as part of Severa's product management team.\n\nHow to succeed?\n\nAs an ideal candidate, you would have several years of experience in marketing in a growth company. You are familiar with the Nordic markets and have already gained experience in marketing for the Nordic region. Preferably you would also have previous experience in leading a team.\n\nYou are a committed, active, and solution-oriented team player. You dare to put your skin in the game, lead through experimentation, and set ambitious goals. You are not daunted by demanding business goals, and you have the analytical skills to analyse marketing effectiveness.\n\nIn addition, we appreciate\n\nprevious experience from commercial roles and/or in SaaS product marketing\n\npractical experience in setting goals according to the OKR model\n\nexperience or insight into ABM and partner marketing.\n\n\n\nWhat we offer\n\nA lot of learning and enjoying the work with a great team. With us, you will build your own growth story! 🚀\n\nAs Product Marketing Lead for Severa you will operate in the modern SaaS marketing field in a rapidly changing market environment, and with skilled professionals. Our 35-person marketing team is known in the company for its warm team spirit and professional work. An active product management team, growth targets in several markets, and great colleagues ensure that you will not have a boring day in this role.\n\nThe employment contract is concluded with Visma Tech, but you will be working for Visma Solutions on the Severa product. The team consists of four employees who are located in Finland, but there is also one employee in Sales located in Sweden.\n\nWith us, you get a pleasant and relaxed work community of over 500 colleagues, modern work tools, and employee benefits that support the harmony of work and leisure. A multinational group combined with the agile operations of the Visma family of companies creates a unique work environment and excellent career opportunities.\n\n \n\nInterested? Tell us about yourself!\n\nIf this sounds like your next step, we’d love to hear from you! Please apply by September 7th 2025, and tell us why you’re excited about this role.\n\nYour workstation is located in Gothenburg, but you can also work remotely. The position requires occasional travel to Finland (Helsinki), approximately once a month.\n\nThe recruitment process includes 2 interview rounds with a small task and an online personality assessment. We are happy to hear your expectations for the salary range based on your experience.\n\nQuestions about the role? Reach out to our Growth Marketing Director Juha Kuokkanen at +358 44 347 7869. Juha is available for calls between August 19th-21st from 2pm to 3pm.\n\nDo you want to know more about career opportunities? Check out our career site.",
        "url": "https://jobbify.se/?post_type=job&p=71956",
        "published": "2025-08-13T14:44:07",
        "deadline": "2025-09-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29815823",
        "title": "Research Engineer(s) in fusion reactor modelling and design",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join the Plasma Physics and Fusion Energy group to help develop the European Transport Simulator (ETS), a cutting-edge fusion research tool supporting the development of modelling fusion power plants. We’re hiring Research Engineers with expertise in areas such as UI design, data analysis, AI/ML integration, and HPC workflows to contribute to the next-generation modeling framework\n\nInformation about the department\nThe Plasma Physics and Fusion Energy (PPFE) group at the Department of Space, Earth and Environment/Astronomy and Plasma physics division has its main activities in modeling, simulation and analysis of tokamak plasmas. A major part of the work is towards the establishment of a predictive capability for fusion energy grade plasmas and model validation towards current experiments. The group has extensive collaborations with major fusion devices and are taking part in the developments for the ITER experiment and the design of scenarios for future pilot power plants. \nThe activities are fully integrated with the European (EUROfusion) activities, and the research group also engages in the development of open data access for fusion experiments and modeling data. We are now aiming to upgrade our main research tool to a new modelling framework while also upgrading user interfaces and data analysis capabilities.\n\nMajor responsibilities\nThe ETS project addresses a range of technical challenges, and we are currently moving the code to a new python based High Performance Computing enabled modelling framework. \nThis is an exciting opportunity to contribute to a high-impact scientific codebase that supports fusion research across major European experiments and ITER. The work will be performed in a collaborative, international environment, with opportunities to engage with a wide network of researchers and institutions across Europe.\n\nContract terms\nThis is a fulltime temporary employment limited to a maximum of 360 days.\n\nQualifications\nWe are looking for individuals with relevant expertise towards at least one of the activites below\n- Maintain the ETS workflow in the Python/MUSCLE3 framework including CD/CI support\n- Develop analysis tools for ETS components (e.g., runtime debugging, offline debugging for Transport Code Interfaces package)\n- Maintain and further develop python based visualization tools for ETS (runtime, postprocessing).\n- Develop the graphical user interface for ETS\n- Integration and support of AI/ML-based surrogate models\n- Support the ETS data access tools and help integrate ETS output in an open access environment\n\nFurthermore, you should have a M. Sc in relevant field, for example Computational Science, Software Engineering or Computational Physics. Experience in programming (python, C++, fortran...), data management and/or visualization is needed. Experiences in plasma physics is meriting but not mandatory.\n\nWe offer \nChalmers offers a cultivating and inspiring working environment in the coastal city of Gothenburg. \n Read more about working at Chalmers and our benefits for employees.\n\nChalmers aims to actively improve our gender balance. We work broadly with equality projects, for example the GENIE Initiative on gender equality for excellence. Equality and diversity are substantial foundations in all activities at Chalmers.\n\nApplication procedure\nThe application should be sent electronically and be attached as pdf-files, as below:\n\n\n• CV: (Please name the document as: CV, Family name, Ref. number)\n• Personal letter: (Please name the document as: letter, Family name, Ref. number)\n\n\n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered.\n\nApplication deadline: 2025-08-24\n\nFor questions, please contact:\nPär Strand, SEE/AoP, par.strand@chalmers.se, 031 7721514\n\n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. *** \n   \n\n\n\nChalmers University of Technology conducts research and education in engineering sciences, architecture, technology-related mathematical sciences, natural and nautical sciences, working in close collaboration with industry and society. The strategy for scientific excellence focuses on our six Areas of Advance; Energy, Health Engineering, Information and Communication Technology, Materials Science, Production and Transport. The aim is to make an active contribution to a sustainable future using the basic sciences as a foundation and innovation and entrepreneurship as the central driving forces. Chalmers has around 11,000 students and 3,000 employees. New knowledge and improved technology have characterised Chalmers since its foundation in 1829, completely in accordance with the will of William Chalmers and his motto: Avancez!",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14133&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-07-07T09:24:37",
        "deadline": "2025-08-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29805236",
        "title": "Development Manager",
        "employer": "Visma Software AB",
        "location": "Göteborg",
        "description": "We're Visma Software Nordic, a leading SaaS ERP House, deeply rooted in the Nordic market. Our ERP product suites specialize in simplifying complex business processes, empowering our customers to stay focused, scale and work smarter.\n \nOur Purpose is to Simplify the complex. We dive into our customers' most intricate operations and make them efficient and simple to perform. Our Vision is to Shaping the future through smart technology. We're committed to innovation and pushing the boundaries of what's possible. Our Mission is to Create a seamless experience with local edge. We combine a broad, unified product offering with deep, localized expertise within the Nordic market.\n\n\r\n\r\nDevelopment Manager to Transpa - Visma Software Nordic\n\nAre you ready to lead a highly competent product development team towards the future? If you’re driven by people leadership and leading operational excellence in a tech savvy environment, you should continue reading. We are now looking for a Development Manager to Transpa Business Line in Visma Software Nordic (Gothenburg or Munkedal). \n\n\nWhat You’ll Do\n\nAs a Development Manager, you’ll take full ownership of your team’s success, focusing equally on leadership, people development, and strategic projects. At our company, people are at the heart of everything we do. You’ll lead a distributed product development team across Sweden and Romania, ensuring they thrive in a well-structured and engaging environment. Our team consists of talented people working within the whole development chain from A to Z with our product TransPA. Part of your time you’ll also be our key player as project manager for a number of strategic projects, with focus on increasing growth and customer engagement.\n\n\nTranspa is built and developed specifically for the transportation industry. An easy-to-use, fully web-based solution that helps you automate payroll management, gather all information in one place, and gain full control over time, personnel, agreements, and laws.\n\n\nIn this role you will report directly to Business Line Director, Oscar Mattsson, and also be part of the local management team for the business line. Your main responsibilities will be:\n\n\nPeople Leadership:\n\n\n\n• Drive people related processes in your team, such as recruitment, performance development and employee engagement.\n\n• Coach individuals to help them grow and excel in their roles and reach their full potential.\n\n• Drive communication and translate business strategies & OKR:s to concrete plans for your team.\n\n• Create a culture of psychological safety, collaboration, and continuous learning.\n\n• Develop and drive work methods, ensuring they align with business goals and foster productivity.\n\n• Improve and implement processes that enhance efficiency and quality across the teams. This includes harnessing the potential of AI for internal use, to help the team work smarter, not harder.\n\n• Oversee budgets, resource allocation, and team structure to ensure your department operates effectively.\n\n\nStrategic Projects:\n\n\n\n• Act as project manager for strategic projects, from concept to completion, ensuring they are delivered on time, and within scope, and meet our high quality standards.\n\n• Engage in market facing initiatives, to make sure TransPA has a voice as thought leaders software vendor in the Swedish transport industry.\n\n• Bridge the gap between technical development and business strategy, driving initiatives that align the development team’s innovation with our commercial goals.\n\n\nIn this role, you can be based at either our office in Munkedal or in Gothenburg. Business travels are included in the role. \n\n\nWhat makes this role exciting\n\nWe are currently in a very exciting phase of TransPA’s journey. As of 2025, we have established our own independent business line within our mother company Visma Software Nordic. This means we have brought together all teams in the TransPA value chain – from code to customer – under one roof. The goal? To become an even stronger and more product-focused team. As our new Development Manager, you will play a key role in this transformation. With us, you’ll get the best of both worlds – the opportunity to lead in a smaller, agile organization while also benefiting from the strength of both Visma Software Nordic and the wider Visma Group.\n\n\n\n\n\nWe offer:\n\n\n• Personal growth: Leadership development and a culture that prioritizes psychological safety.\n\n• Great perks: Such as flexible hybrid work model, private health care insurance, access to company cabins in the Alps to mention a few.\n\n• A flagship product: Work with Transpa, a market leading personnel product in the Swedish transport industry.\n\n• Supportive culture: Ownership, empowerment, and collaboration are core to who we are.\n\n\n\n\n\nWho are we looking for?\n\nWe believe that you are / have:\n\n\n\n• Previous experience and success from leadership & project management.\n\n• Proven track record in engaging people and optimizing processes.\n\n• Previous experience from working within a software development organisation. You don’t have to be a technical hero yourself, but you have genuine interest and insight into software development methods and principles. \n\n• A great networker and a skilled social navigator in international and complex environments.\n\n• Skillful in conveying clear, honest communication. Fluency in Swedish and English.\n\n\nBonus points if you have:\n\n\n\n• Experience from the transport industry or similar, logistic heavy operations.\n\n• More extensive technical background.\n\n• Success in managing remote and distributed teams.\n\n\nApplication\n\nApply by attaching CV or a link to your updated LinkedIn profile. We friendly decline cover letters in this process. Don't wait to seize this opportunity! We're reviewing applications as they come in, but due to summer vacation we will start the process in August. Questions? Contact Oscar Mattsson, Business Line Director, 46 734 344795",
        "url": "https://hire.vismatalent.com/spa/public/apply?guidAssignment=8930f205-6aae-404f-be7a-09ff72f3f5ff&publishCode=AMS&TK=5470dc3a-dafb-4906-aa5a-4bfa4cb997b7",
        "published": "2025-07-01T16:20:27",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787427",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-06-24T08:06:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787426",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-06-24T08:03:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760753",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
        "published": "2025-06-10T13:37:03",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]