[
    {
        "id": "30179680",
        "title": "Systemutvecklare ServiceNow GRC (Governance Risk Compliance)",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nDin roll\n\nDu kommer att ingå i vår centrala ServiceNow-grupp, där ditt fokus på GRC-projekt gör dig till ett värdefullt tillskott. Vi befinner oss i en spännande och snabbväxande fas, där vi förutom nyutveckling också arbetar med att underhålla och förädla befintliga lösningar.\n\nVåra verksamhetsnära projekt ger unika möjligheter att bidra till verklig affärsnytta. Därför är det viktigt att du, förutom att vara en skicklig utvecklare, också är duktig på att förstå verksamhetens behov och skapa välanpassade lösningar. Du behöver vara lika intresserad av att lyssna på och kommunicera med verksamheten som av att arbeta självständigt som utvecklare.\n\nResor kan tillkomma i tjänsten, främst till våra andra kontor runt om i landet. Det finns möjligheter att arbeta remote i viss utsträckning, och detaljerna kring detta kommer du att komma överens om med din närmaste chef.\n\nDin profil\n\nFör att passa hos oss tror vi att du är prestigelös och har en stark vilja att ständigt utvecklas och bli ditt bästa jag. Du trivs med att arbeta agilt, tar gärna egna initiativ och är naturligt hjälpsam. Eftersom vi arbetar i team är det viktigt att du känner dig bekväm i en lagmiljö. Vi är övertygade om att det är tillsammans som vi når framgång - genom att lita på, stötta och lära av varandra, både för Saabs bästa och för vår personliga utveckling.\n\nVi värdesätter också kreativitet och förmågan att tänka utanför boxen - att våga prova nya vägar och hitta innovativa lösningar är en självklar del av vårt arbetssätt.\n\nVi ser gärna att du har:\n\n * \n\nErfarenhet av implementering och/eller förvaltning av GRC (Governance, Risk & Compliance)\n * \n\nGod förståelse för GRC/IRM i ServiceNow samt kännedom om vanliga fallgropar\n * \n\nGod kunskap om ServiceNow som plattform\n * \n\nErfarenhet av att arbeta i ServiceNow-projekt med ambitionen att återgå till så kallade \"Out of the Box\"-lösningar\n * \n\nFörståelse för kopplingen mellan affärsvärde och GRC-processer\n * \n\nErfarenhet av agila arbetssätt\n * \n\nFlytande svenska och engelska i både tal och skrift\n * \n\nEn lagspelare som trivs i team\n\nMeriterande är om du också har:\n\n * \n\nKunskap om säkerhetsstandarder såsom ISO 27001 och NIST\n * \n\nCertifieringen CIS Risk and Compliance\n * \n\nErfarenhet av arbete som kravhanterare\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n \n\nVad du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här\n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=YS5vbHNzb24uOTcwMjguMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-10-23T10:50:36",
        "deadline": "2025-11-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988634",
        "title": "Systemutvecklare",
        "employer": "Zcelero AB",
        "location": "Göteborg",
        "description": "Din profil och kvalifikationer\n \nDu är en passionerad mjukvaruutvecklare som strävar efter kontinuerlig professionell utveckling, omfamnar innovation och ständig förbättring. Att dela din kunskap med dina erfarna kollegor är en central del av Zceleros arbetskultur. Som mjukvaruutvecklare i vårt team kommer du att använda de senaste teknikerna för att skapa innovativa lösningar och tjänster som gynnar våra kunder.\n \n \nC#/.NET \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 6 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      C#/.NET\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Microsoft Azure eller Amazon Web Services (AWS)\n·      Erfarenhet av Azure DevOps och Azure Pipelines eller liknande\n·      Best practices som SOLID och Clean Code\n JAVA \n \nI den här tjänsten behöver du ha:  \n·      Universitetsexamen inom software engineering, computer science eller liknande\n·      Minst 4 års erfarenhet\n·      Flytande svenska samt engelska både i tal och skrift\n·      Java (senaste version)\n·      Spring och Spring Boot\n·      Docker och Kubernetes\n·      TDD (Test Driven Development) eller BDD (Behavior Driven Development)\n·      Amazon Web Services (AWS) eller Microsoft Azure\n·      Best practices som SOLID och Clean Code\n \nMeriterande om du har erfarenhet av\n·      Kafka, PostgreSQL, DynamoDB, Elastic search, Microservices arkitektur på AWS\n·      DevOps, Cloud Ops, CI/CD pipeline\n·      Container technologies (Docker, Cloud Formation, TerraForm, osv)",
        "url": null,
        "published": "2025-09-04T13:27:25",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30224848",
        "title": "System Requirements Engineer IRC280777",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Description\nWe are working on a next generation car platform for one of the most well-known european car brands.\nRequirements\nRequired qualifications\nExtensive experience with Requirements Gathering and Specification\nCarweaver experience (a.k.a. Systemweaver)\nExperience cooperating with basetech unit\nExperience with tools like Elektra, DOORS, Teamcenter, JIRA\nExperience with Software Requirement Specification, SWRS\nSolid background in Software Development with good understanding of Agile development methodology principles\n\n \nPreferred qualifications \nSW Development experience using C++ 14\nConfiguring and using Jenkins\nPython / Bash Scripting\nSetting up and configuring Windows computers with Cygwin\nSetting up and configuring Linux computers\nExperience with working with international teams in a multi-cultural environment.\nPrevious experience with AUTOSAR, MQTT, TCP/IP, CAN, LIN or similar\nExperience with Safety Critical standards\n\nJob responsibilities\nAs a requirement engineer, we expect that you will be able to drive requirements related questions from the supplier and work on finding and creating missing requirements based on the design and prototype work done. The requirements are to be stored in Carweaver and shall be exported to the supplier and tracked. \nThe position requires you to be delivery focused, pro-active and able to work under rapidly changing conditions with international stakeholders in a multi-cultural environment.\nYou also have:\nGood communication skills\nThe ability to work together with different teams and stakeholders towards common goals\nAnalytical skills, ability to change perspective \nAn appreciation of working with other skilled professionals\nThe ability to accept, promote and drive change and implementation \nA structured and analytical way of taking on tasks and performing on a daily basis in a result oriented way, under unclear or rapidly changing conditions.",
        "url": "https://www.globallogic.com/careers/system-requirements-engineer-irc280777/",
        "published": "2025-11-04T16:35:55",
        "deadline": "2025-11-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30222565",
        "title": "Senior Automation Test Engineer C++",
        "employer": "Luxoft Sweden AB",
        "location": "Göteborg",
        "description": "Luxoft is a leading global software services company, delivering professional services across multiple business verticals such as finance, automotive, and digital transformation. The Automotive practice inside DXC Luxoft delivers SW projects to a majority of the world's car manufacturers and suppliers for both personal and commercial vehicles. We are known for our Automotive SW expertise and for helping our customers with high quality services and deliveries. Currently we are growing for our Swedish customers and are looking for Software Developers to join our team. You will be part of our growing organization in Sweden and will be part of developing next gen systems for the Automotive industry for the age of connected, autonomous, electric vehicles. Participate in the process of test system flow by defining test activities, equipment, asset under test and DUT (Device Under Test) preparedness together with requirement owner and suppliers..\nResponsibilities:\nAs a senior Test Automation Engineer at Luxoft you will be responsible for:\n• The ECU component verification, i.e. black and white box test, acceptance test and regression test on deliverables from supplier (both inhouse and external).\n• Automation of test cases in vTestStudio for Component-/Domain- and Complete testing in bench rig, HIL and on Vehicle. Test Cases to automate are from all functional areas.\n• Creating and maintain automation test framework in Python.\n• Testing methods & test case development, planning and coordination of test activities together with rest of the team. • Creating Fault reports and assign to receivers to investigate and create solutions.\n• Reviewing and communicating with suppliers' the test reports and results.\n• Independently take logs and measurement on the component and actuators and signals.\n• In collaboration with developer analyze logs to identify root cause of faults.\n• Ensuring the work is delivered as per specified acceptance criteria and definition.\n• Reading and analyzing from HIL's or other test set-ups.\n• Empowering close collaboration with team members within team and other teams.\n• Being self-organized and outspoken to support the team creating the best solutions.\nMandatory Skills Description:\n• Bachelor's or Master's degree in Engineering or equivalent education.\n• At least 8 years of experience from manual and automated verification of automotive embedded software.\n• Programming knowledge in Python and exposure to C++.\n• Knowledge and understanding how to read electrical schematics, use of instruments such as voltmeters and oscilloscopes.\n• Experiences of the following tools is preferred: Requirement management tool, Vektor tools like Canalyzer/Canoe (both Hardware and software), Inca and DSA.\n• Fluent in English.\n• European B-driver license.\nNice-to-Have Skills:\n• HIL sanity test automation in CANoe (CAPL) or Robot Framework.\n• Vector tools knowledge. • DSPACE tools knowledge.\n• JavaScript expert competence.\n• Docker.\n• Ansible.\n• Git, Gerrit, Artifactory.\n• CI/CD mindset.\n• Passion for new technologies, software and hardware test and creating great user experiences.\n• Willing to take up the task that is most important for the team to progress.\nhttp://www.luxoft.com",
        "url": "https://career.luxoft.com/jobs/regular-automation-test-engineer-15378",
        "published": "2025-11-04T11:44:00",
        "deadline": "2025-11-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30219739",
        "title": "Senior DevOps Engineer",
        "employer": "Explipro Group AB",
        "location": "Göteborg",
        "description": "We are looking for an experienced DevOps engineer who wants to enhance security and performance through reliable and scalable solutions.\nYou will work closely with architects and engineers to run applications and services on AWS, build and maintain integrations in our CI/CD ecosystem, and support product teams in effectively utilizing the platform. You will also identify bottlenecks, drive improvements, and shape how we deliver critical services at enterprise scale.\n\nAbout You\nYou are a customer-focused DevOps engineer with a strong background in AWS and modern CI/CD practices. You enjoy simplifying complex problems, thrive in collaborative environments, and take ownership of solutions from design to delivery.\n\nRequirements:\n- 7+ years of experience with AWS cloud architecture and operations\n- Solid background in CI/CD pipelines, automation, and monitoring\n- Hands-on experience with containerization and Kubernetes\n- Knowledge of Infrastructure as Code (Terraform, CloudFormation, CDK, or similar)\n- Good understanding of secure and reliable system design\n- Fluent English, spoken and written \n\nWe are looking for individuals who are passionate about technology and want to improve our ways of working and solutions. With us, you will have the opportunity to work with leading technology companies and explore new technologies in a supportive and innovative environment.\nWe look forward to hearing from you!",
        "url": "https://career.explipro.com/jobs/6361033-senior-devops-engineer?promotion=1697451-arbetsformedlingen",
        "published": "2025-11-03T17:12:02",
        "deadline": "2025-12-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30209467",
        "title": "HIL Developer - Automotive",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "HIL rig developer for AD system verification and validation\n\n\nThe right candidate should have the following key competencies for the position:\n* Experience of HIL development in HIL rigs for real-time systems\n* Good knowledge of equipment for electronics system or component testing\n* Experience with development of high-quality, production-level software\n* Skilled C/C++ programmer in Linux environments\n* Very good understanding of software tool chains\n* Be proactive in suggesting enhancements and technological choices in HIL rig development and HIL testing as well as experience in automation to ease the day to day tasks\n* Should have had exposure to large scale simulation environment & DevOps\n* Preferably experience in communication protocol, DDS, REST API, UDS, Ethercat\n* Basics of CAN (e.g. J1939) protocol and Canalyzer, CANOE, CAPL\n* Preferably knowledge of perception sensors autonomous driving such as lidar, radar and camera\n* Experience of simulation for AD/ADAS, HIL rigs, and test automation tools, i.e. Carla, from dSpace, Vector, or NI",
        "url": "http://www.skillhuset.se",
        "published": "2025-10-31T01:37:55",
        "deadline": "2025-11-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30180604",
        "title": "Senior Developer to Relay Software Team",
        "employer": "Mullvad VPN AB",
        "location": "Göteborg",
        "description": "About Us \nMullvad VPN is a Swedish VPN company dedicated to fighting mass surveillance and censorship. We do this primarily through our VPN service and our web browser.\nWe believe in a free and open society where people have the right to personal privacy; the right to their own thoughts and opinions, and the right to decide exactly when and with whom they want to share them.\nWe believe that privacy is the right which all other rights rest upon, and that democratic societies must be built on the right to privacy in order to thrive and develop.\nThe Job\nWe’re looking for a Senior Developer to join our Relay Software Team at Mullvad. This team is responsible for all custom software solutions used on our VPN relays. \nYou’ll play a key role in advancing server support for technologies such as Quantum-secure tunnels, traffic-analysis protection and protocol obfuscation. \nWho Are You\nYou’re someone who enjoys working in a team, contributes ideas proactively, and has a strong interest in security, networks and low-level software development. \nYou value quality, maintainability, and thoughtful software design. You are curious and eager to learn, and you understand the importance of digital privacy.\nResponsibilities Work on new and exciting technologies and greenfield projects.\n Using Go, design and implement robust server software for running on Linux.\n Author clean solutions that balance performance and resource usage.\n Perform measurements, testing and troubleshooting.\n Coordinate with stakeholders and developers in other departments.\n Qualifications Excellent written and spoken English and Swedish.\n Highly developed understanding of software design and all aspects of software implementation.\n Experience with building server software.\n Excellent understanding of networking fundamentals.\n Strong knowledge in at least one of C/Go/Rust.\n Why Mullvad?\nWe are a bunch of diversified peeps: from vegans to marathon runners, audiophiles to farmers and coffee brewers. So, what unites us? Our commitment to living and breathing our mission, to make mass surveillance and censorship impractical. \nAdditional Information\nLocation: Gothenburg, Sweden Start: As soon as possible Job Hours: Full-time\nThis is an ongoing recruitment process and we aim to fill the position as soon as possible. As part of our hiring process, we conduct a background check to ensure a safe and secure work environment.",
        "url": "https://www.mullvad.careers/jobs/6634589-senior-developer-to-relay-software-team?promotion=1683351-arbetsformedlingen",
        "published": "2025-10-23T13:07:36",
        "deadline": "2026-04-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29983430",
        "title": "Senior DevOps Engineer",
        "employer": "Irisity AB (publ)",
        "location": "Göteborg",
        "description": "About this role \nWe are now looking for a Senior DevOps Engineer for our organization, someone with a deep interest in infrastructure and enabling fast feedback loops for developers by developing continuous integration capabilities. You will belong to a small and passionate team responsible for developing our infrastructure and related technology stack for on premise and cloud deployments; the foundation for our video analytics platform that thousands of cameras across the world are connected to. \nSome of the technologies we use: \n Go and C++ \n  Kubernetes, OpenShift and Docker \n  Kafka, Redis, MongoDB and Postgres \n  Elastic and Grafana \n  Git, CircleCI and ArgoCD \n \nOur company culture is based on freedom and responsibility. For us that means you will be given extensive freedom to make strategic technical decisions while meeting our ambitious standards and making decisions in a responsible way. You will be located at our headquarters in Gothenburg where we are a team with a lot of positive energy and a strong sense of community. \nWho we think you are \nTo be successful in this role, we expect you will bring experience of working with product development and/or solutions that leverage physical or cloud infrastructure. Experience with on premise deployments is a plus. You also need a good understanding of organizational aspects of software development and of how to collaborate efficiently with others. \nRequirements \n At least 4 years of experience working with infrastructure and tooling for applications with high performance requirements. \n  Strong knowledge of multiple of the technologies we use, e.g., OpenShift, Kubernetes, databases and messaging systems. Kubernetes administrator certificate is a plus. \n  Linux administrator knowledge, e.g., knowledge in kernels, different distributions etc. \n  General interest and knowledge in security. \n  A strong desire to collaborate with others and to contribute to team success. \n  Great understanding of both Windows and Linux build environments and toolchains. \n  Excellent communication and organization skills and great personal initiative and drive, with an ability to understand the requirements of different stakeholders, keeping things organized, and making things happen. \n  Proficiency in English. Swedish is a plus but not a requirement. \n  A degree in computer science or software engineering. Alternatively, a combination of other relevant education (formal or self-taught) and experience. \n \n\nAbout Irisity \nAt Irisity, we develop video analytics software for the security industry with profound respect for personal integrity and privacy, focusing on detecting suspicious activity rather than exposing personal identity. Our system excels at the automatic detection of unwanted activity, such as intruders at construction sites at night, or people climbing roofs or breaking windows. We focus on detecting and preventing criminal activity without registering the identity of regular citizens. At sensitive installations such as schools, our system anonymizes all individuals to hide their identity, to make sure that the invasion of privacy is kept at a zero level. This way, our system can detect what happens and alert, leading to reduced crime rates and increased safety without any negative effects on personal privacy. \nIrisity AB (publ) is a public company listed at OMX Nasdaq First North, with headquarters in Gothenburg. We currently employ a staff of 90+ people globally in development, sales, support, and finance. Our R&D department consists of a computer vision / machine learning team together with an excellent group of system architects, designers, and software developers. \nWe are now looking for more skilled, friendly, and passionate people who want to participate in making sure that the camera security industry ends up on the right side of history. \nAs a global company, we value diverse, inclusive teams that can contribute to our team success through their unique perspectives and experiences and backgrounds. \nWe are looking forward to receiving your application. Selection and interviews will be performed continuously until the position is filled. Read more at www.irisity.com",
        "url": "https://career.irisity.com/jobs/6394507-senior-devops-engineer?promotion=1612570-arbetsformedlingen",
        "published": "2025-09-03T13:10:25",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30146336",
        "title": "CNC FRÄSARE/ PROGRAMMERARE",
        "employer": "Ingeniörsfirma Bågenfelt & Hellström AB",
        "location": "Göteborg",
        "description": "VI SÖKER CNC FRÄSARE/ PROGRAMMERARE!\nVi har idag en mycket fin och modern cnc maskinpark med en växande organisation som nu söker nya medarbetare!\nVi arbetar med Mazak cnc maskiner kunskap i styrsystem Mazatrol eller Master CAM är meriterande.\n\n\nOm oss:\nVi är ett ledande verkstadsföretag inom Fräsning, svarvning, laserskärning, bockning, svetsning, maskinbearbetning samt automation i Västra Frölunda/ Göteborg. Vi söker medarbetare som inte är rädda för nya utmaningar med driv och brinnande intresse för att växa med oss!!\n\n\nArbetsbeskrivning\nVi söker dig som har\n* Erfarenhet och verkstadsvana inom cnc fräsning, programmering.\n* Tekniskt intresse och kompetens\n* Initiativförmåga, kvalitetsfokus, noggrannhet, produktivitetsfokus och kan jobba självständigt",
        "url": "www.bagenfelt.se",
        "published": "2025-10-14T19:00:05",
        "deadline": "2025-11-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226640",
        "title": "Robotics Programmer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Robotics Programmer (ABB / Yamaha) to be based at our customer site in Gothenburg.\nThe role\nWe are seeking a highly skilled Robotics Programmer with expertise in ABB and Yamaha robotic systems to support advanced manufacturing processes including laser treatment, glue dispensing, and precision assembly. This role involves programming, calibrating, and optimizing robotic operations to meet performance, safety, and quality standards in automotive or battery production environments.\nKey Responsibilities\n- Program, calibrate, and optimise ABB and Yamaha robots for laser, dispense, and assembly operations.\n- Fine-tune robot paths to achieve required cycle time and quality.\n- Conduct online and offline programming using RobotStudio / Yamaha RCX Studio.\n- Validate safe robot motion and compliance with commissioning robot standards.\n- Collaborate with PLC, vision, and process engineers for seamless integration.\n- Support commissioning for laser, glue, and vision-guided robot cells.\n- Analyze defect, process improvement and Cycle time enhancement to improve productivity.\nRequired Skills\n- Strong command of ABB RAPID and Yamaha RCX programming environments.\n- Experience commissioning robots in automotive or battery manufacturing lines.\n- Proficiency in TCP calibration, path optimisation, and safe motion configuration.\n- Exposure to vision-guided robotics and dispense process synchronization preferred.\n- Experience of Robotic offline programming using Simulation software's like Delmia, Process Simulate, Robot Studio\nIf you are passionate about bringing innovation to the projects you work on and want to join a global company, then this is the place for you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-11-05T10:28:20",
        "deadline": "2025-12-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30215604",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2025-11-03T10:06:55",
        "deadline": "2025-12-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30213216",
        "title": "Senior Software Developer",
        "employer": "Commitify AB",
        "location": "Göteborg",
        "description": "Senior Software Developer\nWe are now looking for an experienced and motivated Senior Software Developer who wants to help shape the future of automotive software systems.\nAbout the role\nAs a Senior Software Developer, you will be part of a team responsible for developing embedded software in close collaboration with both suppliers and external partners. You will be involved throughout the entire process – from implementation and verification to delivery of complete systems for production.\nYou will contribute to developing the next generation of control units as well as maintaining current products in production. The role also includes planning test activities, managing equipment needs, and taking part in defining the software architecture and implementation strategy – from configuration to final delivery.\nYou will support the team in identifying and implementing enablers, provide technical guidance, and help foster a culture of quality and continuous improvement. Using your technical expertise, you will ensure that the software stack is developed, integrated, and tested efficiently and sustainably.\nThe work is carried out in close collaboration with various areas of expertise, both internally and externally, providing excellent opportunities for professional growth and broadening your technical knowledge.\nWho you are\nYou are a curious, positive, and self-driven individual with a strong passion for technology and collaboration. You have extensive experience in embedded software development and enjoy working in teams where you can contribute both strategically and hands-on.\nYou have strong communication skills and easily build trust and relationships across different stakeholders. You take a structured approach to your work and thrive in an environment where quality, responsibility, and innovation are key values.\nRequirements:\nMaster’s degree (MSc) in Software Engineering, Computer Science, Electrical Engineering, or equivalent field\nAt least 10 years of experience as a software developer, preferably within embedded systems\nStrong ability to plan, lead, and execute software development activities\nDeep understanding of software architecture, integration, and testing\n\nExperience in the following areas are required\nAUTOSAR\nAutomotive software stack development\nEmbedded software development\nConfiguration management and version control\nSoftware release and delivery processes\nProgramming in Python\nCommunication protocols such as CAN and Automotive Ethernet\nHardware-in-the-loop (HIL) systems and real-time simulation\nContinuous Integration, Verification, and Development\nPlatform and system development",
        "url": null,
        "published": "2025-10-31T16:25:20",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30211147",
        "title": "Digital Developer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": ".\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\nWho We Are\n\nService Market Logistics (SML), part of Volvo Group Trucks Operations, serves all brands and business areas by managing and optimizing service parts availability and distribution to secure customer uptime. Through our operations, we provide world class service focusing on delivery precision, quality, continuous improvement, cost efficiency and synergies delivering value all the way to our customers. We embrace innovation and new technologies and work with environmental care and sustainability at heart. Our footprint consists of 40 distribution centers and 3,800 employees worldwide, and we strive for an innovative and diverse workplace, exercising the Volvo Group values with high focus on Customer Success. We are Proud to Deliver. Making a Difference. For People. Every Day.  \n\nOur goal is to keep society running. Making sure that food gets to the grocery store, hospitals have electricity, and that people can commute to work. We do that by making sure that Volvo Group trucks, engines, buses, and construction equipment keep running uninterrupted all over the world. Together with other talented people from a diversity of backgrounds and with a wide variety of skills we make sure that spare parts are available when they are needed in a sustainable distribution network with thousands of dealerships. We are now looking for one or several Digital Developers to join our Supply Chain Optimisation team! \n\nWhat you will do? \n\nThe Digital Developer position is part of the SML Supply Chain Optimization (SCO) organization. SCO is the function at Service Market Logistics where we enable customer success through an optimized supply chain from suppliers to customers by balancing service levels, tied-up capital, transport cost and performance. One of the most fun parts of being a part of the SCO team is that we work together with all Truck brands and Business areas. What we do has a direct impact on the satisfaction of our customers. With us, you can push your own professional skills and drive change together with committed people!  \n\nYou will be primarily responsible for the long-term development of the state-of-the-art product, which will maximize value by combining software development skills with supply chain domain knowledge. You will also contribute to the ongoing digitalization with automation solutions on both a smaller and larger scale. Other responsibilities will include ensuring high-quality forecasting of future spare parts demand for Volvo Trucks, Mack Trucks, VCE and Penta.  \n\nTo succeed in this role, we believe you have: \n\n  *  A university Degree in Logistics, Supply Chain Management, Mathematics/Statistics, Computer Science or a related field; or equivalent experience.  \n  *  Experience working with logistics in a complex global supply chain  \n  *  Strong problem solving, research and analytical skills  \n  *  Ability to visualize and tell a story with data that compels stakeholders to understand and take action (PowerBI, etc…).  \n  *  Experience in 1 or more scripting languages (Python, R, Java, Apache Spark, etc...)  \n  *  Knowledge of relational database query languages (SQL)  \n  *  Knowledge of Agile methodology, Microsoft Azure, DevOPs, or software development \n\n\nReady for the next move?\n\nLast application date: 15 November 2025\n\n\n\nWe value your data privacy and therefore do not accept applications via mail. \n\nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\n\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43753304",
        "published": "2025-10-31T11:25:03",
        "deadline": "2025-11-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30209432",
        "title": "Senior developer (C++)",
        "employer": "Academic Work Sweden AB",
        "location": "Göteborg",
        "description": "Academic Work is now recruiting a Senior C++ Developer on behalf of our client – a role for someone who thrives in a fast-paced environment and enjoys working independently with complex software tasks.\n\nOM TJÄNSTEN \nIn this role, you’ll take ownership of advanced development tasks—from planning software architecture and writing new code from scratch, to testing, verifying, and documenting your work. You’ll be working independently, but also contributing actively to the team’s goals and collaboration.\n\nTo succeed, you’ll need solid experience in C++, Git, Gerrit, and SQL, along with an analytical mindset, persistence, and strong attention to detail. Excellent communication skills and the ability to contribute positively to the team are key.\n\nVI SÖKER DIG SOM \n- Solid experience in C++ development\n- Proficient in Git and Gerrit for version control and code review\n- Hands-on experience with SQL and database handling\n- Ability to plan and design software architecture\n- Skilled in writing unit tests, verifying code, and documenting work\n- Comfortable working independently on complex development tasks\n- Strong analytical mindset and attention to detail\n\nOur recruitment process\n\nThis recruitment process is handled by Academic Work and it is our client’s wish that all questions regarding the position is directed to Academic Work.\n\nOur selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the next phase. The process includes two tests: one personality test and one cognitive test. The tests are tools to find the right talent for the right position, to enable equality, diversity, and a fair process.\n\nINFORMATION OM FÖRETAGET \nN/A",
        "url": "http://www.academicwork.se/jobad/senior-developer-c/15115475?apply=1",
        "published": "2025-10-31T00:01:38",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30203526",
        "title": "Junior OS Platform Developer",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nJoin us and work with the most popular Microwave solution in the world!\nAre you passionate about technology and eager to start your career in embedded software development? We are looking for a motivated junior developer to join our Operating System Platform team, working on Ericsson’s renowned MINI-LINK Microwave Radio Link products. This is your opportunity to learn from experienced colleagues, contribute to real products, and grow your skills in a supportive, diverse environment.\nWe actively leverage artificial intelligence technologies in our daily work to improve both the efficiency and quality of our software development. By adopting AI-driven approaches, our teams can dedicate more time to innovation and creative problem-solving, resulting in more meaningful and rewarding work experiences.\n\nWhat You Will Do\n  *  You will work in a cross-functional, agile team developing and maintaining embedded software for our MINI-LINK products.\n  *  Participate in all stages of the software life cycle: planning, requirement analysis, design, implementation, integration, and testing.\n  *  Collaborate with other product development and continuous integration teams.\n  *  Take on tasks of increasing complexity as you grow in competence.\n  *  Contribute to maintaining and improving build systems, performing board bring-up on new products, and upgrading products to the latest Linux (Yocto-based) versions.\n\n\nWhat We Offer\nYou’ll enjoy an inspiring, flexible working environment that supports a healthy work-life balance, surrounded by a diverse team from all over the world.\nYou will get daily opportunities to learn and develop your skills in embedded Linux, system-level programming, and hardware interaction. As you grow with us, you’ll find clear career paths and plenty of chances to advance into roles such as senior developer, architect, or product owner.\nOn top of that, you’ll have the opportunity to work with cutting-edge AI tools that make your work more efficient and rewarding, allowing you to focus on what’s interesting and meaningful in your role\n\nWho You Are\nMust-Have Skills:\n  *  MSc or BSc in a technical discipline, or equivalent practical experience.\n  *  0–3 years of experience in software development and architecture (recent graduates are encouraged to apply).\n  *  Basic understanding of operating system concepts (e.g., scheduling, memory management, I/O)\n  *  Programming experience in C\n  *  Motivated to explore and investigate new domains\n\n\nNice-to-Have Skills (can be learned on the job):\n  *  Familiarity with build systems (Yocto, Make, CMake)\n  *  Exposure to Linux, bootloaders, or driver development\n  *  Understanding of low-level protocols (I2C, SPI)\n  *  Experience with tools like Git, Gerrit, Jenkins\n  *  Knowledge of TCP/UDP/IP networks\n  *  Interest in containerization and modern software development practices\n\n\nPersonal Attributes:\n  *  Motivates and inspires colleagues.\n  *  Collaborative team player who adapts readily to change.\n  *  Passionate about excellence and continuous improvement.\n  *  Good communication skills in English\n\n\nApplication\n\nWe look forward to receiving your application, including your CV/resume in English.\nApplication deadline: 14th of November\nLocation: Gothenburg, Sweden\nUnit: BNEW RTE TP MW SW Radio-Link 1\nWork setup: We aim for 60% on-site presence at our office.\nPlease note that we do not accept or process applications submitted via email.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43748717",
        "published": "2025-10-29T15:25:03",
        "deadline": "2025-11-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30203393",
        "title": "Senior Software Developer  Cybersecurity & System Architecture",
        "employer": "Globedesk Sverige AB",
        "location": "Göteborg",
        "description": "We’re looking for a Senior Software Developer with a strong background in Cybersecurity to join an agile team building a brand-new internal system for managing and securing external software. This is a hands-on development role with room to take technical leadership and shape how IT security is handled across the organization.\n🛠️ You’ll be involved in:\n• Building and maintaining a new system from scratch\n• Working closely with security requirements and compliance\n• Developing features, fixing bugs, and improving system performance\n• Conducting code reviews and writing unit tests\n• Using tools to visualize data and track usage\n• Sharing your knowledge and mentoring others in the team\n\n\n👨‍💻 Tech environment includes: Golang, Python, Java, Camunda, microservices, Git, Jenkins\n\n\n✅ What we’re looking for:\n• Several years of experience as a software developer, ideally with a focus on cybersecurity\n• Experience designing system architecture or working on new system builds\n• A team player who communicates clearly in both Swedish and English\n• Someone who enjoys mentoring, problem-solving, and working in a collaborative environment",
        "url": null,
        "published": "2025-10-29T15:12:50",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30189557",
        "title": "Omda Incident - Back End Developer",
        "employer": "Omda AB",
        "location": "Göteborg",
        "description": "Join our team and your talent could be part of software creation that helps healthcare professionals bring new life safely into the world, contributes to more people living longer and more fully, or makes all the difference in emergencies when every second counts.\nOur teams empower customers with tools to support their patients and help save lives. We currently have seven business areas that develop specialised software solutions across medical fields and emergency services. At Omda you’ll be close to customer needs and your work will have an impact where it matters most.\nOur Emergency business area provides robust systems for managing every aspect of emergency response.\nWe are looking for a Back-End Developer who is not only passionate about solving problems and building great products for crucial 112 applications but also enthusiastic about contributing to a highly collaborative team based in Gothenburg. We offer a hybrid work model, where you can work remotely up to two days per week – or 40% of your time – depending on what suits the team and role best.\nYou will be part of a cross-functional agile development team working with new features, refactoring and maintaining our 112 back-end platform. You’ll collaborate with Product Owners, testers, UX and other developers in planning, daily stand-ups, code reviews and sprint deliveries. You will have a dedicated onboarding plan and experienced colleagues to guide and support you as you grow in the role.\nWe team up with product and design leads in planning and delivery, and we're firm believers that diverse teams are the strongest teams. We are always seeking ways to improve how we deliver projects and help evolve our technologies to solve upcoming challenges.\nAt the end of the day: we support each other's growth, encourage ownership and continuous development, and love that people can see the impact of their own work.\nDue to the nature of our systems within public safety, Swedish citizenship is a formal requirement for this position.\nOur tech stack:\n .NET / C#\n MSSQL\n \nYour matching strengths for the role:\n University degree in SW Engineering, or similar\n Proficiency in C# and .NET\n Great communication skills in both English and Swedish\n Teamwork oriented\n Strong \"Can-do-attitude\", fearless, proactive, and driven\n Proficiency in Database Development.\n Solution-oriented problem-solving with team and stakeholders\n A growth mindset and willingness to learn new things\n Being committed to Continuous Improvement in development practices\n Skill in Refactoring for improved code quality\n \nWould be great, but not mandatory, if you have:\n 2–8 years of experience as a back-end developer\n Experience with containers and orchestration (e.g. Docker, Kubernetes)\n A track record of innovation or creativity in software development\n Contributions to the tech community – such as bug reports, blog posts, talks, or open-source projects\n Any WPF experience would be great, we know it's unlikely..\n \n\nWe are interviewing continuously, therefore we recommend you submit your application as soon as possible.\nLooking forward to meeting you!",
        "url": "https://careers.omda.com/jobs/6562819-omda-incident-back-end-developer?promotion=1686188-arbetsformedlingen",
        "published": "2025-10-27T07:46:56",
        "deadline": "2026-04-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30183444",
        "title": "Teamcenter Developer",
        "employer": "Hitachi Energy Sweden AB",
        "location": "Göteborg",
        "description": "About the Role: As a Siemens Teamcenter Developer, you will be responsible for developing and customizing solutions within the Siemens Teamcenter environment. You will work closely with the development team to ensure solutions meet business requirements and adhere to best practices in PLM (Product Lifecycle Management). \nKey Responsibilities: \nDevelop and customize Teamcenter solutions using both configuration and custom code/scripts. \nPerform ITK server-side programming in C/C++, Java for dispatcher clients, and XML for stylesheet definitions. \nUtilize tools such as BMIDE, Workflow Designer, and Query Builder for continuous development. \nTroubleshoot and resolve issues in existing code based on user or team reports. \nSupport the development team with technical expertise in programming. \nIncorporate PLM/Teamcenter development best practices. \nIntegrate Teamcenter solutions with third-party applications such as SAP4Hana, NX, and ECAD tools. \nConfigure and customize Active Workspace and Teamcenter architecture/data model. \nInstall and configure 2-Tier & 4-Tier clients, file management servers, dispatcher servers, and CAD integrations. \n\nRequired Qualifications: \nProficiency in at least one of the following programming languages: C/C++, C#, Java, or XML/XSLT. \nStrong knowledge of Teamcenter APIs and the Dispatcher framework. \nExperience with Active Workspace configuration and customization. \nFamiliarity with Git (Azure DevOps) for code management. \nUnderstanding of Teamcenter UA products, including Engineering Data Management, BOM Management, Workflow, and Change Management. \nExperience in Teamcenter client-server customization and SOA customization. \nBasic problem-solving skills for application issues and root cause analysis. \nExposure to real-time customer environments and implementation of Teamcenter product solutions. \nProficiency in English; additional languages such as Swedish are highly valued. \n\nGood to Have: \nExperience with Product Configurator, Multi BOM Management, Service BOM, or Supplier Collaboration in TC and AWC latest versions. \nKnowledge of transitioning from RAC to AWC, understanding the TC AWC data model and Multi BOM Management capabilities. \n\nPersonal Attributes: \nSelf-motivated and able to work effectively both independently and as part of a team. \nStrong interpersonal skills with the ability to communicate clearly at all levels of the organization. \nCreative mindset with excellent problem-solving abilities. \nNatural leadership qualities and the ability to resolve issues efficiently. \n\nWhy Join Us: \nBe part of an international team where you can exchange knowledge with colleagues from around the world. \nWork on cutting-edge PLM solutions and contribute to innovative projects. \nOpportunities for professional growth and development.",
        "url": "https://www.hitachienergy.com/careers/open-jobs",
        "published": "2025-10-24T09:02:25",
        "deadline": "2025-11-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30169261",
        "title": "Software Developer",
        "employer": "Alten Sverige AB",
        "location": "Göteborg",
        "description": "We are looking for a Software Developer with strong experience in Model-Based Development for an advanced R&D assignment within the automotive industry. You will work on developing core functionalities for next-generation vehicle platforms, using Simulink and AUTOSAR-compliant workflows.\n\n \n\nYour profile\nA degree in Mechatronics, Electrical, Computer or Automotive Engineering\nAt least 3 years of experience in model-based software development within the automotive domain\nExcellent knowledge of MATLAB / Simulink, Stateflow, and Embedded Coder\nDeep understanding of AUTOSAR architecture, including SW-Cs, RTE interfaces and BSW integration\nExperience generating production-ready AUTOSAR-compliant code from Simulink models\nFamiliarity with Simulink libraries, custom blocks and S-Functions\nAbility to design modular, reusable and scalable software components\nA structured, analytical and collaborative way of working\nMeritorious experience includes functional safety (ISO 26262), CI/CD integration for MBD, and performance optimization of Simulink models.\n\r\n\nWhat you will do\n\nAs a Model-Based Software Developer, you will be responsible for designing and implementing Simulink models that enable functional growth in the vehicle’s core computing system.\n\n \n\nTasks include:\nDeveloping new features in Simulink / Stateflow aligned with AUTOSAR standards\nDesigning and structuring application-layer software components (SW-Cs)\nConfiguring and generating AUTOSAR-compliant C-code using Embedded Coder\nEnsuring traceability from requirements to model design\nPerforming peer reviews and continuous model improvements\nSupporting integration by delivering well-structured, verified models\n\n \n\nDeliveries\nSimulink models aligned with AUTOSAR architecture and development guidelines\nModular and reusable design ensuring scalability and maintainability\nVerified and production-ready generated code through Embedded Coder\nDocumentation according to project standards and model review results",
        "url": "https://www.alten.se/career/15160-Software-Developer-Simulink",
        "published": "2025-10-21T10:02:36",
        "deadline": "2025-11-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30204071",
        "title": "Mjukvaruutvecklare till avancerade sensorsystem",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Vill du påverka och göra skillnad på riktigt? Här bidrar du till att skapa trygghet för människor och samhällen. Det du gör spelar roll.\n\nHos oss bidrar du till att skapa trygghet för människor och samhällen - på riktigt. Här utvecklar du teknik som gör skillnad, i ett team där kunskap, innovation och samarbete står i centrum.\n\nDin roll\n\nSom mjukvaruutvecklare blir du en del av ett engagerat team som utvecklar programvara för signalbehandling och radarstyrning i avancerade sensorsystem för flygande plattformar.\n\nDu kommer att arbeta i en agil utvecklingsmiljö med stort utrymme för teknisk utveckling och personligt ansvar. Här får du möjligheten att påverka hela utvecklingskedjan - från idé till färdig lösning.\n\nDin profil\n\nVi söker dig som vill växa tillsammans med oss och bidra med både teknisk kompetens och drivkraft. Vi tror att du har:\n\n* Högskole- eller civilingenjörsexamen inom datateknik, elektroteknik, teknisk fysik eller motsvarande.\n\n* Goda programmeringskunskaper i exempelvis C++, C eller Java.\n\n* Starka matematiska färdigheter, gärna med erfarenhet av signalbehandling eller tracking.\n\n* Förmåga att arbeta i team men också kan arbeta självständigt och ta initiativ.\n\n* God kommunikativ och social förmåga - du gillar att samarbeta och dela kunskap.\n \nDet är meriterande om du har erfarenhet av agila arbetssätt och ett genuint intresse för teknik och problemlösning.\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här",
        "url": "https://www.aplitrak.com/?adid=YS5vYmVyZy4xOTM0MS4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-10-29T16:40:32",
        "deadline": "2025-11-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30224846",
        "title": "Electronics Hardware Design Engineer",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Assignment description\nIn this position, you will be the Component Owner for key control units such as ECM or Inverter. You will carry full product responsibility over time, ensuring robust design, industrialization, and lifecycle management.\n\nYou will be the main contact between customers and suppliers and drive the product development from concept to production. You will be part of a team consisting of Software Component Owners, Architects and experts within System Safety, Cyber Security & EMC.\n\n\nKey responsibilities\n\n Lead the hardware design and lifecycle management of electronic control units (ECUs).\n Drive industrialization of automotive electronics from concept to production.\n Ensure compliance with automotive standards and best practices.\n Manage and resolve challenges related to EMC, load handling, and functional in/out pinning of circuit boards.\n Collaborate closely with software engineers and system architects to secure integration and node topology.\n Act as technical expert and main contact point for suppliers and internal stakeholders.\n \n\n\nSkill requirements\nYour profile\n\n Master’s degree or equivalent in Electrical Engineering or related field.\n Solid experience in electronics hardware development within the automotive industry.\n Proven track record working with industrialization of automotive ECUs.\n Deep knowledge of communication protocols between nodes, EMC impact, loads, and circuit board pin functionality.\n Strong understanding of software interaction and ECU topology.\n Experience from Volvo Cars, AB Volvo, or Geely Group companies in Western Sweden is a strong merit.\n Excellent problem-solving skills and ability to take ownership of technical solutions.\n \nRequired skills\nECUs,Communication Protocols, Automotive, Electrical Engineering, electronics hardware\nLanguages\nSwedish(Proficient)  English(Proficient) \nAssignment period\n17 Nov 2025  to 17 Dec 2026",
        "url": "https://careers.progalaxy.se/jobs/6709232-electronics-hardware-design-engineer?promotion=1699347-arbetsformedlingen",
        "published": "2025-11-04T16:24:52",
        "deadline": "2026-04-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30204205",
        "title": "Senior Embedded Software Application Engineer - Thermal Management",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nAbout us\nYou’ll be part of the Cab Climate Software team within the Thermal Management technology stream, focusing on our new electrical architecture. Our team of around 12 engineers brings together diverse backgrounds and a shared passion for sustainable transport, working across all Volvo Group truck brands in a collaborative and innovative-driven environment.\nWhat You Will Do\nAs an Embedded Software Application Engineer you will develop, test and maintain vehicle application software to secure Customer Success. This role involves close collaboration with system engineers and hardware teams to ensure seamless integration, optimizing performance, reliability, and functionality of the embedded applications within constrained environments.\nAt Thermal Management, you will contribute to the transformation of our company, the transport industry, and society at large. \nYour main responsibilities will be to:\n• Collaborate with stakeholders to find ways to improve quality assurance.\n• Analyze system requirements and write test-cases.\n• Troubleshoot and optimize systems in rigs and vehicles.\n• Drive improvements in development processes and environments.\n• Prototype innovations and proof of concepts.\nWho Are You?\nDo you dream big? We do too, and we are excited to grow together. \nEssential requirements: \n• M.Sc. in Electrical Engineering, Software Engineering, or equivalent.\n• Experience in embedded software development (cab climate preferred).\n• Hands on experience in testing strategies, especially in the context of behavior-driven development (BDD).\n• Strong debugging and problem-solving skills.\n• Proficiency in C++ and Python.\n• Familiarity with CI tools (Jenkins, Bitbucket, Git, Artifactory).\n• Knowledge of CAN/LIN protocols and tools (CANalyzer, CANoe).\nNice to have:\n• A customer-focused and quality-driven mindset.\n• Openness to share knowledge and learn from others.\n• Ability to thrive in a changing environment and challenge the status quo.\nWhat’s in it for You?\nWe offer a solid package of compensation and benefits, plus you will enjoy:\n• A global and diverse team of passionate professionals.\n• A collaborative environment where innovation thrives.\n• Opportunities to grow and learn in a rapidly evolving tech landscape.\n• A culture built on Trust, Passion, High Performance, Change, and Customer Success.\n• Flexible work arrangements and a strong focus on work-life balance.\n• Access to modern facilities and services at our Gothenburg site.\nReady for the Next Move?\nAre you excited to bring your skills and disruptive ideas to the table? We can’t wait to hear from you. Apply today!\nContact:\nHiring Manager - Ubaldo Tiberi, ubaldo.tiberi@volvo.com\nTalent Acquisition Partner – Smita Shree, smita.shree@volvo.com\nLast application date: 14th of Nov,2025\n\nWe value your data privacy and therefore do not accept applications via mail. \nWho we are and what we believe in \nWe are committed to shaping the future landscape of efficient, safe, and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents across the group’s leading brands and entities.\nApplying to this job offers you the opportunity to join Volvo Group. Every day, you will be working with some of the sharpest and most creative brains in our field to be able to leave our society in better shape for the next generation. ​We are passionate about what we do, and we thrive on teamwork. ​We are almost 100,000 people united around the world by a culture of care, inclusiveness, and empowerment. \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43749168",
        "published": "2025-10-29T17:25:03",
        "deadline": "2025-11-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30196972",
        "title": "Software Engineer II",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nThis role is within our Commercial Digital team, which is using digital technologies to reinvent the experience of becoming a Volvo customer.\n\n\nWhat you'll do\n\nYou will be responsible for developing software for consumer facing and internal products across more than 100 countries. We create the end-to-end experience for online sales/subscriptions of cars, global campaigns as well as frameworks for other parts of Volvo cars. Your responsibilities will include rapid development of prototypes/concepts and mainly product development.\n\nA start-up mindset where you have quickly developed prototypes and catalysed product development in a fast paced, fluid environment is a plus. Being experienced with agile development and a champion of software development best practices is a must, as well as leading and supporting your teammates with technical decisions. On-call is a must due to the criticality of the supported product.\n\nWhat you'll bring\n\nYou are a full stack software engineer, with working experience in C# and Typescript. To succeed in this role, you need to have a minimum of 5 years of work experience developing software and showcasing the following traits:\n\n  *  Comfortable with ambiguity in requirements\n  *  Has experience in a continuous delivery environment\n  *  Growth mindset\n  *  Ability to write software that fellow engineers can understand\n  *  Experience with deploying, running and scaling code in production\n  *  Experience in co-creation practices like pair programming\n  *  Product mindset\n  *  Empathy towards users, fellow engineers and co-workers\n  *  An open mind and willingness to learn and help others learn\n  *  Data Driven\n  *  Knowledgeable of microservices & event driven architecture\n  *  Familiar with C# and the related ecosystem. This is not a hard requirement. Familiarity with server-side programming languages and runtimes and the ability to choose the right designs for a problem is what is really required.\n  *  Familiarity with Kubernetes in a cloud setting (Azure or AWS) is a big plus\n  *  Familiarity with Tactical Domain Driven Design\n  *  Comfortable in Typescript and JavaScript programming and in building UIs with HTML and CSS.\n  *  Expertise in React and the related ecosystem\n\n\nTo be successful in this job we believe that you are a structured team player with great communications skills, both written and verbal.\n\n#LI-DNI\n#LI-DNP",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43745269",
        "published": "2025-10-28T12:25:02",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30193920",
        "title": "Senior DevOps Engineer IRC278516",
        "employer": "GlobalLogic Sweden AB",
        "location": "Göteborg",
        "description": "Job Description\nLevel of knowledge: intermediate/advanced\nJenkins\nMake, Bash, PowerShell, Windows CMD interface, Groovy(Pipeline scripting), Python, Docker\nBasic electronics knowledge, hardware, some experience in low-level communications protocols(UART, CAN)\nGood networking understanding, starting from protocols(basic knowledge) to ability to configure different networks in Windows and Linux environments, the overall experience in network topology\nDevops experience in the Automotive sector is a must\nBasic knowledge and preferably some experience with C/C++\nGit\\Gerrit\nLinux, other Unix-like, Windows\n\nWould be a BIG Plus:\nBasic Vector toolkit experience(Canoe, Vector hardware configuration)\nExperience with Microcontrollers\nSome knowledge about Static code analysis tools\nOverall ability to learn quickly\n\nWould be a Plus:\nAzure cloud experience\nNetwork Perimeter Security (proxy, VPNs, Firewalls)\n\nJob Responsibilities\nMain responsibilities:\nAutomation of the target process(build and automated testing on remote hardware setup)\nMaintaining CI machinery availability(Build nodes, and mentioned remote hardware for example)\nDiagnosing process interrupts(Like build issues for example making logs understanding and hardware issues diagnostics) and preferably the ability to resolve issues with automated solutions\nManagement of building the created solution\nIntegration of solutions with an already working system\n\nThe deliveries will be tested and tracked to optimize the end-to-end flow over time.\n Together they will drive the technical analysis/triage of found deviations with high severity.\nOften business trips are expected.\nDepartment/Project Description\nThe project aim is to optimize, extend with new features Automotive Solution. Our clients are Tier 1s and OEMs from Europe and USA and development is targeted to Automotive Solution what will be deployed in newest cars. The project is considered as technical excellence and we are paying huge attention to technical challenge motivation of our team members as well as excellence compensation.\nAt our project we are building a computer-in-the-car architecture - key for enabling innovation within areas such as advanced connectivity, machine learning and autonomous drive.\nChallanging project to setup infrastructure form scratch for auotmotive solutions for European cars vendors.\nKnowledge and creativity are welcome.\nSkill Category\nDevOps",
        "url": "https://www.globallogic.com/pl/careers/senior-devops-engineer-irc278516/",
        "published": "2025-10-27T16:39:25",
        "deadline": "2025-11-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30186205",
        "title": "Engineering Graduate Program 2026 - System Verification Engineer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future. If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\n\nWork with the latest technologies to shape tomorrow's society\nImagine yourself working with some of the sharpest and most creative brains in the transport and infrastructure industry, developing cutting-edge technologies and sustainable transport solutions that will change the future of society.\nWe are passionate about what we do; we aim for high performance and thrive on teamwork. We are almost 100,000 colleagues united around the world by a culture of care, empowerment, and inclusiveness, where each one of us can give our very best.\n\n\nAre you ready to join the Engineering Graduate Program?\nThe Engineering Graduate Program at Volvo Group Trucks Technology is a global 12-month program where you are offered the perfect mix of on-the-job learning and diverse training modules. You will get the chance to use and develop your technical and creative engineering skills, while gaining valuable experience working with real products on real business challenges. During the year you will engage in activities that will help you grow professionally and personally, developing strong communication and collaboration skills. \nBesides your manager, who will guide and support you in your daily job, you will have a supportive network of peer graduates, colleagues across the globe, and senior leaders to help you excel. We hope you will learn as much from us as we will from you.\n\n\nShape the Future of Safe & Efficient Driving and Services with Us\nAbout the Team\nWe support the Volvo Group engineering community with cutting-edge tools, verification methods, and data-driven insights. The Data & Release substream is a dynamic and newly formed organization within Safe & Efficient Driving (SED) at Volvo Group Trucks Technology (GTT). Our Test and Release team is at the forefront of verifying and validating the main ECUs that enable ADAS functionalities—and beyond. As vehicle functions become increasingly distributed across multiple ECUs, our challenge is to develop new verification frameworks to ensure comprehensive HIL (Hardware-in-the-Loop) and SIL (Software-in-the-Loop) testing for all our end-user functions.\n\n\nHow you will make an impact \nAs an Engineering Graduate in the Data & Release, you will:\n•  Participate in the verification and validation of ADAS and other vehicle functionalities at both HIL and SIL levels.\n•  Contribute to the development of new verification frameworks to ensure full coverage of our Functions.\n•  Leverage data-driven approaches to create dashboards that visualize software performance and quality.\n•  Automate data collection and analysis tasks, enabling the team to focus on insights and improvements rather than manual data handling.\n•  Collaborate with cross-functional teams to drive continuous improvement in our verification processes.\n•  Gain hands-on experience with state-of-the-art tools and methodologies in a global, innovative environment.\n \nWe believe that you are driven, curious, and eager to learn. You thrive in a collaborative environment and are passionate about making a difference through technology and data.\n\n\nYou meet the following requirements: \n•  An M.Sc. degree in Computer Science, Electrical Engineering, Data Science, Systems and Controls, or a related field.\n•  Strong interest and/or experience in verification and validation, especially HIL/SIL testing.\n•  Good programming skills (Python, C++, or similar) and familiarity with data analytics tools (e.g., MATLAB, Power BI).\n•  A passion for automation and data-driven development.\n•  The ability to work in an international context and willingness to travel.\n\n\nTo qualify for the Engineering Graduate Program, you’ve completed a master’s degree prior to the start of the program but not more than 18 months ago. You should not have more than two years' full-time working experience in the field prior to starting. You also need to be fluent in English, both written and verbal.\n\n\nWhat’s in it for you?\nOur Engineering Graduate Program starts in August 2026, and you will be offered a permanent position at Volvo Group Trucks Technology with placement in Sweden, Gothenburg. These are some of the benefits of joining our program:\nAn opportunity to work with the latest technology. \nAn exciting and global working environment with experienced colleagues. \nPossibility to gain international experience through a short-term assignment abroad. \nA competitive salary and permanent position from day one. \nVarious workshops and seminars designed to help you grow into your future career at Volvo Group. \nThe possibility to shape your own career with endless career opportunities.\n\n\n\nThe application process\nThe journey begins! An email confirmation will be sent when you submit your application. After this, it is still possible to update your personal profile by logging into your account. The hiring team will review your application together with the hiring manager. Shortlisted candidates will be contacted with information about the following steps.\n\n\nLast application date: November 23rd, 2025.\n\n\nWe value your data privacy and therefore do not accept applications via mail.",
        "url": "https://jobs.volvogroup.com/job-invite/25706/",
        "published": "2025-10-24T13:42:45",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30185472",
        "title": "Product Development Leader(7)",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:We are thrilled to offer the position of Product Development Leader at Ericsson. This role is essential to maintaining our competitive edge as it relates to technology management, fostering an innovative culture, and ensuring the right balance of quality, time, scope, and cost for our products. A Product Development Leader at Ericsson takes on a variety of leadership tasks within product development, teaching, coaching, challenging, and aiding in individual, team, and organizational development. The successful candidate will be pivotal in the execution of development strategies and plans. We value an environment that embodies lean and agile methodologies, promoting continuous learning and innovation. Learn more about the role, read more\nWhat you will do:- Drive Ericsson's technical direction to maintain technology leadership.\n- Advocate for lean and agile principles, mentoring teams and individuals.\n- Execute and oversee development strategies, keeping quality, time, scope, and cost in mind for products.\n- Take charge as a leader within product development, including roles such as line managers, program managers, and project managers.\n- Foster an innovative and learning culture within the organization.\n- Engage in learning and development opportunities to maintain expertise in your role.\nThe skills you bring:- Business Understanding.\n- Negotiation.\n- CCD CAPO Integration.\n- Communication.\n- CEE10 Integration DGS.\n- CEE10 Upgrade DGS.\n- Program Management.\n- SDI3 Upgrade.\n- SDI3 Solution Design.\n- GDCE.\n- Coaching and Mentoring.\n- Change Management.\n- Project Management.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43738731",
        "published": "2025-10-24T12:25:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30185470",
        "title": "Sr Specialist Element Management & OAM",
        "employer": "Ericsson AB",
        "location": "Göteborg",
        "description": "Ericsson AB\r\n\r\nJoin our Team\n\nAbout this opportunity:We are thrilled to offer the position of Product Development Leader at Ericsson. This role is essential to maintaining our competitive edge as it relates to technology management, fostering an innovative culture, and ensuring the right balance of quality, time, scope, and cost for our products. A Product Development Leader at Ericsson takes on a variety of leadership tasks within product development, teaching, coaching, challenging, and aiding in individual, team, and organizational development. The successful candidate will be pivotal in the execution of development strategies and plans. We value an environment that embodies lean and agile methodologies, promoting continuous learning and innovation. Learn more about the role, read more\nWhat you will do:- Drive Ericsson's technical direction to maintain technology leadership.\n- Advocate for lean and agile principles, mentoring teams and individuals.\n- Execute and oversee development strategies, keeping quality, time, scope, and cost in mind for products.\n- Take charge as a leader within product development, including roles such as line managers, program managers, and project managers.\n- Foster an innovative and learning culture within the organization.\n- Engage in learning and development opportunities to maintain expertise in your role.\nThe skills you bring:- Business Understanding.\n- Negotiation.\n- CCD CAPO Integration.\n- Communication.\n- CEE10 Integration DGS.\n- CEE10 Upgrade DGS.\n- Program Management.\n- SDI3 Upgrade.\n- SDI3 Solution Design.\n- GDCE.\n- Coaching and Mentoring.\n- Change Management.\n- Project Management.",
        "url": "https://ericsson-ab.contactrh.com/jobs/9669/43738721",
        "published": "2025-10-24T12:25:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30183166",
        "title": "Product Manager, Sensor Platform",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Passionate about making ideas a reality? Join our welcoming world of tech and let your ideas soar. \n\n \n\nWe are now looking for a Product Manager to join our team in Gothenburg.\n\n \n\nYour Role\n\nOur sensor systems are at the forefront of innovation, and we are looking to expand our team with a dynamic Product Manager to oversee the development of our sensor antenna platform portfolio. This role is crucial for driving the technical direction and ensuring our products meet the highest standards of innovation, market, and customer needs.\n\n \n\nAs a Product Manager, your main responsibilities will include:\n\n * Developing and maintaining technical roadmaps that align with our strategic goals and market opportunities for the entire platform portfolio.\n * Collaborating closely with cross-functional teams, including software engineers, systems architects, and product management, to deliver cutting-edge solutions.\n * Acting as a mentor and support for engineers, fostering a culture of continuous learning and development.\n * Representing the platform portfolio's technical solutions to both internal stakeholders and external customers, ensuring clear communication and alignment.\n * Overseeing the integration and interoperability of the antenna platform, compute platform, and sensor application software to create a cohesive and innovative product offering.\n\n \n\nYour Profile\n\nWe are looking for a driven and experienced professional with a strong background in product management and a deep understanding of both technology and business needs.\n\nKey qualifications include:\n\n * A degree in Engineering, Computer Science, or a related field, preferably with a focus on software and hardware development.\n * Proven experience in product management, software development, hardware development or a similar role.\n * Excellent analytical and leadership skills, with the ability to work both independently and as part of a team.\n * Passion for innovation, both regarding technology and business models\n * Strong communication skills in Swedish and English, both written and verbal.\n * Experience with software and hardware development methodologies, requirements management, and technical documentation.\n * A genuine interest in technology and a customer-centric approach.\n * Knowledge of antenna systems, high-performance compute systems, and software integration.\n * Experience from the defense or aerospace industry.\n\n \n\nWe value diversity in our team and place importance on both your competencies and who you are as a person. If you are passionate about driving innovation and have the skills to lead our platform portfolio to new heights, we want to hear from you.\n\n \n\nDo you imagine a career that constant stretches your capabilities and offer you the opportunity to work with technologies of the future? We offer an exciting opportunity to join a global company with a mission to make the society safer.\n\n \n\nThis position requires that you pass a security vetting based on the current regulations around/of security protection. For positions requiring security clearance additional obligations on citizenship may apply.\n\n \n\n \n\nWhat you will be part of\n\nBehind our innovations stand the people who make them possible. Brave pioneers and curious minds. Everyday heroes and inventive troubleshooters. Those who share deep knowledge and those who explore sky-high. And everyone in between. ​\n\n \n\nJoining us means making an impact together, contributing in our own unique ways. From crafting complex code and building impressive defence and security solutions to simply sharing a coffee with a colleague, every action counts. We encourage you to take on challenges, to create smart inventions and grow in our friendly and tech-savvy workspace. We have a solid mission to keep people and society safe.\n\n \n\nSaab is a leading defence and security company with an enduring mission, to help nations keep their people and society safe. Empowered by its 26,100 talented people, Saab constantly pushes the boundaries of technology to create a safer and more sustainable world.\n\n \n\nSaab designs, manufactures and maintains advanced systems in aeronautics, weapons, command and control, sensors and underwater systems. Saab is headquartered in Sweden. It has major operations all over the world and is part of the domestic defence capability of several nations. Read more about us here\n\n \n\nIf you are interested in what benefits you can take part of as an employee at Saab in Sweden, you can read more about them her\n\nDo you want to get to know our business and our people a little bit better? Here you can find some stories told by our employees.\n\nKindly observe that this is an ongoing recruitment process and that the position might be filled before the closing date of the advertisement.",
        "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjI4MzgzLjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
        "published": "2025-10-24T08:20:06",
        "deadline": "2025-11-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30175946",
        "title": "Software Lead at Colibrium Additive",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Would you like to lead software development for a physical product in a global, cross disciplinary environment?\nAt Colibrium Additive, part of GE Aerospace, we’re on a mission to bring the transformative power of additive manufacturing to industries around the world. We’re now looking for a Software Lead to join our Gothenburg team: A hands-on technical leader who thrives on guiding others, writing great code, and improving complex systems that drive real, physical machines.\nIn this role, you’ll lead the development of the software and services that power our electron beam–based additive manufacturing machines. Our main technologies are C# .NET and Python, with additional components in C++. You’ll work both strategically and operationally: setting direction, supporting your teammates, and ensuring our software is reliable, scalable, and ready for the future. You’ll work in a cross disciplinary, global team where software, hardware, and process expertise come together, offering a unique chance to learn and grow while contributing to cutting-edge additive manufacturing technology. You will dig into existing solutions, understand their logic, and help modernize and extend them. You’ll also take part in 3rd line support and root cause analyses, ensuring that we learn from challenges and strengthen our products over time.\n\nKey responsibilities include:\n\n• Write clean, efficient, and scalable code in C# and C++, with a focus on geometric data processing and distributed systems.\n\n• Contribute to software design and ensure that architectural principles are implemented effectively in the codebase.\n\n• Develop and maintain robust client–server communication interfaces, ensuring performance and reliability.\n\n• Work hands-on in an Agile/Scrum team, translating requirements into practical and maintainable solutions.\n\n• Collaborate closely with global and other software teams to shape technology roadmaps for our EBM (Electron Beam Melting) software products.\n\n• Act as a spokesperson for the software team within the global organization, communicating progress, challenges, and future initiatives.\n\n• Provide technical leadership and guidance to a software development team, helping define and deliver high-quality solutions.\n\n• Mentor and coach other developers, fostering a culture of technical excellence and continuous improvement.\nAbout You\nYou have a degree in Computer Science or another relevant education, and probably 3-5 years of professional experience in software development, ideally in a role where you’ve provided both technical and functional leadership. You’re confident working in C# .NET and you have a solid understanding of the software development lifecycle, including modern practices like Agile, CI/CD, secure coding, scalability, and testing techniques. You communicate fluently in English and enjoy working in international teams. You’re a strong collaborator with great communication and influencing skills, able to align people and ideas across different disciplines and locations.\n\nExperience from additive manufacturing or other industrial machinery environments is a strong advantage. Experience with C++ and Python is also meritorious. You’re curious, approachable, and open, someone who enjoys learning, sharing knowledge, and helping others grow. Familiarity with OPC UA, WebSocket, or other industry-standard communication protocols is valuable. \n\nApply now!\nIn this recruitment process Colibrium Additive collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Talent Advisor Marcus Hultberg on +46 72 366 49 43, or Johanna Engblom on +46 73 320 09 00. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application, the 16th of November. \n\nThis position requires that you already have the legal right to work in Sweden (e.g. citizenship, residence permit, or work visa). No relocation assistance is provided.\nAbout Colibrium Additive\nAt GE Aerospace, we invent the future of flight, lift people up, and bring them home safely. We are a world-leading provider of jet engines, components, and integrated systems for commercial and military aircraft. At GE Aerospace, respect for people is core to our culture and commitment to FLIGHT DECK, our proprietary lean operating model. We attract, develop, and retain industry-leading talent from all backgrounds and cultivate communities where people are respected and empowered to reach their fullest potential. For the people of GE Aerospace, their work isn't just a job. It's their passion and purpose. We work and win as one team, accountable to each other and our customers, and we are always finding a better way to climb higher together. We were meant to fly.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=303204&ref=platsbanken",
        "published": "2025-10-22T13:27:56",
        "deadline": "2025-11-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30045972",
        "title": "Embedded Software Developer",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "If you want to see your code come alive in real products, on the water and in the field,  this could be your next step. We’re looking for an Embedded Software Developer who enjoys working close to hardware, thrives in collaboration and wants to take ideas all the way to finished solutions.\nAbout usCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From electrification to intelligent automation, we work at the intersection of safety, efficiency and user experience. We’re proudly part of Volvo Group, where our role is to lead advanced technology development and explore the next generation of smart control systems. \nWe offer remote work up to one day per week, two hours of paid workout time each week, as well as occupational pension and comprehensive insurance.\nYour roleAs an Embedded Software Developer, you’ll work on some of the most exciting and challenging projects in our industry. We work close to applications, which means you’ll be hands-on with the products and even get the chance to learn how to operate a boat. As a product company, we drive ideas all the way to finished solutions. The demands on usability and value-adding features are high, which makes close collaboration between customers, developers and testing essential.\nYou’ll be a technical expert in your field, further developing our existing products for new projects. The role includes working with hardware-near C programming for distributed, safety-critical control systems and driving the development of tomorrow’s electric drivelines for the marine sector. You’ll have external contact with suppliers and customers, and close internal collaboration across project teams.\nResponsibilities Develop and refine hardware-near C programming for distributed control systems\n Contribute throughout the product lifecycle, from idea to final product\n Collaborate with customers, suppliers, and colleagues in agile teams\n Explore new technologies and approaches within electrification and automation\n Help shape tomorrow’s safety-critical systems in the automotive and marine industries\n Key qualifications Embedded development in C\n Distributed control systems\n Continuous integration\n Functional Safety\n Control theory\n CAN\n I/O\n GNSS/IMU\n \nIt’s a plus if you also bring knowledge in\n Marine applications and boats\n Python\n E-mobility\n Electric motor control\n Cyber security\n Who you are\nYou see embedded development as a field full of possibilities and you like being hands-on. You stay updated in your area and share your knowledge with others. You enjoy end-to-end responsibility, and you’re not afraid to challenge norms and find innovative solutions. With your understanding of both hardware and software and the interplay between them, you make things happen. \nHow to applySubmit your application today and feel free to reach out to hiring manager Camilla Wennström at camilla.wennstrom@cpacsystems.se if you have any questions.",
        "url": "https://careers.cpacsystems.se/jobs/6467341-embedded-software-developer?promotion=1634263-arbetsformedlingen",
        "published": "2025-09-18T17:27:41",
        "deadline": "2026-03-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29988496",
        "title": "Software Developer",
        "employer": "SPEEDY TYRES SWEDEN AB",
        "location": "Göteborg",
        "description": "The role involves setting up and maintaining workshop computers, networks, and servers\nCreate/review & maintain item definition, hazard analysis and risk assessment\nDevelop/review Functional Safety concept & Technical safety concept\nAnalyse and define Safety requirements (Functional Safety requirements and Technical safety requirements)\nSupport Functional Safety audits and assessments\nImplementing data backup and cybersecurity measures, gathering requirements from various customers, and defining software process frameworks in alignment with industry standards.\nSystem Safety deliverables for different vehicle variants.\nDevelopment of ASIL D requirements according to ISO26262.",
        "url": null,
        "published": "2025-09-04T13:31:00",
        "deadline": "2025-12-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29914881",
        "title": "Software Engineer",
        "employer": "Ecareer AB",
        "location": "Göteborg",
        "description": "At Aveer, we’re looking for an Embedded Software Integration Engineer to take ownership of managing and configuring our software platform, integrating application components into complete node software, and ensuring our platforms are rock-solid before release. What you’ll do:\nDevelop the embedded software technologies and the software platform.\nManage and configure the software platform and integrate application SW components. Verify the platform, including build environment and CI/CD pipelines. Lead Embedded Software (ESW) integration in a technical team. Integrate deliveries from multiple teams and secure quality before release. Contribute in early-phase development, defining technical roadmaps. Collaborate and influence across global sites. Mentor and coach team members, driving continuous learning. What we’re looking for: 8+ years of relevant embedded software integration experience. Strong AUTOSAR or similar integration expertise. Solid T-shaped profile — broad toolkit with deep technical mastery. Experience leading complex projects and developing team members. Skilled influencer, networker, and value creator beyond your immediate team.",
        "url": "https://jobb.ecareer.se/jobs/6311314-software-engineer?promotion=1590472-arbetsformedlingen",
        "published": "2025-08-15T17:30:45",
        "deadline": "2026-02-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "29887068",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2025-08-07T13:13:40",
        "deadline": "2026-01-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30161598",
        "title": "Senior penetrationstestare",
        "employer": "Combitech AB",
        "location": "Göteborg",
        "description": "Är du en penetrationstestare med flera års erfarenhet och redo för nya utmaningar tillsammans med likasinnade? Combitech söker nu erfarna penetrationstestare till vårt team med placering i Göteborg, Stockholm, Linköping och Sundsvall. Som penetrationstestare på Combitech kommer du ingå i en enhet bestående av specialister inom Penetrationstester och Red Teaming.\n\nDin roll som penetrationstestare\n\nVår enhet är en tekniskt stark och en social arbetsplats med team över flera orter i Sverige. Vi arbetar brett från IoT och webbsäkerhet till nätverk, Active Directory, Automotive och OT/ICS och tar komplexa uppdrag mot myndigheter, försvarsindustri, industri och finanssektorn.\n\nKärnan i vårt arbetssätt är en teamleverans, vi sätter samman grupper med kompletterande kompetenser för att säkerställa hög kvalitet, problemlösning och kontinuerlig kompetensöverföring. Vi har regelbundna veckomöten där vi delar erfarenheter, metodik och uppdateringar, samt forum för teknisk diskussion och planering.\n\nVi investerar i din utveckling du får stöd för certifieringar, tid för lärande och möjlighet att representera oss på konferenser och i professionella nätverk. Detta är en plats där du både bidrar och växer. \n\nArbetsuppgifterna innebär att du utför uppdrag åt våra kunder. I våra leveranser prioriterar vi alltid teamarbete. Du kommer att arbeta i team med kompletterande kompetenser då det ger högre kvalitet, bättre problemlösning och kontinuerlig kunskapsöverföring. Vi matchar rätt person och kompetens till varje uppdrag och stöd från erfarna kollegor finns alltid nära till hands.\n\nDå varje uppdrag avslutas med en rapport och oftast tillhörande presentation, medför det att vi ser att du har vana av att uttrycka dig i skrift såväl på svenska som på engelska, men även att du är van att prata med både tekniskt kunniga individer såväl som de som inte är tekniskt insatta.\n\nResor i tjänsten förekommer frekvent då många av våra uppdrag innebär att vi måste vara på plats hos våra kunder på grund av säkerhetsskyddsskäl, men även för att utföra tester som innebär fysisk närhet till testobjektet.\n \n\nVem är du?\n\nVi söker seniora penetrationstestare med minst fem års erfarenhet av yrket. Du har omfattande erfarenhet av olika IT och IT-miljöer och har arbetat med penetrationstester, där du har utvecklat djup kompetens inom säkerhetstester och granskningar. En teknisk examen i grunden är önskvärt, men dina erfarenheter och personliga egenskaper väger tyngre än en specifik examen.\n\nDu är bevandrad och trygg när det gäller tillvägagångssätt, metodik och tekniker inom penetrationstestning, inklusive planering, scoping samt testdesign och har stött på många typer av IT-miljöer i ditt arbetsliv. Vi tror även att du är van att hjälpa till att planera, definiera uppdrag och bidra till testplaner inför olika projekt, det vill säga att du kan ta ett projekt-/leveransansvar, kunna leda testteam, leverera tidplaner, estimeringar och sign-off.\n\nVi ser gärna att du är flexibel och har möjlighet att resa samt ta kundkontakt och arbeta onsite vid behov, vilket är avgörande för att upprätthålla goda relationer och framgångsrika projekt. Du har lätt att samarbeta med andra och kan bidra med en god stämning i enheten. Vi är ett tekniskt team som alltid ställer upp för varandra och hjälper till där det behövs, vi tror att du delar vår glädje i att sprida kompetens till kollegor och hjälpa varandra framåt. Du är strukturerad i ditt arbete och har en stark förmåga att uttrycka dig i tal och skrift, både på svenska och engelska.\n\nVi förstår att du kanske inte har erfarenhet inom alla dessa områden nedan, men vi värdesätter din expertis inom flera av dem.\n\nKvalifikationer \n\n * Minst 5 års erfarenhet av penetrationstestning och/eller Red Teaming. \n * Erfarenhet av att skriva uttömmande tekniska rapporter och presentera resultat både för teknisk personal och ledning. \n * Kunskap om relevanta standarder, ramverk och metoder, exempelvis OWASP, MITRE ATT&CK, OSSTMM, PTES, TIBER, NIST och IEC 62443. \n * Stark teknisk grund inom nätverk och infrastruktur (design, struktur, protokoll, samt en förståelse för brandväggar, IDS/IPS, lastbalanserare och lagringslösningar). \n * God operativsystemskunskap (Linux och Windows) och vana vid virtualisering/containers. \n\nMeriterande \n\n * Gärna certifieringar som OSCP, SANS/GCIA/GPEN, CREST/Red Team-certifieringar, ISC2 eller liknande, då dessa efterfrågas av våra kunder. \n * Erfarenhet av Red Team, TIBER, scenariobaserade tester och hotaktörsemulering. \n * Djup AD- och Windows-internals-kunskap (kerberos, trusts, GPO, LSASS, SID-history) \n * Cloud-security: praktisk erfarenhet av AWS/Azure/GCP säkerhetsarkitektur, IAM, och moln-attacker (inkl. IaC: Terraform/ARM). moln-certifieringar (AWS-CSP/Azure-Security). \n * Web-/applikationssäkerhet och erfarenhet av avancerade web-verktyg (t.ex. Burp Suite). \n * Erfarenhet inom AI LLM. \n * Erfarenhet av OT-säkerhet/ICS, CAN-buss (inom automotive) eller andra industrisystem. \n * Trådlös kommunikation (Wi-Fi, BT, NFC, radio) och IoT-säkerhet. \n * Kompetens inom hårdvara/ embedded (PCB, JTAG, UART, CAN) för automotive/IoT-tester. \n * Programmering, scripting (Python, PowerShell, Bash) och erfarenhet av exploit-utveckling \n * Reverse engineering & malware analysis (IDA, Ghidra, dynamisk analys) - meriterande för avancerade uppdrag. \n * Säker kodgranskning och kännedom om OWASP ASVS / Secure SDLC. \n * Erfarenhet av lagringslösningar, lastbalanserare och avancerade nätverksarkitekturer. \n\n \n\nDå våra tjänster ofta innebär arbete som omfattas av försvarssekretess krävs det att du genomför och godkänns i en säkerhetsprövning med eventuell registerkontroll.\n\nLåter det intressant? Hör av dig till oss eller skicka in din ansökan. Urval sker löpande.\nVill du veta mer om hur det är att arbeta hos oss? Kolla in våra karriärsidor!",
        "url": "https://www.aplitrak.com/?adid=aC5oZWRlbmdyZW4uMzk3MTQuMzEwMUBzYWFiLmFwbGl0cmFrLmNvbQ",
        "published": "2025-10-17T17:54:31",
        "deadline": "2025-11-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30216178",
        "title": "Product Manager, Kiona",
        "employer": "We SeeQ AB",
        "location": "Göteborg",
        "description": "Join Kiona as Product Manager and drive innovation and real impact for customers in our Retail & Refrigeration segment  In this strategic role, you’ll shape the segment’s future by combining AI, data, and sustainability to deliver smarter, energy-efficient solutions that help retailers and building owners reduce waste and optimize operations. You’ll own the product roadmap across the SaaS lifecycle and use AI to validate concepts faster and enhance workflows. \n About the role As Product Manager at Kiona, you play a key role in shaping and leading the development of services and features within our SaaS offering. You operate at the intersection of business, customer, and technology, turning insight into action and strategy into measurable results.\nYou’ll own the product strategy for the segment, ensuring that identified customer needs and business opportunities are turned into scalable SaaS solutions and measurable impact. Together with other Product Managers and the development team, you’ll ensure a unified strategy and turn insights into solutions that drive measurable business results. \n Your main responsibilities Take full ownership of the SaaS product lifecycle from concept and product strategy to packaging, launch, and continuous optimization. You’ll ensure our SaaS offering evolves into an even more professional, scalable, and value-driven solution, balancing short-term customer needs with long-term product vision.\n Define and communicate the end-to-end product roadmap, from idea to launch and continuous improvement \n Drive SaaS productification, ensuring that features and services are packaged and delivered as scalable, value-driven offerings\n Identify and validate new service and product opportunities that create customer value\n Leverage AI as a driver of smarter decisions, faster validation, and continuous innovation\n Collaborate with the development team to turn strategy into effective solutions\n Communicate roadmap progress and results across teams to ensure alignment and transparency\n Track feature adoption, measure impact, and deliver measurable business outcomes\n Work cross-functionally with tech, marketing, sales, and customer success\n Own the product’s business case and contribute to company growth and commercial success\n Act as an ambassador for your product, both internally and externally\n \nWe’re looking for someone who has\n A university degree in engineering, business, informatics, or equivalent\n Managing the full product lifecycle in a SaaS environment\n Ability to drive product strategy from idea to delivery and measurable results\n Prioritizing and making decisions based on customer insights and data\n Strong communication skills and the ability to align stakeholders\n Analytical strength and solid business acumen\n Excellent collaboration skills in cross-functional teams\n Fluency in both Swedish and English, written and spoken\n \nMeriting experience\n PropTech or Retail/Refrigeration domains\n Using or exploring AI in product development processes\n Scaling SaaS products across multiple markets\n Understanding of system integrations with platforms or hardware\n Monitoring and developing product business cases and commercial outcomes\n \nWho you are You thrive in a fast-paced environment where business and technology meet, curious about customer challenges and passionate about solving them. Analytical, communicative, and empathetic, you lead by example from idea to launch and build trust through clarity and collaboration. You navigate complexity with confidence and inspire others through engagement, vision, and clarity.\nYou are driven by development and want to contribute to shaping services and features that make a real difference for users and society.\nWhat Kiona offers you At Kiona, you get more than a job; you become part of a culture defined by our values: Trust, Curiosity, and Creativity. We trust each other and offer freedom with responsibility. We encourage curiosity and continuous learning, and we believe creativity drives progress. Here, you have space to grow, take ownership, and make an impact while working on solutions that make a real difference for the climate and our customers.\nThe position is based at Kiona’s new office in MIMO House, central Mölndal, opening in June 2026.\nAre you the Product Manager we’re looking for?   Application Kiona is partnering with We SeeQ in this recruitment. Please apply by answering the questions below and uploading your profile. For questions or further information, contact Lena Wadenby: 0702-943550 / lena.wadenby@weseeq.se.  \nAbout Kiona Kiona is a leading SaaS company with the vision to make a big impact in the fight against climate change by offering the smartest and most cost-effective proptech platform on the market. The company enables building owners and other stakeholders to achieve their financial and sustainability goals through the digitalization of new and old buildings and their heating, cooling, ventilation, and refrigeration systems. With offices in eight markets and 150 colleagues, Kiona currently connects over 55,000 commercial, industrial, residential, and public buildings and 3,000 grocery stores in Europe. Through an innovative platform that monitors, controls, and optimizes both energy use and organizations, Europe's existing buildings can now become part of the solution for the future. For more information, visit our website: www.kiona.com",
        "url": "https://weseeq.teamtailor.com/jobs/6688801-product-manager-kiona?promotion=1695718-arbetsformedlingen",
        "published": "2025-11-03T10:51:33",
        "deadline": "2025-11-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30187386",
        "title": "AI Growth Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Ride the AI Wave: Become MindArk’s AI Growth Engineer!\nThe AI revolution isn’t waiting for your graduation. If you’ve completed two years of a technical degree (with top grades in math and physics) and find yourself questioning the value of a traditional diploma in a world about to be upended by AI, this is your moment. \nMindArk – the creative force behind Entropia Universe – is hiring an AI Growth Engineer in Gothenburg to help market our virtual universe using cutting-edge AI tools. We want brilliant minds like yours on board now to ride the wave of AI transformation with us.\nStep off the academic treadmill and into a real-world impact role. \nAs our AI Growth Engineer, you’ll apply your technical skills to engineer explosive growth for Entropia Universe. Forget the old marketing playbook – you’ll write new rules, using data, code, and creativity to turn bold ideas into global success stories.\nThis is your chance to work at the crossroads of advanced tech and creative marketing, where marketing is treated as an engineering challenge. You’ll run experiments powered by AI and turn them into real results, helping transform a pioneering virtual world into a global phenomenon.\nWhy Join MindArk?\n• Accelerated Learning: Work with state-of-the-art AI tools on live projects and level up faster than any classroom can offer.\n• Real Impact: See your ideas drive the growth of Entropia Universe in real time and shape a vibrant online community on a global stage.\n• Ahead of the Curve: Be at the forefront of AI-driven marketing in gaming, outpacing what’s taught in textbooks and setting trends instead of following them.\nWe’re looking for ambitious, creative problem-solvers who refuse to settle for “good enough.” If you thrive on innovation and want to be ahead of the curve, join us and make your mark now. Don’t watch the AI revolution from the sidelines – become the engineer driving it.\nReady to launch your career and make history? Apply today to join MindArk’s mission and help us engineer the future of digital marketing. Let’s ride this wave together.",
        "url": "https://career.mindark.com/jobs/6262447-ai-growth-engineer",
        "published": "2025-10-24T15:26:40",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30182882",
        "title": "Operations Graduate Program 2026 - Digital Transformation Leader",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "During 15 intense and exciting months, our Operations Graduate Program will give you a holistic view of our operational and logistic activities, including both the local and global perspective.\r\n\r\nYou will have a permanent position from day one, with a manager and mentor to support you. You will experience several local and international on the job-rotations and work on business-critical projects developing your competencies for tomorrow. \n\nOur organization\n\nAt Tuve Plant, we are not just building heavy-duty trucks, we are shaping the future of sustainable transportation! Guided by lean manufacturing values, we are proud to be the forefront of innovation, and exciting things are happening all around us. As we embrace industrialization and digitalization, we are pushing the boundaries to create greener, more efficient automotive products. Our internal flows and processes are evolving rapidly with automation and breakthrough technologies are at the heart of our transformation.\n\nThis is us, your new team\n\nWelcome to Digitalization & IT team from Tuve! We are a collaborative, curious, and value-oriented group working closely with production, logistics, engineering, and business units to unlock digital potential in a company where change is gradual and budget-conscious decisions are the norm. We value open communication, resilience, and practical innovation over flashy quick wins.\n\nMain activities and responsibilities: \n\nIn this role, you will have the opportunity to explore and shape innovative Industry 4.0 applications, such as IoT, AI, machine learning, and data management, to bring measurable value to production, logistics, and business processes.\n\nYou will collaborate with cross-functional teams to map and enhance business processes, conduct value stream mapping and gap analyses, and propose practical, cost-effective solutions. Additionally, you will act as a facilitator of change by engaging stakeholders across different departments to build alignment and foster a digital mindset. You will create and manage small-scale pilots or proof-of-concept projects, from scoping to execution, ensuring that the learnings can be scaled. In parallel, you will contribute to shaping product-oriented digital strategies that thoughtfully balance long-term transformation with immediate operational needs.\n\nThroughout the process, you will communicate progress, challenges, and insights clearly, engaging leadership and leveraging data to support decision-making.\n\nWho are you? \n\nWe are looking for a proactive, entrepreneurial graduate with strong interest in AI and digital transformation. You thrive in environments where patience and resilience are required to drive change, and you are comfortable working with low digital maturity operations while inspiring others with new possibilities.\n\nWe believe you bring a strong analytical mindset and a genuine passion for applying data and AI to solve business problems. You are someone who takes initiative, works independently, and drives projects forward despite obstacles. Your ability to navigate uncertainty with adaptability and a clear focus on value creation is one of your strengths.\n\nAn inclusive and collaborative attitude, along with strong facilitation skills, are essential to bring stakeholders together effectively. Your curiosity and eagerness to understand the complexities of vehicle manufacturing are key assets. You have strong communication skills and the ability to present complex topics in a simple and understandable manner. Perseverance and resilience are necessary to drive transformation in a slow-changing, budget-conscious environment. You are a creative problem-solver with a practical mindset, balancing innovation with cost constraints. High energy, curiosity, and a drive to learn and grow within a global manufacturing context are important.\n\nRequired knowledge:\n\n  *  MSc or BSc with strong academic achievements in Computer Science, Data Science, Artificial Intelligence, Industrial Engineering & Management, Information Technology, or a related field. Specialization in AI/ML, Data Analytics, Digital Transformation, Industrial Digitalization (Industry 4.0), or Smart Manufacturing.\n  *  Knowledge of Industry 4.0 concepts (IoT, AI/ML, automation, digital twins).\n  *  Familiarity with data analytics tools (PTC tools, Python, R, Power BI, or similar).\n  *  Understanding of agile methodologies and product-oriented work.\n  *  Ability to perform gap analysis and business process mapping.\n  *  Comfort with stakeholder management and cross-functional collaboration.\n  *  Maximum two years of previous full-time working experience, prior to or after graduation. Work during studies are not included.\n  *  In this truly global program, communication will be in English, hence you need to be fluent in both speaking and writing in Swedish & English.\n  *  Valid work or study permit for Sweden, if not a citizen.\n\n\nCurious, and have some questions?\n\nManager: Priscila Lovato, +46313278005, priscila.lovato@volvo.com\nHRBP: Louise Karlsson, +46 765534974, louise.karlsson.3@volvo.com",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43735676",
        "published": "2025-10-24T02:25:20",
        "deadline": "2025-11-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30127328",
        "title": "Android Platform Architect",
        "employer": "Coretura AB",
        "location": "Göteborg",
        "description": "Join the Revolution in Commercial Vehicle Tech. At Coretura, we’re not just building the future of commercial vehicles—we’re redefining how automotive software is developed. As a joint venture between Volvo Group and Daimler Truck, we blend startup speed with industry strength. And we’ve gone all-in on AI.\nWe’re looking for an experienced Android Platform Architect to help define and lead the system-level architecture of our Android-based infotainment and vehicle integration stack—bridging the gap between hardware, middleware, and Android OS internals.\n \nWhat You’ll Do\nIn this role, you’ll take ownership of the Android platform architecture, working closely with hardware and middleware teams to ensure seamless integration, performance, and compliance. Your responsibilities will include:\n Architecting the Android platform stack from HAL to system services, with a focus on embedded integration.\n Defining HAL/service boundaries and OTA update strategies (including A/B partitioning).\n Collaborating with hardware, AUTOSAR, and middleware teams to align Android with real-time ECUs.\n Leading efforts in secure and scalable system design: SELinux, sandboxing, secure/verified boot.\n Optimizing system performance: boot time, memory footprint, GPU/CPU scheduling.\n Designing for multi-SoC, multi-display, and multi-user environments.\n Ensuring compliance with Google certification (CTS, VTS) and projection standards.\n Guiding Android virtualization strategies (e.g., VirtIO, Cuttlefish).\n Aligning architecture with functional safety standards (ISO-26262, ASPICE, AUTOSAR).\n Acting as a technical interface with OEM stakeholders and certification partners.\n Lead Android certification strategy and compliance processes including projection certification\n \n \nWhat You Bring\nAt Coretura, we value more than just technical expertise—we’re looking for someone who brings genuine drive, initiative, and a proactive, action-driven mindset to every challenge. You’re passionate about technology and innovation, and your leadership skills inspire those around you to push boundaries and deliver results. Your ability to take ownership and lead projects forward makes you a catalyst for progress in our team.\nAlongside these qualities, you have a strong technical foundation and hands-on experience in Android platform development, particularly in embedded and automotive environments. Ideally, you have:\n Proven experience as an Android System Architect \n Deep knowledge of AAOS internals: system services, Binder IPC, HAL, and embedded design.\n Strong understanding of Android’s interaction with hardware and middleware layers.\n Experience with Android bring-up, BSP/kernel integration, and SoC-level architecture.\n Familiarity with automotive protocols (CAN, LIN, SOME/IP) and VHAL design.\n Hands-on experience with Android graphics stack (SurfaceFlinger, HWComposer).\n \nExposure to cloud-native design, edge-cloud orchestration, and telematics is a plus.\n \nWhy us?\nAt Coretura, we’re all about shaking things up in our industry! We believe in empowering our team and creating a culture where innovation thrives. \nWhen you join us, you won’t just be another employee; you’ll have the freedom to make decisions that drive our projects and tech forward. We encourage creativity and we know that diverse perspectives are key to solving the tough challenges we face. \nOur focus is on making a real impact, and we prioritize what matters most to deliver value to our customers quickly. With a lean team that’s always learning and adapting, we’re ready to evolve with the latest technology and market trends. Come be a part of a workplace where your contributions truly matter!\n \nReady to architect the next generation of Android-powered commercial vehicles?\nApply now and help us build the foundation for the future of transport. Applications will be reviewed continuously.\n \nQuestions? Dont hesitate to reach out to Sandra.hamdi@coretura.com you have any questions. \nPlease note we do not accept any applications via email.",
        "url": "https://career.coretura.com/jobs/6588345-android-platform-architect?promotion=1664134-arbetsformedlingen",
        "published": "2025-10-09T15:47:21",
        "deadline": "2025-11-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30108410",
        "title": "Doctoral student in physics-informed machine learning for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided and data-driven foundation models for multivariate time series in safety-critical systems such as automotive. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering at Chalmers and University of Gothenburg in Sweden employs approximately 300 employees from more than 30 countries. The department is divided into four divisions and is widely recognized for excellent research and education, with activities on two campuses in the city of Gothenburg. Research in the department has a wide span, from theoretical foundations to applied systems development. We provide high quality education at the bachelor's, master's, and graduate levels, offering over 120 courses each year. We also have extensive national and international collaborations with academia, industry and society.\n\nWe are announcing a PhD position that is placed at the Computing Science division with Chalmers University of Technology as the employer. \n\nThis project is a collaboration between the AIXLab@Chalmers and Volvo Group. At AIXLab, we focus on developing AI solutions that are usable and applicable in real-world settings. We are part of the Computing Science division at the Department of Computer Science and Engineering.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other domains. You do not need extensive experience with physics-guided modeling; strong interest in time series machine learning and the ambition to learn are what matter most. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent.\n• You will need strong written and verbal communication skills in English.\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning.\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch). \n• Engineering skills: GPU/cluster training, experiment tracking, data engineering.\n• Ability to formulate research questions, run empirical studies at scale.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Experience with physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Experience with academic research and publications\n\nWhat you will do\n\n• Take courses at an advanced level within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files. Please note the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than December 1st 2025\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nEmail: yinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nEmail: secarl@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***  \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society. \nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14252&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-10-06T10:43:01",
        "deadline": "2025-12-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30197331",
        "title": "Chef Systemvalidering",
        "employer": "RISE Research Institutes of Sweden AB",
        "location": "Borås",
        "description": "Är du intresserad av ledarskap, forskning och affärsutveckling? Vill du hjälpa svensk industri att bibehålla och stärka sin konkurrenskraft, såväl nationellt som internationellt? Då har vi jobbet för dig!\nOm oss\nAvdelningen System- och produktsäkerhet inom division Säkerhet och transport bedriver verksamhet inom forskning, utbildning provning och certifiering som stödjer utvecklingen av säkra system och produkter. Vi arbetar bland annat med elsäkerhet, miljötålighet, funktionssäkerhet,cybersäkerhet, AI, maskinsäkerhet, robusta och resilienta energisystem samt totalförsvar.\nVi söker nu en enhetschef till Systemvalidering som är en del av avdelningen System- och produktsäkerhet. Enheten befinner sig i en spännande utvecklingsfas för att ännu bättre möta den stora efterfrågan inom området.Enheten erbjuder viktiga tjänster för både nya och befintliga tekniska lösningar och säkerställer att de är säkra, robusta och uppfyller gällande lagkrav vilket är avgörande för industrin, samhället och svensk konkurrenskraft. Det handlar om provning, certifiering, validering av system, maskiner, produkter och infrastruktur. Rådgivning och utbildning kring regelverk, AI, cybersäkerhet och maskinförordningen. Här finns expertis inom funktionssäkerhet för inbyggda system och maskiner, samt test och utvärdering av mätinstrument och datainsamlingssystem såsom taxametrar, larmsystem, betalsystem och redovisningscentraler för taxi.\nDu blir en del av en expansiv och dynamisk avdelning med stor utvecklingspotential, där samarbete står i centrum. Vi är ett engagerat team med högt i tak, och du kommer att få möjlighet att växa, lära och bidra till samhällsviktig innovation varje dag.\nOm rollen\nSom Enhetschef leder och utvecklar enheten Systemvalidering och har personalansvar för ca 18 medarbetare. Du arbetar nära våra kunder och partners och bidrar aktivt till att vidareutveckla våra erbjudanden. I samverkan med kollegor inom RISE har du ett tydligt ansvar för att stärka vår affär, innovationsförmåga och utveckling. Vidare leder du enheten med ett kommunikativt och förtroendeingivande ledarskap, där du coachar medarbetarna och är en viktig ambassadör för RISE:s kultur och värderingar.\nSom medlem i avdelningens ledningsgrupp är du med och driver det strategiska arbetet inom System- och produktsäkerhet i linje med RISE:s vision. Du har en central roll i att forma enhetens riktning och bidra till hela avdelningens utveckling och innovationskraft. Du rapporterar till Avdelningschefen för System- och produktsäkerhet.\nBefattningen är placerad i säkerhetsklass, vilket innebär att du behöver genomgå en säkerhetsprövning, i enlighet med kraven i Säkerhetsskyddslagen. Godkänd säkerhetsprövning och svenskt medborgarskap är ett krav för anställningen.\nPlaceringsort är Göteborg eller Borås, och vi arbetar idag utifrån ett hybridupplägg. Resor förekommer i tjänsten. Eftersom våra medarbetare finns på RISE:s siter i både Göteborg och Borås är fysisk närvaro i labb och på kontor en viktig del av arbetet.\nVem är du?\nDu är en affärsmässig och förtroendeingivande ledare som med trygghet och engagemang coachar dina medarbetare mot gemensamma mål. Genom ett kommunikativt och lyhört ledarskap skapar du en arbetsmiljö präglad av tillit, samverkan och utveckling. Du har god samarbetsförmåga och förstår att de bästa resultaten uppnås när vi arbetar tillsammans.\nTillsammans med dina medarbetare formulerar du tydliga och konkreta mål, samtidigt som du på ett kommunikativt och förtroendeingivande sätt förmedlar RISE:s vision och roll som innovationspartner, både internt och externt. Du arbetar nära våra kunder och bidrar aktivt till att vidareutveckla våra erbjudanden, med målet att leverera goda resultat, såväl kvalitativa som kvantitativa.\nVidare har du förmågan att bygga engagerade och produktiva team genom att utveckla och möjliggöra för dina medarbetare att nå sin fulla potential. Genom att skapa förutsättningar för samverkan, delegera ansvar och främja en kultur där feedback är en naturlig del av vardagen, stärker du både individens och gruppens utveckling. Du arbetar aktivt med att effektivisera processer och fokuserar på det som skapar verkligt värde och lönsamhet. Med god förmåga att prioritera och skapa balans i det dagliga arbetet, bidrar du till en hållbar och framgångsrik arbetsmiljö.\nKrav\nEn för området relevant akademisk examen på magister/masternivå eller mer avancerad nivå\nDokumenterad erfarenhet av ledande roller med personal-, budget och resultatansvar, samt vana att leda och coacha medarbetare till goda resultat\nErfarenhet att leda arbete inom områdena AI och cybersäkerhet\nErfarenhet av ledande roller med fokus på innovation, forskning och kommersiell verksamhet.\nErfarenhet av att strategiskt leda inom något/några av avdelningens viktiga områden så som utveckling av certifiering, provning och verifiering\nDomänkunskap inom ett eller flera av följande områden: certifiering, provning, verifiering, cybersäkerhet, maskinförordningen och AI.\nGod förmåga att analysera omvärlden, identifiera framtida behov och utmaningar, och omsätta insikterna till proaktiva åtgärder.\nÖppenhet för nya teknologier och agila arbetssätt\nFörmåga att främja tvärfunktionellt samarbete och erfarenheter från arbete med organisationer i förändringar\nDokumenterad förmåga att driva affärsutveckling som leder till god lönsamhet\nEtt för området starkt nätverk inom näringsliv, offentlig sektor samt universitet och högskolor\nB-körkort\nFlytande svenska och engelska i tal och skrift\nSvenskt medborgarskap\n\nMeriterande\nErfarenhet av att leda forsknings- och/eller utvecklingsprojekt.\nErfarenhet av säkerhetskänslig verksamhet\nGod kunskap om maskinförordningen\n\nÄr vi en bra match?\nInom RISE är vi övertygade om att mångfald bidrar till en innovativ miljö där vi tillsammans utmanar gränser och utvecklar ny kunskap och kompetens för framtiden. På RISE kommer du tillsammans med engagerade och kompetenta kollegor bidra till en hållbar framtid. Vill du vara med på den resan mot ett mer robust och resilient samhälle? Välkommen till hela Sveriges forskningsinstitut och innovationspartner!\nVälkommen med din ansökan!\nLåter detta spännande och du vill veta mer är du välkommen att kontakta Avdelningschef Elenor Bernelow Loyd, +46 10 516 50 16. Sista ansökningsdag är 10 november 2025. Urval och intervjuer sker löpande under och efter ansökningsperioden.\nFackliga representanter är Linda Ikatti, Unionen, 010-516 51 61 och Ingemar Pettermann, SACO, 010-228 41 22",
        "url": "https://career.ri.se/jobs/6669430-chef-systemvalidering",
        "published": "2025-10-28T13:11:05",
        "deadline": "2025-11-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30197323",
        "title": "Chef Säkra produkter",
        "employer": "RISE Research Institutes of Sweden AB",
        "location": "Borås",
        "description": "Vill du leda spetskompetens inom produktsäkerhet och samtidigt bidra till ett säkrare och mer hållbart samhälle? Hos oss får du möjlighet att bidra i en verksamhet där forskning, provning och innovation möts. Som enhetschef för Säkra Produkter får du tillsammans med ett engagerat team skapa lösningar som gör skillnad – för industrin, för samhället och för framtiden.\nOm oss\nAvdelningen System- och produktsäkerhet inom division Säkerhet och transport bedriver verksamhet inom forskning, utbildning provning och certifiering som stödjer utvecklingen av säkra system och produkter. Vi arbetar bland annat med elsäkerhet, miljötålighet, funktionssäkerhet,cybersäkerhet, AI, maskinsäkerhet, robusta och resilienta energisystem samt totalförsvar.\nEnheten befinner sig i en spännande utvecklingsfas för att ännu bättre möta efterfrågan inom området .Vi söker nu en enhetschef till Säkra Produkter som är en del av avdelningen System- och produktsäkerhet. Enheten erbjuder Provning, certifiering, validering av system, maskiner, produkter och komponenter, rådgivning och utbildning kring regelverk. \nDu blir en del av en expansiv och dynamisk avdelning med stor utvecklingspotential, där samarbete står i centrum. Vi är ett engagerat team med högt i tak, och du kommer att få möjlighet att växa, lära och bidra till samhällsviktig innovation varje dag.\nOm rollen\nSom enhetschef för Säkra Produkter får du möjlighet att leda ett team med spetskompetens inom produktsäkerhet, elsäkerhet, miljötålighet och IP-provning. Tillsammans driver ni utveckling, provning, certifiering och rådgivning för att säkerställa att produkter och komponenter är säkra, robusta och hållbara – både idag och i framtiden. Enheten arbetar med både kunduppdrag och forskningsprojekt, ofta inom ackrediterad verksamhet, och har en viktig roll i att bidra till ett säkrare och mer hållbart samhälle.\nDu har personalansvar för cirka 20 medarbetare och ett helhetsansvar för att utveckla enheten med fokus på tillväxt, lönsamhet och kompetensförsörjning. I nära samarbete med kunder och partners vidareutvecklar du våra erbjudanden och stärker vår affär genom att bygga långsiktiga relationer och driva komplexa affärer. Du säkerställer hög kvalitet i våra tekniska tjänster och utvecklar provningsverksamheten i samverkan med forskningen, samtidigt som du bidrar till affärs- och verksamhetsutveckling inom produktsäkerhet och angränsande områden.\nMed ett kommunikativt och förtroendeingivande ledarskap coachar du medarbetarna och är en viktig ambassadör för RISE:s kultur och värderingar. Du representerar RISE i externa sammanhang och samverkar med industri, myndigheter och akademi för att stärka vår position och bidra till RISE:s strategiska utveckling inom området säkra produkter och system.\nSom medlem i avdelningens ledningsgrupp är du med och driver det strategiska arbetet inom System- och produktsäkerhet i linje med RISE:s vision. Du har en central roll i att forma enhetens riktning och bidra till hela avdelningens utveckling och innovationskraft. Du rapporterar till Avdelningschefen för System- och produktsäkerhet.\nBefattningen är placerad i säkerhetsklass, vilket innebär att du behöver genomgå en säkerhetsprövning, i enlighet med kraven i Säkerhetsskyddslagen. Godkänd säkerhetsprövning och svenskt medborgarskap är ett krav för anställningen.\nPlaceringsort är Göteborg eller Borås, och vi arbetar idag utifrån ett hybridupplägg. Resor förekommer i tjänsten. Eftersom våra medarbetare finns på RISE:s siter i både Göteborg och Borås är fysisk närvaro i labb och på kontor en viktig del av arbetet.\nVem är du?\nDu är en affärsmässig och förtroendeingivande ledare som med trygghet, positiv energi och engagemang coachar dina medarbetare mot gemensamma mål. Genom ett kommunikativt och lyhört ledarskap skapar du en arbetsmiljö präglad av tillit, samverkan och utveckling. Du har en god förmåga att bygga relationer och trivs i samarbeten där olika perspektiv möts. Med en flexibel och lösningsorienterad inställning tar du dig an utmaningar och ser möjligheter i förändring.\nTillsammans med ditt team formulerar du tydliga och konkreta mål, samtidigt som du på ett inspirerande sätt förmedlar RISE vision och roll som innovationspartner, både internt och externt. Du arbetar nära våra kunder och bidrar aktivt till att vidareutveckla våra erbjudanden, med målet att leverera goda resultat, såväl kvalitativa som kvantitativa.\nVidare har du en strategisk blick och förmågan att leda i förändring, samtidigt som du är strukturerad och drivande i ditt arbetssätt. Genom att skapa förutsättningar för samverkan, delegera ansvar och främja en kultur där feedback är en naturlig del av vardagen, stärker du både individens och gruppens utveckling. Med förmåga att prioritera och skapa balans i det dagliga arbetet bidrar du till en hållbar och framgångsrik arbetsmiljö där laganda och nyfikenhet är centrala drivkrafter.\nKrav\nEn för området relevant akademisk examen på magister/masternivå\nFlerårig erfarenhet av ledarskap inom teknikintensiva organisationer\nErfarenhet att leda arbete i områdena AI och cybersäkerhet\nDokumenterad god erfarenhet av:\nLedning av tekniska team och specialister\nBudget-, personal- och resultatansvar\nAffärsutveckling och kundrelationer\nProvning, certifiering och kvalitetsarbete\nArbeten kopplade till produktsäkerhet och/eller produktutveckling\nGod förmåga att analysera omvärlden, identifiera framtida behov och utmaningar, och omsätta insikterna till proaktiva åtgärder\nÖppenhet för nya teknologier och agila arbetssätt\nErfarenhet att främja tvärfunktionellt samarbete och erfarenheter från arbete med organisationer i förändringar\nDokumenterad erfarenhet av att driva ekonomiskt lönsam verksamhet samt förmåga att utveckla affärer som genererar god lönsamhet\nEtt för området starkt nätverk inom näringsliv, offentlig sektor samt universitet och högskolor\nErfarenhet av ackrediterad verksamhet och standardiseringsarbete\nErfarenhet av kvalitets och arbetsmiljöarbete\nB-körkort\nFlytande svenska och engelska i tal och skrift\nSvenskt medborgarskap\n\nMeriterande\nGod kunskap i andra europeiska språk\nErfarenhet av säkerhetskänslig verksamhet\n\n\n\nVälkommen med din ansökan!\nLåter detta spännande och du vill veta mer är du välkommen att kontakta Avdelningschef Elenor Bernelow Loyd, +46 10 516 50 16. Sista ansökningsdag är 10 november 2025. Urval och intervjuer sker löpande under och efter ansökningsperioden.\nFackliga representanter är Linda Ikatti, Unionen, 010-516 51 61 och Ingemar Pettermann, SACO, 010-228 41 22",
        "url": "https://career.ri.se/jobs/6667834-chef-sakra-produkter",
        "published": "2025-10-28T13:08:45",
        "deadline": "2025-11-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30096280",
        "title": "Data Warehouse Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "About Us\nEtraveli Group is the globally leading company for tech solutions and fulfilment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travellers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nDo you want to be part of the next step in our growth journey?\nAt Etraveli Group we use a lot of data for decision making processes, analysis and machine learning. Users of the data can be found in different departments like Finance, Customer Service, Sales, Data Science and Research. In alignment with our growing targets we are looking for experienced data engineers to become part of our Data Solutions team to get more data into our data lakehouse platform and prepare it in order to be used by the users. \nWho You Are\nWith the right skill set and motivation you will be setting up, maintaining and evolving our data warehouse solution as well as participating in driving a large portion of our future data engineering.\nIn this primarily technical role, there will be close interaction with database administrators and operations’ engineers, but there will also be collaboration with stakeholders from other parts of our organization (e.g data analysts, business intelligence teams and business stakeholders). The data sources we use are located both in cloud environments as well as on-prem. Working with us means you'll have access to a team of highly competent professionals and ample resources to foster your personal and professional growth. We face the challenges of the day working for a company that goes the extra mile to ensure that we have fun at, and outside, the office. \nRequirements\nTo thrive and succeed in this role we believe that you have:\nA strong interest in maintain and evolve our data warehouse solution\nAbility to analyze and take on tasks, both individually and together with others\nAbility to design and implement tasks from scratch, individually gathering the necessary information where needed\nStrong foundation in data warehousing concepts and data modeling (e.g., Star and Snowflake Schemas, Incremental Loads, Slowly Changing Dimensions)\nPrevious experience working with data processing and distributed query engines, like Spark, Dremio/Trino, Databricks\nPrevious experience working as a data engineer, with different ETL (e.g., dbt, Airflow) and CDC tools (e.g., Debezium, Flink CDC, Kafka Connect)\nPrevious experience working with multiple scripting languages, like Bash, Python, SQL, etc\n\nIt is also desirable that your skills match one or more of the following:\nPrevious experience to ensure high-performance data processing with techniques like indexing, partitioning, and caching.\nPrevious experience working with data integrations\nPrevious experience working with data modelling for efficient query performance, data quality and optimization\nPrevious experience working as a database administrator\nComfortable working with Linux, Docker, and preferably also Kubernetes\nExperience with data lakehouse table formats like Apache Iceberg or Delta Lake, enabling features like ACID transactions and time-travel on object storage\n\nBenefits\nAt Etraveli Technology, you will be part of a gang of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard.\nEtraveli Group is a company that really wants to contribute to you reaching your full potential.\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\nWe love gaming and after work activities.\nWe know the value of personal development and continuous training.\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\nWellness allowance - Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities.\nThrough partners, we offer comprehensive pension and health insurance so that you can quickly get help if the accident occurs.\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\nAnd we serve breakfast every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/206B865709/apply",
        "published": "2025-10-02T09:24:25",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]