[
    {
        "id": "29796204",
        "title": "AI Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced AI Engineer to join our team.\nKey Responsibilities:\nBuild and deploy LLM-powered agents for business process automation (e.g., using LangChain, AutoGen, OpenAI).\nImplement Retrieval-Augmented Generation (RAG) pipelines integrating with internal knowledge sources (e.g., Confluence, Google Drive).\nDevelop multi-step reasoning chains, function calling, and agent memory for complex workflows.\nIntegrate agents with third-party APIs (Salesforce, GitHub, Jira, Slack, etc.).\nDefine best practices around prompt engineering, tool usage, and secure API communication.\nCollaborate with cross-functional teams to understand and prioritize automation opportunities.\nTrack AI reliability, hallucination risks, and ethical use across deployed solutions.\nDesign evaluation strategies for agent performance, reliability, and business impact.\nSupport fine-tuning or embedding optimization to improve agent accuracy and task alignment.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\nStrong software engineering background- Python a must; experience with Bash, JavaScript or Golang is a plus.\nHands-on experience with LLM frameworks (LangChain, LlamaIndex) and APIs (OpenAI, Gemini, Claude).\nProficient in integrating external APIs using REST/GraphQL and managing agent workflows.\nComfortable with cloud platforms (preferably GCP/Vertex AI or Azure OpenAI) and containerized environments.\nExperience with RAG, semantic search, vector databases (e.g., Pinecone, FAISS), and prompt templating.\nStrong understanding of security, privacy, and responsible AI practices.\nCurious, experimental, and fast learner with excellent communication skills in English. \nFamiliarity with orchestration frameworks (e.g., CrewAI, MetaGPT, AutoGen) is a strong advantage.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2025-06-26T21:30:40",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29796221",
        "title": "Machine Learning Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Machine Learning Engineer to join our team.\nKey Responsibilities:\nEstablish MLOps best practices and patterns for scalable ML deployment.\nDesign and build reproducible ML pipelines and model-serving infrastructure.\nManage and automate CI/CD for ML using GitHub Actions or Azure DevOps.\nOperate in cloud-first environments (GCP, Azure, AWS), using tools like Vertex AI, DBT, Airflow, or Kubeflow.\nImplement observability (model monitoring, drift detection) and infrastructure-as-code (Terraform, Helm).\nCollaborate with Data Scientists, Engineers, and Analysts to move models from notebooks to production.\nEnsure ML workflows align with data governance, security, and compliance standards.\nContribute to LLM-based model serving and fine-tuning pipelines where applicable.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\n4+ years of experience in ML engineering or MLOps in production settings.\nProficient in Python (OOP, testing, clean code, package management).\nExperienced in cloud platforms - GCP, Azure, AWS.\nExperienced with AWS services for ML deployment and infrastructure management, including SageMaker, CloudWatch, and IAM.\nExperience developing RESTful APIs using FastAPI for model serving and inference endpoints, including integration with CI/CD and auth middleware.\nHands-on with CI/CD pipelines, Containerization (Docker, Kubernetes), Infrastructure as Code (Terraform, ArgoCD, etc.), MLFlow, DBT, and Airflow.\nExperience in monitoring/observability strategies for production ML systems, including latency tracking, drift detection, and model version health using Prometheus, Grafana, or Vertex AI Model Monitoring.\nStrong skills in SQL, data modeling, and scalable data pipelines.\nAble to work in agile, cross-functional teams with clear communication and ownership mindset.\nStrong analytical problem-solving skills and love for clean, maintainable systems.\nCurious, experimental, and fast learner with excellent communication skills in English.\nExperience with large language models and LLMOps pipelines is a plus.\nWorking knowledge aligned with GCP/AWS ML certification standards (Vertex AI, IAM, Dataflow) is a plus.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2025-06-26T21:27:10",
        "deadline": "2025-12-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795902",
        "title": "Game Engineer (AI Team)",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Game Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking a Game Engineer to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nMindark is the pioneering force behind Entropia Universe, a dynamic and evolving virtual world where players engage in a vast array of activities, from commerce to exploration and beyond. With a strong emphasis on player-driven economies and real cash economy integration, we're at the forefront of shaping the future of MMORPG games. We value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Game Engineer, you'll play a pivotal role in developing and enhancing game features to take Entropia Universe to the next level. Your responsibilities will include designing, implementing, and optimizing game systems. A key aspect of this role is working extensively with new AI technologies inside our dedicated AI Team. This includes Transformer tech, large language models, and agentic frameworks, as well as current gamesystems. Your interest and expertise in these cutting-edge AI technologies and games will be crucial as you collaborate closely with multidisciplinary teams, to deliver high-quality features and advancements.\n\n\nResponsibilities: \nWork extensively with advanced AI technologies, such as Transformers and agentic frameworks, to innovate and improve current and new AI features in the game.\nDevelop and integrate current and new game systems to support and enhance gameplay features and functionalities.\nParticipate in code reviews and contribute to maintaining high coding standards.\nCollaborate with cross-functional teams to integrate new game mechanics and features.\nImplement security protocols and measures to safeguard game-related data.\nTroubleshoot and resolve technical issues related to game systems.\nBe flexible and open to work with all parts of the technical ecosystem.\n\n\n\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field.\nA few years of experience within the field. \nCreative thinker with a passion for games and a drive to innovate within the gaming space.\nProficiency in C++.\nProficiency in Python is a strong plus. \nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks.\nKnowledge of game development principles and methodologies.\nProblem-solving and communication skills.\nBeing flexible and able to work with a larger technical ecosystem.\n\n\n\nWhy Join Mindark: \nWork on a massively multiplayer online role-playing game with active players from around the globe.\nCollaborate with a talented and diverse team of gaming enthusiasts.\nCompetitive compensation package with opportunities for growth and development.\nA dynamic work environment that fosters creativity and innovation.\nAn inclusive work culture that values diversity and innovation.\nBeing able to work with cutting edge technologies that have not even hit the MMORPG games field yet.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: We would like you to be able to come into the office two days a week to Mindark Headquarters in Gothenburg, Sweden.",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-06-26T16:17:35",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787419",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-06-24T07:59:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29786070",
        "title": "Linux och Open Source entusiast",
        "employer": "Combitech AB",
        "location": "Göteborg",
        "description": "Vi söker Linux och open source entusiaster till Combitech i Göteborg. Hos oss får du möjlighet att växa i en företagskultur som uppmuntrar både professionell och personlig utveckling samt anställningstrygghet och balans i livet. Som medarbetare på Combitech i Göteborg är du med och utvecklar framtidens digitaliseringslösningar för industri och samhälle.\n\n \n\n \n\nDin roll som utvecklare\n\nDu kommer att vara en del av ett team som tillsammans utvecklar mjukvarulösningar för datainsamling, datalagring, analys, automation, AI samt flera typer av visualiseringar. Lösningarna teamet bygger används i stora projekt inom t.ex. offentlig verksamhet, processindustri och industri 4.0. Målet är att kunderna (baserat på data) ska få djupare insikt i sin verksamhet och därigenom effektivisera sina processer. Teknik- och komponent-stacken baseras på olika Open Source Communities, så som CNCF, som vi kompletterar med egenutvecklade applikationer.\n\n \n\nVåra uppdrag innebär att man bygger moderna system för att skapa lösningar som är innovativa och framtidssäkra för våra uppdragsgivare. Vi jobbar både med infrastruktur och applikationsutveckling vilket gör att våra medarbetare får både en bredd och djup inom olika relevanta mjukvaruteknologier. Exempel på ramverk, verktyg och tekniker som används är Docker, Kubernetes och Helm som grund vilka kompletteras med t.ex. Kafka, Quarkus med NodeJS och React. Programmeringsspråk som oftast används är TypeScript, Python, Java och Go.\n\n \n\n \n\nVem är du?\n\nVi söker dig som är kreativ och drivs av att ligga i teknikens framkant vad gäller verktyg och koncept. Du har ett stort intresse för FOSS (t.ex. CNCF, LF) och följer med i dess nyheter och diskussioner. Vi ser gärna att du är en daglig användare av Linux sedan något år tillbaka (antingen från skolan, tidigare tjänst eller fritiden). Som person trivs du med att vara en lagspelare i ett effektivt team som hjälper kunderna att skapa nya möjligheter.\n\n \n\nLämplig utbildningsprofil är Civilingenjör eller Högskoleingenjör med inriktning i Datateknik eller Informationsteknik eller annan Civilingenjör/Universitetsutbildning med inriktning inom programvaruutveckling och IT infrastruktur. Vi välkomnar både erfarna ingenjörer och ingenjörer som är i början av sin karriär.\n\n \n\nDå tjänsten innebär arbete som kan omfattas av försvarssekretess krävs det att du genomför och godkänns i en säkerhetsprövning. \n\nUrval sker i Augusti. Vi ser fram emot din ansökan!\n\n \n\n \n\nKom & gör skillnad\n\nVi tror att man gör ett bättre jobb om man kan fokusera på rätt saker, därför gör vi det lätt att kombinera jobbet med vardagen. Vi satsar på våra medarbetare, de utgör kärnan, hjärnan och hjärtat i vår verksamhet. Dessutom står vi på en stadig grund av högteknologi, forskning och anställningstrygghet med försvars- och säkerhetskoncernen Saab som ägare.\n\n \n\nFör oss handlar det om hållbarhet - vi vill bli branschens mest hållbara företag; och för att vara ett hållbart företag i en hållbar framtid behöver vi investera i våra medarbetare. För oss är din återhämtning, dina utvecklingsmöjligheter och din trygghet lika viktigt som företagets framgång - utan våra medarbetare står vi stilla.\n\n \n\nVill du veta mer om hur det är att arbeta hos oss? Kolla in våra karriärsidor!\n\n \n\nKontaktpersoner: Ingvar Andersson ingvar.andersson (@) combitech.com",
        "url": "https://www.aplitrak.com/?adid=am9sc3Nvbi4wMzczMi4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-06-23T14:00:47",
        "deadline": "2025-08-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 99
    },
    {
        "id": "29784165",
        "title": "Java-utvecklare till innovativt företag",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Bli en del av Yoin Technologies, ett ungt och snabbväxande techbolag som erbjuder IT-tjänster. Vi söker en engagerad systemutvecklare med kunskaper inom Java. Kom och bli en del av vårt team.\n\nDitt jobb på Yoin Technologies\n\nDitt främsta uppdrag blir att assistera kunder och ta deras tekniska miljöer till nästa nivå. Beroende på din erfarenhetsnivå kommer du antingen hantera uppdateringar och vidareutveckling av kunders miljöer eller få ett större ansvar och sköta processen när kunden byter från en klassisk driftsmiljö till en modernare cloud/azure-miljö. Oavsett vilken del av processen du tar dig an kommer du att stötta kundens utvecklingsteam med best practices för deployment, migrering av applikationer och tjänster samt miljöuppsättning.\n\nDå Yoin Technologies bedriver inkubatorverksamhet kan du se fram emot en hel del spännande projekt. Genom sina breda kunskaper och sitt stora nätverk gör man det möjligt för drivna entreprenörer att förverkliga sina idéer. Här blir du en viktig pusselbit i arbetet med att testa gångbarheten och ta fram prototyper för att se om idén har bärkraft. \n\nI dagsläget består Yoin Technologies av 20 stycken erfarna utvecklare och du kommer jobba tätt ihop med alla. Vilket team du jobbar i beror på projektet, men målet är att alltid arbeta i ett team om minst 3-4 personer som tillsammans jobbar mot samma projekt och kund. \nFrån start kommer några av dina närmsta kollegor bli Marcus, Peter och Fredrik.\n\nÄr det här du?\n\nFör att lyckas i den här rollen har du minst en 3-årig akademisk utbildning och 5 års erfarenhet inom utveckling i Java efter examen. Du behöver också behärska svenska flytande i tal och skrift.\n\nPå Yoin Technologies är vi övertygade om att en stark laganda och samarbete är nyckeln till framgång. Som systemutvecklare hos oss kommer du att vara en del av en engagerad och hjälpsam grupp som stöttar varandra. Vi tror på din förmåga att vara självgående och ta egna initiativ. Här får du inte bara möjlighet att utveckla dina tekniska färdigheter, utan också vara en del av en trivsam arbetsmiljö där vi värdesätter arbetsglädje och social sammanhållning.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Yoin Technologies. Det är viktigt att klargöra att rollen är för Yoin Technologies och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:33",
        "deadline": "2025-07-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784180",
        "title": "Erfaren systemutvecklare inom IT och industri",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa effektiva stöd för industriella processer. Här tar du hjälp av dina kunskaper i .NET och din förståelse för systemintegration för att identifiera behov och fastställa kravspecifikationer. Du deltar i allt ifrån tekniska förstudier, design, utveckling och installation till support, underhåll och vidareutveckling samt förvaltning av mjukvara för effektiv produktion. I stora drag kan man säga att du kommer jobba med både systemering och programmering.\n\nI ditt arbete får du uppbackning av kollegor som Olle, Björn, Martin, Robert, Elisabeth och Helena.\n\nÄr det här du?\n\nFör att passa i rollen behöver du ha en civilingenjör/högskoleingenjörsexamen och minst fem års erfarenhet av utveckling och leverans av IT-lösningar inom kritisk drift. Du får gärna ha känsla för både .NET, SQL Server och Oracle Server. Om du dessutom förstår det här med systemintegration och kan tillämpa olika datautbytesmetoder är det ett stort plus.\n\nDitt engagemang och stora intresse för teknik är vad som sporrar dig att hitta nya lösningar och effektiva stöd. Det är bra om du har lätt för att kommunicera, interagera med andra och känner igen dig i egenskaper som kundorienterad och lösningsorienterad Känner du dig dessutom som en kreativ person med förmågan att vara analytisk och ha ett öga för detaljer så har du hamnat rätt.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Prevas. Det är viktigt att klargöra att rollen är för Prevas och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:31",
        "deadline": "2025-07-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29782051",
        "title": "Systemutvecklare",
        "employer": "YH Akademin AB",
        "location": "Göteborg",
        "description": "Störst i Sverige på Yrkeshögskoleutbildningar på distans. Genom åren har tusentals personer tagit sig vidare i karriären hos oss. Vi finns för dig som vill utvecklas i ditt yrke, göra ett karriärbyte eller ta steget ut i arbetslivet. Tillsammans med näringslivet stärker vi kompetensen i hela Sverige.\r\n\r\nVill du vara med och forma digitala lösningar för vår utbildningsverksamhet? Då är vi rätt plats för dig!\n\nYH Akademin är en av Sveriges större anordnare av Yrkeshögskoleutbildning. Vi har ca 70 YH-utbildningar inom många olika branscher, nästan alla med ett distansupplägg eller nätbaserat upplägg som vi kallar det. Vi är en engagerad grupp om ca 100 medarbetare i hela landet och från/i olika branscher som skapar efterfrågad tillgänglig yrkesutbildning. Vi arbetar innovativt och försöker hitta de bästa metoderna att erbjuda lärande.\n\nOm tjänsten\n\nVi letar efter en passionerad och kreativ systemutvecklare som vill bli en del av vårt dynamiska och växande team. Hos oss kommer du att arbeta med spännande projekt där du får möjlighet att påverka och bidra till att skapa innovativa lösningar som gör skillnad.\n\nDina arbetsuppgifter\n\n• Utveckla och underhålla applikationer och system. \n• Samarbeta med olika team för att förstå verksamhetskrav och omvandla dem till tekniska lösningar. \n• Delta i hela utvecklingscykeln – från design till lansering och drift. \n• Hålla dig uppdaterad med de senaste teknologierna och implementera dem i vårt arbete. \n• Hantera och lösa tekniska utmaningar för att säkerställa hög kvalitet och prestanda. \n\nVem är du?\n\nVi söker dig som har:\n\n• En eftergymnasial utbildning inom IT, datavetenskap eller motsvarande erfarenhet. \n• Kunskap och erfarenhet inom programmering (gärna PHP) och mjukvaruutveckling. \n• Kunskap och erfarenhet inom API-integrationer är meriterande. \n• Förmåga att arbeta i team såväl som självständigt. \n• Ett lösningsorienterat tankesätt och en stor vilja att lära dig nya saker. \n• God kommunikationsförmåga, både på svenska och engelska. \n• Det är meriterande om du har erfarenhet av utbildningsverksamhet och gärna yrkeshögskola. \n\nVad erbjuder vi?\n\n• En inspirerande arbetsmiljö där innovation och samarbete står i fokus. \n• Möjligheten att arbeta med spännande projekt och den senaste tekniken. \n• Flexibla arbetstider med möjlighet till distansarbete. \n• Kompetensutveckling genom utbildningar och konferenser. \n• En arbetskultur där din röst verkligen räknas och där vi värdesätter mångfald och inkludering. \n\nTillträde\n\nAugusti/September 2025 eller efter överenskommelse.\n\nOmfattning\n\nTillsvidare anställning, 100% heltid eller efter överenskommelse\n\nArbetsort\n\nDu kan själv välja om du har din huvudsakliga arbetsplats hemma eller på ett kontor då vi främst jobbar nätbaserat.",
        "url": "https://yh.se/lediga-tjanster/?jobid=296958&ref=platsbanken",
        "published": "2025-06-19T12:17:17",
        "deadline": "2025-08-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709496",
        "title": "Systemingenjör",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Företagsbeskrivning\nAFRY erbjuder tjänster inom teknik, design, digitalisering och rådgivning. Vi är hängivna experter inom industri, energi- och infrastruktur, som skapar värde för kommande generationer. AFRY har en global räckvidd med djupa rötter i Norden. Tillsammans accelererar vi omställningen till ett mer hållbart samhälle.\n\n\nJobbeskrivning\nSom systemingenjör kommer du att jobba med elektronik och elsystem inom fordonsutveckling. \nDu kommer att arbeta med att analysera och realisera systemkrav och definiera hur fordonssystemet ska utformas med hjälp av konceptstudier, systemdefinition och systemkonstruktion. Rollen som systemingenjör innebär att man tar ägandeskap för förmåga, funktion och/eller attribut. \nOavsett vilket funktionsområde du tar dig an, kommer du att vara en nyckelperson i utvecklingen av våra fordonssystem. Du koordinerar hantering av komplexa tekniska frågor och leder din funktionsgrupp genom hela projektet i nära samarbete med seniora konstruktörer och specialister.\nExempel på arbetsuppgifter: \nSäkerställa att funktionaliteten är realiserbar samt att designen är ändamålsenlig. \nSäkerställa att utvecklad lösning uppfyller både kunds krav och interna krav.\nIdentifiera risker, planera tester, simuleringar och beräkningar och ser till att de genomförs för att kvalitetssäkra systemdesignen.\n\nResor i tjänst förekommer. \n\n\nKvalifikationer\nVi tror att du är civilingenjör inom tex mekatronik, elektronik eller datateknik, eller har annan för rollen relevant utbildningsbakgrund.\nSom person är du en driven person med förmågan att se helheten i design och arkitekturfrågor. Du förstår hur ett system är uppbyggt och bygger dina analyser på fakta och data. Du är analytisk och förstår hur ändringar på underliggande system har påverkan på andra system och andra för produkten viktiga attribut.\nFör oss är det meriterande om din främsta kompetens ligger inom mjukvara, elektronik och/eller nätverk samt erfarenhet av arbete på systemnivå för komplexa system. Har du tidigare erfarenhet av Systems Engineering (SE), eller erfarenhet från fordonsbranschen är det extra meriterande.\nDu har god presentations- och dokumentationsförmåga i tal och i skrift, både på svenska och på engelska.\nDå tjänsten innebär arbete som omfattas av försvarssekretess krävs det att du genomför och godkänns i en säkerhetsprövning med registerkontroll. \n\n\nYtterligare information\nFör frågor om tjänsten är du varmt välkommen att kontakta: \n\nLena Henriksson - Section Manager\n\nlena.henriksson@afry.com\n\n\n\nVi arbetar med löpande urval så skicka in din ansökan redan idag. Sista datum för att ansöka är: 6/7.\nVälkommen med din ansökan! \n\nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059995715-systemingenjor?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:22:23",
        "deadline": "2025-07-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29668991",
        "title": "Software Engineer- Billiant",
        "employer": "Telavox AB",
        "location": "Göteborg",
        "description": "Join Billiant in Gothenburg as a Software Engineer! \nWe are looking for a Software Engineer to join the engineering team with us at Billiant- a Telavox company. Billiant BSS enables a feature-rich, future-proof billing and support system for mobile, fixed, broadband, and TV services. As a key team member, you will be crucial in designing and developing a diverse and advanced BSS platform. You will be involved from the initial stages of understanding our customers’ challenges to creating and implementing effective solutions. If you’re excited about working with Java, designing distributed systems, and contributing to an innovative team, we’d love to hear from you! \nAbout the job \nAs a Software Engineer at Billiant, you’ll work on our feature-rich and future-proof Billing and Support System (BSS). You’ll collaborate with a team of talented engineers and be involved in the entire development process—from understanding customer challenges to implementing robust solutions.\nA typical day in this role involves:\n \nDesigning and developing: Contributing to the design and development of scalable features for our advanced BSS platform, handling large data sets like millions of subscriptions and billions of events.\n\n \nProblem-solving: Tackling complex technical challenges while continuously improving system performance.\n\n \nCollaborating with the team: Engaging in code reviews, brainstorming sessions, and team retrospectives to refine workflows and deliver high-quality results.\n\n \nWorking with customers: Understanding their needs and translating them into effective technical solutions.\n\n \nThis role is based in our Gothenburg office, a welcoming and modern space near the city center, easily accessible via public transport or car.\n About you \nWe’re looking for a Software Engineer with 2+ years of experience in software development. You’re a curious and collaborative problem-solver who enjoys diving into complex challenges and crafting innovative solutions. \nTechnical competencies:\n \nProficiency in Java, SQL, and RESTful APIs.\n\n \nExposure to distributed systems and an interest in scalable architecture.\n\n \nFamiliarity with React/TypeScript.\n\n \nGood-to-have skills:\n \nExperience with Agile methodologies like SCRUM.\n\n \nKnowledge of modern DevOps practices.\n\n \nYou’ll fit right in if you thrive in a collaborative environment, enjoy learning new technologies, and value teamwork and communication. We welcome a proactive mindset and a drive to continuously improve yourself and the products you work on.\nApply today and join us at Billiant in shaping the future of telecom solutions! \n\nJoin us at Billiant?\nAt Billiant, we have been working with BSS solutions and developing our own BSS platform since early 2000—for more than twenty years! Today, the product is an extensive and advanced framework for creating solutions for telecom operators in several countries throughout Europe. We are constantly developing new and enhanced features based on our customers’ needs and market trends, where quick time to market and flexibility are our guiding principles. Today, Billiant is part of the Telavox group, which is fast-growing and profitable. The group has +1.9b in revenue, +500 Telavoxers in nine countries, and +160 people working in Product and Engineering. We pride ourselves on creating an inclusive, supportive culture where everyone can thrive. By joining us, you will not only contribute to our technology but also be part of a company that values work-life balance, continuous learning, and community. Plus, you will enjoy our legendary company events, personal development opportunities, and much more \n How to apply! At Telavox, we don't focus on fitting in; we focus on making room for everyone. We’re always on the lookout for great talent, so applications are reviewed continuously. If you're ready to be part of an innovative, AI-driven telecom company, apply today with your CV and cover letter in English.  \nFor any questions, feel free to reach out to Talent Acquisition Partner Ami Faraguna at ann-marie.faraguna@telavox.com  \nLearn more about what we do!",
        "url": "https://career.telavox.com/jobs/5878141-software-engineer-billiant?promotion=1451303-arbetsformedlingen",
        "published": "2025-04-30T12:13:55",
        "deadline": "2025-10-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661571",
        "title": "Verification Engineer HIL - Göteborg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Är du en metodisk och nyfiken ingenjör med passion för problemlösning och HIL-verifiering? Nu har du chansen att bli en del av ett högteknologiskt team hos vår kund inom fordonsindustrin, där du får arbeta i framkant med framtidens styrsystem och testmiljöer.\nOm uppdraget: I rollen som Verification Engineer HIL kommer du att arbeta med utveckling och underhåll av HIL-simuleringsmiljöer, skriva testspecifikationer, skapa testfall samt genomföra och analysera tester. Du kommer att samarbeta tätt med funktionsutvecklare och bli en nyckelperson i att säkerställa kvaliteten i fordonets dynamiksystem.\nKravprofil:\n- Civilingenjörsexamen inom elektronik, mekatronik, mekanik eller fysik - Erfarenhet av modellbaserad utveckling och verifiering - Grundläggande kunskap om HIL-hårdvara - God kännedom om dSPACE-verktyg: ControlDesk, AutomationDesk, MotionDesk/Aurelion och ASM - Erfarenhet av CI/CD-processer, gärna med Jenkins - Kunskaper i Python och Matlab/Simulink \nMeriterande:\n- Erfarenhet av att sätta upp CI/CD-flöden i Jenkins - Fordonsdynamikkompetens - Erfarenhet av simulering av mekatroniska/pneumatiska system",
        "url": "https://careers.progalaxy.se/jobs/5858126-verification-engineer-hil-goteborg?promotion=1447500-arbetsformedlingen",
        "published": "2025-04-28T13:20:15",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603174",
        "title": "Control Systems Engineer / Vehicle Motion Control Engineer",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are expanding our team of skilled control engineers to strengthen our current services within Vehicle Motion Control in Gothenburg. We are looking for you who want to be part of this journey!\nWho are we? Combine Control Systems is a leading supplier of high-quality engineering services within Data Science and AI, Software development, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking for a technical expert within the domain of Vehicle Motion Control to our Gothenburg office to take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Gothenburg, Lund, and Linköping, with our headquarter being in Gothenburg.\nWhat can we offer? Exciting assignments within various industries, ranging from the automotive industry to the railway industry. The flexibility of taking on the most exciting assignments without being locked to a single product. The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about control systems, Data Science, and AI. The flexibility and friendly atmosphere of a smaller company. Our employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks, and projects and expand their knowledge in a supportive and helpful way.\nWhich skills do you need to join the team? We are looking for someone with extensive and hands-on experience within the field of vehicle motion control for automotive applications. We believe you have experience from model based design and are a true believer that virtual verification is the way to go. We believe that you appreciate working within, or leading project teams. You like having fun and respect and trust your team as much as your knowledge. For us, personality speaks loudest and we are strong believers that knowledge can be taught.\nQualifications\n Master’s degree or PhD in relevant field.\n Extensive experience from the field of Vehicle Motion Control\n Experience from several of the following: Stability Control, Vehicle State Estimation, Longitudinal Control, Lateral Control\n MPC, EKF, UKF, Kalman Filter\n Matlab/Simulink, Dymola, Modelon Impact, FMU, Co-simulation\n  \n Strong communication and teamwork abilities.\n \nWho are you? We believe that you are positive and social. For you, the work-life balance is important and you like to share your hobbies and interests which you are passionate about with others. You believe in never stop learning and love the challenge that comes with it.\nIf you want to join our team, do not hesitate to apply!",
        "url": "https://combine.teamtailor.com/jobs/4741171-control-systems-engineer-vehicle-motion-control-engineer?promotion=1413957-arbetsformedlingen",
        "published": "2025-04-04T09:08:15",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603157",
        "title": "Data Engineer / Machine Learning / AI / Cloud",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "About Combine At Combine Control Systems, we are passionate about technology and innovation. We specialize in creating innovative technology that empowers industries and shapes the world around us. Our pursuit of staying at the forefront of the rapidly changing tech world drives us to develop and work with the latest tools and techniques in areas such as Data Science, AI, embedded systems, and control engineering. We offer exciting and diverse challenges at the cutting edge of technology and create an inspiring work environment where our employees thrive and have the opportunity to grow and develop. Together, we form a team of dedicated and skilled engineers and experts who are passionate about technology and innovation. As we continue to expand our horizons, we are seeking a passionate and talented Data Science Engineer to join our dynamic team in Gothenburg. \nWhat can we offer you? Joining our team means becoming part of a community that values openness, creativity, and trust. We embrace teamwork and welcome your contribution. At Combine, we encourage personal development, provide opportunities to explore new domains, and offer an inspiring and inclusive workplace.\nTechnically challenging projects - You will be part of exciting and technically challenging projects. You will work with the latest technologies and tools in Data Science and AI/Machine Learning. We give you the opportunity to challenge yourself and grow in specialized areas.\nInspiring work environment - Here, you will be surrounded by like-minded and enthusiastic colleagues. We promote collaboration and knowledge sharing to create a dynamic and rewarding work environment.\nProfessional development - We invest in our employees and provide opportunities for skills development and further education to help you grow in your career.\nYour role As a Data Engineer at Combine, you are a crucial part of our team. You will work with clients from various industries and sectors, where data is at the core of every project. Your role involves adapting existing tools/packages to create automated pipelines in the cloud, following industry best practices. You will analyze data to address stakeholders' questions, monitor data, and create/update reports or dashboards. Additionally, you will collaborate closely with stakeholders and support cross-functional teams.\nQualifications\n  Master's degree in areas related to computer science, information technology, or equivalent. \n Proficiency in Python and/or Scala. Experience with SQL and NoSQL databases.\n Experience with Git, CI/CD, and Data/DevOps. \n At least two years of experience working with large datasets using cloud technologies such as AWS, GCP, or Azure. \n Very good skills within the English language, both spoken and written.  Preferred Qualifications \n Experience with Databricks, Spark, Snowflake, etc., is advantageous. \n \nWho are you? We are looking for a versatile and talented individual who enjoys collaboration, embraces challenges, and appreciates a holistic approach to problem-solving. If you enjoy exploring new areas, value teamwork and can communicate technical knowledge to colleagues and stakeholders at different domains and technical levels, you are the right person for our team. \nWe look forward to receiving your application!",
        "url": "https://combine.teamtailor.com/jobs/4961523-data-engineer-machine-learning-ai-cloud?promotion=1413941-arbetsformedlingen",
        "published": "2025-04-04T09:03:45",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29573819",
        "title": "Systemutvecklare",
        "employer": "Sylog Väst AB",
        "location": "Göteborg",
        "description": "Systemutvecklare/DevOps Ingenjör med mer än 6 års erfarenhet inom nedan område: \n Java, .NET/C#, Spring, Golang, TypeScript, React, SQL, Oracle, CI/CD tools, Kubernetes, Docker, AWS, Azure",
        "url": null,
        "published": "2025-03-25T13:48:05",
        "deadline": "2025-09-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29701269",
        "title": "Lead Developer Dynamics 365 Customer Engagement",
        "employer": "Fellowmind Sweden AB",
        "location": "Malmö",
        "description": "Forma framtidens kundupplevelser tillsammans med oss på Fellowmind \nHär är chansen för dig som är redo att ta nästa kliv i din karriär som utvecklare – och samtidigt vara med och sätta din prägel på den tekniska standarden för hur framtidens digitala kundlösningar ser ut! Hos oss på Fellowmind får du en ledande roll i ett sammanhang där teknik och mänsklighet går hand i hand. Vi söker nu en Lead Developer inom Dynamics 365 CE som brinner för kvalitet, innovation och att inspirera andra! \nDin roll hos oss \nSom Lead Developer är du mer än en teknisk specialist – du är en vägvisare! Du är med och formar riktningen för hur vi bygger, utvecklar och levererar våra lösningar inom Dynamics 365 CE. En del av ditt uppdrag blir att säkerställa vår tekniska kompetens och var ett nav för kunskapsdelning, kvalitetssäkring och inspiration för våra utvecklare. \nDu kommer bland annat att: \n Jobba i teknikens framkant – särskilt inom Power Platform och Dynamics 365 CE. \n  Leda interna utvecklarforum – en kreativ samlingsplats för inspiration, idéutbyte och kompetenshöjning. \n  Granska kodbaser och leveranser för att säkra kvalitet, hållbarhet och skalbarhet. \n  Coacha kollegor genom code reviews, teknisk vägledning och mentorskap. \n  Samverka med arkitekter och andra experter i tvärfunktionella projekt – ibland leder du själv, ibland bidrar du i teamet.\n \nTekniken vi älskar att jobba med \nHos oss är tekniken ett medel för att skapa verkligt värde. Vi jobbar bland annat med: \n Power Platform (Power Automate, Power Apps) \n  JavaScript/TypeScript \n  C#.NET (t.ex. plugins, Custom APIs) \n  Power Apps Component Framework \n  React \n  Azure DevOps och CI/CD-pipelines\n Vi tror att du  Har gedigen erfarenhet av utveckling inom Dynamics 365 CE och Microsofts molnbaserade ekosystem - troligen 5 år eller mer. \n  Brinner för struktur, arkitektur och kod av hög kvalitet. \n  Är nyfiken och pedagogisk – du trivs med att både lära och lära ut. \n  Vill kombinera teknik med ansvar och samarbete – du gillar att se helheten.\n Vad vi erbjuder \nSom en ledande europeisk Microsoftpartner är Fellowmind en arbetsplats där tekniken får ett mänskligt ansikte. Vi tror på att digital transformation börjar med relationer – och att de bästa lösningarna föds i samarbetet mellan människor. Här får du en roll med verklig påverkan, i en kultur som präglas av: \n Always personal – Vi bygger relationer på äkta engagemang. \n  Better together – Vi tror på kraften i samarbete. \n  Act with courage – Vi vågar tänka nytt och utmana gamla sanningar. \n  Serious about fun – Vi kombinerar hög leveranskvalitet med en arbetsmiljö där du trivs, växer och skrattar.\n \nLägg därtill att vi i höstas blev utsedda till Sveriges Bästa Arbetsgivare vilket vi ser som ett kvitto på att vi gör mycket rätt – och vi kommer alltid att fortsätta arbeta för att vara en plats där alla ska må bra och känna sig hemma. \nDet praktiska  Omfattning: Heltid \n  Placering: Något av våra centrala kontor i Malmö, Göteborg, Stockholm, Jönköping eller Halmstad \n  Start: Snarast – men vi anpassar oss efter din kalender\n \nRedo att leda vägen för tekniken – och samtidigt göra skillnad för både kunder och kollegor? -Sök redan idag!",
        "url": "https://career.fellowmind.se/jobs/5927477-lead-developer-dynamics-365-customer-engagement?promotion=1468872-arbetsformedlingen",
        "published": "2025-05-14T09:30:15",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29803815",
        "title": "Vi söker nu utvecklare - för nästa generations testsystem!",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Drivs du av att se dina idéer bli verklighet? Välkommen till vår spännande och teknikintensiva värld. \n\nVi söker nu seniora utvecklare till våra tvärfunktionella agila testutvecklingsteam. Vi utvecklar testsystem och testlösningar för nya generationens radarsystem.\n\nDin roll\n\nDu kommer ingå i ett team inom Test Development på SAAB Surveillance, med både seniora och juniora testutvecklare. Våra team ansvarar för att utveckla en helhetslösning baserat på vårt testplattformskoncept, där du deltar i samtliga utvecklingsfaser från koncept till levererat testsystem. Vi är också involverade i den långsiktiga strategin för testsystemutvecklingen inom hela SAAB Surveillance.\n\nTestobjekten är komplexa produkter, allt från kretskort och kassetter upp till delsystem och system, DC-50 GHz. Arbetsuppgifterna innefattar:\n\n * Systemdesign\n * Elektronikutveckling\n * Programvaruutveckling\n * Verifiering av egenutvecklade testutrustningar\n\n \n\nDin profil\n\nFör att lyckas, och trivas, i denna roll ser vi att du har teknisk högskoleutbildning, ett genuint intresse för teknik och kompetens inom något eller några av följande områden:\n\n * Mätteknik\n * Mikrovågsteknik\n * Elektronik\n * Digitalteknik\n\n \n\nVi tror också att du gillar att jobba i tvärfunktionella team och att bidra till både teamets och verksamhetens utveckling och mål. Som person är du engagerad, kreativ och vill utvecklas både personligt och professionellt och prova olika teknikområden. Du är mån om att komma framåt och att kunna hitta effektiva lösningar.\n\nHar du dessutom stor erfarenhet av att jobba med LabVIEW är detta meriterande då våra testlösningar är realiserade med detta utvecklingsverktyg.\n\nTjänsteresor kan förekomma.\n\n \n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\nVad du blir en del av\n\nBakom våra innovationer finns alla de som har gjort det möjligt. Modiga pionjärer och kluriga tänkare. Vardagshjältar och kreativa problemlösare. De som delar djup kunskap och de som utforskar nya områden. Och alla däremellan.\n\nHär har du chansen att påverka och bidra på ditt unika sätt. Allt från att utveckla kod och bygga imponerande försvars- och säkerhetslösningar till att ta en kaffe med en kollega. Varje bidrag räknas. Vi ger dig möjlighet att anta utmaningar och skapa smarta innovationer. I vår vänliga och tekniksmarta värld finns plats för dig att växa. Vi finns här för att tillsammans skapa trygghet för människor och samhällen.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 25 500 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här \n\n \n\nOm du är intresserad av vilka förmåner som du kan ta del av som anställd på Saab i Sverige, kan du läsa om dem här\n\n \n\nVåra värderingar kan du läsa om här\n \n\nVill du lära känna vår verksamhet och personal lite bättre? Här kan du hitta berättelser från några av våra anställda.\n\n \n\nVänligen observera att vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdatum har gått ut.",
        "url": "https://www.aplitrak.com/?adid=cy5qdW5nZXZpLjQ2MDU2LjMxMDFAc2FhYi5hcGxpdHJhay5jb20",
        "published": "2025-07-01T11:10:37",
        "deadline": "2025-07-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29796251",
        "title": "Software and System Developer",
        "employer": "ArinaSoft AB",
        "location": "Göteborg",
        "description": "About ArinaSoft AB\n ArinaSoft AB is a forward-thinking technology company at the forefront of automotive innovation. We specialize in delivering high-performance software systems, embedded solutions, and AI-powered safety technologies to leading automotive OEMs and Tier-1 suppliers. Through our commitment to quality, safety, and technological advancement, we are driving the future of mobility toward smarter, safer, and more sustainable roads.\nAt ArinaSoft, we foster a collaborative and knowledge-sharing environment where curiosity is encouraged, expertise is valued, and impact is real.\nPosition Summary\n We are seeking a skilled and driven Software and System Developer with 3–5 years of hands-on experience in embedded software engineering. This role offers an exciting opportunity to work on next-generation vehicle systems, from control algorithms and model-based design to system-level integration and validation. You’ll be part of a dynamic, cross-functional team delivering high-quality solutions that shape the automotive technologies of tomorrow.\nResponsibilities\nDevelop and optimize embedded automotive software.\nDesign and implement control logic using MATLAB/Simulink, including Model-in-the-Loop (MIL) and Software-in-the-Loop (SIL) testing.\n\n\nBuild and maintain unit tests with GTest or similar frameworks.\n\n\nContribute to CI/CD pipelines using tools such as Jenkins, Docker, Gerrit, and Zuul.\n\n\nConduct Hardware-in-the-Loop (HIL) testing and support real-vehicle validation.\n\n\nEnsure adherence to functional safety and software standards including ISO 26262, and ASPICE.\n\n\nCollaborate with multidisciplinary teams including hardware, system, and validation engineers.\n\n\nMaintain clear and comprehensive technical documentation.\n\n\nMentor junior team members and contribute to continuous improvement efforts.\n\nRequired Qualifications\n3–5 years of experience in embedded or automotive software development.\n\n\nPractical knowledge of MATLAB/Simulink and model-based system design.\n\n\nFamiliarity with unit testing, CI/CD methodologies, and version control (e.g., Git/Gerrit).\n\n\nUnderstanding of automotive software safety standards and quality processes.\n\n\nExcellent problem-solving, communication, and teamwork abilities.\n\n\nFluency in English (written and spoken).\n\nPreferred Qualifications\nExposure to ADAS, AI/ML, or vision-based systems.\n\n\nExperience with automotive communication protocols (CAN/CANopen).\n\n\nBackground in Agile/Scrum development methodologies.\n\n\nDegree in Computer Science, Electrical/Software Engineering, or a related field.\n\n\n\nWhat We Offer\n At ArinaSoft, we believe great talent deserves great support. We provide:\nComprehensive private health insurance\n\n\nGenerous parental leave policies\n\n\nOngoing professional development through in-house and external training programs\n\n\nPaid sick leave and 25 vacation days plus public holidays\n\n\nFlexible working hours and a focus on work-life balance\n\n\nA pension scheme and employee referral program\n\n\nA vibrant, innovation-driven work culture with real impact on safety and sustainability\n\nHow to Apply\n If you're ready to build the future of mobility and are passionate about cutting-edge technology and real-world impact, we’d love to hear from you.\nArinaSoft – Engineering Innovation for Safer Roads.\nNote to Applicants\n Thank you for your interest in joining ArinaSoft. Every application will be carefully reviewed against the role’s requirements. Please note that only shortlisted candidates will be contacted. If you do not hear from us within 10 working days, we kindly inform you that your profile was not selected at this time. However, your information will be retained for future relevant opportunities.",
        "url": null,
        "published": "2025-06-26T23:36:15",
        "deadline": "2025-07-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29796249",
        "title": "Software and System Developer",
        "employer": "Autonomous Vision AB",
        "location": "Göteborg",
        "description": "Autonomous Vision is a leading technology company specializing in innovative software solutions for the automotive industry. We collaborate closely with top automotive manufacturers and suppliers to deliver cutting-edge embedded systems, control algorithms, and AI-driven safety applications. With a strong focus on quality, innovation, and sustainable development, Autonomous Vision is driving the future of automotive technology. Join us and be part of a team committed to excellence and making roads safer worldwide.\nPosition Overview:\nWe are looking for a talented and motivated Software and System Developer with 3 to 5 years of experience to join our Göteborg office. You will work on embedded automotive software development, including C/C++ programming, system design, and validation in model-based environments. Your role will involve close collaboration with cross-functional teams and participation throughout the software development lifecycle.\nKey Responsibilities\nDevelop and maintain embedded automotive software using C++ and Python.\nDesign control algorithms with MATLAB/Simulink; validate using MIL/SIL.\nCreate unit tests (Gtest) and ensure CI/CD integration (Jenkins, Docker, Zuul).\nWork in Linux-based environments; manage code via Git/Gerrit.\nConduct HIL and real vehicle testing.\nEnsure compliance with ISO 26262, MISRA C++, and ASPICE.\nCollaborate across teams and maintain technical documentation.\nShare knowledge and support junior developers.\n\nRequired Qualifications\n3–5 years of experience in embedded/automotive software development.\nStrong skills in C++, Python, and Linux environments.\nExperience with MATLAB/Simulink and model-based design.\nFamiliar with CI/CD workflows and testing frameworks (e.g., Gtest).\nKnowledge of ISO 26262, MISRA C++, and ASPICE standards.\nProficient in English; strong analytical and teamwork skills.\n\nPreferred Qualifications\nExperience with ADAS, AI/ML, or Android/Yocto development.\nKnowledge of CAN/CANopen protocols.\nBackground in Agile/Scrum environments.\nBachelor’s or Master’s degree in a relevant technical field.\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\n\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nAutonomous Vision: Shaping the Future of Safer Mobility.\nWe sincerely thank all applicants for their interest in joining Autonomous Vision. Every application will be carefully reviewed based on the role’s criteria. Please note that only candidates selected for further consideration will be contacted. If you do not hear from us within 10 business days of your application, it means you have not been selected at this time. However, we will keep your profile on file for any suitable future opportunities.\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://www.autonomousvision.se",
        "published": "2025-06-26T23:11:10",
        "deadline": "2025-07-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29793204",
        "title": "ADAS Function Developer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \nWhat you will do\nAs a member of the Driver Support Function group, your main tasks will be:\nAlgorithm development for decision and control, path planning, situation assessment and more.\nTrouble shooting and integration.\nWriting use cases, requirements and test cases on different levels as well as defining KPIs and participating in developing data-driven evaluation methods.\n\n \nYour future team\nWe have the responsibility to develop and maintain Advanced Driver Assistance Systems (ADAS) for the full life cycle for commercial trucks.\n \nExamples of features being developed by our team are Driver Alert Support (driver monitoring, distraction warnings), Pilot Assist, as well as other Lane Keeping features (such as Lane Keeping Assist, Emergency Steering).\nWho are you?\nWe don’t know you yet, but we believe that you are a structured and analytical person with a ‘can-do’ attitude. You are solution-oriented and thrive in a collaborative environment, where you can build strong relationships and work cross-functionally. Your clear communication and ability to create trust make you an appreciated team player. You enjoy exchanging ideas, discussing solutions, and sharing knowledge with colleagues to drive progress. With curiosity and adaptability, you embrace change with a positive mindset and always strive for continuous improvement.\n \nAs for educational background, you have a master’s degree in engineering physics, automation, signal processing, electronics, mechatronics, computer science or similar. You have several years of experience as an Automotive Function Developer, preferably within ADAS.\n \nAdditionally, you have experience and interest in several of the following areas:\nEmbedded systems and software development in C++, MATLAB and Simulink.\nSoftware Architecture and system design.\nSystems modeling and simulation.\nSensor Data Fusion.\nControl systems, algorithms, signal processing and filter design.\nVehicle dynamics and control.\nFunctional safety and ISO 26262.\nAgile development.\n\n\n\nReady for the next move?\nLocation: Gothenburg, Sweden.\n Positions: Two (2).\nLast application date: July 6th 2025.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=19529&company=volvoinfor&st=C153AE32EDADE5F11070288A4995D3441336BAC9",
        "published": "2025-06-25T17:45:05",
        "deadline": "2025-07-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29785855",
        "title": "Senior Software Developer - Efficient Driving",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\nShaping tomorrow’s technology\n\nAt Vehicle Technology, we are passionate about shaping tomorrow’s technology to create excellent sustainable transport and infrastructure solutions to make the world a better place for future generations. We provide innovative, safe, and driver-friendly solutions, we develop top-quality services, and we make our customer operations more efficient by using excellent data insights. We support the Volvo Group engineering community with innovative tools and methods.\n\nThe Efficient Driving team develops on-board software solutions that optimize driving efficiency combined with safety and driver assistance resulting in an optimized and seamless customer experience.\n\n\nWhat you will do\n\nAs a Software Developer, you will play a crucial role in designing and developing software solutions that improve vehicle performance, functionality, and overall system efficiency. You will define features based on legislative requirements and end-user needs. Your expertise in energy-efficiency software will be crucial for optimizing truck behavior and energy consumption. This position offers significant exposure to system design and implementation.\n\nAdditionally, you will:\n•    Design, develop and maintain software applications using C++.\n•    Utilize Adaptive Autosar frameworks to enhance software functionality.\n•    Collaborate with cross-functional teams to design, implement, and test software solutions.\n•    Work with Linux OS to develop and deploy applications.\n•    Troubleshoot and debug software issues to ensure optimal performance.\n•    Participate in code reviews and provide constructive feedback to peers.\n•    Verification at all levels to ensure software quality through code reviews, unit testing, HIL, SIL, and debugging.\n•    Stay updated with the latest industry trends and technologies to continuously improve skills and knowledge.\n\nWho are you?\n\nWe believe that the right mindset is key to making a difference in our organization. You excel in communication, effectively leading discussions and managing stakeholder relationships with confidence. Your proactive approach drives initiatives forward, ensuring you are not just a participant but a key contributor in cross-functional forums. With a strong passion for technology, you embrace change, ambiguity, and complexity with curiosity. Your ability to understand and operate within the software architecture of the truck will be essential in delivering high-quality solutions and deploying new features into production.\n\nIn addition, you have:\n•    Master's degree in Computer Science, Engineering, or a related field.\n•    5+ years of experience in C++ and C\n•    Advanced level proficiency in Adaptive Autosar.\n•    Experience with Linux OS.\n•    Knowledge of both Adaptive Autosar and classic Autosar is a must.\n•    Strong problem-solving skills and attention to detail.\n•    Excellent communication skills and the ability to work effectively in a team environment.\n•    Eagerness to learn and adapt to new technologies and methodologies.\n\nIt is considered a merit if you have knowledge of Advanced Driver Assistance Systems (ADAS), functional safety standards, particularly ISO 26262, and Failure Mode and Effects Analysis (FMEA). Familiarity with cybersecurity principles and practices is a plus.\n\n\nDue to summer vacations, all applications will be reviewed from week 33 forward. Please do not expect any communication earlier than this.\n\n\nWho we are and what we believe in\nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination.\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43467022",
        "published": "2025-06-23T13:25:09",
        "deadline": "2025-07-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772154",
        "title": "Software Developer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Software Developer to strengthen our team in Gothenburg.\nTHE ROLE\nThe Software Developer Engineer will design, develop, and test control algorithms for Exterior Lighting and Visibility Module Functionalities. The role involves model-based development (MBD) using MATLAB/Simulink, embedded code generation, and alignment with ISO 26262 standards.\nAREA OF RESPONSIBILITY:\n1. Control Algorithm Development\nDesign and develop control algorithms for exterior lighting systems and body control Modules\nUtilize MATLAB/Simulink/Stateflow for model-based development and simulation of control logic.\nPerform model-in-the-loop (MIL), and software-in-the-loop (SIL) to validate control strategies.\nCollaborate with cross-functional teams including hardware, software, systems, and validation engineers to ensure seamless integration.\nGenerate and maintain documentation including control design specifications, test plans, and validation reports.\nEnsure compliance with ISO 26262 functional safety standards and other relevant automotive regulations.\nParticipate in design reviews and issue resolution processes.\n\n2. Model Quality & Optimization\nConduct model reviews and refactoring to optimize execution time, memory usage, and multicore adaptability.\nEnsure compliance with MAAB, MISRA, and internal modeling standards.\nPerform back-to-back testing for model-code consistency.\n\n3. Documentation & Compliance\nMaintain traceability between requirements, models, and test cases.\nCreate and manage interface specifications, model architecture documents, and test artifacts.\nEnsure software development aligns with ISO 26262 and ASPICE compliance frameworks.\n\nEXPERIENCE / KNOWLEGDE:\nExtensive experience in automotive embedded software development.\nExpertise in model-based control design, auto-coded production software, and system-level verification.\nDeep understanding of control theory and automotive control domains (e.g.,Body control module, Exterior Lighting & Visibility SW, etc.).\nProven ability in MIL, and SIL testing\nStrong grasp of model compliance, verification strategies, and software quality management.\n\nDesirable:\nExperience with adaptive lighting systems, sensor fusion, or vision-based control.\nFamiliarity with CI/CD workflows in model-based environments.\nExposure to Vector DaVinci, Jenkins, Git/Gerrit, JIRA, Polarion, or similar tools.\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-06-16T10:52:28",
        "deadline": "2025-07-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760383",
        "title": "AI Developer Internship",
        "employer": "X Mobility & Logistics Group AB",
        "location": "Göteborg",
        "description": "AI Developer Internship\nEmpower Your Future in AI Technology \nAre you passionate about artificial intelligence and eager to develop cutting-edge skills that will shape the future of technology? Do you dream of building AI solutions that drive innovation and enhance user experiences? If so, we have the perfect opportunity for you! \nAbout the Internship \nOur AI Developer Internship is designed for ambitious individuals who want to explore the exciting world of AI development and gain hands-on experience. This program offers the chance to work on challenging projects, develop advanced AI solutions, and collaborate with industry experts. \nWhat You'll Learn \n Gaining expertise in designing and using code/no-code platforms for scalable AI applications. \n  Creating and optimizing AI-powered SaaS platforms that redefine the way businesses operate. \n  Developing and integrating AI Agents for dynamic and adaptive systems. \n \n\nWhy Join Us? \n Hands-on experience with state-of-the-art AI tools and technologies. \n  Guidance and mentorship from seasoned AI professionals. \n  Opportunity to work on real-world projects that make an impact. \n  A collaborative and innovative environment that nurtures creativity. \n \nWho We're Looking For \nWe welcome interns who: \n Have a strong interest in artificial intelligence and technology. \n  Possess a reasonable level of knowledge and skills in one or more programming languages: TypeScript, Python, JavaScript, etc and a willingness to explore no-code platforms. You don’t need to have expert programming skills, but we expect you to be comfortable writing and understanding code. \n  Some knowledge and skills using one or more frameworks such as React, Tailwind CSS, Supabase, Node.js, etc and database management systems such as PostgreSQL. \n  Possess knowledge and skills using Git, GitHub, etc \n  Are eager to learn and solve complex problems. \n  Are ready to contribute ideas and collaborate with a dynamic team. \n \nHow to Apply \nSend your resume and a cover letter explaining why you're excited about AI development and why you are an ideal candidate for the role. \nIt is recommended to include any personal tech projects you have previously worked on or hackathons you have participated in. \nApplications are open until 31 July 2025. Don't miss this chance to kickstart your journey in AI technology!\nJoin us, and let's shape the future of AI together! Please note: This is an unpaid, full-time, 6-month onsite internship starting August 18 at our offices in Lindholmen, Gothenburg.",
        "url": "https://careers.ultradefy.com/jobs/6031419-ai-developer-internship?promotion=1506709-arbetsformedlingen",
        "published": "2025-06-10T12:23:00",
        "deadline": "2025-07-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29759256",
        "title": "Software Developer  with C++ experience",
        "employer": "Göteborg int8 Technology AB",
        "location": "Göteborg",
        "description": "Location: Göteborg\nEmployment Type: Full-time \nDepartment: Embedded Software Development\nJob Summary:\nWe are seeking a skilled and motivated Software Developer with strong experience in C++ to join our development team. The ideal candidate will have experience working in a Linux environment, using Gtest for unit testing, and managing code with Git. \nThe role also requires hands-on experience testing software on Hardware-in-the-Loop (HIL) systems and actual vehicles, making it essential to have both software development expertise and a solid understanding of embedded systems and testing frameworks.\nKey Responsibilities:\nDesign, develop, and maintain high-quality C++ software for embedded systems.\nWrite and maintain unit tests using Gtest to ensure software reliability and correctness.\nWork in a Linux-based development environment.\nUse Git for version control and collaboration.\nConduct and support software testing on HIL setups and real vehicles to validate domain-specific functionalities.\nCollaborate with cross-functional teams including hardware engineers, test engineers, and system architects.\nParticipate in code reviews and contribute to continuous improvement of software development practices.\nRequirements:\nStrong   Experience in C++ development.\nExperience working in a Linux environment.\nSolid understanding of unit testing using Gtest.\nProficiency with git for source control and workflow management.\nHands-on experience with Hardware-in-the-Loop (HIL) systems and in-vehicle software testing.\nFamiliarity with embedded systems, control systems, or automotive domains is a plus.\nStrong problem-solving skills and the ability to work independently and in a team environment.\nPreferred Qualifications:\nBachelor’s or Master’s degree in Computer Science, Electrical Engineering, or a related field.\nExperience in automotive or aerospace domains.\n\n\nFamiliarity with software development lifecycle (Agile/Scrum).",
        "url": null,
        "published": "2025-06-09T22:18:48",
        "deadline": "2025-07-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709548",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nWithin AFRY, we develop and deliver solutions for vehicles, systems, functions and attributes to customers in the automotive industry. Our customers are both established OEM's, startup companies and system suppliers (Tier 1). \nWe are now looking for experienced software developers who is passionate in developing the next generation infotainment system based on Google's Android automotive OS.\nAs an Android Automotive Software Developer, you will be doing Software development in application and native layers of Android stack for the infotainment system. You will collaborate with UX, Designers and other stakeholders to define a coherent end-to-end solution. You will be part of a team that has end-to-end responsibility including design, architecture, documentation, development, verification and validation. As part of organization you will have the opportunity to actively contribute for generating innovative ideas and solutions.\n\n\nQualifications\nM.Sc in Software Engineering or equivalent experience through years of practice\nExperience of Android app and Android platform development along with experience in AOSP and the AOSP build system.\nFamiliar with modern app architectural patterns (MVP, MVVM, layered architecture, refactoring)\nExperience in Automotive communication buses\nGood knowledge in Android Java, C++, Python\nGood knowledge of Android testing frameworks (Junit, Espresso, Mockito)\nVery good knowledge of English (written and spoken) \n\nMeritorious if you have:   \nExperience of Embedded Linux Development\nExperience of working with CI (Continuous Integration)\nSwedish driving license (B) \n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 6/7.\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059723644-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:32:23",
        "deadline": "2025-07-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709359",
        "title": "Function developer C++ within ADAS/AD",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society. \n\n\nJob Description\nWe want to strengthen our team with more skilled SW developers that wants to be part of the development of the future vehicles in Gothenburg.\nAs function developer within ADAS (Advanced Driver Assistance Systems) and AD (Autonomous Drive) you will get the possibility to work in one of the most growing areas within automotive. The work is varying and can include defining functions, create system design for complex functionality, write requirements for a software and/or test and verify the software modules\nWith us you get to be a part of the AFRY family with lots of competence within different areas. There is always something new to learn, independently which level you are at. We believe in the importance of not getting stuck in the same assignment, but instead to keep eyes on the next milestone whether it is a new assignment or being part of the next competence development project.\n\n\nQualifications\nBachelor’s or master’s degree in computer science or computer engineering or equivalent.\n5 years of experience from C++ development in embedded systems\n2 years of experience from C++ development of ADAS/AD functions or motion control\nKnowledge in GIT, Gerrit, Jenkins, Python, CI/CD\nExperience from ADAS/AD\nEuropean driving license (category B)\nFluent in English\n\n\n\nAdditional Information\nWelcome with your application! Please note that we don't accept applications via email. \n\n\n\nFor any questions about the position, please contact:\n\nJenny Ljungqvist - Section Manager \n\njenny.ljungqvist@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059994085-function-developer-c-within-adas-ad?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:07:23",
        "deadline": "2025-07-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29652382",
        "title": "Experienced Machine Learning Developer for International Company!",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Do you have a passion for machine learning and a few years of professional experience in the field? Are you looking for an exciting opportunity to work with innovative technologies in an international environment? Then the role of Experienced Machine Learning Developer could be exactly what you are looking for!\n\nJOB DESCRIPTION\n\nAs a Machine Learning Developer at our client company, you will join a team within software development while collaborating closely across functions, including with teams focused on testing, integration, and software development. Your primary responsibility will be to develop and optimize machine learning and AI solutions, with a particular focus on neural networks. This includes methodology development, data collection and training, and performance optimization, for example, designing efficient neural networks suitable for devices with limited computational resources. This is a highly technical and hands-on role, where you will work closely with a colleague in the same position.\n\nThe role involves programming mainly in Python, with solutions also being converted to C for deployment on embedded systems. Beyond technical development, you will also participate in data acquisition, testing, and the full development lifecycle. Additionally, the role includes client interaction, where you will present and demonstrate solutions.\n\nIDEAL CANDIDATE:\nMaster’s degree in Engineering Physics, Software Engineering, or a related field.\nHave a minimum of five years of professional experience in machine learning, AI, neural networks, or similar areas.\nPossess strong programming skills in both Python and C++.\nAre proficient in both Swedish and English, as both languages are used in daily internal and external communication\n\n\nIt is a plus if you also have:\n\nPrevious experience in the automotive industry\n\n\nIn order to be a good fit , we think you have a professional approach towards customers and good communication skills. You are a fast learner, eager to learn and develop within the company. You are also flexible and focused on customer satisfaction. Though you work in a team with others you are a good team player with a positive and outgoing mindset and aim to help the team solve their tasks.\n\nEMPLOYMENT\n\nThe position is a direct recruitment, which means that the recruitment process takes place through Friday and you will be employed by the client.\n\nADDITIONAL INFORMATION\nEmployment type: Full time.\nStart date: September/October 2025.\nLocation: Gothenburg.\nSalary: Fixed monthly.\n\n\nApply by clicking the link below. Remember to be quick with your application as apply continuous selection of candidates and the position may be filled before the application deadline is due.\n\nABOUT FRIDAY\n\nBy being a partner to our clients and candidates, we strive to find the best match for both parties. We achieve this by really getting to know our clients and candidate’s needs! Of course, we will ensure that requirements and skillsets match. But above all, we focus on the importance to find harmony between values and corporate culture which both candidate and client considers optimal.\n\nOur passion is to help people to the right position, workplace and context within the IT and Technology field. That's also the reason to why we founded Friday, with the aim to help you find the job that gives you that Friday feeling – every day!\n\nWe mainly focus on young engineers who either are at the beginning of their career or soon graduating from university within the IT/Tech field.\n\nOur belief is that people reach their fullest potential when looking forward to going to work each morning. \"Friday - everyday\", how about that?",
        "url": "https://pnty-apply.ponty-system.se/friday?id=3249&pnty_src=arbetsformedlingen",
        "published": "2025-04-24T09:02:26",
        "deadline": "2025-07-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29793570",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Det tar en minut att ansöka och vi tar kontakt med dig inom två... eller så snart vi kan!\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 24 juli.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1528938-arbetsformedlingen",
        "published": "2025-06-26T08:28:58",
        "deadline": "2025-07-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29798949",
        "title": "Product Mastery",
        "employer": "Volvo Personvagnar Aktiebolag",
        "location": "Göteborg",
        "description": "Who are we?\nVolvo Cars is a company on a mission; to bring traditional car manufacturing into a connected, sustainable and smart future.\nSince 1927, we have been a brand known for our commitment to safety, creating innovative cars that make life less complicated for our consumers. In 2010, we decided to transform our business, resulting in a totally new generation of cars and technologies, as well as steady growth and record sales. Today, we’re expanding our global footprint in Europe, China and the US, and we’re on the lookout for new talent. \nWe are constantly pushing our own skills and abilities to drive change in the automobile industry like never before. We are looking for innovative, committed people to join us in this endeavour and create safe, sustainable and connected cars. We believe in the power of people and will challenge and support you to reach your full potential. Join us and be part of Volvo Cars’ journey into the future.\r\n\r\nLet's introduce ourselves\n\nIn this role you will serve as the Product Mastery for two teams. One team is responsible for implementing an onboard measurement data API, also known as a data collection framework, which gathers data from various vehicle sources such as video and LIDAR, supporting systems like AD/ADAS and others. The second team focuses on calibration and data collection, supporting standards such as XCP and UDS, as well as host log.\nBoth teams consist of skilled software engineers who are passionate about software development. Currently, the teams develop in C and C++ and primarily deploy on HPA. This role will enable you to build and maintain a broad personal network both within and outside the team. As part of our team, you will gain access to long-term development opportunities in a dynamic and continuously growing field.\n\nWhat you'll do\n\nRole Description:\nLead and manage product related work by owning and deciding upon backlog priorities for teams and organizations based on business needs. The Product Mastery roles are named differently depending on operational model and level.\n\nJob Responsibilities:\n  *  Digital Strategy/Transformational Projects Execution 6: Execute and deliver elements of the digital road map, leveraging agile and design-thinking principles to drive sustainable implementation.\n  *  Product and Solution Development 6: Define and deliver products and services that meet customer needs by selecting the best possible approaches available within established systems.\n  *  Project Team Management 5: Lead a small project team; communicate the necessary outcomes and the direction required to achieve them; coordinate team actions on project tasks; request additional team member support when needed; and identify areas of improvement to build the capability of the team through training, coaching, and mentoring.\n  *  Digital Vision and Strategy 6: Support strategy formulation for digital by exploring how information technology can be used to help the organization become more responsive to customer needs and changing business requirements.\n  *  Agile Release Planning 5: Plan and replan software releases for small projects as they are produced to ensure timely updates and to deliver the planned benefits as early as possible in the project.\r\n\r\nWe are looking for an experienced and curious person with previous experience in cross-functional collaboration as well as a strong sense of business insight. People management, collaboration and communication skills are essential when working in a diverse and international setting. It is also important that you are continuously developing your own skills and guide and coach your teams to continuously develop theirs. \n\nWe also see that you have...\n  *  M.Sc or B.Sc. degree in Electrical Engineering, Software Engineering or equivalent\n  *  Ability to communicate technical information to the team and stakeholders\n  *  Ability to translate customer needs into product features and stories\n  *  Ability on creating and communicating product roadmaps\n  *  Ability to deliver clear, concise reports on the product's status, risks, and timelines.\n  *  Ability to understand SW testing, CI/CD, test automation and validation\n  *  Skilled in conflict resolution to manage differences of opinion among team members or stakeholders\n  *  Solid presentation skills to articulate the product vision, progress, and technical details to stakeholders.\n  *  Previous SW development experience and familiarity with embedded systems is an advantage\n  *  Knowledge of Agile frameworks like Scrum and Kanban\n  *  Knowledge using JIRA",
        "url": "https://volvo-car-corporation.contactrh.com/jobs/9669/43484653",
        "published": "2025-06-27T15:25:08",
        "deadline": "2025-07-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 60
    },
    {
        "id": "29795278",
        "title": "Senior Cloud and Security Architect",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nJeppesen is currently looking for a Senior Cloud and Security Architect in Sweden, Gothenburg.\nWhy Choose Boeing Digital Aviation:\nAt Boeing Digital Aviation Solutions, you'll be a part of a team that creates innovative digital solutions and analytics that drive the future and evolution of Digital Aviation and enable our customers to transform the way they do business. Using agile digital technology, our solutions optimize all aspects of the flight ecosystem including safety, environmental sustainability, and efficiency – delivering value and protecting our customers and the planet.\nWho We Are Looking For:\nThe Boeing Digital Aviation Solutions (DAS) Application Engineering Senior Cloud and Product Security Architect must have broad cloud and application security background with experience in leading the definition and implementation of secure architecture and coding best practices for cloud native, customer-facing software solutions. The candidate needs strong technology leadership, analytical skills, teamwork, and excellent communication skills. The candidate will need to communicate at different levels in the organization to other technical personnel, business leaders and customers. This role will drive best-in-class software security practices into the Application Engineering organization in support of DAS modernization efforts to bring market-leading solutions to our aviation customers.\nWhat You Will Do:\n•   Develop and lead implementation of security architecture and secure coding standards and strategies for DAS software solutions. \n•   Contribute to the definition of overall DAS architecture security principles, guidelines, patterns, training, and standards. \n•   Drive adoption of DevSecOps practices into the software engineering organization by working directly with teams on implementation.\n•   Provide effective communication to business and technical community on security architecture topics.\n•   Perform security tool evaluations and make recommendations for adoption.\n•   Assess security impact of architectural decisions to product lifecycle. \n•   Lead the identification of design constraints and ensure architecture conforms to security requirements.\n•   Work across software engineering teams and architects for end to end alignment, process improvements and future designs.\n•   Contribute to the standard software artifacts including the Software Architecture Document, Software Architecture models and other standard artifacts.\n•   Work with customers to understand their security requirements.\n•   Ensure compliance with Boeing Information Security requirements.\n•   Collaborate with cloud service providers, Boeing InfoSec and Boeing Enterprise External Cloud teams to architect best-of-breed application security solutions across multiple clouds.\n•   Review internal and vendor artifacts for security architecture compliance.\n\n\nWhat You Will Need:\n• Bachelor's degree or higher in related field\n•   Highly technical and analytical, possessing 10 or more years of IT implementation experience.\n• 5+ years' experience in IT security, compliance and risk management, including privacy, controls, etc. \n•   Hands-on technical expertise in Security Architecture, automation, integration, and deployment (DevSecOps).\n• Strong verbal and written communication skills and ability to lead effectively across organizations.\n\n\nAdditional Success Factors: \n•   Proven experience leading a globally distributed team \n•   Proven experience to research, advise, compare and recommend technology solutions; ability to demonstrate and maintain method of keeping current on new technologies\n•   Proven ability to deliver application and infrastructure security solutions in a multi-cloud environment\n•   DevSecOps automation best practices\n•   DFARS/FedRAMP/ITAR \n•   NIST Cybersecurity Framework\n•   ISO 27001\n•   Security Development Lifecycle\n•   AWS/Azure/GCP Security services\n•   Cloud Security monitoring process\n•   Certificate Management\n•   Threat modeling\n•   Dynamic and Static Application Security Testing (DAST & SAST)\n•   Software Composition Analysis\nTypical Education & Experience: \nEducation/experience typically acquired through advanced education (e.g. Bachelor) and typically 10 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+6 years' related work experience)\nThis position is hybrid. This means that the selected candidate will be required to perform some work onsite 3 days a week. This is at the hiring team's discretion and could potentially change in the future.",
        "url": "https://jobs.boeing.com/job/gothenburg/senior-cloud-and-security-architect/185/82514566736",
        "published": "2025-06-26T14:21:30",
        "deadline": "2025-08-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29794481",
        "title": ".Net-utvecklare till AFRY Göteborg",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Företagsbeskrivning\nAFRY är ett ledande europeiskt företag med global räckvidd inom teknik, design och rådgivning. \n\nVi är hängivna experter inom digitalisering, infrastruktur, industri och energi som skapar hållbara lösningar för kommande generationer. Tillsammans accelererar vi omställningen mot ett hållbart samhälle.\n\n\nJobbeskrivning\nVill du arbeta med andra duktiga kollegor som är lika tekniskt intresserade som du? Hos AFRY får du möjlighet att arbeta på ett företag som sätter sina anställda först och som alltid strävar efter att ligga i framkant när det kommer till teknisk innovation med hållbarhet i fokus.\nVi söker dig som har minst 5 års erfarenhet av mjukvaruutveckling och som vill arbeta med mjukvara för uppkopplade enheter exempelvis inom fordonsindustrin.\nDu gillar att arbeta enligt agila principer i ett skickligt och engagerat scrumteam som täcker alla aspekter av produkterna: design, implementering och testlösning. Vi kommunicerar direkt med intressenter för att hitta gemensamma och återanvändbara lösningar som säkrar kundernas framgång.\nVem är du?\nDu är en lagspelare; för oss är det viktigaste teamets leverans och våra anställda. Vi stöttar varandra för att komma fram till bästa lösningen för de utmaningar vi som team ställs infor. Du är riktigt duktig på C#, men ännu viktigare är att du är en person som gillar att få saker gjorda och tillhandahålla lösningar från design till support och acceptanstestning.\nFörutom programmering i C# är erfarenhet av kommunikationsprotokoll (design/implementering) meriterande. Du kommer definitivt att kunna välja din personliga målgrupp, men vår grundidé är att alla ska kunna göra allt, i enlighet med ett självorganiserande scrum-team.\n\n\nKvalifikationer\nUtmärkta kunskaper inom mjukvaruutveckling i C# och .NET Core (minst 5 år)\nMS Visual Studio, GIT\nErfarenhet av att arbeta med MAUI/Xamrin/iOS/Android-utveckling\nErfarenhet av att arbeta med DevOps, multitrådad programmering\nErfarenhet av SCRUM/Agila-metoder\n\nYtterligare färdigheter ses som meriterande:\nErfarenhet av diagnostiska kommunikationsprotokoll, till exempel ISO14229, SAEJ1587\nErfarenhet av .NET-applikationer med moln (Azure/AWS)\n\n\n\nYtterligare information\nOmfattning: Heltid\n\nStart: Enligt överenskommelse\n\nVi tar emot ansökningar löpande.\nVälkommen med din ansökan, sista ansökningsdag är 2025-08-18. \n\nVi ber om överseende, på grund av semestertider så kan återkoppling dröja något.\n\n\n\nKontaktuppgifter vid frågor:\n\n\n\nRekryterande chef\n\nLars Jakobsson – lars.jakobsson@afry.com\n\n \n\nVi ber er respektera att vi inte tar emot ansökningar via mail. \n\nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000067195474--net-utvecklare-till-afry-goteborg?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-06-26T11:22:07",
        "deadline": "2025-07-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29793525",
        "title": "Mjukvaruutvecklare – Utveckla framtidens avancerade system!",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Drömmer du om en karriär där du får arbeta med framtidens teknik och utmana din kompetens? Nu erbjuder vårt kontor i Göteborg en spännande möjlighet att bli en del av ett globalt företag med fokus på innovation och avancerade tekniska lösningar.\nVi söker nu efter en mjukvaruutvecklare till ett av våra projekt gentemot vår kund som arbetar med avancerade programvarusystem och simuleringar. Är du vår nästa stjärna?\nOm rollen\nSom mjukvaruutvecklare kommer du få arbeta i ett tvärfunktionellt utvecklingsteam med ansvar för både utveckling och underhåll av mjukvaruprodukter. Du kommer vara involverad i hela utvecklingskedjan – från kravhantering och design till implementering, testning och underhåll. Du kommer bland annat ansvara över följande:\n Utveckling och underhåll av programvara för avancerade system\n Design, implementation och testning av mjukvarulösningar\n Samarbete med andra team och avdelningar för att säkerställa hög kvalité\n Bidra till effektiva utvecklingsprocesser och kontinuerlig förbättring\n Arbeta med moderna utvecklingsmetoder och verktyg.\n \nVi söker en mjukvaruutvecklare som har:\n En högskole- eller civilingenjörsexamen inom data eller motsvarande\n Några års erfarenhet av mjukvaruutveckling och moderna utvecklingsverktyg\n Goda kunskaper inom Linux och versionshantering\n Erfarenhet utav CI/CD.\n \nUtöver detta så ser vi även det som positivt om du har erfarenhet av följande:\n C++\n Git\n Inbyggda system\n Simulering, signalbehandling samt radarstyrning.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande. \nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 24 juli. Vi arbetar med löpande urval. \nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/5500131-mjukvaruutvecklare-utveckla-framtidens-avancerade-system?promotion=1528926-arbetsformedlingen",
        "published": "2025-06-26T08:19:47",
        "deadline": "2025-07-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29777210",
        "title": "Senior Software Engineer at Appgate",
        "employer": "Software Skills International AB",
        "location": "Göteborg",
        "description": "Are you a Senior Engineer with an interest in cyber security? Software Skills is recruiting on behalf of our client, Appgate, for skilled developers to join their growing team in Gothenburg. \nAbout the role \nAs a Senior Software Engineer at Appgate, you will be part of a creative, cross-functional team in cybersecurity. You will have the opportunity to work in an agile environment with a high degree of autonomy while collaborating with top level developers, machine learning experts and network security engineers. \nTheir Gothenburg office serves as the innovation center for the Appgate SDP product - a security solution that is transforming network access for organisations worldwide. With a rapidly growing international presence, Appgate currently employs around 450 people, including 160 software engineers from over ten different countries. \n﻿Why join Appgate? \nWork in a cutting-edge field with the latest technologies.  \nBe part of a collaborative and innovative team.   \nEnjoy a high degree of autonomy and creative freedom within an agile and open environment.     \nCompetence development.     \nFun colleagues and many activities.     \nStable work / life balance.     \nHybrid workplace.     \nWork in a brand-new office in the heart of Gothenburg.    \n\nResponsibilities \nContribute to the development of Appgate SDP, a market-leading Zero Trust Network Access (ZTNA) solution, consisting of both SaaS and customer on-prem platform components. \nParticipate in and lead team decisions about the technical direction. \nDesign, architect, develop, test, review code and document production code to automate operations, including deployment, configuration, networking, upgrades, database clustering, backup & restore, metrics collection and running containers and services. \nBuild developer tooling to facilitate builds, end-to-end testing and deployments. \nTroubleshoot and debug technical issues that end users encounter. \nContinuously learn, introduce new concepts to your team and go to the root of issues to find solutions. \n\nYour profile \nWe are looking for engineers who are passionate about software development and cybersecurity. Ideal candidates will have:  \nMinimum 5 years of experience developing using Python with either Go or Rust.  \nExperience developing Linux-based software and systems. \nProficiency with containers and cloud technologies. \nExperience adding and maintaining automation and unit tests. \nComfort with troubleshooting systems. \nDesire to learn and adapt to new tools and technologies. \nA focus on writing readable, performant, reliable and secure code. \n\nBonus qualifications \nExperience in any of the following: Windows, macOS, Linux, Android or iOS development. \n Knowledge of computer networks and cybersecurity. \n\nAbout Appgate \nAppgate is a global cybersecurity company providing solutions for secure network access. Their flagship product, Appgate SDP, is an identity-centric access control solution that surpasses traditional security approaches by providing “a software-defined perimeter” that increases resilience, simplifies management complexity and reduces cost. It is currently deployed by over 100 customers, including Fortune 100 companies and governments.",
        "url": "https://softwareskills.se/jobs/67d95e86305872019d063ef2?source=af",
        "published": "2025-06-17T18:09:28",
        "deadline": "2025-07-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-07-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772138",
        "title": "Test Lead",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies, we make product development dreams a reality by designing, engineering, and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Test Lead to strengthen our team in Gothenburg.\nTHE ROLE\nThe Test Lead will be responsible for leading verification and validation (V&V) activities for different functions across vehicle platforms. This includes defining and driving the V&V strategy, integrating test frameworks within CI/CD pipelines, and ensuring robust test automation. The ideal candidate will have a strong background in automotive embedded systems, test automation, and XIL testing methods.\nAREA OF RESPONSIBILITY:\nV&V Leadership\nDefine and drive the end-to-end V&V strategy for respective system functions.\nEstablish test coverage matrices, quality gates, and acceptance criteria aligned with automotive safety standards (ISO 26262, ASPICE).\n\nCI/CD & DevOps\nCollaborate with development and DevOps teams to integrate test frameworks within CI/CD pipelines.\nImplement robust test automation workflows in Jenkins, GitLab CI, or Azure DevOps.\n\nTest Automation\nOwn and grow test automation coverage using industry-standard frameworks and tools such as Python, Robot Framework, or Selenium.\nEstablish automation best practices and reusable test libraries.\n\nXIL Testing Expertise\nApply and guide the use of MiL, SiL, HiL, and ViL testing methods.\nDefine specific test cases for each XIL level and ensure traceability across the testing pyramid.\n\nTest Strategy & Planning\nDevelop comprehensive test strategies and detailed test plans per software increment.\nInclude risk-based testing approaches and resource allocation plans.\n\nExecution Oversight\nSupervise test execution, defect triaging, and risk tracking.\nImplement efficient issue management workflows and escalation paths for critical defects.\n\nTeam Leadership\nLead, mentor, and support a team of ~25 test engineers.\nDrive performance management and technical upskilling initiatives.\n\nCross-Functional Collaboration\nWork closely with software developers, function owners, and key stakeholders.\nFacilitate requirements clarification and quality alignment sessions.\n\nTest Infrastructure Enablement\nIdentify and manage enablers for test readiness and automation.\nOversee the setup and maintenance of test environments and vehicle test fleets.\n\nReporting & Governance\nDeliver regular reports, KPIs, and lead technical governance meetings.\nImplement metrics for real-time visibility into test coverage and quality trends.\n\nEXPERIENCE / KNOWLEDGE:\nTechnical Skills:\nStrong background in V&V for automotive embedded systems.\nExperience with CI/CD & DevOps tools (e.g., Jenkins, GitLab, Azure DevOps).\nProficient in test automation (Python, Robot Framework, etc.).\nSolid understanding of XIL methods (MiL, SiL, HiL, ViL).\n\nTooling Proficiency:\nExperience with test management and defect tracking tools (e.g., JIRA, ALM).\nProgramming knowledge in C, C++, Python, or Java.\nFamiliarity with automotive communication protocols (CAN, LIN, Ethernet).\n\nSoft Skills:\nStrong leadership and communication skills.\nAnalytical mindset with attention to detail.\nAbility to work cross-functionally in a fast-paced environment.\n\nPreferred Qualifications:\nExperience within OEMs or Tier-1 automotive suppliers.\nValid driver's license (Category B).\nFluent in English.\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\n \nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-06-16T10:49:38",
        "deadline": "2025-07-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772087",
        "title": "Technical Lead ",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Technical Lead to strengthen our team in Gothenburg.\nTHE ROLE\nExperienced Software Test Engineer with verification and validation of SW functionality for the engineering area of vehicle systems. Including test execution, test definition, test reporting, test case and test structure maintenance, fault report handling and fault tracing (root cause identification).\nDefine test systems and/or test cases suitable for automation for black box and white box testing in the areas of acceptance tests, regression tests, functional and non functional testing, E2E tests, CI, debugging at the component, domain, and complete level\nAREA OF RESPONSIBILITY:\nTesting\nPerform various types of tests to ensure complete functional coverage of the different vehicle systems.\nInterface towards supplier and customers regarding all questions related to software\nPlan test strategies aligned with each software delivery cycle.\nUpdate test cases and/or test structure, if needed, in Car weaver if requirements or needed updates or changes requires it.\nImplement new or changed test cases and/or test structure in vTestStudio for semiautomatic or automatic testing including, after debugging and QA of the test case, merge to repositories associated with CI rigs.\nVerification, by testing (including automatically testing in CI), analyzing, doing measurements or review changes in SW, HW or PSIs within all planned change introductions.\nValidation of CF and PF by exploratory testing.\nBooking of adequate test objects for testing.\nIssuing fault reports and transfer, convey and delegate to suitable receiver according to PEF\nprocess for Fault report handling.\nReview and analyze Fault reports, for testability and root cause analysis together with necessary stakeholders appointed by functional owners or system designers.\nSolve and close Fault reports and Fault slip through analysis including implementing\ncorrective actions.\nWrite test reports and give verdicts of test cases according to PEF processes.\nSupport functional owners and system designers in requirement definition by give input on testability and previous experience of risks.\nCollaborate with requirement owners to develop test systems for each PSI when/if needed.\n\nAutomation\nCollaborate with the integration team to integrate test cases into nightly test runs.\nMonitor and analyze test results from daily executions.\nIdentify test cases suitable for inclusion in CI/CD pipelines for continuous testing.\n\n Documentation & Compliance\nMaintain traceability between requirements, models, and test cases in SystemWeaver.\nPRST – Product System Safety Test Plan (for Safety requirements)\nDVM – Design Verification Method (for Test Systems / PSI from Car Weaver)\nTest reports (Car Weaver)\nNecessary guides, tips and instructions needs that arise.\nSupport to create Safety related test documentation as per ISO 26262 standard.\n\nEXPERIENCE / KNOWLEGDE:\nExtensive experience in automotive testing and validation, preferably with exposure to exterior systems.\nHands-on experience with vehicle testing, HIL systems, and Boxcar setups.\nExperience with dSPACE tools such as ControlDesk, AutomationDesk, or VT System for HIL testing.\nProficient in using software tools such as Vector testing tools like CANoE, vTestStudio, CAPL.\nAutomation experience using vTestStudio , Python and Robot Frameworks.\nSkilled in test case documentation and verdict updates using SystemWeaver, DOORS, or Electra.\nKnowledge of safety testing and documentation in accordance with ISO 26262 standards.\nStrong understanding of validation processes, testing equipment, and standards related to assigned modules.\n\nDesirable:\nExperience with Exterior systems.\nFamiliarity with System weaver\nExposure to Jenkins, Git/Gerrit, JIRA, Polarion, or similar tools.\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-06-16T10:46:08",
        "deadline": "2025-07-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772081",
        "title": "Test Engineer",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth, we are now recruiting for a Test Engineer to strengthen our team in Gothenburg.\nTHE ROLE\nExperienced Software Test Engineer with verification and validation of SW functionality for the engineering area of vehicle systems. Including test execution, test definition, test reporting, test case and test structure maintenance, fault report handling and fault tracing (root cause identification). \nDefine test systems and/or test cases suitable for automation for black box and white box testing in the areas of acceptance tests, regression tests, functional and non functional testing, E2E tests, CI, debugging at the component, domain, and complete level\nAREA OF RESPONSIBILITY:\nTesting\nPerform various types of tests to ensure complete functional coverage of the different vehicle systems.\nInterface towards supplier and customers regarding all questions related to software\nPlan test strategies aligned with each software delivery cycle.\nUpdate test cases and/or test structure, if needed, in Car weaver if requirements or needed updates or changes requires it.\nImplement new or changed test cases and/or test structure in vTestStudio for semiautomatic or automatic testing including, after debugging and QA of the test case, merge to repositories associated with CI rigs.\nVerification, by testing (including automatically testing in CI), analyzing, doing measurements or review changes in SW, HW or PSIs within all planned change introductions.\nValidation of CF and PF by exploratory testing.\nBooking of adequate test objects for testing.\nIssuing fault reports and transfer, convey and delegate to suitable receiver according to PEF\nprocess for Fault report handling.\nReview and analyze Fault reports, for testability and root cause analysis together with necessary stakeholders appointed by functional owners or system designers.\nSolve and close Fault reports and Fault slip through analysis including implementing\ncorrective actions.\nWrite test reports and give verdicts of test cases according to PEF processes.\nSupport functional owners and system designers in requirement definition by give input on testability and previous experience of risks.\nCollaborate with requirement owners to develop test systems for each PSI when/if needed.\n\nAutomation\nCollaborate with the integration team to integrate test cases into nightly test runs.\nMonitor and analyze test results from daily executions.\nIdentify test cases suitable for inclusion in CI/CD pipelines for continuous testing.\n\n Documentation & Compliance\nMaintain traceability between requirements, models, and test cases in SystemWeaver.\nPRST – Product System Safety Test Plan (for Safety requirements)\nDVM – Design Verification Method (for Test Systems / PSI from Car Weaver)\nTest reports (Car Weaver)\nNecessary guides, tips and instructions needs that arise.\nSupport to create Safety related test documentation as per ISO 26262 standard.\n\nEXPERIENCE / KNOWLEGDE:\nExtensive experience in automotive testing and validation, preferably with exposure to exterior systems.\nHands-on experience with vehicle testing, HIL systems, and Boxcar setups.\nExperience with dSPACE tools such as ControlDesk, AutomationDesk, or VT System for HIL testing.\nProficient in using software tools such as Vector testing tools like CANoE, vTestStudio, CAPL.\nAutomation experience using vTestStudio , Python and Robot Frameworks.\nSkilled in test case documentation and verdict updates using SystemWeaver, DOORS, or Electra.\nKnowledge of safety testing and documentation in accordance with ISO 26262 standards.\nStrong understanding of validation processes, testing equipment, and standards related to assigned modules.\n\nDesirable:\nExperience with Exterior systems.\nFamiliarity with System weaver\nExposure to Jenkins, Git/Gerrit, JIRA, Polarion, or similar tools.\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-06-16T10:43:38",
        "deadline": "2025-07-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29738651",
        "title": "R&D Manager",
        "employer": "Cpac Systems AB",
        "location": "Göteborg",
        "description": "We’re looking for an R&D Manager to co-lead one of our development departments at CPAC Systems. If you’re excited by technology, comfortable with complexity and genuinely enjoy helping both people and ideas grow this could be your next step. \nCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From drive-by-wire to intelligent automation, we work at the intersection of safety, efficiency and user experience. We are proudly part of Volvo Group where our role is to lead advanced technology development and explore the next generation of smart control systems.\nThe RoleYou’ll lead a group of highly skilled engineers working on cutting-edge product development. This is a hands-on leadership role where you’ll work both strategically and operationally: coaching people, managing projects, solving technical problems and shaping how we work.\nResponsibilities Leading a cross-functional development team and being part of their daily work\n Driving product development within both software and hardware, from idea to delivery in customer projects\n Coaching engineers and building a team that thrives\n Taking ownership of delivery, quality and budget\n Making sure we work smart, continuously improving our methods and processes\n Collaborating with other leaders to align tech, organization and business goals\n Being part of a project team yourself to stay close to the technology\n Key Qualifications\nYou probably have a background in software, embedded systems or systems engineering. You’ve worked in product development and you’ve led people in a technical environment. You like digging into the details but never lose sight of the bigger picture.\n Has experience in product development, ideally within embedded or software-heavy systems\n Enjoys technical problem-solving and isn't afraid to challenge the status quo\n Is confident in your leadership: listens, supports, drives motivation\n Communicates clearly and builds trust across teams\n Thinks long-term and makes decisions with both people and product in mind\n Why CPAC Systems? You’ll work on real tech that makes a real difference for real users\n You’ll be part of a collaborative, curious and driven team\n You’ll get the freedom to explore, question, build and improve\n You’ll join a company that combines the agility of a tech firm with the muscle of a world-leading industry group\n Curious?\nIf you're excited to make a significant impact and want to be a part of our innovative team, we'd love to learn more about you. Submit your application today and don't hesitate to reach out to Malin Lindebjörn with any questions you may have.",
        "url": "https://careers.cpacsystems.se/jobs/5987800-r-d-manager?promotion=1491722-arbetsformedlingen",
        "published": "2025-05-28T16:53:53",
        "deadline": "2025-11-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29715982",
        "title": "Senior System Test Engineer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society. \n\n\nJob Description\nWe are looking for a senior system test engineer within electromobility that wants to be part of our team, testing and developing solutions for vehicles, systems and functions together with our customers in Gothenburg and Trollhättan.\nIn the role as system test engineer you will drive the development of testing for the next generations of mobility solutions. You are an important link between your team, suppliers and internal partners. Here you get the opportunity to work on exciting assignments for many different companies.\nWith us, you become an important part of the AFRY family, with different skills. Together we create sustainable solutions for the challenges of the future. To us it is important that you have the opportunity to develop in the direction that you would like, and therefore that you have a manager that supports you in your ambition.\nWe are looking for you with a bachelor or master’s degree within computer science, automotive, physics or similar. You have at least five years’ experience within automotive R&D within electromobility. A thorough understanding of product development processes are required, as well as experience with electrical architectures and safety concepts.\n\n\nQualifications\nYour main competence areas would be\nTesting of complex (HW/SW) automotive applications, both in simulated environments but also in vehicle\nDeveloping test cases from requirements with a system understanding\nImplementing test cases in simulated environments (HIL/SIL)\nUnderstanding of functional safety (ISO26262)\nRequirement development\nAgile development experience\n\nWe also think you are comfortable with at least some of these tools/areas\nPython, Matlab/Simulink, C/C++\nCanalyzer, Canoe, INCA, Controldesk\nJenkins, Git\n\nIn addition you have experience from product development within high voltage systems (Charging, traction batteries, electric motors, inverters).\nAs in all our recruitments large emphasis is put on personal qualities. As a person, you are positive and driven by constantly working to find new solutions to challenges you face together with your team. You are an effective and experienced communicator, and can express yourself well both orally and in writing. In addition, you are structured in your way of working and prefer order and order.\n\n\nAdditional Information\nWe are looking for someone who wants to be part of AFRY’s success story. Are you passionate about technology development? Do you like to work together to find the best solution? Then we can offer you career opportunities in a modern workplace with challenging assignments and exciting projects all over the world.\n\n\n\nThe AFRY Group is ranked as one of Sweden’s most popular employer among engineers. At AFRY you will be involved in developing innovative and sustainable solutions within infrastructure, energy and industry. We are always looking for the sharpest skills that can create a future society together with us. We hope you will learn as much from us as we will learn from you.\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000060544255-senior-system-test-engineer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-20T10:31:43",
        "deadline": "2025-07-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709549",
        "title": "Join our Software Team within Automotive Infotainment!",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAs SW Developer/System Engineer/SW Test Developer/Scrum Master within Infotainment you will work at one of our clients to develop and maintain the functionality of Personalization, Vehicle Functions , Positioning & Maps, Core HMI , Camera, BT Telephony, Security, Base Tech , vehicle power modes, SW Download and Diagnostics/OTA.\nYou will join a team with valuable knowledge from all infotainment domains. The daily work includes Infotainment development with end to end responsibility including design, architecture, documentation, implementation and automated tested case.\n\n\nQualifications\nWe believe that you have:\nM.Sc in Software Engineering or similar relevant experience\nAt least 3 years of software development in Java and/or C++ in a Linux environment\nGood English skills (written and spoken)\nGood understanding in working according to Agile principles\nEuropean driving license (B) \n\nOne or several of the below:\nExperience and good understanding of android stack development including knowledge within platform area\nExperience in test driven development\nExperience in developing automated unit or integration test in C++/Java and Python\nExperience from automotive environment\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 6/7. \nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059723035-join-our-software-team-within-automotive-infotainment-?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:32:33",
        "deadline": "2025-08-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 70
    },
    {
        "id": "29709489",
        "title": "Automotive Functional Safety Engineers",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nFunctional Safety, Engineers\n\nAs a Functional Safety Engineer, you will plan and follow up all functional safety activities within your team/ART/project. You will support your organization with functional safety activities such as project and test planning, Safety Joint Reviews and Formal Reviews and release of work products. You will have ownership of functional safety work products such as Project Safety Plan, Project Safety Test Plan and Safety Case within yourTeam/ART/Project. \nFunctional Safety, System Engineers\n\nAs a System Engineer, you will define, analyze and validate Safety Goals, Functional Safety Requirements (FSC/FSR) and Technical Safety Requirements (TSC/TSR) you work closely with Function Owners, System Engineers and Test Engineers to include the functional safety work in the development process, you are a skilled user of FMEA and FTA to analyze design and requirements. \nFunctional Safety, Test Engineer\n\nAs a Test Engineer you will take part in Functional Safety and requirements analysis and being responsible for development of test methods, test planning and test execution according ISO26262. You will define and prepare test environment and test objects for the different levels to test e.g. vehicle, function, system and component.\n\n\nQualifications\nYou need to have deep knowledge in at least one vehicle domain about electrical/electronic hardware, embedded software and good understanding of requirements breakdown from design to production.\nYour academic background is a Bachelor or Master’s degree, you have at least 7 years of experience in automotive electrical systems development. You have good knowledge of ISO 26262. You are familiar with the use of requirement management tools like e.g. System Weaver, DOORS, Elektra, if you also have work experience with software quality and processes like e.g. CMMI and Automotive SPICE, we see it as meritorious. \nYour business English is fluent both verbally and in writing and you communicate easily with both peers and upper management. It is an advantage, but not a requirement, to also know Swedish. A Swedish driver license type B is required.\n\n\nAdditional Information\nWe are looking forward to reading your application! Last date to apply: 6/7.\nFor questions about the position please contact: \n\nLena Henriksson - Section Manager\n\nlena.henriksson@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059994605-automotive-functional-safety-engineers?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:26:13",
        "deadline": "2025-07-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29690348",
        "title": "AUTOSAR (Classic and Adaptive) Architect",
        "employer": "VHR SOLUTIONS AB",
        "location": "Göteborg",
        "description": "1. AUTOSAR (Classic and Adaptive) architecture and concepts.\n2. Understanding of AUTOSAR development methodology and workflow.\n3. Knowledge of AUTOSAR configuration tools, such as DaVinci.\n4. Experience in classic AUTOSAR, preferably the Vector stack.\n5. Experience with AUTOSAR communication stacks (e.g., Ethernet, CAN, FlexRay).\n6. Understanding of AUTOSAR software components, including Basic Software (BSW) modules and Application Software (ASW).\n7. Familiarity with AUTOSAR development standards and guidelines.\n8. Proficiency in software development tools (e.g., Eclipse, Git, JIRA).\n9. Software development using C#\n10. Development of test cases using CANoe and C#.\n11. Automotive knowledge.\n12. Automotive embedded systems: strong understanding of in-vehicle ECU development\n13. Swedish Language (Swedish local Engineers preferred)",
        "url": null,
        "published": "2025-05-09T10:11:19",
        "deadline": "2025-08-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29662150",
        "title": "Senior Java Developer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 2300 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Canada, Greece, India and Poland.\nLife at Etraveli Group\nDepending on how you want to grow we want to listen in on your future career plan. To be able to inspire you to be your best within a fast moving industry we work hard to provide for the best prerequisites to make you feel that you belong together with us on our journey, by giving you a lot of work freedom, time for self studies, having recurring Hackatons, Dev weeks and a lot other fun activities together within the team and across the company to foster a great culture.\nDo you want to be part of the next step in our growth journey?\nIn alignment with the growing targets and needs, we are currently on the lookout for Java Developers to become part of our tight-knit teams in Gothenburg. In the teams, we are continuously looking to find new ways of working that decrease complexity and provide the tools for team members to do their best work.\nWhat will you be doing\nYou will be working on Java technologies, developing/maintaining our core back-end software system and facing fresh challenges along with your team members every day. Day to day tasks include new booking features and after sale support automations. The successful candidate must be knowledgeable in the field of software development and eager to contribute & work in a fast-paced, ever changing environment.\nYou will be part of designing and implementing features for our core back-end system, which handles millions of requests per day.\nYou will work closely with software and product developers.\nYou will test your code and write unit tests.\nDocument and communicate your work with your team in order to deliver weekly releases as well as estimate subsequent sprints.\nYou will participate in a stand-up meeting with your team every morning and participate in a weekly retro/planning session with your team.\nEnsure code quality and adherence to best practices, standards, and guidelines.\nCollaborate with cross-functional teams to implement new features and enhancements.\n\nOur stack\nJava, MySQL, MemSQL, Artemis, Kafka as well as Atlassians agile tools, Git, Jenkins, Docker, Kubernetes, Linux, Mac OS, IntelliJ.\nOf course you don't have to be familiar with all of our tech stack. We will support you in your journey with us.\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\nProven experience as a Java Developer, with a strong grasp of Java or Spring Framework.\nFamiliarity with RESTful web services and API development.\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\nStrong problem-solving skills and the ability to work independently and collaboratively.\nExcellent communication skills to interact effectively with team members and stakeholders.\nUnderstanding of the travel industry and a keen interest in keeping up with industry trends\n\nBenefits\nWhen working at Etraveli Group you will always feel that you are trusted and that you can rely on others to help you. To work together as a team and feel that you are challenged in a way that helps you evolve within your profession. You will have awesome colleagues together with whom you will solve complex problems in a fast-moving business. But not just that.\nWhat else do we offer?\nBrand New office in the City – We are located in Merkurhuset in central Gothenburg, just a stone's throw away from public transport and lunch restaurants.\nConferences – We believe in personal development and continuous education. We continuously organize internal trainings and workshops so that we can learn from each other.\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\nHackaton and Dev week – We believe in fostering creativity and testing new things.\nTo kick the day off just right, we serve breakfast at the office every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/52B77B692A/apply",
        "published": "2025-04-28T14:44:04",
        "deadline": "2025-08-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661465",
        "title": "Senior Python/Matlab Developer- Gothenberg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Professional Galaxy looking for an experienced Matlab and Python developer for one of our clients in Gothenburg. The role requires strong analytical skills, experience working in complex technical environments, and proven knowledge of microwave technology.\nYou will contribute to the creation and improvement of technical systems and analytical tools. Its beneficial if you have a great understanding of microwave technology, as well as the ability to manage technical documentation and databases.\nRequirements: - 3–5 years of experience in Matlab and Python development - Documented experience with microwave technology - Strong skills in handling technical documentation and databases - Excellent communication skills in English - Relevant educational background in engineering, electronics, computer science, or similar\nDuration: 2025-09-01 - 2025-02-28\nApplication deadline: 2025-04-30",
        "url": "https://careers.progalaxy.se/jobs/5857963-senior-python-matlab-developer-gothenberg?promotion=1447444-arbetsformedlingen",
        "published": "2025-04-28T12:59:35",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29538714",
        "title": "Senior Mjukvaruutvecklare",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Du kommer att ingå i ett utvecklingsteam som arbetar med forskning och utveckling av testutrustning, testmetodik och testmiljöer. Syftet är att möjliggöra avancerade tester av automatiserade och uppkopplade fordon för att säkerställa en trygg och hållbar trafikmiljö i framtiden.\nDu förväntas ha en god samarbetsförmåga, vara ansvarstagande och ha en analytisk förmåga med intresse för att sätta dig in i olika forskningsfrågor.\nObligatoriska krav: MSc. inom elektro, mekatronik eller motsvarande.\n \nErfarenhet:\n Minst 5 års erfarenhet som mjukvaruutvecklare i industrin.\n \nProgrammeringskunskaper:\n Goda kunskaper i C++ och Python.\n \nLinux-kunskaper:\n Van att arbeta med olika varianter av Linux-distributioner.\n \nB-körkort:\n Svenskt B-körkort.\n \nSpråkkunskaper:\n Behärska både svenska och engelska i tal och skrift.\n Mervärden (önskvärda kvalifikationer): Kunskaper i MatLab.\n Erfarenhet av sensorfusion och sensorutveckling.\n Erfarenhet av CARLA eller Unreal Engine är meriterande.\n Dokumentation: CV med kompetensbeskrivning.\n Beskrivning av genomförda uppdrag.\n Uppdragsperiod:\n20250407 - 20260406 , 1 år med möjlighet till förlängning om 3 år.\nPlacering:Uppdraget är placerat i Göteborg med en del arbete på en testbana utanför Borås.",
        "url": "https://careers.progalaxy.se/jobs/5674587-senior-mjukvaruutvecklare?promotion=1381054-arbetsformedlingen",
        "published": "2025-03-12T18:39:32",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29805236",
        "title": "Development Manager",
        "employer": "Visma Software AB",
        "location": "Göteborg",
        "description": "We're Visma Software Nordic, a leading SaaS ERP House, deeply rooted in the Nordic market. Our ERP product suites specialize in simplifying complex business processes, empowering our customers to stay focused, scale and work smarter.\n \nOur Purpose is to Simplify the complex. We dive into our customers' most intricate operations and make them efficient and simple to perform. Our Vision is to Shaping the future through smart technology. We're committed to innovation and pushing the boundaries of what's possible. Our Mission is to Create a seamless experience with local edge. We combine a broad, unified product offering with deep, localized expertise within the Nordic market.\n\n\r\n\r\nDevelopment Manager to Transpa - Visma Software Nordic\n\nAre you ready to lead a highly competent product development team towards the future? If you’re driven by people leadership and leading operational excellence in a tech savvy environment, you should continue reading. We are now looking for a Development Manager to Transpa Business Line in Visma Software Nordic (Gothenburg or Munkedal). \n\n\nWhat You’ll Do\n\nAs a Development Manager, you’ll take full ownership of your team’s success, focusing equally on leadership, people development, and strategic projects. At our company, people are at the heart of everything we do. You’ll lead a distributed product development team across Sweden and Romania, ensuring they thrive in a well-structured and engaging environment. Our team consists of talented people working within the whole development chain from A to Z with our product TransPA. Part of your time you’ll also be our key player as project manager for a number of strategic projects, with focus on increasing growth and customer engagement.\n\n\nTranspa is built and developed specifically for the transportation industry. An easy-to-use, fully web-based solution that helps you automate payroll management, gather all information in one place, and gain full control over time, personnel, agreements, and laws.\n\n\nIn this role you will report directly to Business Line Director, Oscar Mattsson, and also be part of the local management team for the business line. Your main responsibilities will be:\n\n\nPeople Leadership:\n\n\n\n• Drive people related processes in your team, such as recruitment, performance development and employee engagement.\n\n• Coach individuals to help them grow and excel in their roles and reach their full potential.\n\n• Drive communication and translate business strategies & OKR:s to concrete plans for your team.\n\n• Create a culture of psychological safety, collaboration, and continuous learning.\n\n• Develop and drive work methods, ensuring they align with business goals and foster productivity.\n\n• Improve and implement processes that enhance efficiency and quality across the teams. This includes harnessing the potential of AI for internal use, to help the team work smarter, not harder.\n\n• Oversee budgets, resource allocation, and team structure to ensure your department operates effectively.\n\n\nStrategic Projects:\n\n\n\n• Act as project manager for strategic projects, from concept to completion, ensuring they are delivered on time, and within scope, and meet our high quality standards.\n\n• Engage in market facing initiatives, to make sure TransPA has a voice as thought leaders software vendor in the Swedish transport industry.\n\n• Bridge the gap between technical development and business strategy, driving initiatives that align the development team’s innovation with our commercial goals.\n\n\nIn this role, you can be based at either our office in Munkedal or in Gothenburg. Business travels are included in the role. \n\n\nWhat makes this role exciting\n\nWe are currently in a very exciting phase of TransPA’s journey. As of 2025, we have established our own independent business line within our mother company Visma Software Nordic. This means we have brought together all teams in the TransPA value chain – from code to customer – under one roof. The goal? To become an even stronger and more product-focused team. As our new Development Manager, you will play a key role in this transformation. With us, you’ll get the best of both worlds – the opportunity to lead in a smaller, agile organization while also benefiting from the strength of both Visma Software Nordic and the wider Visma Group.\n\n\n\n\n\nWe offer:\n\n\n• Personal growth: Leadership development and a culture that prioritizes psychological safety.\n\n• Great perks: Such as flexible hybrid work model, private health care insurance, access to company cabins in the Alps to mention a few.\n\n• A flagship product: Work with Transpa, a market leading personnel product in the Swedish transport industry.\n\n• Supportive culture: Ownership, empowerment, and collaboration are core to who we are.\n\n\n\n\n\nWho are we looking for?\n\nWe believe that you are / have:\n\n\n\n• Previous experience and success from leadership & project management.\n\n• Proven track record in engaging people and optimizing processes.\n\n• Previous experience from working within a software development organisation. You don’t have to be a technical hero yourself, but you have genuine interest and insight into software development methods and principles. \n\n• A great networker and a skilled social navigator in international and complex environments.\n\n• Skillful in conveying clear, honest communication. Fluency in Swedish and English.\n\n\nBonus points if you have:\n\n\n\n• Experience from the transport industry or similar, logistic heavy operations.\n\n• More extensive technical background.\n\n• Success in managing remote and distributed teams.\n\n\nApplication\n\nApply by attaching CV or a link to your updated LinkedIn profile. We friendly decline cover letters in this process. Don't wait to seize this opportunity! We're reviewing applications as they come in, but due to summer vacation we will start the process in August. Questions? Contact Oscar Mattsson, Business Line Director, 46 734 344795",
        "url": "https://hire.vismatalent.com/spa/public/apply?guidAssignment=8930f205-6aae-404f-be7a-09ff72f3f5ff&publishCode=AMS&TK=5470dc3a-dafb-4906-aa5a-4bfa4cb997b7",
        "published": "2025-07-01T16:20:27",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795052",
        "title": "Software Application Development Manager",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nFor more than 80 years, Jeppesen, a Boeing Company, has made it possible for pilots and their passengers to safely and efficiently reach their destinations. We are the world's leading provider of aeronautical data and operational support, combining our company's enduring spirit of innovation with a legacy of leadership in aviation to deliver 21st century navigation and optimization solutions.\nJeppesen, A Boeing Company is looking for a Software Application Development Manager. The position will be based in Gothenburg, Sweden in our newly renovated office at Odinsgatan.\nAbout the position\nThe Software Development and Advanced Technology department is now looking for a Line Manager who want to join us and be a part of driving a transition journey. We are on a journey to take our solutions into the cloud and at the same time continue to explore what modern technology such as AI and Quantum Computing can do to support our customers in the best possible way.\nOur development teams build world-leading optimization solutions targeting professional users as well as web-based solutions for airline personnel.\nAs a line manager, you will be joining a team of 10 line managers and you will be leading 3-4 teams and about 15-20 team members. Both the leadership team and the development teams use agile principles to plan and perform their work.\nPosition Responsibilities:\nAs a line manager you will:\nBe accountable for your team's deliveries and performance\nSupport your teams when they innovate, develop and maintain our software\nCoach both teams and team members to help them perform at their best\nWork closely with product management and the neighboring implementation department\nBe an active member of a leadership team that collaborates on a daily basis\nDrive continuous improvement across teams and departments\nPlay an active part in our technical and cultural transformation journey\nHelp create a workplace that gives you and your colleagues energy and make Jeppesen the best workplace in town\n\n\n\nProfile:\nOur leaders play an important role in nurturing our identity and company culture. We want our teams to apply an owner's mentality in everything they do and feel proud about what they do for our customers. This requires a special mindset and we believe our leaders play an important role in building and nurturing that culture.\nRequired qualifications:\nAbility to speak and write English fluently\n\n\n\nPreferred qualifications:\nAs a leader we believe that you:\nHave a background in the IT industry\nHave a track record of being a good coach to teams and people\nAre passionate about always improving ways of working and that you are eager to learn\nAre passionate about software development and new technology\nAre familiar with Agile and Lean principles\nHave track record of creating a safe, inclusive and collaborative working climate\n\n\n\nIf you want to take part of our journey and would like to work in an international atmosphere, please submit your application in English.\nRelocation: This position does not offer relocation support.\nShow Sponsorship: Employer will initiate the visa application; however, the successful candidate will cover the cost of visa.\nPlease apply ASAP for this role as recruitment may commence before the end date.\nIf you join us you will get the chance to:\nGet professional skills development with our virtual learning tools and platforms e.g. (Digital Campus, LinkedIn Learning, Degreed, EdX, Enterprise Mentoring, and Communities of Excellence & Practice)\nBroaden your experience in international projects, technical workshops and hackathons\nEnjoy additional days off for Christmas break (December 24th-January 1st)\nParticipate in employee recognition program\nHave Private Medical Insurance (Skandia)\nGrow as a leader in an international team\nAnd more...\n\n\n\nPlease note that, due to the summer holiday period, there may be minor delays in the recruitment process.",
        "url": "https://jobs.boeing.com/job/gothenburg/software-application-development-manager/185/82983740480",
        "published": "2025-06-26T13:45:45",
        "deadline": "2025-08-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787427",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-06-24T08:06:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787426",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-06-24T08:03:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29763053",
        "title": "IT Operations Manager to Maurten",
        "employer": "Bravura Sverige AB",
        "location": "Göteborg",
        "description": "Do you enjoy taking full ownership of IT operations and driving continuous improvemen? If that sounds like you, then apply today!\n About the job\nThis is a direct recruitment, which means that the recruitment process takes place through Bravura and you are employed directly by the company Maurten.\n About Maurten AB\nWe exist primarily for people who see themselves as athletes. People who are not satisfied with simply joining, finishing, then going home. People who see it as a way of life to train, compete and always aim for the best results possible. These are the people who will benefit most from using Maurten products. They push themselves to achieve their best and we push ourselves to give them our best.\nBack in 2015, we found a way to make sports fuels easier to tolerate: by encapsulating carbohydrates in hydrogels. This method was so successful, that today, most of the world's best marathoners, cyclist and triathletes are fueling their training sessions and competitions with our technology.\nAs Maurten grows rapidly, we need to grow our team with colleagues that share our passion for sports. The company looks for people who can grow, think, create and dream. Join us in upholding a culture of integrity, teamwork, and community.\n Tasks and responsibilities\nIn the role as IT Operations Manager, you will take ownership of the company’s internal IT infrastructure and ensure that all systems and devices run securely, efficiently, and reliably. This includes managing servers, networks, databases, cloud services, and other IT resources. You will report to the CFO and play a critical role in enabling efficient operations, safeguarding company assets, and delivering exceptional support to all employees. Making sure your colleagues have the tools they need to do their best work.\nYou will also be responsible for ensuring seamless onboarding and offboarding processes, building and maintaining a strong internal IT knowledge base, keeping IT policies up to date, and driving training and awareness across the organization.\nIn addition to operational responsibilities, you will lead development initiatives to modernize IT operations and prepare the company for future growth. This includes working with scalable systems, supporting the secure adoption of AI tools, establishing efficient document management processes, and leading IT projects during future expansions.\nYou will collaborate closely with teams across the company to align IT with business needs and ensure that IT is a true enabler of growth and innovation.\n• Ensure the stability, security, and performance of IT infrastructure\n• Manage the full lifecycle of company devices for both Windows and macOS environments\n• Drive IT development projects, including asset management, process automation\n• Stay on top of emerging technologies and continuously recommend improvements to IT operations\n Education, experience and personal characteristics\n• University degree in Information Technology or a related field\n \n• At least 5 years of experience in IT operations, infrastructure management, or system administration\n• Proven experience administering Microsoft 365, including Exchange, SharePoint, and Teams\n• Knowledge of Entra ID, including identity lifecycle management, provisioning, and Single Sign-On (SSO) configuration\n• Hands-on experience with device management for both Windows and macOS environments, including Mobile Device Management (MDM) using Intune\n• Experience in providing end-user support and managing IT service desk operations\n• Excellent communication skills in English, both written and spoken\nThe ideal candidate is a pragmatic problem-solver who can resolve technical issues while driving continuous improvement. You take initiative, work independently with a strong sense of ownership, and thrive in a fast-moving, entrepreneurial environment.\nA prestigious and hands-on mindset is key in this role and you’re just as comfortable rolling up your sleeves to solve day-to-day challenges as you are driving larger development projects. You are structured and detail-oriented, ensuring consistency and quality even when balancing multiple tasks and deadlines.\nYou collaborate easily with both technical and non-technical stakeholders, and you deliver high-quality support with empathy, responsiveness, and a strong service mindset. You take responsibility for managing sensitive data and systems securely and in line with compliance standards.\nYou embrace change and are driven to continuously learn and modernize systems and processes. Above all, you bring an entrepreneurial spirit and a genuine drive to contribute to the company’s growth and success\n Other information\nStart: Upon agreement Location: Gibraltargatan 1A, 411 32 Göteborg Salary: Upon agreement\n Questions about Bravura's recruitment process? You can find answers to the most frequently asked questions here: https://www.bravura.se/karriar/ \n If you have any questions about the position or your application, you are welcome to contact the responsible recruiter Navid Parsa at navid.parsa@bravura.se or 070 – 434 17 71.\nWe recommend that you submit your application immediately as we make a continuous selection. Welcome with your application! \n #Brillante",
        "url": "https://ledigajobb.bravura.se/jobs/6029407-it-operations-manager-to-maurten?promotion=1508380-arbetsformedlingen",
        "published": "2025-06-11T11:01:31",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760753",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
        "published": "2025-06-10T13:37:03",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29750273",
        "title": "Tech Lead Development Environment",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "Jeppesen, a subsidiary of The Boeing Company, is one of the largest software development companies in Gothenburg. We develop innovative optimization solutions for the world’s leading airlines. We are dedicated to continuous improvement, delivering more value to our clients, and exploring emerging technologies such as quantum computing, AI and big data analytics.\n\n\nWe are currently looking for a Tech Lead Development Environment taking the role as Product Owner for one of our development team as well as driving various improvement areas in the areas surrounding development environment and product usage by our implementation teams. The team is responsible for development environments for internal and customers implementation teams implementing our products. You will be responsible for the team’s backlog and ensuring we are developing a maintainable solution as well as ensuring the development environment fulfills the needs for our internal and customers implementation teams. We are looking for a product owner who can team up with our Product Manager, Software Architect and implementation teams to explore new solutions, whilst also working with the development team to experiment, innovate and shape the next generation of our Flight Operations products.\nPosition Responsibilities:\nTake ownership of the team's backlog and prioritize development efforts to deliver a high quality and maintainable core product based on the products and components requirements.\nCollaborate with the Product Manager, Software Architect and implementation teams to develop and deliver high-value solutions that meets architectural vision and implementation team’s needs.\nEffectively communicate your vision and present technical solutions to diverse audiences.\nEnsure innovation and experimentation within the development team to explore the next generation of our Flight Operations products.\nEmbrace and promote agile ways of working to foster collaboration and productivity.\nDemonstrate informal leadership, being positive, outgoing, and results-oriented, to foster a strong and motivated team.\nDrive various improvement areas towards different stakeholders in the border area between product and implementation teams\n\nBasic Qualifications:\nMinimum 10 years of experience working within the software industry\nMinimum 5 years of experience as a product owner within the software industry\nExperience in cloud services ecosystem (e.g. AWS)\nExperience in using and understanding agile methodology and a willingness to embrace it\nFluency in English, both written and spoken\n\nPreferred Qualifications:\nExperienced from Jeppesen crew implementation projects\nExperienced in engaging with diverse stakeholders and balancing competing needs effectively\nA team player with high integrity\nExcellent communication skills, with the ability to clearly convey visions and to present technical solutions to different stakeholders or audiences\nAn engineering background as Bachelor of Science, Master of Science or similar\nStrong ability to see the bigger picture\nFluency in Swedish, both written and spoken\n\nJoin us if you want to:\nHave the opportunity to work with the most well-known companies in the aviation world\nLearn new things every day\nWork together with highly motivated and skilled team mates\nWork with new technologies and cloud deployments\nHave Private Medical Insurance (Skandia)\nEnjoy additional days off for Christmas break (December 24th-January 1st)\nParticipate in employee recognition program (Boeing PridePoints)\nPension Plan (Defined Contribution Plan)\n\nTypical Education & Experience:\nEducation/experience typically acquired through advanced technical education (e.g. Bachelor) and typically 5 or more years' related work experience or an equivalent combination of technical education and experience (e.g. PhD, Master+3 years' related work experience, 9 years' related work experience, etc.).",
        "url": "https://jobs.boeing.com/job/gothenburg/software-application-developer-product-application-development/185/79522281280",
        "published": "2025-06-04T11:58:08",
        "deadline": "2025-07-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29476672",
        "title": "Supplier Quality Engineer with experience in Software",
        "employer": "Qamcom Research And Technology AB",
        "location": "Göteborg",
        "description": "You now have the chance to join us, the Standards & Methods team at Qamcom! \nWe are a central team of highly skilled and motivated persons driving multiple aspects for multiple technologies for the complete life cycle of our global range of products. Competences of the team include System Safety, Quality and Security and typical industries are automotive, medical, aero and rail. \nAbout the role: As an SQE, you will have a full end-to-end ownership of your portfolio. Your input is key to selecting the most suitable supplier for a sourcing award. In this role you will work mainly in the field of connectivity and the suppliers you will assess will mainly come from software and electronics. Your work continues throughout the project to secure a quality assured project launch. Risk management skills will be important through all steps: sourcing, project and running production. The job requires frequent travels during certain periods. \n \nYour Background In this recruitment, we will have a high focus on the mindset and personality. We are looking for someone that embraces problems and sees it as learning opportunities. You have a collaborational mindset and willingness to share ideas.\nFurther you have a great interest in the quality area with a good knowledge of automotive quality standards. Customer satisfaction is important for you while remaining structured and organized. \nQualifications \n  MSc or BSc in Engineering or equivalent, and 6 years of work experience needed \n Good knowledge and practice of automotive quality standards and tools, such as IATF 16949, VDA, APQP, PPAP, ISO 9001.\n Knowledge in ASPCE and ISO 26262\n Experience in assessing suppliers in the software and hardware domains\n Experience from supplier quality work\n Good English communication skills, both orally and in writing\n Drivers licence\n Meriting with engineering work\n Qamcom offers\nWe are proud to offer a work environment with highly competent and experienced colleagues. We create teams with a unique blend of high academic competence and rich industry experience. In our in-house projects we often create cutting-edge system solutions that encompass hardware, software, and algorithms tailored for industrial and medtech applications. Hence, we provide the possibility to apply advanced technology in various product development projects focusing on a variety of business segments like medtech, industry 4.0 and Industrial IoT and AI. \nAdditionally, a sample of general benefits are listed below:\n Competitive insurance and pension program.\n Generous parental leave (90% of the salary).\n Wellness policy (up to 5000 SEK/year).\n Leasing of a bicycle and option for an employee car (electric or hybrid).\n \nJoin us at Qamcom, where your expertise will contribute to shaping the future of technology and innovation.",
        "url": "https://career.qamcom.com/jobs/5358781-supplier-quality-engineer-with-experience-in-software?promotion=1348393-arbetsformedlingen",
        "published": "2025-02-18T15:11:38",
        "deadline": "2025-08-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]