[
    {
        "id": "29869715",
        "title": "Founding Data Scientist",
        "employer": "Cerve Holding AB",
        "location": "Göteborg",
        "description": "About Cerve\nAt Cerve, our mission is to power a digitally-enabled global food system. We believe that creating a sustainable and resilient food system hinges on making data accessible and transparent. By democratising data and fostering connectivity, we empower organisations to build solutions that reduce waste, improve food security, drive growth and optimise operational efficiency.\nAbout the role\nAs a Founding Data Scientist, you will help shape the future of data at Cerve. You’ll be instrumental in building the foundation of our data science function, from designing scalable data pipelines to applying cutting-edge AI techniques, including LLMs, to solve key business problems.\nYou’ll collaborate closely with product, engineering, and commercial teams. This is a high-impact, high-ownership role ideal for someone who thrives in fast-paced, cross-functional environments and enjoys solving open-ended problems from first principles.\nWhat you’ll do\nAs a Founding Data Scientist at Cerve, you will be a core part of our newly established data team, responsible for building data capabilities from the ground up and applying advanced analytics to power our product.\nDesign, build and maintain scalable data pipelines (ETL) for ingestion, cleaning and storage.\nDevelop systems for collecting and integrating structured and unstructured data from internal and external sources.\nApply machine learning, statistical modelling and AI techniques to real-world challenges.\nDevelop tools to automate data processing, decision support and forecasting.\nHelp architect the end-to-end data ecosystem from ingestion to reporting.\nIdentify areas for automation and assist in deploying production-ready solutions.\n\nYou are\nAutonomous: You are comfortable in small teams where you are expected to take full ownership of your projects, driving them from concept to completion.\nDetail-Oriented: Focused on ensuring tasks are completed accurately and on time.\nResilient: Approach challenges and setbacks with a problem-solving mindset and determination to succeed.\nCollaborative: You’re excited to work in a team, learning and growing from shared successes and failures.\nThriving in Ambiguity: Uncertainty motivates you. You embrace complex challenges that often raise more questions than answers.\n\nYou have\nA minimum of 2 years of experience in data science, applied machine learning or analytics roles.\n2+ years of experience working with Large Language Models (LLMs) and other modern AI techniques.\nStrong proficiency in Python and SQL for data analysis and pipeline development.\nFamiliarity with cloud platforms (GCP, AWS, or Azure).\nExperience working with APIs or integrating external data sources.\n[+] A background or strong interest in supply chains, food systems, or sustainability (nice to have).\n\nWe offer\nSalary: Competitive\nBonus: Potential of company-wide annual payment\nFlexible Vacation: 25 days, Bank holidays and Special days\nFlexible hours: Choose your working hours around core hours (9:30 – 15:30 GMT)\nCareer Development: Opportunity to progress within a high pace and growth environment\nHybrid Workspace: Hybrid working from our Hub in Gothenburg\nPension: Auto enrolment into our pension scheme\nBest Tech and Equipment: Macbook and whatever else you need to do your best work\n\nWe are committed to creating a diverse and inclusive workplace where everyone feels welcome and valued. We believe that diversity of thought and experience is essential to our success, and we are particularly interested in candidates who can bring a different perspective to our team, regardless of their race, ethnicity, gender, sexual orientation, gender identity, disability, or career status.",
        "url": null,
        "published": "2025-07-31T17:08:50",
        "deadline": "2025-08-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29862918",
        "title": "HIL Developer - Automotive",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "HIL rig developer for AD system verification and validation\n\n\nThe right candidate should have the following key competencies for the position:\n* Experience of HIL development in HIL rigs for real-time systems\n* Good knowledge of equipment for electronics system or component testing\n* Experience with development of high-quality, production-level software\n* Skilled C/C++ programmer in Linux environments\n* Very good understanding of software tool chains\n* Be proactive in suggesting enhancements and technological choices in HIL rig development and HIL testing as well as experience in automation to ease the day to day tasks\n* Should have had exposure to large scale simulation environment & DevOps\n* Preferably experience in communication protocol, DDS, REST API, UDS, Ethercat\n* Basics of CAN (e.g. J1939) protocol and Canalyzer, CANOE, CAPL\n* Preferably knowledge of perception sensors autonomous driving such as lidar, radar and camera\n* Experience of simulation for AD/ADAS, HIL rigs, and test automation tools, i.e. Carla, from dSpace, Vector, or NI",
        "url": "http://www.skillhuset.se",
        "published": "2025-07-28T21:57:50",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29862916",
        "title": "Senior Embedded Software Engineer",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "Mid- Senior Embedded Software Engineer with Android, C++ and Python as their main language as well us an understanding of system architecture.\nTeam works with Build configuration, Android version bring up and SW complexity reduction\nTo be successful in this role, your experience must include: \n\t•\tEmbedded Software Development of complex software products using C++ and Python.\n\t•\tEmbedded OS or Linux experience.\n\t•\tDevelopment within android platform\n\t•\tWorking experience in a CI environment.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n\t•\tCoordinate and communicate with the CI teams to enable the new hardware support quickly and smoothly.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n \nWe'd also prefer if you have: \n\t•\tA Driver’s license (B-level) will also be ideal.\n\t•\tExperience from Automotive Infotainment domain\n\t•\tTest automation experience using Pytest\n\t•\tPrevious working experience with android uplift",
        "url": null,
        "published": "2025-07-28T21:57:05",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29836454",
        "title": "Software Engineer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Who We Are\nEtraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights and TUI.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 2000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Canada, Greece, India and Poland.\nLife at Etraveli Group\nDepending on how you want to grow we want to listen in on your future career plan. To be able to inspire you to be your best within a fast moving industry we work hard to provide for the best prerequisites to make you feel that you belong together with us on our journey.\nDo you want to be part of it?\nIn alignment with the growing targets and needs, we are currently on the lookout for a highly proficient and seasoned AWS Cloud Engineer to become a valued member of our team Platform in Gothenburg. As an AWS Cloud Engineer, you will play a crucial role in creating and managing AWS environments. You will work closely with our development and operations teams to design, implement, and maintain robust and scalable cloud infrastructure solutions.\nResponsibilities\nMaintain, design and implement AWS cloud environments and the AWS Landing Zone. \nCollaborate with development and operations teams to understand system requirements and translate them into cloud infrastructure designs.\nUse AWS CDK and AWS CloudFormation to provision, configure, and manage AWS resources, including compute instances, storage, networking, and security components.\nImplement and optimize infrastructure-as-code practices to ensure efficient and consistent provisioning of AWS resources.\nWork with DevOps tools and practices to automate the deployment, monitoring, and management of AWS environments.\nPerform regular system monitoring and performance tuning to ensure high availability, reliability, and scalability of AWS infrastructure.\nCollaborate with security teams to implement and maintain robust security controls and best practices within AWS environments.\nTroubleshoot and resolve issues related to AWS infrastructure, networking, and application deployments.\nStay up-to-date with the latest AWS services, features, and best practices and evaluate their potential impact on our infrastructure.\nDocument AWS architecture, configurations, and processes for knowledge sharing and future reference.\n\nRequirements\nProven experience of at least 4 years as an AWS Cloud Engineer, with a focus on designing and deploying cloud infrastructure.\nStrong knowledge of AWS services and features, including compute, storage, networking, databases, and security. Proficiency in infrastructure-as-code tools such as AWS CDK, Cloudformation and Terraform for provisioning and managing AWS resources.\nExperience with DevOps practices and tools, including CI/CD pipelines, configuration management, and containerization.\nSolid understanding of networking concepts, including VPCs, subnets, routing, load balancers, and security groups.\nFamiliarity with monitoring and logging tools for AWS, such as CloudWatch, CloudTrail, and OpenSearch.\nExperience with Kubernetes for container orchestration and management.\nStrong problem-solving and troubleshooting skills with the ability to identify and resolve complex technical issues.\nExcellent communication and collaboration skills to work effectively with cross-functional teams.\nAWS certifications (e.g AWS Certified Solutions Architect, AWS Certified DevOps Engineer) are a plus.\n\nJoin our team and be part of an exciting journey to build and deploy cutting-edge green field systems on the AWS cloud. We offer a collaborative and innovative work environment with opportunities for professional growth and development.\nBenefits\n﻿When working at Etraveli Group you will always feel that you are trusted and that you can rely on others to help you. To work together as a team and feel that you are challenged in a way that helps you evolve within your profession. You will have awesome colleagues together with whom you will solve complex problems in a fast-moving business. But not just that.\nWhat else do we offer?\nBrand New Office in the City, located in the heart of Gothenburg at Merkurhuset, close to public transport and great lunch spots\nInclusive Culture Celebrating Diversity; a vibrant team representing many nationalities and cultures as well as regular cultural events and celebrations to share traditions from around the world\nAfterworks & social gatherings to unwind, socialize, and strengthen team bonds\nBreakfast at the Office every morning to start the day right\nConferences, Workshops and other opportunities for personal and professional growth\nWellness Benefit; annual healthcare allowance for gym memberships, massages, or other wellness activities, as per Swedish Tax Agency guidelines.\nComprehensive Pension and Health Insurance; full coverage through partners, ensuring quick assistance in case of illness or injury.\nHackathons and Dev Week\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/EF782D4D5E/apply",
        "published": "2025-07-15T08:08:20",
        "deadline": "2025-08-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29832272",
        "title": "System Developer",
        "employer": "Autonomous Vision AB",
        "location": "Göteborg",
        "description": "Autonomous Vision is a leading technology company specializing in innovative software solutions for the automotive industry. We collaborate closely with top automotive manufacturers and suppliers to deliver cutting-edge embedded systems, control algorithms, and AI-driven safety applications. With a strong focus on quality, innovation, and sustainable development, Autonomous Vision is driving the future of automotive technology. Join us and be part of a team committed to excellence and making roads safer worldwide.\nPosition Overview:\nSystem Developer – Automotive Systems (Gothenburg)\nAbout the Role\n We are seeking a skilled and driven System Developer to join our innovative Automotive team in Gothenburg. In this role, you will be instrumental in developing robust system solutions aligned with technical and functional requirements across various domains within the vehicle architecture.\nKey Responsibilities\nLead and participate in the development of system solutions that meet agreed cross-functional targets.\nEnsure technical solutions align with specified system and customer requirements.\nAnalyze, structure, and decompose system-level requirements into executable elements within Car Weaver (System Weaver).\nCollaborate closely with cross-disciplinary teams and stakeholders throughout the system development lifecycle.\n\n\n\nYour Profile\nBachelor’s or Master’s degree in Electronics, Software Engineering, Mechatronics, or related fields.\nMinimum 2 years of experience in system engineering or strong background in electrical system knowledge through software testing.\nExperience in system development and system integration is a valuable asset.\nStrong analytical skills with a solution-oriented mindset.\nExcellent communication skills and fluency in English (spoken and written).\nValid driver’s license (category B) or strong intent to obtain one in the near future.\n\nPreferred Qualifications (Meritorious Skills)\n We highly value additional experience or familiarity with the following:\nSimulation and Model-Based Design (MATLAB/Simulink)\nSystem Weaver and Elektra\nVehicle communication protocols (CAN, LIN, FlexRay, Ethernet)\nKnowledge of automotive standards, such as:\nISO 26262 – Functional Safety\nISO 21434 – Automotive Cybersecurity\n\n\n\nIn return for bringing your expertise to our business we offer a competitive salary along with excellent benefits including:\nPrivate Health Insurance\nParental Leave\nContinued Training (through our internal portal and external resources)\nSick Leave\nFlexible Working Hours (Flex Time)\nPension Scheme\nEmployee Referral Scheme\n25 Days of Holiday plus Bank Holidays\n\n\n\nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\nAutonomous Vision: Shaping the Future of Safer Mobility.\nWe sincerely thank all applicants for their interest in joining Autonomous Vision. Every application will be carefully reviewed based on the role’s criteria. Please note that only candidates selected for further consideration will be contacted. If you do not hear from us within 10 business days of your application, it means you have not been selected at this time. However, we will keep your profile on file for any suitable future opportunities.\n\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://www.autonomousvision.se",
        "published": "2025-07-11T23:11:10",
        "deadline": "2025-08-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29806984",
        "title": "DevOps Engineer",
        "employer": "Opera Sweden AB",
        "location": "Göteborg",
        "description": "Opera Sweden is looking for a DevOps Engineer with a passion for learning and technology to join our team in Gothenburg where you get to build great products together with our best engineers. Experimenting with new technology is in our DNA and our collaborative team is constantly trying to find better ways to build quality products. In the current project we have chosen to go with AWS and invested a lot in SaaS and CI/CD. You will be working in a supportive team with an agile workflow. Together with the rest of the engineering team you will be part of design reviews, sprint planning, weekly sprints and delivery. The team is currently located in Gothenburg in a cozy office in the city center.\nRole & Responsibilities:\nSupport the engineering team when it comes to tools, CI and CD\nBuild monitoring and reporting for the project\nSet up the framework for incident management and recovery\nCooperate with the development team to build the SDLC framework for the project\nCreate a release plan with the management team and developers\nMaintain existing infrastructure and create new solutions\nAdvocate DevOps best practices in the organization\n\nJob Requirements:\nBS or MS in Computer Science or equivalent degree\nAt least 2 years of recent employment in a DevOps role in the enterprise environment\nSolid knowledge of AWS is a must\nExperience with deployment and delivery of web and generic server applications\nAbility to build the infrastructure from scratch\nFamiliarity with mainstream CI/CD and SaaS: Docker, Jenkins, Kubernetes, Terraform\nExperience with load balancing and CDN, administration of Linux systems\nFluent in English\n\nAn Ideal Candidate’s Profile:\nFamiliar with monitoring tools such as Grafana, Loki, Prometheus\nClose-to-expert knowledge of git, experience with python, shell scripting and high availability systems\nCurrently living in Gothenburg or willing to relocate\n\nWhat’s on Offer:\nFlat organizational structure with short decision-making processes that boost your creativity and drive\nA team of experienced and supportive individuals that fosters a friendly work atmosphere\nProfessional skill development\nA diverse and inclusive workplace\nSmart working technology",
        "url": "https://jobs.opera.com/jobs/6060392-devops-engineer",
        "published": "2025-07-02T12:29:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795902",
        "title": "Game Engineer (AI Team)",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Game Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking a Game Engineer to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nMindark is the pioneering force behind Entropia Universe, a dynamic and evolving virtual world where players engage in a vast array of activities, from commerce to exploration and beyond. With a strong emphasis on player-driven economies and real cash economy integration, we're at the forefront of shaping the future of MMORPG games. We value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Game Engineer, you'll play a pivotal role in developing and enhancing game features to take Entropia Universe to the next level. Your responsibilities will include designing, implementing, and optimizing game systems. A key aspect of this role is working extensively with new AI technologies inside our dedicated AI Team. This includes Transformer tech, large language models, and agentic frameworks, as well as current gamesystems. Your interest and expertise in these cutting-edge AI technologies and games will be crucial as you collaborate closely with multidisciplinary teams, to deliver high-quality features and advancements.\n\n\nResponsibilities: \nWork extensively with advanced AI technologies, such as Transformers and agentic frameworks, to innovate and improve current and new AI features in the game.\nDevelop and integrate current and new game systems to support and enhance gameplay features and functionalities.\nParticipate in code reviews and contribute to maintaining high coding standards.\nCollaborate with cross-functional teams to integrate new game mechanics and features.\nImplement security protocols and measures to safeguard game-related data.\nTroubleshoot and resolve technical issues related to game systems.\nBe flexible and open to work with all parts of the technical ecosystem.\n\n\n\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field.\nA few years of experience within the field. \nCreative thinker with a passion for games and a drive to innovate within the gaming space.\nProficiency in C++.\nProficiency in Python is a strong plus. \nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks.\nKnowledge of game development principles and methodologies.\nProblem-solving and communication skills.\nBeing flexible and able to work with a larger technical ecosystem.\n\n\n\nWhy Join Mindark: \nWork on a massively multiplayer online role-playing game with active players from around the globe.\nCollaborate with a talented and diverse team of gaming enthusiasts.\nCompetitive compensation package with opportunities for growth and development.\nA dynamic work environment that fosters creativity and innovation.\nAn inclusive work culture that values diversity and innovation.\nBeing able to work with cutting edge technologies that have not even hit the MMORPG games field yet.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: We would like you to be able to come into the office two days a week to Mindark Headquarters in Gothenburg, Sweden.",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-06-26T16:17:35",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787419",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-06-24T07:59:12",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29786070",
        "title": "Linux och Open Source entusiast",
        "employer": "Combitech AB",
        "location": "Göteborg",
        "description": "Vi söker Linux och open source entusiaster till Combitech i Göteborg. Hos oss får du möjlighet att växa i en företagskultur som uppmuntrar både professionell och personlig utveckling samt anställningstrygghet och balans i livet. Som medarbetare på Combitech i Göteborg är du med och utvecklar framtidens digitaliseringslösningar för industri och samhälle.\n\n \n\n \n\nDin roll som utvecklare\n\nDu kommer att vara en del av ett team som tillsammans utvecklar mjukvarulösningar för datainsamling, datalagring, analys, automation, AI samt flera typer av visualiseringar. Lösningarna teamet bygger används i stora projekt inom t.ex. offentlig verksamhet, processindustri och industri 4.0. Målet är att kunderna (baserat på data) ska få djupare insikt i sin verksamhet och därigenom effektivisera sina processer. Teknik- och komponent-stacken baseras på olika Open Source Communities, så som CNCF, som vi kompletterar med egenutvecklade applikationer.\n\n \n\nVåra uppdrag innebär att man bygger moderna system för att skapa lösningar som är innovativa och framtidssäkra för våra uppdragsgivare. Vi jobbar både med infrastruktur och applikationsutveckling vilket gör att våra medarbetare får både en bredd och djup inom olika relevanta mjukvaruteknologier. Exempel på ramverk, verktyg och tekniker som används är Docker, Kubernetes och Helm som grund vilka kompletteras med t.ex. Kafka, Quarkus med NodeJS och React. Programmeringsspråk som oftast används är TypeScript, Python, Java och Go.\n\n \n\n \n\nVem är du?\n\nVi söker dig som är kreativ och drivs av att ligga i teknikens framkant vad gäller verktyg och koncept. Du har ett stort intresse för FOSS (t.ex. CNCF, LF) och följer med i dess nyheter och diskussioner. Vi ser gärna att du är en daglig användare av Linux sedan något år tillbaka (antingen från skolan, tidigare tjänst eller fritiden). Som person trivs du med att vara en lagspelare i ett effektivt team som hjälper kunderna att skapa nya möjligheter.\n\n \n\nLämplig utbildningsprofil är Civilingenjör eller Högskoleingenjör med inriktning i Datateknik eller Informationsteknik eller annan Civilingenjör/Universitetsutbildning med inriktning inom programvaruutveckling och IT infrastruktur. Vi välkomnar både erfarna ingenjörer och ingenjörer som är i början av sin karriär.\n\n \n\nDå tjänsten innebär arbete som kan omfattas av försvarssekretess krävs det att du genomför och godkänns i en säkerhetsprövning. \n\nUrval sker i Augusti. Vi ser fram emot din ansökan!\n\n \n\n \n\nKom & gör skillnad\n\nVi tror att man gör ett bättre jobb om man kan fokusera på rätt saker, därför gör vi det lätt att kombinera jobbet med vardagen. Vi satsar på våra medarbetare, de utgör kärnan, hjärnan och hjärtat i vår verksamhet. Dessutom står vi på en stadig grund av högteknologi, forskning och anställningstrygghet med försvars- och säkerhetskoncernen Saab som ägare.\n\n \n\nFör oss handlar det om hållbarhet - vi vill bli branschens mest hållbara företag; och för att vara ett hållbart företag i en hållbar framtid behöver vi investera i våra medarbetare. För oss är din återhämtning, dina utvecklingsmöjligheter och din trygghet lika viktigt som företagets framgång - utan våra medarbetare står vi stilla.\n\n \n\nVill du veta mer om hur det är att arbeta hos oss? Kolla in våra karriärsidor!\n\n \n\nKontaktpersoner: Ingvar Andersson ingvar.andersson (@) combitech.com",
        "url": "https://www.aplitrak.com/?adid=am9sc3Nvbi4wMzczMi4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2025-06-23T14:00:47",
        "deadline": "2025-08-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 99
    },
    {
        "id": "29784165",
        "title": "Java-utvecklare till innovativt företag",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Bli en del av Yoin Technologies, ett ungt och snabbväxande techbolag som erbjuder IT-tjänster. Vi söker en engagerad systemutvecklare med kunskaper inom Java. Kom och bli en del av vårt team.\n\nDitt jobb på Yoin Technologies\n\nDitt främsta uppdrag blir att assistera kunder och ta deras tekniska miljöer till nästa nivå. Beroende på din erfarenhetsnivå kommer du antingen hantera uppdateringar och vidareutveckling av kunders miljöer eller få ett större ansvar och sköta processen när kunden byter från en klassisk driftsmiljö till en modernare cloud/azure-miljö. Oavsett vilken del av processen du tar dig an kommer du att stötta kundens utvecklingsteam med best practices för deployment, migrering av applikationer och tjänster samt miljöuppsättning.\n\nDå Yoin Technologies bedriver inkubatorverksamhet kan du se fram emot en hel del spännande projekt. Genom sina breda kunskaper och sitt stora nätverk gör man det möjligt för drivna entreprenörer att förverkliga sina idéer. Här blir du en viktig pusselbit i arbetet med att testa gångbarheten och ta fram prototyper för att se om idén har bärkraft. \n\nI dagsläget består Yoin Technologies av 20 stycken erfarna utvecklare och du kommer jobba tätt ihop med alla. Vilket team du jobbar i beror på projektet, men målet är att alltid arbeta i ett team om minst 3-4 personer som tillsammans jobbar mot samma projekt och kund. \nFrån start kommer några av dina närmsta kollegor bli Marcus, Peter och Fredrik.\n\nÄr det här du?\n\nFör att lyckas i den här rollen har du minst en 3-årig akademisk utbildning och 5 års erfarenhet inom utveckling i Java efter examen. Du behöver också behärska svenska flytande i tal och skrift.\n\nPå Yoin Technologies är vi övertygade om att en stark laganda och samarbete är nyckeln till framgång. Som systemutvecklare hos oss kommer du att vara en del av en engagerad och hjälpsam grupp som stöttar varandra. Vi tror på din förmåga att vara självgående och ta egna initiativ. Här får du inte bara möjlighet att utveckla dina tekniska färdigheter, utan också vara en del av en trivsam arbetsmiljö där vi värdesätter arbetsglädje och social sammanhållning.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Yoin Technologies. Det är viktigt att klargöra att rollen är för Yoin Technologies och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-yoin-technologies-goteborg-2?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:33",
        "deadline": "2025-08-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29784180",
        "title": "Erfaren systemutvecklare inom IT och industri",
        "employer": "Jobnet AB",
        "location": "Göteborg",
        "description": "Engagerad utvecklare till företag i teknisk framkant. På Prevas blir du del av ett familjärt gäng som varvar hållbart förbättringsarbete med en och annan lekfull aktivitet.\n\nDitt jobb på Prevas\n\nPå Prevas i Göteborg är det en grupp som specialiserat sig på att utveckla robusta, pålitliga och kundanpassade systemstöd för produktion. Arbetet drivs ofta i projektform och dessa kan variera i både inriktning och storlek.\n\nDin roll blir att tillsammans med andra utvecklare hitta lösningar och skapa effektiva stöd för industriella processer. Här tar du hjälp av dina kunskaper i .NET och din förståelse för systemintegration för att identifiera behov och fastställa kravspecifikationer. Du deltar i allt ifrån tekniska förstudier, design, utveckling och installation till support, underhåll och vidareutveckling samt förvaltning av mjukvara för effektiv produktion. I stora drag kan man säga att du kommer jobba med både systemering och programmering.\n\nI ditt arbete får du uppbackning av kollegor som Olle, Björn, Martin, Robert, Elisabeth och Helena.\n\nÄr det här du?\n\nFör att passa i rollen behöver du ha en civilingenjör/högskoleingenjörsexamen och minst fem års erfarenhet av utveckling och leverans av IT-lösningar inom kritisk drift. Du får gärna ha känsla för både .NET, SQL Server och Oracle Server. Om du dessutom förstår det här med systemintegration och kan tillämpa olika datautbytesmetoder är det ett stort plus.\n\nDitt engagemang och stora intresse för teknik är vad som sporrar dig att hitta nya lösningar och effektiva stöd. Det är bra om du har lätt för att kommunicera, interagera med andra och känner igen dig i egenskaper som kundorienterad och lösningsorienterad Känner du dig dessutom som en kreativ person med förmågan att vara analytisk och ha ett öga för detaljer så har du hamnat rätt.\n\n***\n\nGå in direkt och gör en anonym lönematchning: \nhttps://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen\n\n***\n\nVia länken hittar du bilder, förmåner och mer information om tjänsten på Prevas. Det är viktigt att klargöra att rollen är för Prevas och att Jobnet endast fungerar som plattform för din ansökan.",
        "url": "https://jobnet.se/systemutvecklare-programmerare-prevas-goteborg?utm_source=arbetsformedlingen",
        "published": "2025-06-22T20:15:31",
        "deadline": "2025-08-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29782051",
        "title": "Systemutvecklare",
        "employer": "YH Akademin AB",
        "location": "Göteborg",
        "description": "Störst i Sverige på Yrkeshögskoleutbildningar på distans. Genom åren har tusentals personer tagit sig vidare i karriären hos oss. Vi finns för dig som vill utvecklas i ditt yrke, göra ett karriärbyte eller ta steget ut i arbetslivet. Tillsammans med näringslivet stärker vi kompetensen i hela Sverige.\r\n\r\nVill du vara med och forma digitala lösningar för vår utbildningsverksamhet? Då är vi rätt plats för dig!\n\nYH Akademin är en av Sveriges större anordnare av Yrkeshögskoleutbildning. Vi har ca 70 YH-utbildningar inom många olika branscher, nästan alla med ett distansupplägg eller nätbaserat upplägg som vi kallar det. Vi är en engagerad grupp om ca 100 medarbetare i hela landet och från/i olika branscher som skapar efterfrågad tillgänglig yrkesutbildning. Vi arbetar innovativt och försöker hitta de bästa metoderna att erbjuda lärande.\n\nOm tjänsten\n\nVi letar efter en passionerad och kreativ systemutvecklare som vill bli en del av vårt dynamiska och växande team. Hos oss kommer du att arbeta med spännande projekt där du får möjlighet att påverka och bidra till att skapa innovativa lösningar som gör skillnad.\n\nDina arbetsuppgifter\n\n• Utveckla och underhålla applikationer och system. \n• Samarbeta med olika team för att förstå verksamhetskrav och omvandla dem till tekniska lösningar. \n• Delta i hela utvecklingscykeln – från design till lansering och drift. \n• Hålla dig uppdaterad med de senaste teknologierna och implementera dem i vårt arbete. \n• Hantera och lösa tekniska utmaningar för att säkerställa hög kvalitet och prestanda. \n\nVem är du?\n\nVi söker dig som har:\n\n• En eftergymnasial utbildning inom IT, datavetenskap eller motsvarande erfarenhet. \n• Kunskap och erfarenhet inom programmering (gärna PHP) och mjukvaruutveckling. \n• Kunskap och erfarenhet inom API-integrationer är meriterande. \n• Förmåga att arbeta i team såväl som självständigt. \n• Ett lösningsorienterat tankesätt och en stor vilja att lära dig nya saker. \n• God kommunikationsförmåga, både på svenska och engelska. \n• Det är meriterande om du har erfarenhet av utbildningsverksamhet och gärna yrkeshögskola. \n\nVad erbjuder vi?\n\n• En inspirerande arbetsmiljö där innovation och samarbete står i fokus. \n• Möjligheten att arbeta med spännande projekt och den senaste tekniken. \n• Flexibla arbetstider med möjlighet till distansarbete. \n• Kompetensutveckling genom utbildningar och konferenser. \n• En arbetskultur där din röst verkligen räknas och där vi värdesätter mångfald och inkludering. \n\nTillträde\n\nAugusti/September 2025 eller efter överenskommelse.\n\nOmfattning\n\nTillsvidare anställning, 100% heltid eller efter överenskommelse\n\nArbetsort\n\nDu kan själv välja om du har din huvudsakliga arbetsplats hemma eller på ett kontor då vi främst jobbar nätbaserat.",
        "url": "https://yh.se/lediga-tjanster/?jobid=296958&ref=platsbanken",
        "published": "2025-06-19T12:17:17",
        "deadline": "2025-08-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661571",
        "title": "Verification Engineer HIL - Göteborg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Är du en metodisk och nyfiken ingenjör med passion för problemlösning och HIL-verifiering? Nu har du chansen att bli en del av ett högteknologiskt team hos vår kund inom fordonsindustrin, där du får arbeta i framkant med framtidens styrsystem och testmiljöer.\nOm uppdraget: I rollen som Verification Engineer HIL kommer du att arbeta med utveckling och underhåll av HIL-simuleringsmiljöer, skriva testspecifikationer, skapa testfall samt genomföra och analysera tester. Du kommer att samarbeta tätt med funktionsutvecklare och bli en nyckelperson i att säkerställa kvaliteten i fordonets dynamiksystem.\nKravprofil:\n- Civilingenjörsexamen inom elektronik, mekatronik, mekanik eller fysik - Erfarenhet av modellbaserad utveckling och verifiering - Grundläggande kunskap om HIL-hårdvara - God kännedom om dSPACE-verktyg: ControlDesk, AutomationDesk, MotionDesk/Aurelion och ASM - Erfarenhet av CI/CD-processer, gärna med Jenkins - Kunskaper i Python och Matlab/Simulink \nMeriterande:\n- Erfarenhet av att sätta upp CI/CD-flöden i Jenkins - Fordonsdynamikkompetens - Erfarenhet av simulering av mekatroniska/pneumatiska system",
        "url": "https://careers.progalaxy.se/jobs/5858126-verification-engineer-hil-goteborg?promotion=1447500-arbetsformedlingen",
        "published": "2025-04-28T13:20:15",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603174",
        "title": "Control Systems Engineer / Vehicle Motion Control Engineer",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are expanding our team of skilled control engineers to strengthen our current services within Vehicle Motion Control in Gothenburg. We are looking for you who want to be part of this journey!\nWho are we? Combine Control Systems is a leading supplier of high-quality engineering services within Data Science and AI, Software development, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking for a technical expert within the domain of Vehicle Motion Control to our Gothenburg office to take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Gothenburg, Lund, and Linköping, with our headquarter being in Gothenburg.\nWhat can we offer? Exciting assignments within various industries, ranging from the automotive industry to the railway industry. The flexibility of taking on the most exciting assignments without being locked to a single product. The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about control systems, Data Science, and AI. The flexibility and friendly atmosphere of a smaller company. Our employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks, and projects and expand their knowledge in a supportive and helpful way.\nWhich skills do you need to join the team? We are looking for someone with extensive and hands-on experience within the field of vehicle motion control for automotive applications. We believe you have experience from model based design and are a true believer that virtual verification is the way to go. We believe that you appreciate working within, or leading project teams. You like having fun and respect and trust your team as much as your knowledge. For us, personality speaks loudest and we are strong believers that knowledge can be taught.\nQualifications\n Master’s degree or PhD in relevant field.\n Extensive experience from the field of Vehicle Motion Control\n Experience from several of the following: Stability Control, Vehicle State Estimation, Longitudinal Control, Lateral Control\n MPC, EKF, UKF, Kalman Filter\n Matlab/Simulink, Dymola, Modelon Impact, FMU, Co-simulation\n  \n Strong communication and teamwork abilities.\n \nWho are you? We believe that you are positive and social. For you, the work-life balance is important and you like to share your hobbies and interests which you are passionate about with others. You believe in never stop learning and love the challenge that comes with it.\nIf you want to join our team, do not hesitate to apply!",
        "url": "https://combine.teamtailor.com/jobs/4741171-control-systems-engineer-vehicle-motion-control-engineer?promotion=1413957-arbetsformedlingen",
        "published": "2025-04-04T09:08:15",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29603157",
        "title": "Data Engineer / Machine Learning / AI / Cloud",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "About Combine At Combine Control Systems, we are passionate about technology and innovation. We specialize in creating innovative technology that empowers industries and shapes the world around us. Our pursuit of staying at the forefront of the rapidly changing tech world drives us to develop and work with the latest tools and techniques in areas such as Data Science, AI, embedded systems, and control engineering. We offer exciting and diverse challenges at the cutting edge of technology and create an inspiring work environment where our employees thrive and have the opportunity to grow and develop. Together, we form a team of dedicated and skilled engineers and experts who are passionate about technology and innovation. As we continue to expand our horizons, we are seeking a passionate and talented Data Science Engineer to join our dynamic team in Gothenburg. \nWhat can we offer you? Joining our team means becoming part of a community that values openness, creativity, and trust. We embrace teamwork and welcome your contribution. At Combine, we encourage personal development, provide opportunities to explore new domains, and offer an inspiring and inclusive workplace.\nTechnically challenging projects - You will be part of exciting and technically challenging projects. You will work with the latest technologies and tools in Data Science and AI/Machine Learning. We give you the opportunity to challenge yourself and grow in specialized areas.\nInspiring work environment - Here, you will be surrounded by like-minded and enthusiastic colleagues. We promote collaboration and knowledge sharing to create a dynamic and rewarding work environment.\nProfessional development - We invest in our employees and provide opportunities for skills development and further education to help you grow in your career.\nYour role As a Data Engineer at Combine, you are a crucial part of our team. You will work with clients from various industries and sectors, where data is at the core of every project. Your role involves adapting existing tools/packages to create automated pipelines in the cloud, following industry best practices. You will analyze data to address stakeholders' questions, monitor data, and create/update reports or dashboards. Additionally, you will collaborate closely with stakeholders and support cross-functional teams.\nQualifications\n  Master's degree in areas related to computer science, information technology, or equivalent. \n Proficiency in Python and/or Scala. Experience with SQL and NoSQL databases.\n Experience with Git, CI/CD, and Data/DevOps. \n At least two years of experience working with large datasets using cloud technologies such as AWS, GCP, or Azure. \n Very good skills within the English language, both spoken and written.  Preferred Qualifications \n Experience with Databricks, Spark, Snowflake, etc., is advantageous. \n \nWho are you? We are looking for a versatile and talented individual who enjoys collaboration, embraces challenges, and appreciates a holistic approach to problem-solving. If you enjoy exploring new areas, value teamwork and can communicate technical knowledge to colleagues and stakeholders at different domains and technical levels, you are the right person for our team. \nWe look forward to receiving your application!",
        "url": "https://combine.teamtailor.com/jobs/4961523-data-engineer-machine-learning-ai-cloud?promotion=1413941-arbetsformedlingen",
        "published": "2025-04-04T09:03:45",
        "deadline": "2025-09-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29573819",
        "title": "Systemutvecklare",
        "employer": "Sylog Väst AB",
        "location": "Göteborg",
        "description": "Systemutvecklare/DevOps Ingenjör med mer än 6 års erfarenhet inom nedan område: \n Java, .NET/C#, Spring, Golang, TypeScript, React, SQL, Oracle, CI/CD tools, Kubernetes, Docker, AWS, Azure",
        "url": null,
        "published": "2025-03-25T13:48:05",
        "deadline": "2025-09-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29817376",
        "title": "Microsoft Power Platform-utvecklare – Göteborg",
        "employer": "Ecareer AB",
        "location": null,
        "description": "Vill du vara med och förbättra affärskritiska processer med hjälp av Power Platform? Vi söker en senior utvecklare eller lösningsarkitekt som brinner för att skapa robusta, effektiva och användarvänliga appar i en Microsoft-miljö.\n\nOm rollenDu kommer in i ett befintligt utvecklingsteam där fokus ligger på att vidareutveckla interna verktyg för hantering av personalflöden – främst onboarding och offboarding. Ditt uppdrag blir att analysera, förbättra och optimera lösningar byggda i Power Platform, både tekniskt och funktionellt.\nUppdraget passar dig som gillar att arbeta nära verksamheten, samtidigt som du har koll på tekniska detaljer som påverkar prestanda, användarupplevelse och underhåll. Du förväntas bidra med både problemlösning och nyutveckling i en miljö som kräver kvalitet och långsiktighet.\n\nI rollen kommer du bland annat att:  Vidareutveckla och optimera lösningar i Power Apps och Power Automate\n Utreda och åtgärda tekniska fel och prestandaproblem\n Arbeta med datamodellering, logik och integrationer (t.ex. med Azure AD, MS Graph eller interna API:er)\n Samarbeta med andra utvecklare, verksamhet och supportteam\n Dokumentera lösningar och bidra till att höja den tekniska standarden\n \n\nVi söker dig som har:  Minst 5 års erfarenhet av arbete med Microsoft Power Platform (Power Apps, Power Automate, Power BI)\n God kunskap om Dataverse, SharePoint, Azure AD och relaterade Microsoft 365-tjänster\n Erfarenhet av att felsöka och förbättra befintliga lösningar\n Stark förmåga att arbeta strukturerat med krav, logik och användarflöden\n Vana av att arbeta i team och kommunicera med olika typer av intressenter\n \n\nMeriterande erfarenheter:  Erfarenhet av lösningsarkitektur eller teknisk lead-roll\n Kunskap om CI/CD i Power Platform-miljöer (t.ex. med Azure DevOps)\n Tidigare arbete med processautomation inom HR eller liknande områden\n Certifiering som PL-100, PL-400 eller PL-600\n \n\nÖvrig information:Placeringsort: Göteborg",
        "url": "https://jobb.ecareer.se/jobs/6143695-microsoft-power-platform-utvecklare-goteborg?promotion=1544415-arbetsformedlingen",
        "published": "2025-07-07T15:25:28",
        "deadline": "2025-08-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29701269",
        "title": "Lead Developer Dynamics 365 Customer Engagement",
        "employer": "Fellowmind Sweden AB",
        "location": "Malmö",
        "description": "Forma framtidens kundupplevelser tillsammans med oss på Fellowmind \nHär är chansen för dig som är redo att ta nästa kliv i din karriär som utvecklare – och samtidigt vara med och sätta din prägel på den tekniska standarden för hur framtidens digitala kundlösningar ser ut! Hos oss på Fellowmind får du en ledande roll i ett sammanhang där teknik och mänsklighet går hand i hand. Vi söker nu en Lead Developer inom Dynamics 365 CE som brinner för kvalitet, innovation och att inspirera andra! \nDin roll hos oss \nSom Lead Developer är du mer än en teknisk specialist – du är en vägvisare! Du är med och formar riktningen för hur vi bygger, utvecklar och levererar våra lösningar inom Dynamics 365 CE. En del av ditt uppdrag blir att säkerställa vår tekniska kompetens och var ett nav för kunskapsdelning, kvalitetssäkring och inspiration för våra utvecklare. \nDu kommer bland annat att: \n Jobba i teknikens framkant – särskilt inom Power Platform och Dynamics 365 CE. \n  Leda interna utvecklarforum – en kreativ samlingsplats för inspiration, idéutbyte och kompetenshöjning. \n  Granska kodbaser och leveranser för att säkra kvalitet, hållbarhet och skalbarhet. \n  Coacha kollegor genom code reviews, teknisk vägledning och mentorskap. \n  Samverka med arkitekter och andra experter i tvärfunktionella projekt – ibland leder du själv, ibland bidrar du i teamet.\n \nTekniken vi älskar att jobba med \nHos oss är tekniken ett medel för att skapa verkligt värde. Vi jobbar bland annat med: \n Power Platform (Power Automate, Power Apps) \n  JavaScript/TypeScript \n  C#.NET (t.ex. plugins, Custom APIs) \n  Power Apps Component Framework \n  React \n  Azure DevOps och CI/CD-pipelines\n Vi tror att du  Har gedigen erfarenhet av utveckling inom Dynamics 365 CE och Microsofts molnbaserade ekosystem - troligen 5 år eller mer. \n  Brinner för struktur, arkitektur och kod av hög kvalitet. \n  Är nyfiken och pedagogisk – du trivs med att både lära och lära ut. \n  Vill kombinera teknik med ansvar och samarbete – du gillar att se helheten.\n Vad vi erbjuder \nSom en ledande europeisk Microsoftpartner är Fellowmind en arbetsplats där tekniken får ett mänskligt ansikte. Vi tror på att digital transformation börjar med relationer – och att de bästa lösningarna föds i samarbetet mellan människor. Här får du en roll med verklig påverkan, i en kultur som präglas av: \n Always personal – Vi bygger relationer på äkta engagemang. \n  Better together – Vi tror på kraften i samarbete. \n  Act with courage – Vi vågar tänka nytt och utmana gamla sanningar. \n  Serious about fun – Vi kombinerar hög leveranskvalitet med en arbetsmiljö där du trivs, växer och skrattar.\n \nLägg därtill att vi i höstas blev utsedda till Sveriges Bästa Arbetsgivare vilket vi ser som ett kvitto på att vi gör mycket rätt – och vi kommer alltid att fortsätta arbeta för att vara en plats där alla ska må bra och känna sig hemma. \nDet praktiska  Omfattning: Heltid \n  Placering: Något av våra centrala kontor i Malmö, Göteborg, Stockholm, Jönköping eller Halmstad \n  Start: Snarast – men vi anpassar oss efter din kalender\n \nRedo att leda vägen för tekniken – och samtidigt göra skillnad för både kunder och kollegor? -Sök redan idag!",
        "url": "https://career.fellowmind.se/jobs/5927477-lead-developer-dynamics-365-customer-engagement?promotion=1468872-arbetsformedlingen",
        "published": "2025-05-14T09:30:15",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29868713",
        "title": "System Configuration Developer",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "Jeppesen, a subsidiary of The Boeing Company, is one of the largest software development companies in Gothenburg. We develop and implement innovative Crew and Operations management products for the world’s leading airlines.\nThe Digital Solutions & Analytics implementation department is responsible for the configuration and delivery of these systems to ensure airlines all over the world can optimize their crew members’ work schedules and aircraft utilization.\nAt Jeppesen’s office in central Gothenburg you will work in a one-of-a-kind software development organization with solutions that make a real difference to people around the world. You will work in an agile environment that fosters continuous improvement. You’ll be surrounded by a team of talented, creative, and highly motivated colleagues. You will learn and broaden your perspective by working with 400 professionals from more than 50 different nations but also be part of a global organization allowing for collaboration with customers and colleagues across the world.\nAt Jeppesen work life balance is important. We offer a comprehensive benefits package that includes a pension plan, health care insurance, Wellness contribution and winter break (off between 23 December and 2 January).\nJeppesen is looking for a System Configuration Developer for our Digital Solutions & Analytics implementation department based in Gothenburg, Sweden.\nAs System Configuration Developer you will be a key member of a dynamic team of 5-10, you will actively tailor innovative solutions to meet our clients' unique crew and aircraft planning needs. You will work closely with the client to handle expectations, building long-term relations and ensure our solution brings the customer optimal value. You will collaborate with your team and other departments to solve technical challenges and programming tasks in an efficient way.\nWe are looking for solution-oriented team members with expertise in software implementation. We put great emphasis on your personal characteristics and value individuals who have an analytical approach to problem solving, strong communication and collaboration skills both within and outside your team, an interest in technology as well as human relations and a curiosity to learn and explore new ways of doing things. For this position it is vital that you are passionate about learning the airline business and that you see yourself as a team player ready to contribute in workshops and communicating with different stakeholders as part of the requirements gathering and implementation process.\nBasic Qualifications (Required Skills/Experience): :\n2+ years of working experience\nExperience working with Python\nAdvanced knowledge of the English language in both verbal and written communications\n\n\n\nPreferred Qualifications (Education/Experience):\nMSc or BSc in Computer Science / Software Engineering or equivalent\nAirline and specifically Crew and / or Operations planning\nRave knowledge\nWorking with clients and their end users\nManaging a codebase using a tool such as Git and GitLab/GitHub, or equivalent\nDevelopment and administration in Linux systems\nSoftware testing\nFunctional Programming\n\n\n\nIf you're ready to make a difference in the aviation industry, we encourage you to apply by sending your CV in English. We are continuously scanning CVs and would love to hear from you soon!\nJoin us if you want to:\nBe part of implement a new application that improves the life of thousands of airline crew members \nHave the opportunity to work with the most well-known companies in the aviation world\nLearn new things every day\nWork together with highly motivated and skilled team mates\nWork with new technologies and cloud deployments\nHave Private Medical Insurance (Skandia)\nEnjoy additional days off for Christmas break (December 24th-January 1st)\nParticipate in employee recognition program (Boeing PridePoints)",
        "url": "https://jobs.boeing.com/job/gothenburg/software-application-developer-product-application-development/185/79522281360",
        "published": "2025-07-31T12:49:10",
        "deadline": "2025-08-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29853741",
        "title": "Senior Software Developer - Efficient Driving",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "\"Founded in 1927, the Volvo Group is committed to driving prosperity and shaping the future landscape through sustainable transport, mobility, and infrastructure solutions. By offering trucks, buses, construction equipment, power solutions for marine and industrial applications, financing and services that increase our customers’ uptime and productivity. \n\nOur headquarters are in Gothenburg, Sweden. Volvo Group shares are listed on Nasdaq Stockholm.\"\r\n\r\nTransport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match.\n\nShaping tomorrow’s technology\n\nAt Vehicle Technology, we are passionate about shaping tomorrow’s technology to create excellent sustainable transport and infrastructure solutions to make the world a better place for future generations. We provide innovative, safe, and driver-friendly solutions, we develop top-quality services, and we make our customer operations more efficient by using excellent data insights. We support the Volvo Group engineering community with innovative tools and methods.\nThe Efficient Driving team develops on-board software solutions that optimize driving efficiency combined with safety and driver assistance resulting in an optimized and seamless customer experience.\n\n\nWhat you will do\n\nAs a Software Developer, you will play a crucial role in designing and developing software solutions that improve vehicle performance, functionality, and overall system efficiency. You will define features based on legislative requirements and end-user needs. Your expertise in energy-efficiency software will be crucial for optimizing truck behavior and energy consumption. This position offers significant exposure to system design and implementation.\nAdditionally, you will:\n•    Design, develop and maintain software applications using C++.\n•    Utilize Adaptive Autosar frameworks to enhance software functionality.\n•    Collaborate with cross-functional teams to design, implement, and test software solutions.\n•    Work with Linux OS to develop and deploy applications.\n•    Troubleshoot and debug software issues to ensure optimal performance.\n•    Participate in code reviews and provide constructive feedback to peers.\n•    Verification at all levels to ensure software quality through code reviews, unit testing, HIL, SIL, and debugging.\n•    Stay updated with the latest industry trends and technologies to continuously improve skills and knowledge.\n\n\nWho are you?\n\nWe believe that the right mindset is key to making a difference in our organization. You excel in communication, effectively leading discussions and managing stakeholder relationships with confidence. Your proactive approach drives initiatives forward, ensuring you are not just a participant but a key contributor in cross-functional forums. With a strong passion for technology, you embrace change, ambiguity, and complexity with curiosity. Your ability to understand and operate within the software architecture of the truck will be essential in delivering high-quality solutions and deploying new features into production.\nIn addition, you have:\n•    Master's degree in Computer Science, Engineering, or a related field.\n•    5+ years of experience in C++ and C\n•    Advanced level proficiency in Adaptive Autosar.\n•    Experience with Linux OS.\n•    Knowledge of both Adaptive Autosar and classic Autosar is a must.\n•    Strong problem-solving skills and attention to detail.\n•    Excellent communication skills and the ability to work effectively in a team environment.\n•    Eagerness to learn and adapt to new technologies and methodologies.\nIt is considered a merit if you have knowledge of Advanced Driver Assistance Systems (ADAS), functional safety standards, particularly ISO 26262, and Failure Mode and Effects Analysis (FMEA). Familiarity with cybersecurity principles and practices is a plus.\n\n\nPositions: Two (2).\n\nDue to summer vacations, all applications will be reviewed from week 33 forward. Please do not expect any communication earlier than this.\n\n\nWho we are and what we believe in\nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination.\nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://volvo-information-technology-ab.contactrh.com/jobs/9669/43541254",
        "published": "2025-07-23T13:25:07",
        "deadline": "2025-08-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29852947",
        "title": "C++ Software Developer",
        "employer": "Surgical Science Sweden AB",
        "location": "Göteborg",
        "description": "About the organisation\nSurgical Science is a leading provider of medical simulation training and software solutions. Together with healthcare partners and customers worldwide, we enhance patient safety and healthcare outcomes through evidence-based simulation to improve clinical proficiency and performance.\nJob Summary\nYou will be part of a global team where most of your team members will be remote. Together with the team, you will enable efficient training of healthcare professionals in the use of imaging devices. Your responsibilities include:\nUsing C++, you will develop and refine advanced medical simulations with realistic 3D graphics and soft-body dynamics.\nCollaborate with a global team, mostly remote but also on-site\nTogether with the team, you will be working with leading medical manufacturers to shape future training solutions.\n\nThis role will be based in Gothenburg, Sweden (hybrid).\n\n\nYour profile\nTo succeed in this role, we are seeking not only technical competence but a person who can fit in our diverse team culture. \nMust have requirements:\nProfessional work experience with C++.\nYou enjoy working in a project-oriented, multicultural environment within a global remote team.\nYou work well independently while also enjoying being part of a collaborative team.\nYou are not afraid to reach out to others when facing complex challenges and are open to sharing your knowledge generously.\nA degree in Computer Science, Software Engineering, or an equivalent field.\nAn interest in and knowledge of 3D graphics technologies.\nProfessional-level English and strong communication skills.\n\n\n\nNice to have:\nExperience with game engines (e.g., Unity, Unreal Engine, Godot or similar).\nKnowledge of soft-body physics theory and algorithms.\nBasic mathematical knowledge such as linear algebra\nExperience in JIRA, GIT, WPF.\nYou are are comfortable in defining technical requirements, performing code reviews, unit tests to release staging.\nExperience with agile methodologies.\n\n\n\nSurgical Science as an employer\nWe are a fast-growing global organization with offices in Gothenburg, Stockholm, the US, the UK, Israel and China. Our diverse and multicultural workplace embraces both onsite and remote team members, fostering a hybrid work environment.\nWe believe in empowering our employees, valuing their unique experiences and knowledge, and encouraging them to make a meaningful impact. Growth and development are at the heart of our culture, and you’ll be part of a welcoming, open team where your creativity is valued.\nGuided by our core values—respect, curiosity, and perseverance—we strive to create an environment where everyone can thrive and contribute to our shared success.",
        "url": "https://surgicalscience.bamboohr.com/careers/107",
        "published": "2025-07-23T09:58:45",
        "deadline": "2025-08-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29821418",
        "title": "PLC Developer",
        "employer": "Freemelt AB",
        "location": "Göteborg",
        "description": "Join Freemelt as our new PLC Developer!\nAre you a self-driven and methodical PLC programmer with a passion for technology and future development? Freemelt is looking for a skilled PLC Developer to strengthen our team and contribute to the evolution of advanced machine systems. If you thrive in a dynamic, high-tech environment and want to be part of an innovative company revolutionizing industrial 3D printing, this is the opportunity for you!\n\n\nAbout the role\nAs a PLC Developer at Freemelt, you will play a key role in both maintaining and developing our additive manufacturing systems. Your first year will focus on optimizing and fine-tuning our existing machines, ensuring they operate efficiently and reliably. In the long term, you will be involved in system validation, test rigs, and the development of future machine systems.\nKey responsibilities\nFirst year:\nCollect analyze machine operation statistics\nMaintain and improve PLC code\nCreate commissioning instructions for production and service teams\nPerform machine tuning and optimization\n\nLong-term:\nProvide Level 3 support for service teams\nConduct system validation and testing\nBuild and maintain test rigs\nContribute to the development of future machine systems\n\nRequired technical competencies:\nExtensive experience in PLC Programming (Experience with Omron controllers and servomotors is a plus)\nSafety PLC programming (Experience with Pilz safety systems is a plus)\nHardware: Strong understanding of hardware components and integration\n\nIf you have experience in Software such as Linux, GitHub, and Python it is an extra plus.\nYour profile:\nSelf-motivated and independent\nStructured, methodical, and analytical problem solver\nPassionate about technology and continuous improvement\n\n\n\nWhy Freemelt:\nAt Freemelt, we provide a collaborative, innovative, and dynamic work environment where your ideas matter. You will have opportunities for professional growth and development while being part of a company at the forefront of 3D printing technology. We offer a competitive compensation package and a workplace that values diversity, inclusion, and equal opportunities for all.\nApply Today!\nJoin Freemelt and be a part of our journey to revolutionize metal additive manufacturing. Apply now and shape the future with us!\nWe look forward to receiving your application as soon as possible, but no later than 2025-08-05.",
        "url": "https://career.freemelt.com/jobs/5768283-plc-developer",
        "published": "2025-07-09T11:24:55",
        "deadline": "2025-08-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29815930",
        "title": "Experienced Machine Learning Developer for International Company!",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Do you have a passion for machine learning and a few years of professional experience in the field? Are you looking for an exciting opportunity to work with innovative technologies in an international environment? Then the role of Experienced Machine Learning Developer could be exactly what you are looking for!\n\nJOB DESCRIPTION\n\nAs a Machine Learning Developer at our client company, you will join a team within software development while collaborating closely across functions, including with teams focused on testing, integration, and software development. Your primary responsibility will be to develop and optimize machine learning and AI solutions, with a particular focus on neural networks. This includes methodology development, data collection and training, and performance optimization, for example, designing efficient neural networks suitable for devices with limited computational resources. This is a highly technical and hands-on role, where you will work closely with a colleague in the same position.\n\nThe role involves programming mainly in Python, with solutions also being converted to C for deployment on embedded systems. Beyond technical development, you will also participate in data acquisition, testing, and the full development lifecycle. Additionally, the role includes client interaction, where you will present and demonstrate solutions.\n\nIDEAL CANDIDATE:\nMaster’s degree in Engineering Physics, Software Engineering, or a related field.\nHave a minimum of five years of professional experience in machine learning, AI, neural networks, or similar areas.\nPossess strong programming skills in both Python and C++.\nAre proficient in both Swedish and English, as both languages are used in daily internal and external communication\n\n\nIt is a plus if you also have:\n\nPrevious experience in the automotive industry\n\n\nIn order to be a good fit , we think you have a professional approach towards customers and good communication skills. You are a fast learner, eager to learn and develop within the company. You are also flexible and focused on customer satisfaction. Though you work in a team with others you are a good team player with a positive and outgoing mindset and aim to help the team solve their tasks.\n\nEMPLOYMENT\n\nThe position is a direct recruitment, which means that the recruitment process takes place through Friday and you will be employed by the client.\n\nADDITIONAL INFORMATION\nEmployment type: Full time.\nStart date: September/October 2025.\nLocation: Gothenburg.\nSalary: Fixed monthly.\n\n\nApply by clicking the link below. Remember to be quick with your application as apply continuous selection of candidates and the position may be filled before the application deadline is due.\n\nABOUT FRIDAY\n\nBy being a partner to our clients and candidates, we strive to find the best match for both parties. We achieve this by really getting to know our clients and candidate’s needs! Of course, we will ensure that requirements and skillsets match. But above all, we focus on the importance to find harmony between values and corporate culture which both candidate and client considers optimal.\n\nOur passion is to help people to the right position, workplace and context within the IT and Technology field. That's also the reason to why we founded Friday, with the aim to help you find the job that gives you that Friday feeling – every day!\n\nWe mainly focus on young engineers who either are at the beginning of their career or soon graduating from university within the IT/Tech field.\n\nOur belief is that people reach their fullest potential when looking forward to going to work each morning. \"Friday - everyday\", how about that?",
        "url": "https://pnty-apply.ponty-system.se/friday?id=3249&pnty_src=arbetsformedlingen",
        "published": "2025-07-07T09:54:07",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29808668",
        "title": "Software Developer - Embedded Systems",
        "employer": "Hms Industrial Networks AB",
        "location": "Göteborg",
        "description": "At HMS Industrial Networks, we know that our people are the key to our success. That’s why we focus on creating a friendly, innovative, and supportive work environment where everyone can grow – both professionally and personally. We believe work should be meaningful, collaborative, and fun.\n\nWe are now building a new business line focused on customized embedded software solutions for large international customers – and we’re looking for a Software Developer to join this exciting journey. If you’re passionate about embedded systems and enjoy solving complex problems together with customers and skilled teammates, we’d love to hear from you.\n\nABOUT THE ROLE\n\nIn this role within our new initiative, you'll join a small, agile team within HMS working closely with key customers and our R&D organization. Your work will include designing, adapting, and delivering embedded software solutions for a wide range of industrial applications.\n\nProjects vary in size and complexity – from focused modules to integrated system deliveries – giving you the opportunity to work across different technologies and continuously grow your technical skills. Whether you're early in your career or bring many years of experience, you'll contribute to delivering high-impact, real-world solutions.\n\nThis role is based at our new Gothenburg office, with a hybrid work model that supports both flexibility and work-life balance.\n\nWHAT YOU'LL DO\n\n• Develop and deliver embedded software solutions based on customer and system requirements \n• Collaborate closely with customers, product managers, and R&D teams \n• Work across various technologies, platforms, and communication protocols \n• Contribute to both short-term and long-term software projects \n• Adapt and reuse existing software components where possible, while also innovating when needed \n• Take part in improving internal methods, tools, and ways of working \n\nABOUT YOU\n\nWe’re looking for a curious and driven developer who enjoys working in a dynamic environment with close customer interaction. You are a strong team player with a problem-solving mindset and a solid foundation in embedded systems.\n\nWHAT WE'RE LOOKING FOR\n\n• A Bachelor’s or Master’s degree in Computer Science, Electrical Engineering or similar \n• 0–10 years of relevant experience – we welcome both junior and experienced developers \n• Solid knowledge of C/C++ for embedded systems \n• Familiarity with real-time operating systems and low-level programming \n• Good communication skills and team mindset – whether you're more introverted or extroverted \n• Bonus: experience with industrial communication protocols (e.g., Modbus, CAN, EtherNet/IP) is an advantage \n\nYOU MIGHT THRIVE HERE IF YOU...\n\n• Enjoy variety in your technical work and value continuous learning \n• Appreciate working in cross-functional teams and close to the customer \n• Are motivated by building solutions that make a real difference \n• Want to be part of a global company with a local, collaborative feel \n\nABOUT US\n\nAt HMS, we believe that connecting matters – from enabling machines to communicate, to building strong partnerships with customers. Our technology connects millions of industrial devices around the world, helping companies become more productive, efficient, and sustainable.\n\nOur mission is embodied in our name: HMS – Hardware Meets Software™. We combine world-class engineering with deep customer understanding to create connectivity solutions that lead the industry.\n\nWith headquarters in Halmstad, Sweden and offices around the world, HMS is truly an international company – but with a culture driven by Heart, Mind, and Soul.\n\nAbout the Application \n\nHMS is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. \n\nJoin us in pushing the boundaries of technology and making a significant impact on the industry. Apply today with your application in English and be part of a team that values your unique perspective and expertise! \n\nDue to the upcoming summer holidays, the position will remain open for applications until August 17th. Please note that no selection or feedback will take place between weeks 28 and 32. We will begin interviews at the end of August and into early September. \n\nIf you want to learn more about the role, feel free to contact Olof Lennerstedt, Business Line Director Software & Professional R&D services, at olle@hms.se. \n\nIf you want to know more about the recruitment process, please contact responsible HR. \n\nWelcome with your application!",
        "url": "https://career.hms-networks.com/jobs/297256-software-developer-embedded-systems?ref=platsbanken",
        "published": "2025-07-03T08:27:47",
        "deadline": "2025-08-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29805952",
        "title": "Embedded SW Developer",
        "employer": "Einride AB",
        "location": "Göteborg",
        "description": "Want to be part of transforming road freight – for good? Einride is showing the world a new way to move, based on the latest digital, electric and autonomous technologies. Through our offering – freight capacity as a service – we enable businesses around the world to accelerate towards their sustainability goals.\nFounded in 2016, Einride became the first company in the world to deploy a cab-less autonomous electric vehicle on a public road (Sweden, 2019). In 2022, we were the first to successfully operate such a vehicle on a US public road. Today, we are a team of more than 500 people, and our award-winning technology is being deployed across 8 countries (and counting). Our clients include some of the world’s biggest shippers, including Fortune 500 companies.\nAs an Embedded Software Engineer within the Actuation SW Team at Einride you will be part of a team responsible for the low level control of our autonomous electric vehicles. The team is SW focused, but with a close relation to the hardware. Our main deliverable is an embedded software with realtime constraints, implemented in C, that translates high level commands into low level actuations on the vehicle. You’ll be joining a top talent team of ambitious, creative, kind-hearted people who challenge conventional thinking, think big and aim for zero.\nAt Einride everyone is responsible for their work end to end, from development to production. You will help us improve developer happiness, our fearless development culture and acquire a deep understanding of your domain.\nYou will work with:\nDesigning technical solutions in collaboration with your colleagues\nWrite and review embedded software written in C for the target platform\nVirtual testing/verification (unit tests, Simulation, HardwareInLoop and SoftwareInLoop)\nWrite and review technical requirements and verifications\nContribute during track days to verify the teams' software\n\nWe expect you to:\nHave at least 2 years experience within embedded sw development\nBe interested in growing technical competence within embedded systems\nCommunicate well in english\nM.sc in relevant field (e.g. computer science, embedded systems, control theory, vehicle engineering, electrical engineering or similar)\n\nExperience within any of the below is considered a bonus:\nDevelopment of safety critical systems\nAgile development\nSystem safety (ISO 26262)\nAutomotive communication technology and protocols (CAN, J1939 etc)\n\nThis is a full-time position based at our office in Gothenburg. Of course, we have a modern and hybrid set-up that allows you to partly work from home but our expectations is that you also are present at our office in Gothenburg.\n\n\nPlease note that as part of our standard recruitment process, we conduct a background control on the final candidate for this role. This may include verification of education, employment history, any relevant professional certifications or other information that may be of our interest.\nAt Einride, we are innovators, building solutions the world has never seen before – but urgently needs. That’s why we take action, and it’s why we are always eager to be challenged. We know that our best innovations come from having a diverse mix of people, including those of different experiences, career paths, and walks of life. By coming together and sharing our perspectives openly – by disagreeing, discussing, and committing – we deliver greater impact.",
        "url": "https://emp.jobylon.com/jobs/296701-einride-embedded-sw-developer/",
        "published": "2025-07-02T09:04:25",
        "deadline": "2025-08-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772078",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-06-17T00:00:00",
        "deadline": "2025-12-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709548",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAt AFRY, we develop and deliver cutting-edge solutions for vehicles, systems, functions, and attributes to clients in the automotive industry. Our customers include both established OEMs, innovative startups, and Tier 1 system suppliers.\nWe are currently seeking experienced software developers who are passionate about shaping the next generation of infotainment systems based on Google’s Android Automotive OS.\nAs an Android Automotive Software Developer, you will work on software development across both application and native layers of the Android stack for infotainment systems. You will collaborate closely with UX designers and other stakeholders to define a seamless, end-to-end user experience. You’ll be part of a team with full responsibility—from design and architecture to documentation, development, verification, and validation. At AFRY, you’ll also have the opportunity to contribute actively to innovation by generating new ideas and solutions.\n\n\nQualifications\n\nWe are looking for candidates with the following background and skills:\n\nM.Sc. in Software Engineering or equivalent experience gained through years of professional practice\nSolid experience in Android application and platform development, including work with AOSP and the AOSP build system\nFamiliarity with modern app architectural patterns such as MVP, MVVM, and layered architecture\nExperience working with automotive communication buses\nStrong programming skills in Android Java, C++, and Python\nGood knowledge of Android testing frameworks such as JUnit, Espresso, and Mockito\nExcellent command of English, both written and spoken\nProven experience working with a Swedish OEM within the automotive industry\nCurrently residing in Sweden today\n\nMeritorious qualifications:\n\nExperience in Embedded Linux development\nFamiliarity with Continuous Integration (CI) tools and workflows\nPossession of a Swedish B-class driving license\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 6/7.\nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000069510871-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:32:23",
        "deadline": "2025-08-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29866377",
        "title": "Syntronic i Göteborg söker fler mjukvaruutvecklare",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Nu växlar vi upp i Göteborg och fyller på vårt redan härliga team med ännu fler mjukvaruutvecklare! \nVill du få du utrymme att växa som person, kollega och rent tekniskt i din yrkesroll? Välkommen till en arbetsplats där vi hjälper, stöttar och utvecklar varandra samtidigt som vi finner nya tekniska lösningar för en hållbar framtid! \nVi tycker att det är toppenbra om du redan har erfarenhet inom mjukvaruutveckling så att du kan hjälpa till med de lite mer avancerade uppdragen och problemställningarna vi har samt kunna lära dina lite mindre erfarna kollegor hur en funktionell kod ska skrivas.\nVi söker mjukvaruutvecklare som har kunskap eller förståelse i något av dessa programmeringsspråk och verktyg:\n C\n C#\n C++\n Java\n Python\n Git\n Matlab\n \nVi önskar att du som mjukvaruutvecklare hos oss har: \n En högskole- eller civilingenjörsexamen inom t.ex. Datavetenskap, Systemutveckling, Mjukvaruutveckling eller liknande\n Genuint teknikintresse\n Minst 2 eller fler års erfarenhet som mjukvaruutvecklare\n Förmåga att kommunicera på både svenska och engelska i tal och skrift.\n \nVi kommer att göra allt för att du ska trivas som mjukvaruutvecklare hos oss. Det tar en minut att ansöka och vi tar kontakt med dig inom två... eller så snart vi kan!\nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande.\nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb – du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic! \nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 29 augusti.  Vi arbetar med löpande urval och tjänsten kan komma att tillsättas innan sista ansökningsdag.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/4888984-syntronic-i-goteborg-soker-fler-mjukvaruutvecklare?promotion=1571557-arbetsformedlingen",
        "published": "2025-07-30T10:48:37",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29866181",
        "title": "Mjukvaruutvecklare – Utveckla framtidens avancerade system!",
        "employer": "Syntronic AB",
        "location": "Göteborg",
        "description": "Drömmer du om en karriär där du får arbeta med framtidens teknik och utmana din kompetens? Nu erbjuder vårt kontor i Göteborg en spännande möjlighet att bli en del av ett globalt företag med fokus på innovation och avancerade tekniska lösningar.\nVi söker nu efter en mjukvaruutvecklare till ett av våra projekt gentemot vår kund som arbetar med avancerade programvarusystem och simuleringar. Är du vår nästa stjärna?\nOm rollen\nSom mjukvaruutvecklare kommer du få arbeta i ett tvärfunktionellt utvecklingsteam med ansvar för både utveckling och underhåll av mjukvaruprodukter. Du kommer vara involverad i hela utvecklingskedjan – från kravhantering och design till implementering, testning och underhåll. Du kommer bland annat ansvara över följande:\n Utveckling och underhåll av programvara för avancerade system\n Design, implementation och testning av mjukvarulösningar\n Samarbete med andra team och avdelningar för att säkerställa hög kvalité\n Bidra till effektiva utvecklingsprocesser och kontinuerlig förbättring\n Arbeta med moderna utvecklingsmetoder och verktyg.\n \nVi söker en mjukvaruutvecklare som har:\n En högskole- eller civilingenjörsexamen inom data eller motsvarande\n Några års erfarenhet av mjukvaruutveckling och moderna utvecklingsverktyg\n Goda kunskaper inom Linux och versionshantering\n Erfarenhet utav CI/CD.\n \nUtöver detta så ser vi även det som positivt om du har erfarenhet av följande:\n C++\n Git\n Inbyggda system\n Simulering, signalbehandling samt radarstyrning.\n \nSyntronic erbjuder en trygg anställning i en dynamisk och framåtriktad miljö. Att vi är ett team är vår styrka, därför ser vi att du arbetar tillsammans på plats med oss på kontoret – när du inte behövs hos någon av våra kunder förstås!\nVi arbetar för en jämn könsfördelning och ser gärna kvinnliga sökande. \nVi erbjuder\nPå Syntronic blir du en del av en härlig gemenskap där din röst hörs och dina idéer välkomnas. Vi erbjuder flexibla arbetstider, balans mellan arbete och fritid samt regelbundna karriärutvecklingssamtal och interna workshops för din utveckling. Utöver detta får du förmånliga förmåner och försäkringar. Hos oss får du inte bara ett jobb - du får en plats att växa och trivas både personligt och professionellt. Välkommen till Syntronic!\nAnsökan\nVi ser fram emot din ansökan, som ska vara oss tillhanda senast 29 augusti. Vi arbetar med löpande urval. \nBakgrundskontroller kan förekomma.\nAv kommunikation- och kvalitetssäkringsskäl ber vi dig att skicka in din ansökan digitalt via vårt system och inte via e-post.",
        "url": "https://jobsemea.syntronic.com/jobs/5500131-mjukvaruutvecklare-utveckla-framtidens-avancerade-system?promotion=1571457-arbetsformedlingen",
        "published": "2025-07-30T10:14:47",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29860855",
        "title": "Embedded Developer",
        "employer": "Icomera AB",
        "location": "Göteborg",
        "description": "Icomera is a leading global innovator in connectivity solutions within the transportation sector. We are at the forefront of transforming public transport, making it smarter, safer, greener, and more connected than ever before. At Icomera you work with products used by many users around the world, including passengers on some of the world's largest train and bus operators. \nAre you looking for a new and challenge and want to make sure it is an exciting one? Our embedded team is looking for a new team member!\nJob type: Full-time   \nWorkplace conditions: Hybrid \nLocation:  Gothenburg, Sweden\nAbout the Role:\nAs an Embedded Software Developer at Icomera, you will help develop the next generation of network routers for vehicles. The embedded team is responsible for analysis, design, implementation, and testing of the router OS as well as its applications. You’ll work closely with hardware and web development teams, contributing to innovative solutions that are visible to millions of passengers around the world. If you enjoy working on the Linux platform, networking, and tackling firmware or hardware challenges, this is the role for you!\nKey responsibilities:\nWrite high-quality code with focus on performance and maintainability.\nCommunicate with and support team members and other stakeholders within the business.\nFollow established development processes and related standards.\nContribute to a positive working environment and help optimise performance of the team.\n\n \nRequirements: \nB.sc / M.sc degree, in computer science, physics or equivalent.\n3+ years of Linux-based software development experience in an agile environment (C/C++, Bash).\nDeep knowledge of computer networking.\nPassion for the Linux platform and software development.\nProficient in English, written and spoken. Working proficiency in Swedish, written and spoken, is a plus\n\nWho You Are:\nTo thrive in this role, you enjoy working with people and you are excited to be part of a constantly evolving international company. As an Embedded Software Developer, you are honest, driven, and solution-oriented, and you enjoy tackling technical challenges as part of a team. \nOur Offer:\n— The opportunity to work with cutting-edge technology in a market leader where we design and build everything in-house—from hardware to software\n— Health is important – we offer a comprehensive health benefit program to our employees\n— Flexible work arrangements – work from our modern and central office locations, or work from home up to two days a week\n— Electrical bike lease agreement via net salary deduction\n— ITP Pension and collective bargaining agreement\n— A social work environment – board game nights, after works, seasonal parties… The list goes on!\nReady to be part of something exciting and make a real difference in the connected future of transport? We’d love to hear from you!\nMore about the position:\nWe will be reviewing applicants ongoing. Icomera welcomes candidates from all backgrounds, and we value a diverse and inclusive work environment. \nIcomera is an employer with a collective agreement with TechSverige. If you have questions to our local union representatives, you may contact them at unionen@icomera.com or saco@icomera.com.\nAbout Icomera:\nIcomera is the world’s leading provider of integrated connectivity solutions for trains, trams, buses, and coaches, serving millions of passengers and tens of thousands of vehicles on a daily basis. The IcoCrew now consist of 300+ employees globally. Icomera is headquartered in Gothenburg, Sweden, with main offices in the United States, Canada, the United Kingdom, Germany, France, Ireland, and Italy.\nIcomera’s vision for green mobility within the public transport industry perfectly complements the wider mission of our parent company, Equans. As the global leader in multi-technical services with 74,000 employees working across 17 country hubs, Equans delivers customised solutions which connect, protect and energise territories, cities, buildings, industries and transport infrastructures, empowering their energy, industrial and digital transitions. Visit www.icomera.com for further information.",
        "url": "https://enfrench-equans.icims.com/jobs/75022/embedded-developer/login",
        "published": "2025-07-28T10:26:00",
        "deadline": "2025-08-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29840825",
        "title": "Software Engineer ",
        "employer": "Tata Technologies Nordics AB",
        "location": "Göteborg",
        "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continued growth we are now recruiting for a Software Developer (Unity) to be based at our office in Gothenburg\n Responsibilities\nAUTOSAR Domain Knowledge (Classic or Adaptive)\nConfigure and integrate AUTOSAR Basic Software (BSW) modules using tools like DaVinci Developer/Configurator, EB Tresos, ETAS or Vector.\n\nScripting & Programming Automation\nDevelop and maintain automation scripts for continuous build, integration, and testing processes using Python, CAPL, Shell, or other relevant languages, Jenkinson, PyBuilder, SCons\n\nRelease Activities & Support\nManage software release cycles including versioning, documentation, and delivery by coordinating with cross-functional team\nPost release activities support in helping the issue fix\n\nSoftware Testing & Validation -> Unit and Functional Test\nDesign and execute unit, integration/functional tests\nUse tools like CANoe, CANalyzer, and VectorCAST for testing and validation.\nEnsure compliance with automotive standards such as ISO 26262 and ASPICE.\n\nFault Tracing & Debugging\nAnalyze and trace software faults using debugging tools and logs like T32 or INCA\nCollaborate with development team to get the issue fixed on time\n\n \nKnowledge/Experience\n5+ years of experience in automotive embedded software development.\nCAN or LIN or Flexray communication protocol knowledge\nStrong knowledge of AUTOSAR architecture and tools chains\nProficiency in C, Python, CAPL and embedded systems programming.\nExperience with software integration and configuration tools (e.g., DaVinci, EB Tresos, ETAS etc).\nHands-on experience with testing tools (CANoe, CANalyzer, etc.).\nHanda-on programming experience with Embedded C, C++\nKnowledge of version control systems (Git, SVN) and CI/CD pipelines.\nProblem-solving and debugging skills.\n\n \nIf you are passionate about bringing innovation to the projects you work on then we would love to hear from you.\n \nTata Technologies: Engineering a better world.\n \nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
        "url": null,
        "published": "2025-07-16T15:25:05",
        "deadline": "2025-08-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29824328",
        "title": "Test Engineer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY erbjuder tjänster inom teknik, design, digitalisering och rådgivning. Vi är hängivna experter inom industri, energi- och infrastruktur, som skapar värde för kommande generationer. AFRY har en global räckvidd med djupa rötter i Norden. Tillsammans accelererar vi omställningen till ett mer hållbart samhälle.\n\n\nJob Description\nWe are currently looking for a driven and detail-oriented Test Engineer to support the development and validation of advanced steering systems. This role involves both HIL-based testing and in-car verification, ensuring robust functionality and safety of steering software and hardware components.\nYou will be responsible for planning, executing, and documenting test activities for steering systems in both simulated and real-world environments. The role requires close collaboration with software developers, system engineers, and suppliers to ensure compliance with functional and safety requirements.\nWhat you will do\nPlan and execute test cases on HIL rigs and in-vehicle environments.\nAnalyze and troubleshoot issues related to steering system behavior.\nValidate steering functions such as Haptic Warning, Active Return, Torque Overlay, and Safety Monitors.\nTest all supplier releases, including all services\nSupport fault injection and degradation testing for safety validation.\nCollaborate with cross-functional teams to align on test coverage and results.\nDocument test results and contribute to continuous improvement of test methods.\n\nYou can either be located at one of our offices in Gothenburg or in Trollhattan.\n\n\nQualifications\nAt least 5 years experience in steering system development and testing.\nHands-on experience with HIL systems (e.g., dSPACE, Vector).\nProficiency in tools such as CANoe, CANape, CAPL, and requirements tooling\nSolid understanding of vehicle dynamics, CAN communication, and UDS diagnostics.\nExperience with functional safety (ISO 26262) \nAbility to work independently and in a team-oriented environment.\n\nOther requirements\nMSc or BSc in Mechatronics, Electrical Engineering, or similar.\nFluent in English (spoken and written).\nValid driver’s license (B) and experience with test driving is required.\nTrack license T1/T2/T3 is advantage\n\n\n\nAdditional Information\nFor more information about the position please contact/\nGothenburg: Torgrim Brochmann, Section Manager  torgrim.brochmann@afry.com\nTrollhattan: Nicklas Karlsson, Section Manager nicklas.g.karlsson@afry.com\n \nDue to summer/vacation period the reply from us can take a little bit longer then usual, but we will reply/get back to you as soon as possible.\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000069607400-test-engineer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-07-09T14:35:07",
        "deadline": "2025-08-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29818976",
        "title": "Embedded Software Engineer within the Automotive Industry",
        "employer": "SiNIX Embedded AB",
        "location": "Göteborg",
        "description": "Are you an experienced embedded software developer looking to work with cutting-edge technology in the automotive domain?\nWe are looking for an experience Embedded Software Engineer to join our team!\nAs part of our embedded software team, you'll contribute to a variety of development projects—ranging from system architecture and software design to implementation, integration, and validation of embedded systems. The work is both technically challenging and rewarding, often involving modern platforms and real-world problem-solving in the fast-evolving automotive industry.\nWe offer a workplace where your voice is heard, your skills are developed, and where we have fun while solving challenging technical problems together.\nQualifications for this position\nSeveral years of experience in embedded software development\nM.Sc or B.Sc. in Computer Science Electronics, Mechatronics or related technical field\nProficiency C++ and embedded systems programming\nExperience with Linux, QNX and Yocto\nEnsure compliance with AUTOSAR, ISO 26262, and MISRA C++ guidelines\nFamilarity with tools such as GIT, JIRA, Vector tools (CANoe, CANalyzer)\nExperience working within the automotive industry\nIt’s a plus if you have experience working closely with suppliers and have been involved in cybersecurity-related aspects of embedded development\n\n\n\nAbout you\nWe believe that you are curious, driven and solution-oriented. You have a mindset of continuous learning and like to share knowledge with those around you. We value individuals who take ownership, enjoy working in teams, and actively contribute to a positive and open atmosphere.\nWho we are\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/jobs/6026679-embedded-software-engineer-within-the-automotive-industry",
        "published": "2025-07-08T10:28:45",
        "deadline": "2025-09-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29814202",
        "title": "Full Stack Engineer",
        "employer": "Enabi Solutions AB",
        "location": "Göteborg",
        "description": "Do you want to transform how Swedish manufacturing companies work with sales and customer relationships?\nAt Enabi, we’re on an exciting growth journey where your contribution will directly impact both our customers and the future of our company. We’re now looking for an full stack developer to our engineering team. \nAbout Enabi\nAt Enabi, we’re reshaping the workday for sales teams at Sweden’s leading manufacturing companies. Our CRM replaces the chaos of inboxes, Excel sheets, and scattered notes with smart, integrated workflows that our customers love. We’re a startup with a clear product–market fit and a tight-knit team built on high ambition and deep trust – a place where work–life balance goes hand in hand with a strong product culture.\nFull stack developer at Enabi\nProgramming has changed. Nobody knows where it'll go. With little legacy to hold us back, we can move quickly and stay flexible. We're looking for an experienced developer who wants to be on the frontline of using LLMs to ship more and better code. We believe that experienced developers with drive can help us push these boundaries.\nWe're looking for people who constantly improve their own ways of working and like to share and learn together with others. We think that this mindset will only become more important in the years ahead.\nWhat you'll do\nBuild across the stack with React, Next.js, C#, .NET, and GraphQL\nFix nasty bugs, build well-defined features, and help us figure out the best way to build new stuff\nFocus on delivering real value, fast\nFigure out how LLMs can help us ship more and better code to create more value\nOwn the quality of what you build and take initiative when needed\nCollaborate and grow with the team\n\nWho we are\nTwo years in, solving real problems for users who already love the product\nTeam of 6 with a dev team of 3-4 people and counting\nSmall, experienced team with high trust and strong drive\nWe'd rather stay small and sharp than grow bloated and slow\nWe believe in balance. Great work shouldn't cost your health or family\nWe care about each other as people. Trust and connection make us grow\nBased in Gothenburg, about two office days per week\n\nYou'll thrive here if you\nCare deeply about what you build and do what's best for the company\nAre excited about the future of LLM-based development\nBelieve that trust, clarity and shared ambition build great teams\nEnjoy solving real problems that improve people's workday\nSometimes think about work problems, not because you have to, but because you care and can't help it\nWant to be part of growing a fast-moving startup with strong product culture\nFluent in English and at least ok with Swedish\n\nNice to have\nBuilt system integrations before\nExperience with ERP or finance software\nWorked with LLM-powered features\nHave experience of doing peer-programming or code reviews\nPrevious experience at a product startup (not just consultancy work)\nExperience working with microservices setup\n\nDoes this sound like you? You don't need to tick every box - we care more about your drive and hunger to build something great. Please apply and let's talk! Send an email to daniel@enabi.io.",
        "url": "https://www.linkedin.com/jobs/view/4258805988/",
        "published": "2025-07-04T14:48:15",
        "deadline": "2025-08-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29811101",
        "title": "Baseline Release Manager - Vehicle Software Factory",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\n\nThis is us, your new colleagues\nWe are the Product Release & Documentation team within the Vehicle Software Factory organization in Volvo Group Trucks Technology. We are responsible for securing the continuous deliveries of consistent and well-documented embedded system releases to our many different stakeholders, internally and externally.\nWe also provide the GTT organization with know-how to release software, by quality-assured documentation. This ensures that possible breakdowns and installations can be handled in all applicable rigs and vehicles during development phases, as well as during releases to our factories and aftermarket.\nWe continuously strive to maintain and improve the operational software release and software documentation flow. This is what we want you to contribute to in your day-to-day work.\n\n\nWhat you will do\nWe are looking for a supportive, structured System Baseline Release Manager to continue to build our Product Release & Documentation team.\nYour core responsibilities will be to:\nDefine software system baselines according to our incremental plans, special requests, and required software delivery time.\nInteract with the function and software delivery teams to provide visibility on plans and scope and provide support to manage their deliveries.\nEnsure the product documentation quality at system level.\nPrepare the basis for the release decision and documentation, in the shape of release notes, verification results, and so on, to provide smooth handling in appropriate forums like Release Board.\nParticipate in the work of continuous improvement to enable faster and more automated software releases and deployment.\nInterface to and support stakeholders of the integrations/releases such as Product Leaders, Field test (FVV), assembly factories (GTO), and aftermarket (AMT).\n\n\n\nWho are you?\nTo thrive in this role, you have an open and curious mindset, and you’re comfortable navigating a dynamic environment. You are motivated by continuous improvement and enjoy driving change within the broad area of Product Release. You have a structured and detail-oriented way of working, with a natural drive to follow up and ensure progress. You’re also skilled at managing and maintaining a wide network of stakeholders who contribute to building our software system platform.\nYou enjoy working with complex topics, yet you have a strong drive to create clarity and simplicity. In our team, we are also expected to support and guide the teams delivering and releasing individual ECU software. Therefore, you’re someone who enjoys sharing knowledge—by developing clear instructions and guidelines, offering training sessions, and providing hands-on support when needed.\nYou communicate effectively and collaborate well with others, have a sharp analytical mindset, and pay close attention to detail. Most importantly, you take initiative and follow through, ensuring tasks are completed and actions are seen to the end.\nRequirements:\nUniversity degree in Electronics, Software, Computer Engineering, or related fields.\nA track record of working with software system baselines, deliveries, and product documentation—ideally at electrical component level—with a solid understanding of functional development.\nExperience working with TEA2+ architecture, with a holistic understanding of the GTT software development process and the TEA2+ structure.\nSeveral years of experience in the automotive embedded software development life cycle.\nSolid experience working in an Agile/SAFe setup, with skills in tools such as JIRA, Confluence, and similar.\nProficiency in Configuration Management tools such as SW Configurator and PDM (KOLA).\nFamiliarity with software development toolchains, including Continuous Integration/Continuous Delivery (CI/CD).\n\n\n\nWhat’s in it for you?\nYou will be part of a highly knowledgeable and supportive team within the Vehicle Software Factory, working closely with our skilled engineers through the GTT organization to improve both our products and work methods every day.\n \nLocation: Gothenburg, Sweden.\n\n\nDue to summer vacations, all applications will be reviewed from week 33 forward. Please do not expect any communication earlier than this.\n\n\nWe value your data privacy and therefore do not accept applications via mail. \n\n\nWho we are and what we believe in \nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination. We are committed to removing the barriers to entry, which is why we ask that even if you feel you may not meet every qualification on the job description, please apply and let us decide.\nApplying to this job offers you the opportunity to join Volvo Group. Every day, across the globe, our trucks, buses, engines, construction equipment, financial services, and solutions make modern life possible. We are almost 100,000 people empowered to shape the future landscape of efficient, safe and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents with sharp minds and passion across the group’s leading brands and entities. \nGroup Trucks Technology are seeking talents to help design sustainable transportation solutions for the future. As part of our team, you’ll help us by engineering exciting next-gen technologies and contribute to projects that determine new, sustainable solutions. Bring your love of developing systems, working collaboratively, and your advanced skills to a place where you can make an impact. Join our design shift that leaves society in good shape for the next generation.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=20453&company=volvoinfor&st=7B5B64395783B1BF159EABFA4F4804C9E3FA6B72",
        "published": "2025-07-03T16:11:05",
        "deadline": "2025-08-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29747836",
        "title": "Senior Embedded developers - Sebratec",
        "employer": "Sebratec AB",
        "location": "Göteborg",
        "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nWe are looking for Senior Embedded Developers to Sebratec, for consultancy opportunities with our partners.\nResponsibilities will be different based on what  assignment fits your experiences, competence and career aspirations. They will be positions where a high Embedded knowledge and experience are needed, across several sectors but with a main focus on Automotive companies.\nProficiency in C, C++, Python, and Matlab/Simulink.\nStrong experience with Android and other embedded systems.\nPerform Hardware-in-the-Loop (HIL) and Software-in-the-Loop (SIL) testing for complex systems.\nCollaborate with cross-functional teams to design and implement innovative solutions.\nWork closely with clients to understand their unique needs and deliver tailored solutions.\n\nQualifications:\nBachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field.\nStrong knowledge of embedded systems and software development.\nProficiency in C, C++, Python, and Matlab/Simulink.\n5+ years of experience in a role within the embedded field.\nExperience within the automotive sector is highly valued\nIt is Meritorious to have special expertise in areas such as HMI,  ADAS, Infotainment, Powertrain and Vehicle controls etc.\n\nAt Sebratec, we value qualities that foster a collaborative and innovative environment. We are looking for individuals who are not only technically proficient but also team players, socially adept, open to new ideas, and driven to excel. Join our team and be a part of a dynamic community that thrives on mutual support and shared success.\nWhat do we offer:\nCompetitive fixed monthly salary!\nReferral bonus for bringing in top talent.\nGenerous 5 weeks of paid vacation.\nAnnual wellness benefit of 5,000 SEK through Benify.\nPension plan in accordance with the collective agreement.\nDedication to your career growth, tailored to your unique aspirations.\nAccess to continuous education and training within your field.\nA sense of community, with monthly events and gatherings to connect with fellow Sebratecers.\n\nLocation: Our office is in Gothenburg, but the assignments be in different locations nationally.\nIf you are a seasoned professional with a passion for software and engineering, ready to make an impact in the tech industry, Sebratec is the place for you. Join our dynamic team and be part of innovative projects that shape the future of technology. Apply now through the link below!",
        "url": "https://jobs.sebratec.com/jobs/3481045-embedded-possibilities-sebratec",
        "published": "2025-07-01T00:00:00",
        "deadline": "2025-12-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795278",
        "title": "Senior Cloud and Security Architect",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nJeppesen is currently looking for a Senior Cloud and Security Architect in Sweden, Gothenburg.\nWhy Choose Boeing Digital Aviation:\nAt Boeing Digital Aviation Solutions, you'll be a part of a team that creates innovative digital solutions and analytics that drive the future and evolution of Digital Aviation and enable our customers to transform the way they do business. Using agile digital technology, our solutions optimize all aspects of the flight ecosystem including safety, environmental sustainability, and efficiency – delivering value and protecting our customers and the planet.\nWho We Are Looking For:\nThe Boeing Digital Aviation Solutions (DAS) Application Engineering Senior Cloud and Product Security Architect must have broad cloud and application security background with experience in leading the definition and implementation of secure architecture and coding best practices for cloud native, customer-facing software solutions. The candidate needs strong technology leadership, analytical skills, teamwork, and excellent communication skills. The candidate will need to communicate at different levels in the organization to other technical personnel, business leaders and customers. This role will drive best-in-class software security practices into the Application Engineering organization in support of DAS modernization efforts to bring market-leading solutions to our aviation customers.\nWhat You Will Do:\n•   Develop and lead implementation of security architecture and secure coding standards and strategies for DAS software solutions. \n•   Contribute to the definition of overall DAS architecture security principles, guidelines, patterns, training, and standards. \n•   Drive adoption of DevSecOps practices into the software engineering organization by working directly with teams on implementation.\n•   Provide effective communication to business and technical community on security architecture topics.\n•   Perform security tool evaluations and make recommendations for adoption.\n•   Assess security impact of architectural decisions to product lifecycle. \n•   Lead the identification of design constraints and ensure architecture conforms to security requirements.\n•   Work across software engineering teams and architects for end to end alignment, process improvements and future designs.\n•   Contribute to the standard software artifacts including the Software Architecture Document, Software Architecture models and other standard artifacts.\n•   Work with customers to understand their security requirements.\n•   Ensure compliance with Boeing Information Security requirements.\n•   Collaborate with cloud service providers, Boeing InfoSec and Boeing Enterprise External Cloud teams to architect best-of-breed application security solutions across multiple clouds.\n•   Review internal and vendor artifacts for security architecture compliance.\n\n\nWhat You Will Need:\n• Bachelor's degree or higher in related field\n•   Highly technical and analytical, possessing 10 or more years of IT implementation experience.\n• 5+ years' experience in IT security, compliance and risk management, including privacy, controls, etc. \n•   Hands-on technical expertise in Security Architecture, automation, integration, and deployment (DevSecOps).\n• Strong verbal and written communication skills and ability to lead effectively across organizations.\n\n\nAdditional Success Factors: \n•   Proven experience leading a globally distributed team \n•   Proven experience to research, advise, compare and recommend technology solutions; ability to demonstrate and maintain method of keeping current on new technologies\n•   Proven ability to deliver application and infrastructure security solutions in a multi-cloud environment\n•   DevSecOps automation best practices\n•   DFARS/FedRAMP/ITAR \n•   NIST Cybersecurity Framework\n•   ISO 27001\n•   Security Development Lifecycle\n•   AWS/Azure/GCP Security services\n•   Cloud Security monitoring process\n•   Certificate Management\n•   Threat modeling\n•   Dynamic and Static Application Security Testing (DAST & SAST)\n•   Software Composition Analysis\nTypical Education & Experience: \nEducation/experience typically acquired through advanced education (e.g. Bachelor) and typically 10 or more years' related work experience or an equivalent combination of education and experience (e.g. Master+6 years' related work experience)\nThis position is hybrid. This means that the selected candidate will be required to perform some work onsite 3 days a week. This is at the hiring team's discretion and could potentially change in the future.",
        "url": "https://jobs.boeing.com/job/gothenburg/senior-cloud-and-security-architect/185/82514566736",
        "published": "2025-06-26T14:21:30",
        "deadline": "2025-08-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29794481",
        "title": ".Net-utvecklare till AFRY Göteborg",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Företagsbeskrivning\nAFRY är ett ledande europeiskt företag med global räckvidd inom teknik, design och rådgivning. \n\nVi är hängivna experter inom digitalisering, infrastruktur, industri och energi som skapar hållbara lösningar för kommande generationer. Tillsammans accelererar vi omställningen mot ett hållbart samhälle.\n\n\nJobbeskrivning\nVill du arbeta med andra duktiga kollegor som är lika tekniskt intresserade som du? Hos AFRY får du möjlighet att arbeta på ett företag som sätter sina anställda först och som alltid strävar efter att ligga i framkant när det kommer till teknisk innovation med hållbarhet i fokus.\nVi söker dig som har minst 5 års erfarenhet av mjukvaruutveckling och som vill arbeta med mjukvara för uppkopplade enheter exempelvis inom fordonsindustrin.\nDu gillar att arbeta enligt agila principer i ett skickligt och engagerat scrumteam som täcker alla aspekter av produkterna: design, implementering och testlösning. Vi kommunicerar direkt med intressenter för att hitta gemensamma och återanvändbara lösningar som säkrar kundernas framgång.\nVem är du?\nDu är en lagspelare; för oss är det viktigaste teamets leverans och våra anställda. Vi stöttar varandra för att komma fram till bästa lösningen för de utmaningar vi som team ställs infor. Du är riktigt duktig på C#, men ännu viktigare är att du är en person som gillar att få saker gjorda och tillhandahålla lösningar från design till support och acceptanstestning.\nFörutom programmering i C# är erfarenhet av kommunikationsprotokoll (design/implementering) meriterande. Du kommer definitivt att kunna välja din personliga målgrupp, men vår grundidé är att alla ska kunna göra allt, i enlighet med ett självorganiserande scrum-team.\n\n\nKvalifikationer\nUtmärkta kunskaper inom mjukvaruutveckling i C# och .NET Core (minst 5 år)\nMS Visual Studio, GIT\nErfarenhet av att arbeta med MAUI/Xamrin/iOS/Android-utveckling\nErfarenhet av att arbeta med DevOps, multitrådad programmering\nErfarenhet av SCRUM/Agila-metoder\n\nYtterligare färdigheter ses som meriterande:\nErfarenhet av diagnostiska kommunikationsprotokoll, till exempel ISO14229, SAEJ1587\nErfarenhet av .NET-applikationer med moln (Azure/AWS)\n\n\n\nYtterligare information\nOmfattning: Heltid\n\nStart: Enligt överenskommelse\n\nVi tar emot ansökningar löpande.\nVälkommen med din ansökan, sista ansökningsdag är 2025-08-18. \n\nVi ber om överseende, på grund av semestertider så kan återkoppling dröja något.\n\n\n\nKontaktuppgifter vid frågor:\n\n\n\nRekryterande chef\n\nLars Jakobsson – lars.jakobsson@afry.com\n\n \n\nVi ber er respektera att vi inte tar emot ansökningar via mail. \n\nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000067195474--net-utvecklare-till-afry-goteborg?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-06-26T11:22:07",
        "deadline": "2025-08-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29772626",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-06-16T12:25:38",
        "deadline": "2025-08-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29731905",
        "title": "AI Linguist - Digitalization & NLP Specialist",
        "employer": "Atqta AB",
        "location": "Göteborg",
        "description": "About Us:\nWe are a forward-thinking technology company focused on transforming industries through AI-driven solutions. For out client, we are looking for one AI Linguist to develop smarter, language-aware systems that unlock the power of unstructured data.\nRole Overview:\nWe are seeking a highly skilled AI Linguist to join our team and contribute to digital transformation projects across sectors. The ideal candidate will have a strong foundation in Natural Language Processing (NLP), Optical Character Recognition (OCR), and data analysis. You will work cross-functionally with data scientists, engineers, and project managers to build robust AI solutions that process and understand human language.\nKey Responsibilities:\nLead and contribute to the development of AI-driven digitalization tools\nDesign and implement NLP pipelines for tasks like classification, entity extraction, summarization, and sentiment analysis\nApply OCR techniques to extract information from scanned documents and handwritten text\nAnalyze linguistic data and corpora to inform model training and evaluation\nCollaborate with engineering teams to deploy and optimize language models\nManage AI-related projects from scoping to delivery, ensuring high quality and timely results\nContinuously monitor advancements in AI linguistics and integrate state-of-the-art techniques\n\n\n\nRequired Qualifications:\nAt least Bachelor degree in Computational Linguistics, Computer Science, Artificial Intelligence, or a related field\nDegree must be from a top-tier university (e.g., top 100 globally ranked institutions)\nProven experience in NLP, OCR, and data analysis (Python, spaCy, NLTK, Hugging Face, Tesseract, etc.)\nStrong project management skills; experience using tools like Jira, Confluence, or similar\nSolid understanding of linguistic theory and its application in computational models\nExcellent communication and documentation skills in English\n\n\n\nPreferred Skills:\nExperience working with large language models (LLMs) and prompt engineering\nFamiliarity with machine translation, speech recognition, or multilingual NLP\nPrevious experience in a digital transformation or enterprise AI project\nKnowledge of cloud platforms (AWS, GCP, Azure) and MLOps practices\n\n\n\nWhy Join Us?\nWork on cutting-edge AI projects with real-world impact\nJoin a highly collaborative, diverse, and international team\nCompetitive salary and benefits package\nOpportunities for professional development and career growth",
        "url": "https://www.atqta.com/",
        "published": "2025-05-26T17:12:28",
        "deadline": "2025-11-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29715982",
        "title": "Senior System Test Engineer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society. \n\n\nJob Description\nWe are looking for a senior system test engineer within electromobility that wants to be part of our team, testing and developing solutions for vehicles, systems and functions together with our customers in Gothenburg and Trollhättan.\nIn the role as system test engineer you will drive the development of testing for the next generations of mobility solutions. You are an important link between your team, suppliers and internal partners. Here you get the opportunity to work on exciting assignments for many different companies.\nWith us, you become an important part of the AFRY family, with different skills. Together we create sustainable solutions for the challenges of the future. To us it is important that you have the opportunity to develop in the direction that you would like, and therefore that you have a manager that supports you in your ambition.\nWe are looking for you with a bachelor or master’s degree within computer science, automotive, physics or similar. You have at least five years’ experience within automotive R&D within electromobility. A thorough understanding of product development processes are required, as well as experience with electrical architectures and safety concepts.\n\n\nQualifications\nYour main competence areas would be\nTesting of complex (HW/SW) automotive applications, both in simulated environments but also in vehicle\nDeveloping test cases from requirements with a system understanding\nImplementing test cases in simulated environments (HIL/SIL)\nUnderstanding of functional safety (ISO26262)\nRequirement development\nAgile development experience\n\nWe also think you are comfortable with at least some of these tools/areas\nPython, Matlab/Simulink, C/C++\nCanalyzer, Canoe, INCA, Controldesk\nJenkins, Git\n\nIn addition you have experience from product development within high voltage systems (Charging, traction batteries, electric motors, inverters).\nAs in all our recruitments large emphasis is put on personal qualities. As a person, you are positive and driven by constantly working to find new solutions to challenges you face together with your team. You are an effective and experienced communicator, and can express yourself well both orally and in writing. In addition, you are structured in your way of working and prefer order and order.\n\n\nAdditional Information\nWe are looking for someone who wants to be part of AFRY’s success story. Are you passionate about technology development? Do you like to work together to find the best solution? Then we can offer you career opportunities in a modern workplace with challenging assignments and exciting projects all over the world.\n\n\n\nThe AFRY Group is ranked as one of Sweden’s most popular employer among engineers. At AFRY you will be involved in developing innovative and sustainable solutions within infrastructure, energy and industry. We are always looking for the sharpest skills that can create a future society together with us. We hope you will learn as much from us as we will learn from you.\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000068810595-senior-system-test-engineer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-20T10:31:43",
        "deadline": "2025-08-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29709549",
        "title": "Join our Software Team within Automotive Infotainment!",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY provides engineering, design, digital and advisory services. We are devoted experts in industry, energy and infrastructure sectors, creating impact for generations to come. AFRY has Nordic roots with a global reach. Join us in accelerating the transition towards a sustainable society.\n\n\nJob Description\nAs SW Developer/System Engineer/SW Test Developer/Scrum Master within Infotainment you will work at one of our clients to develop and maintain the functionality of Personalization, Vehicle Functions , Positioning & Maps, Core HMI , Camera, BT Telephony, Security, Base Tech , vehicle power modes, SW Download and Diagnostics/OTA.\nYou will join a team with valuable knowledge from all infotainment domains. The daily work includes Infotainment development with end to end responsibility including design, architecture, documentation, implementation and automated tested case.\n\n\nQualifications\nWe believe that you have:\nM.Sc in Software Engineering or similar relevant experience\nAt least 3 years of software development in Java and/or C++ in a Linux environment\nGood English skills (written and spoken)\nGood understanding in working according to Agile principles\nEuropean driving license (B) \n\nOne or several of the below:\nExperience and good understanding of android stack development including knowledge within platform area\nExperience in test driven development\nExperience in developing automated unit or integration test in C++/Java and Python\nExperience from automotive environment\n\n\n\nAdditional Information\nWelcome with your application! Last date to apply: 6/7. \nDaniel Sletteberg Loveryd - Section Manager\n\ndaniel.slettebergloveryd@afry.com\n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000059723035-join-our-software-team-within-automotive-infotainment-?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-05-16T14:32:33",
        "deadline": "2025-08-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 70
    },
    {
        "id": "29690348",
        "title": "AUTOSAR (Classic and Adaptive) Architect",
        "employer": "VHR SOLUTIONS AB",
        "location": "Göteborg",
        "description": "1. AUTOSAR (Classic and Adaptive) architecture and concepts.\n2. Understanding of AUTOSAR development methodology and workflow.\n3. Knowledge of AUTOSAR configuration tools, such as DaVinci.\n4. Experience in classic AUTOSAR, preferably the Vector stack.\n5. Experience with AUTOSAR communication stacks (e.g., Ethernet, CAN, FlexRay).\n6. Understanding of AUTOSAR software components, including Basic Software (BSW) modules and Application Software (ASW).\n7. Familiarity with AUTOSAR development standards and guidelines.\n8. Proficiency in software development tools (e.g., Eclipse, Git, JIRA).\n9. Software development using C#\n10. Development of test cases using CANoe and C#.\n11. Automotive knowledge.\n12. Automotive embedded systems: strong understanding of in-vehicle ECU development\n13. Swedish Language (Swedish local Engineers preferred)",
        "url": null,
        "published": "2025-05-09T10:11:19",
        "deadline": "2025-08-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29662150",
        "title": "Senior Java Developer",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve exclusively Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 2300 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Canada, Greece, India and Poland.\nLife at Etraveli Group\nDepending on how you want to grow we want to listen in on your future career plan. To be able to inspire you to be your best within a fast moving industry we work hard to provide for the best prerequisites to make you feel that you belong together with us on our journey, by giving you a lot of work freedom, time for self studies, having recurring Hackatons, Dev weeks and a lot other fun activities together within the team and across the company to foster a great culture.\nDo you want to be part of the next step in our growth journey?\nIn alignment with the growing targets and needs, we are currently on the lookout for Java Developers to become part of our tight-knit teams in Gothenburg. In the teams, we are continuously looking to find new ways of working that decrease complexity and provide the tools for team members to do their best work.\nWhat will you be doing\nYou will be working on Java technologies, developing/maintaining our core back-end software system and facing fresh challenges along with your team members every day. Day to day tasks include new booking features and after sale support automations. The successful candidate must be knowledgeable in the field of software development and eager to contribute & work in a fast-paced, ever changing environment.\nYou will be part of designing and implementing features for our core back-end system, which handles millions of requests per day.\nYou will work closely with software and product developers.\nYou will test your code and write unit tests.\nDocument and communicate your work with your team in order to deliver weekly releases as well as estimate subsequent sprints.\nYou will participate in a stand-up meeting with your team every morning and participate in a weekly retro/planning session with your team.\nEnsure code quality and adherence to best practices, standards, and guidelines.\nCollaborate with cross-functional teams to implement new features and enhancements.\n\nOur stack\nJava, MySQL, MemSQL, Artemis, Kafka as well as Atlassians agile tools, Git, Jenkins, Docker, Kubernetes, Linux, Mac OS, IntelliJ.\nOf course you don't have to be familiar with all of our tech stack. We will support you in your journey with us.\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\nProven experience as a Java Developer, with a strong grasp of Java or Spring Framework.\nFamiliarity with RESTful web services and API development.\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\nStrong problem-solving skills and the ability to work independently and collaboratively.\nExcellent communication skills to interact effectively with team members and stakeholders.\nUnderstanding of the travel industry and a keen interest in keeping up with industry trends\n\nBenefits\nWhen working at Etraveli Group you will always feel that you are trusted and that you can rely on others to help you. To work together as a team and feel that you are challenged in a way that helps you evolve within your profession. You will have awesome colleagues together with whom you will solve complex problems in a fast-moving business. But not just that.\nWhat else do we offer?\nBrand New office in the City – We are located in Merkurhuset in central Gothenburg, just a stone's throw away from public transport and lunch restaurants.\nConferences – We believe in personal development and continuous education. We continuously organize internal trainings and workshops so that we can learn from each other.\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\nHackaton and Dev week – We believe in fostering creativity and testing new things.\nTo kick the day off just right, we serve breakfast at the office every morning.\n\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\nWelcome to Etraveli Group.\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.",
        "url": "https://apply.workable.com/j/52B77B692A/apply",
        "published": "2025-04-28T14:44:04",
        "deadline": "2025-08-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29661465",
        "title": "Senior Python/Matlab Developer- Gothenberg",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Professional Galaxy looking for an experienced Matlab and Python developer for one of our clients in Gothenburg. The role requires strong analytical skills, experience working in complex technical environments, and proven knowledge of microwave technology.\nYou will contribute to the creation and improvement of technical systems and analytical tools. Its beneficial if you have a great understanding of microwave technology, as well as the ability to manage technical documentation and databases.\nRequirements: - 3–5 years of experience in Matlab and Python development - Documented experience with microwave technology - Strong skills in handling technical documentation and databases - Excellent communication skills in English - Relevant educational background in engineering, electronics, computer science, or similar\nDuration: 2025-09-01 - 2025-02-28\nApplication deadline: 2025-04-30",
        "url": "https://careers.progalaxy.se/jobs/5857963-senior-python-matlab-developer-gothenberg?promotion=1447444-arbetsformedlingen",
        "published": "2025-04-28T12:59:35",
        "deadline": "2025-10-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29538714",
        "title": "Senior Mjukvaruutvecklare",
        "employer": "Professional Galaxy AB",
        "location": "Göteborg",
        "description": "Du kommer att ingå i ett utvecklingsteam som arbetar med forskning och utveckling av testutrustning, testmetodik och testmiljöer. Syftet är att möjliggöra avancerade tester av automatiserade och uppkopplade fordon för att säkerställa en trygg och hållbar trafikmiljö i framtiden.\nDu förväntas ha en god samarbetsförmåga, vara ansvarstagande och ha en analytisk förmåga med intresse för att sätta dig in i olika forskningsfrågor.\nObligatoriska krav: MSc. inom elektro, mekatronik eller motsvarande.\n \nErfarenhet:\n Minst 5 års erfarenhet som mjukvaruutvecklare i industrin.\n \nProgrammeringskunskaper:\n Goda kunskaper i C++ och Python.\n \nLinux-kunskaper:\n Van att arbeta med olika varianter av Linux-distributioner.\n \nB-körkort:\n Svenskt B-körkort.\n \nSpråkkunskaper:\n Behärska både svenska och engelska i tal och skrift.\n Mervärden (önskvärda kvalifikationer): Kunskaper i MatLab.\n Erfarenhet av sensorfusion och sensorutveckling.\n Erfarenhet av CARLA eller Unreal Engine är meriterande.\n Dokumentation: CV med kompetensbeskrivning.\n Beskrivning av genomförda uppdrag.\n Uppdragsperiod:\n20250407 - 20260406 , 1 år med möjlighet till förlängning om 3 år.\nPlacering:Uppdraget är placerat i Göteborg med en del arbete på en testbana utanför Borås.",
        "url": "https://careers.progalaxy.se/jobs/5674587-senior-mjukvaruutvecklare?promotion=1381054-arbetsformedlingen",
        "published": "2025-03-12T18:39:32",
        "deadline": "2025-08-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29841188",
        "title": "Lead Software Developer",
        "employer": "Hellsten Gears AB",
        "location": "Kungsbacka",
        "description": "Hellsten Gears AB is looking for a Lead Developer who will take technical ownership of our web-based systems – both internal and customer-facing. You will be hands-on in development while being responsible for the overall system architecture, code quality, security, and future development. This role works closely with the CEO and the operations team – but does not include personnel management.\nWe are looking for someone with many years of experience as a full stack developer. Our codebase ranges from modern frameworks to legacy systems over 20 years old. Broad experience with different types of technologies, architectures, and system environments is highly meriting.\nWe actively collaborate with developers and businesses in Thailand, so experience with Thai work culture or fluency in the Thai language is mandatory. English language and experience of European/Swedish work culture is also highly valued. \nYour responsibilities will include\n·       Maintaining and developing our custom web systems\n·       Acting as a technical advisor to the organization\n·       Ensuring a modern, secure, and scalable codebase\n·       Introducing new tools and frameworks when needed\n·       Making technical decisions and handling deployments\n\n\nOur current tech stack includes\n·       Ruby (Ruby on Rails)\n·       PHP5 (Laravel)\n·       Node.js (Vue.js, React.js, Express.js, Fastify)\n·       Elasticsearch\n·       MySQL\n·       Docker\n·       Git (GitHub)\n·       DigitalOcean\n·       Kubernetes\n·       Jenkins\n\n\nMeriting experience includes\n·       CI/CD pipelines\n·       Automated testing\n·       IT security\n·       UX/UI design\n·       Database relational design\n·       API integrations\n·       Legacy system architecture (monoliths, micro services in-house platforms)\n·       Experience with Thai work culture\n·       Fluency in the Thai language\n \nAbout you\nYou are a skilled full stack developer with at least 15 years of experience in web development and have ideally had technical ownership in one or more projects. You are comfortable working independently but also enjoy collaborating with non-technical colleagues. You are pragmatic, solution-oriented, and curious.\nYou must be able to communicate fluently in English and Thai, both written and spoken.\nAbout Hellsten Gears AB\nHellsten Gears AB is a Swedish company that develops, repairs, and sells gearboxes for vehicles and machines. We are a team of 20 people working with both private and commercial customers in Sweden and internationally. Our workshop is located in Fjärås, Halland County, near Gothenburg.\nWe are an innovative company combining traditional mechanical work with digital solutions. We build and maintain our own internal systems to streamline operations – from customer communication to logistics, spare parts management, and invoicing.\nTerms of employment\n·       Type of employment: Permanent (probationary period may apply)\n·       Scope: Full-time\n·       Working hours: Weekdays, office hours\n·       Location: Fjärås, Kungsbacka municipality, Sweden (onsite; partial remote possible)\n·       Start date: As agreed\n·       Salary: Monthly salary, individual agreement",
        "url": "https://www.hellstengears.com/en/jobba-hos-oss",
        "published": "2025-07-16T18:21:50",
        "deadline": "2025-08-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29865247",
        "title": "Data Protection and Compliance Officer (Senior or Lead)",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "Jeppesen, Planning and Operations is seeking a Data Protection and Compliance Officer (Senior or Lead). We offer world leading digital solutions for Flight Operations to major airlines across the globe, saving customers time, money, and resources across the entire airline ecosystem. These software and data analytics powered solutions help customers navigate and operate more efficiently, reduce fuel consumption, optimize crew utilization, minimize disruption impact.\nData privacy is an important aspect of our business, not the least in Planning & Operations where our solutions hold a lot of airline crew data. Therefore, we are now strengthening our team with a Data Protection and Compliance Officer, at senior or lead level.  The position is based in our centrally located office in Gothenburg, with five hundred colleagues of more than fifty nationalities. For a communicative, international minded and positive person this is a great opportunity to join a cutting edge IT company and drive our data privacy questions.\nPosition Responsibilities:\nEnsure our compliance with data privacy regulations, in EU and globally\nThe primary scope is client data but also employee and other data\nEnsure privacy by designing new initiatives, projects, and processes\nSupport in privacy risk and impact assessment\nAdvice on data privacy related contract language\nHave contact with clients and partners in data transfer matters, including negotiating data processing agreements\nTrain teams and spread awareness in the privacy area\nRecord management and advice on how to apply privacy principles\n\nBasic Qualifications (Required Skills/Experience):\nYou have a relevant degree at least on Bachelor level, preferably in law\nYou have 3+ years of experience from working with data privacy\nYou are fluent in English both orally and in writing\nExisting rights to work in Sweden\n\nThis position is hybrid and flexible. This means that you can work partly from home, but at least 2 days per week in the office. \n​Preferred Qualifications (Desired Skills/Experience):\nSenior (Level 4):\nYou have 3+ years of experience from working with data privacy\nYou are well known with EU data privacy regulations and have knowledge of regulations outside the EU.\nYou have working experience from legal and/or compliance in the IT industry\nPreferably you have knowledge of AI regulation related compliance\n\nLead (Level 5):\nYou have 5+ years of experience from working with data privacy\nYou are well known with EU data privacy regulations and have some knowledge of regulations outside the EU.\nYou have working experience from legal and compliance in the IT industry\nYou have knowledge of AI regulation related compliance\n\nRelocation: This position does not offer relocation. Candidates must live on commute distance or relocate at their own expense.\nVisa: If visa is required, the employer will initiate the visa application; however, the successful candidate will cover the cost of visa.",
        "url": "https://jobs.boeing.com/job/gothenburg/product-owner-airline-applications-ops-control/185/83578343312",
        "published": "2025-07-29T16:28:50",
        "deadline": "2025-08-10T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29816907",
        "title": "IT Security & Risk Officer",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n\n\n\n\nWe are at a pivotal moment where digitalization is key to our future success, presenting an exciting opportunity to make a significant impact. \n \nIn an environment of change, with exciting new technologies and evolving customer needs, Group Trucks Technology (GTT) continues to invest in digitalization supporting our strategy, strengthen our core engineering functions, and prepare us for future goals. \n \nAs part of this strategic transformation, we are seeking a proactive and insightful IT Security & Risk Officer for GTT Digital Operations to help drive our digital ambitions securely and effectively.\n \nAbout us \n \nOur 100-person team across Gothenburg, Lyon, Greensboro, and Bangalore drives digital transformation for GTT, fostering collaboration, synergies, and effectiveness. We are responsible for managing the IT strategy, initiatives and budget, leading the alignment of strategy work including AI, data, and simulation. We foster innovation and performance, promoting an innovative culture while balancing technical, operational, and relational aspects of the business \n \nWhat will you do? \n \nAs IT Security and Risk Officer you will identify, assess, and mitigates information security risks within an organization. You play a crucial role in safeguarding an organization's information systems and data by establishing policies, monitoring compliance, and implementing risk management strategies. \nWho are you?\n \n \nCapability Building & Change Enablement \n \nLead the development and execution of enterprise security capability programs within GTT, ensuring the engagement and buy-in from senior management, aligning operations to security directives, policies and guidelines. \n\n \nFacilitate cross-functional forums (e.g., Security Workgroups with business representatives) to drive collaboration, knowledge-sharing and business-aligned requirements gathering to further strengthen and enable desired security behaviors. \n\n \nSupport operational teams with vulnerability management processes and tools \n\n \nAwareness & Culture Change \n \nDesign and deliver tailored awareness activities, supporting the strategic roadmap. Follow up on awareness KPI’s, such as phishing email results or training completion, and implement risk mitigation plans. \n\n \nTranslate technical content into business-relevant messaging to engage non-technical stakeholders and drive behavior change \n\n \nCross-functional collaboration & representation \n \nRepresent GTT in forums connected to vulnerability and security awareness collaborating with Information Security Officers and BISO’s from other TD/BA’s and geographical regions.\n\n \nData-driven communication & Insight development.\n\n \nCompile and interpret technical data to visualize security data, enhancing clarity and impact during executive and operational presentations. \n\nWho are you\nAs an enthusiastic security expert with a solid track record, you’re eager to advance your career while working with amazing people around the world. You excel in communication, and lead through networks, and you embody the Volvo Group Values with integrity and trust. You help foster a positive work environment based on meaningful work, diversity, supportive colleagues and management, and a growth mindset. \n \nTo succeed in this role, we believe you have: \n \n \nA degree in engineering, IT, or cybersecurity, or equivalent experience and several years of professional experience in Cyber Security, IT Security, or Information Security, preferably within Enterprise Information Security. \n\n \nUnderstanding and proven experience in Information Security best practices, process design, and implementation. \n\n \nCertifications in CISSP, CISM, CISA, CRISC, or similar are preferred \n\n \nExperience with relevant standards (e.g., ISO27001) and data protection regulations (e.g., GDPR) are a merit. \n\n \nLeadership experience and familiarity with the manufacturing industry is a plus. \n\n \nProficiency in English, both verbal and written. \n\nWhat's in it for you?\nWe offer a solid package of compensation and benefits, plus you will enjoy: \nworking global company taking the maximum advantage of the strength inherent to differences in knowledge, experience, age, gender, and nationality, among others \nWe offer a stimulating environment where you’ll work with committed colleagues, influence strategic decisions, and grow in your professional role. We encourage initiative, innovation, and continuous development—both professionally and personally. \n \nThe last date to submit your application is August 15th, 2025. \n \nWe’d love to hear from you and don’t hesitate to call us if you have any question! \n \nMagnus Nilsson, Director CDO Office via mail: magnus.a.nilsson@volvo.com \n \nKindly note that due to GDPR, we will not accept applications via mail. Please use our career site",
        "url": "https://jobs.volvogroup.com/job-invite/22977/",
        "published": "2025-07-07T13:13:25",
        "deadline": "2025-08-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29815823",
        "title": "Research Engineer(s) in fusion reactor modelling and design",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join the Plasma Physics and Fusion Energy group to help develop the European Transport Simulator (ETS), a cutting-edge fusion research tool supporting the development of modelling fusion power plants. We’re hiring Research Engineers with expertise in areas such as UI design, data analysis, AI/ML integration, and HPC workflows to contribute to the next-generation modeling framework\n\nInformation about the department\nThe Plasma Physics and Fusion Energy (PPFE) group at the Department of Space, Earth and Environment/Astronomy and Plasma physics division has its main activities in modeling, simulation and analysis of tokamak plasmas. A major part of the work is towards the establishment of a predictive capability for fusion energy grade plasmas and model validation towards current experiments. The group has extensive collaborations with major fusion devices and are taking part in the developments for the ITER experiment and the design of scenarios for future pilot power plants. \nThe activities are fully integrated with the European (EUROfusion) activities, and the research group also engages in the development of open data access for fusion experiments and modeling data. We are now aiming to upgrade our main research tool to a new modelling framework while also upgrading user interfaces and data analysis capabilities.\n\nMajor responsibilities\nThe ETS project addresses a range of technical challenges, and we are currently moving the code to a new python based High Performance Computing enabled modelling framework. \nThis is an exciting opportunity to contribute to a high-impact scientific codebase that supports fusion research across major European experiments and ITER. The work will be performed in a collaborative, international environment, with opportunities to engage with a wide network of researchers and institutions across Europe.\n\nContract terms\nThis is a fulltime temporary employment limited to a maximum of 360 days.\n\nQualifications\nWe are looking for individuals with relevant expertise towards at least one of the activites below\n- Maintain the ETS workflow in the Python/MUSCLE3 framework including CD/CI support\n- Develop analysis tools for ETS components (e.g., runtime debugging, offline debugging for Transport Code Interfaces package)\n- Maintain and further develop python based visualization tools for ETS (runtime, postprocessing).\n- Develop the graphical user interface for ETS\n- Integration and support of AI/ML-based surrogate models\n- Support the ETS data access tools and help integrate ETS output in an open access environment\n\nFurthermore, you should have a M. Sc in relevant field, for example Computational Science, Software Engineering or Computational Physics. Experience in programming (python, C++, fortran...), data management and/or visualization is needed. Experiences in plasma physics is meriting but not mandatory.\n\nWe offer \nChalmers offers a cultivating and inspiring working environment in the coastal city of Gothenburg. \n Read more about working at Chalmers and our benefits for employees.\n\nChalmers aims to actively improve our gender balance. We work broadly with equality projects, for example the GENIE Initiative on gender equality for excellence. Equality and diversity are substantial foundations in all activities at Chalmers.\n\nApplication procedure\nThe application should be sent electronically and be attached as pdf-files, as below:\n\n\n• CV: (Please name the document as: CV, Family name, Ref. number)\n• Personal letter: (Please name the document as: letter, Family name, Ref. number)\n\n\n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered.\n\nApplication deadline: 2025-08-24\n\nFor questions, please contact:\nPär Strand, SEE/AoP, par.strand@chalmers.se, 031 7721514\n\n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. *** \n   \n\n\n\nChalmers University of Technology conducts research and education in engineering sciences, architecture, technology-related mathematical sciences, natural and nautical sciences, working in close collaboration with industry and society. The strategy for scientific excellence focuses on our six Areas of Advance; Energy, Health Engineering, Information and Communication Technology, Materials Science, Production and Transport. The aim is to make an active contribution to a sustainable future using the basic sciences as a foundation and innovation and entrepreneurship as the central driving forces. Chalmers has around 11,000 students and 3,000 employees. New knowledge and improved technology have characterised Chalmers since its foundation in 1829, completely in accordance with the will of William Chalmers and his motto: Avancez!",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14133&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-07-07T09:24:37",
        "deadline": "2025-08-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29807821",
        "title": "Digital Research Engineer - Data Analysis and Scientific Visualisation",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Digital Research Engineer - focus on Data Analysis and Scientific Visualisation\n\nAbout Chalmers e-Commons\nThe mission of Chalmers e-Commons is to provide Chalmers´ integrated hub for enabling digitalised research and innovation, empowering researchers and innovators at Chalmers and giving Chalmers a competitive advantage in fundamental research and collaborations with other parts of society. The initiative is a unique university-wide initiative to integrate access to e-infrastructure resources, support, and expertise in collaborative projects for supporting the full range of digital aspects of research.\n\nAbout Digital Research Engineers at Chalmers e-Commons\nChalmers e-Commons hosts an expert hub of Digital Research Engineers, collaborating with researchers, research initiatives, and research infrastructures to advance research and innovation in all research areas. The team of engineers supports research by providing expertise on the practical use of data analysis/management and computing resources, advancing the state-of-the-art in selected collaborative projects where research methods and software are developed and used. Here, the Digital Research Engineers work closely with both the researchers and the e-infrastructure experts in e-Commons. For clusters of problem areas, the Digital Research Engineers build, coordinate, and further develop networks of Chalmers experts on digitally supported research. The Engineers also provide advice on which e-infrastructure resources and services - locally, nationally, and internationally – that will be most suitable for specific research efforts.\n\nThe employment presented in this advertisement has a focus on modern data analysis (including machine learning/AI) and scientific visualization. Part of the work will be performed within e-Commons AI/ML group, supporting Chalmers' research projects. Also, the work will be partly performed within the framework of the national research infrastructure for visualization, InfraVis. InfraVis is a long-term effort by the Swedish Research Council and nine Swedish partner universities where visualization experts work with various software solutions and access to high-end visualization laboratories, providing support to research projects at the national level.\n\nContract terms\nFull-time permanent employment\n\nYour qualifications\nAcademic degree in a relevant field of science or technology. A PhD degree or relevant experience of research at PhD level, within or outside academia, is a merit.\n\nDocumented experience and competence in analysis and management of research data and/or scientific visualisation, Good communication skills, both written and spoken, in English and - if Swedish is your mother tongue - in Swedish. Experience in working in collaborative projects, where you also have an ability to create trust. Experience of building and leading groups and networks containing different competences and interests. Also, experience in planning and executing projects and interest in your own personal development.\n\nWhat we offer \n Chalmers provides a cultivating and inspiring working environment in the coastal city of Gothenburg. \n Read more about working at Chalmers and our benefits for employees.\n\nChalmers aims to actively improve our gender balance. We work broadly with equality projects, for example the GENIE Initiative on gender equality for excellence. Equality and diversity are substantial foundations in all activities at Chalmers.\n\nApplication procedure \nThe application should be attached as PDF files, as below:\n\nCV\n\nPersonal letter\n\n\n\n• Personal letter, explaining why you are interested in the employment, what you could contribute to Chalmers e-Commons and the national infrastructure InfraVis. Also, describe what you expect Chalmers e-Commons, Chalmers, and InfraVis to contribute to your personal development\n\nOther documents (optional): \n• Copies of completed education, grades etc.\n\nPlease use the button at the bottom of the page to reach the application form. We do not accept applications sent by email.\n\nApplication deadline: August 4, 2025\n\nFor questions, please contact:\nSverker Holmgren\nE-mail: svehol@chalmers.se\nTel: +46 31-772 191212\n\n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***\n\n\n Chalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society.\nChalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14104&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2025-07-02T15:17:07",
        "deadline": "2025-08-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29805236",
        "title": "Development Manager",
        "employer": "Visma Software AB",
        "location": "Göteborg",
        "description": "We're Visma Software Nordic, a leading SaaS ERP House, deeply rooted in the Nordic market. Our ERP product suites specialize in simplifying complex business processes, empowering our customers to stay focused, scale and work smarter.\n \nOur Purpose is to Simplify the complex. We dive into our customers' most intricate operations and make them efficient and simple to perform. Our Vision is to Shaping the future through smart technology. We're committed to innovation and pushing the boundaries of what's possible. Our Mission is to Create a seamless experience with local edge. We combine a broad, unified product offering with deep, localized expertise within the Nordic market.\n\n\r\n\r\nDevelopment Manager to Transpa - Visma Software Nordic\n\nAre you ready to lead a highly competent product development team towards the future? If you’re driven by people leadership and leading operational excellence in a tech savvy environment, you should continue reading. We are now looking for a Development Manager to Transpa Business Line in Visma Software Nordic (Gothenburg or Munkedal). \n\n\nWhat You’ll Do\n\nAs a Development Manager, you’ll take full ownership of your team’s success, focusing equally on leadership, people development, and strategic projects. At our company, people are at the heart of everything we do. You’ll lead a distributed product development team across Sweden and Romania, ensuring they thrive in a well-structured and engaging environment. Our team consists of talented people working within the whole development chain from A to Z with our product TransPA. Part of your time you’ll also be our key player as project manager for a number of strategic projects, with focus on increasing growth and customer engagement.\n\n\nTranspa is built and developed specifically for the transportation industry. An easy-to-use, fully web-based solution that helps you automate payroll management, gather all information in one place, and gain full control over time, personnel, agreements, and laws.\n\n\nIn this role you will report directly to Business Line Director, Oscar Mattsson, and also be part of the local management team for the business line. Your main responsibilities will be:\n\n\nPeople Leadership:\n\n\n\n• Drive people related processes in your team, such as recruitment, performance development and employee engagement.\n\n• Coach individuals to help them grow and excel in their roles and reach their full potential.\n\n• Drive communication and translate business strategies & OKR:s to concrete plans for your team.\n\n• Create a culture of psychological safety, collaboration, and continuous learning.\n\n• Develop and drive work methods, ensuring they align with business goals and foster productivity.\n\n• Improve and implement processes that enhance efficiency and quality across the teams. This includes harnessing the potential of AI for internal use, to help the team work smarter, not harder.\n\n• Oversee budgets, resource allocation, and team structure to ensure your department operates effectively.\n\n\nStrategic Projects:\n\n\n\n• Act as project manager for strategic projects, from concept to completion, ensuring they are delivered on time, and within scope, and meet our high quality standards.\n\n• Engage in market facing initiatives, to make sure TransPA has a voice as thought leaders software vendor in the Swedish transport industry.\n\n• Bridge the gap between technical development and business strategy, driving initiatives that align the development team’s innovation with our commercial goals.\n\n\nIn this role, you can be based at either our office in Munkedal or in Gothenburg. Business travels are included in the role. \n\n\nWhat makes this role exciting\n\nWe are currently in a very exciting phase of TransPA’s journey. As of 2025, we have established our own independent business line within our mother company Visma Software Nordic. This means we have brought together all teams in the TransPA value chain – from code to customer – under one roof. The goal? To become an even stronger and more product-focused team. As our new Development Manager, you will play a key role in this transformation. With us, you’ll get the best of both worlds – the opportunity to lead in a smaller, agile organization while also benefiting from the strength of both Visma Software Nordic and the wider Visma Group.\n\n\n\n\n\nWe offer:\n\n\n• Personal growth: Leadership development and a culture that prioritizes psychological safety.\n\n• Great perks: Such as flexible hybrid work model, private health care insurance, access to company cabins in the Alps to mention a few.\n\n• A flagship product: Work with Transpa, a market leading personnel product in the Swedish transport industry.\n\n• Supportive culture: Ownership, empowerment, and collaboration are core to who we are.\n\n\n\n\n\nWho are we looking for?\n\nWe believe that you are / have:\n\n\n\n• Previous experience and success from leadership & project management.\n\n• Proven track record in engaging people and optimizing processes.\n\n• Previous experience from working within a software development organisation. You don’t have to be a technical hero yourself, but you have genuine interest and insight into software development methods and principles. \n\n• A great networker and a skilled social navigator in international and complex environments.\n\n• Skillful in conveying clear, honest communication. Fluency in Swedish and English.\n\n\nBonus points if you have:\n\n\n\n• Experience from the transport industry or similar, logistic heavy operations.\n\n• More extensive technical background.\n\n• Success in managing remote and distributed teams.\n\n\nApplication\n\nApply by attaching CV or a link to your updated LinkedIn profile. We friendly decline cover letters in this process. Don't wait to seize this opportunity! We're reviewing applications as they come in, but due to summer vacation we will start the process in August. Questions? Contact Oscar Mattsson, Business Line Director, 46 734 344795",
        "url": "https://hire.vismatalent.com/spa/public/apply?guidAssignment=8930f205-6aae-404f-be7a-09ff72f3f5ff&publishCode=AMS&TK=5470dc3a-dafb-4906-aa5a-4bfa4cb997b7",
        "published": "2025-07-01T16:20:27",
        "deadline": "2025-08-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29795052",
        "title": "Software Application Development Manager",
        "employer": "Jeppesen Systems AB",
        "location": "Göteborg",
        "description": "At Boeing, we innovate and collaborate to make the world a better place. We're committed to fostering an environment for every teammate that's welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us.\nFor more than 80 years, Jeppesen, a Boeing Company, has made it possible for pilots and their passengers to safely and efficiently reach their destinations. We are the world's leading provider of aeronautical data and operational support, combining our company's enduring spirit of innovation with a legacy of leadership in aviation to deliver 21st century navigation and optimization solutions.\nJeppesen, A Boeing Company is looking for a Software Application Development Manager. The position will be based in Gothenburg, Sweden in our newly renovated office at Odinsgatan.\nAbout the position\nThe Software Development and Advanced Technology department is now looking for a Line Manager who want to join us and be a part of driving a transition journey. We are on a journey to take our solutions into the cloud and at the same time continue to explore what modern technology such as AI and Quantum Computing can do to support our customers in the best possible way.\nOur development teams build world-leading optimization solutions targeting professional users as well as web-based solutions for airline personnel.\nAs a line manager, you will be joining a team of 10 line managers and you will be leading 3-4 teams and about 15-20 team members. Both the leadership team and the development teams use agile principles to plan and perform their work.\nPosition Responsibilities:\nAs a line manager you will:\nBe accountable for your team's deliveries and performance\nSupport your teams when they innovate, develop and maintain our software\nCoach both teams and team members to help them perform at their best\nWork closely with product management and the neighboring implementation department\nBe an active member of a leadership team that collaborates on a daily basis\nDrive continuous improvement across teams and departments\nPlay an active part in our technical and cultural transformation journey\nHelp create a workplace that gives you and your colleagues energy and make Jeppesen the best workplace in town\n\n\n\nProfile:\nOur leaders play an important role in nurturing our identity and company culture. We want our teams to apply an owner's mentality in everything they do and feel proud about what they do for our customers. This requires a special mindset and we believe our leaders play an important role in building and nurturing that culture.\nRequired qualifications:\nAbility to speak and write English fluently\n\n\n\nPreferred qualifications:\nAs a leader we believe that you:\nHave a background in the IT industry\nHave a track record of being a good coach to teams and people\nAre passionate about always improving ways of working and that you are eager to learn\nAre passionate about software development and new technology\nAre familiar with Agile and Lean principles\nHave track record of creating a safe, inclusive and collaborative working climate\n\n\n\nIf you want to take part of our journey and would like to work in an international atmosphere, please submit your application in English.\nRelocation: This position does not offer relocation support.\nShow Sponsorship: Employer will initiate the visa application; however, the successful candidate will cover the cost of visa.\nPlease apply ASAP for this role as recruitment may commence before the end date.\nIf you join us you will get the chance to:\nGet professional skills development with our virtual learning tools and platforms e.g. (Digital Campus, LinkedIn Learning, Degreed, EdX, Enterprise Mentoring, and Communities of Excellence & Practice)\nBroaden your experience in international projects, technical workshops and hackathons\nEnjoy additional days off for Christmas break (December 24th-January 1st)\nParticipate in employee recognition program\nHave Private Medical Insurance (Skandia)\nGrow as a leader in an international team\nAnd more...\n\n\n\nPlease note that, due to the summer holiday period, there may be minor delays in the recruitment process.",
        "url": "https://jobs.boeing.com/job/gothenburg/software-application-development-manager/185/82983740480",
        "published": "2025-06-26T13:45:45",
        "deadline": "2025-08-09T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787427",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-06-24T08:06:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29787426",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-06-24T08:03:52",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29760753",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "Functional Safety Engineer\nThe world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nThe role is an integrated part of our System Safety Competence Center (SSCC) where a team of (System Safety Leaders) SSLs are together achieving the long-term goals of ensuring and delivering safe products within the System Safety area. System Safety includes Functional Safety (FUSA) as well as Safety of the Intended Functionality (SOTIF).\nIn this role you will play a key role in:\n•  Drive the implementation of ISO 26262 & ISO 21448 and system safety processes across the organization.\n•  Develop and maintain system safety methods, tools, and best practices.\n•  Conduct awareness and training sessions to enhance the organization's understanding of system safety, principles, standards and way of working.\n•  Provide expert support and guidance on system safety processes to various departments, including engineers and managers.\n•  Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262.\n•  Stay up to date with industry trends and advancements in system safety and international standards.\nYour profile\n•  Relevant educational background\n•  Minimum 4 years of experience in Functional Safety\n•  Good knowledge of systems engineering including embedded SW/HW in the automotive domain.\n•  Good knowledge of system safety engineering practices, safety standards and product safety.\n•  Deep knowledge in the automotive relevant system safety standards e.g. (ISO 26262, ISO 21448)\n•  Experience in risk assessment and analysis methodologies (HARA, FTA, FMEDA, FMEA) and processes/methods/tools for functional safety and safety of the intended functionality.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/151650-en_US+sap_btp/",
        "published": "2025-06-10T13:37:03",
        "deadline": "2025-10-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29746502",
        "title": "PLM Solution Architect",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\n\n\nYour Role\nWe’re looking for Senior Solution Architects with experience from Teamcenter, 3DExperience or Windchill, who can bring value to the team and work as a key resource in our PLM projects. You will act as a creator of architectural design, defining system requirements and use cases to address overall business requirements, ensuring that the technical solution remains aligned and delivers value throughout any project. Location can be in Stockholm, Gothenburg or Malmö.\n\n\n• Engage in Customer Project Delivery Activities\n• Conduct requirements gathering sessions and workshops\n• Analyze customer requirements and take ownership of high / low level design for PLM and other associated systems \n• Propose, plan, design and communicate architectural solutions with Capgemini, Software vendor architects and customers\n• Produce written specifications that align with customer requirements for proposed solution and configuration activities\n• Identify issues, risks and provide input on solutions to key stakeholders\n• Explain requirements, design and configuration requirements to onsite / offshore team members\n• Guide team as required to ensure deliverables meet customer expectations\n• Demos to key stakeholders as required during requirement gathering and in later stages for UAT etc.\n• Participate in customer delivery and cutovers as needed.\n• Actively contribute to Pre-Sales Activities\n• Work with sales for budgetary proposals\n\n\nYour profile\n• University degree, preferably in the fields of Computer Science or Engineering\n• Demonstrated expertise in developing and deploying solutions based on Teamcenter, 3DExperience or Windchill\n• At least 4 years of experience working in a Nordic country\n• Proven IT development experience as well as experience of multi-cultural project teams, where parts are located off-site\n• Excellent communication skills in English, both orally and written\n• Swedish work permit or Swedish citizenship\n\n\nMeritorious skills\n• Swedish communication skills, both oral and written\n• Past coding experience on Java, JSP, MQL, EKL, Widgets\n• Knowledge of data migrations \n• Working knowledge of CAD tools, PLM-CAD-ERP and other enterprise integrations\n\n\nWe are looking for a team player who sees the team’s contribution as the ultimate goal. Additionally, you should be a self-going and communicative person with natural leader instincts, drive and independence.\n\n\nWhat we believe you will enjoy about working here \n• We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n• At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n• We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\n\n\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/1342-en_US+sap_btp/",
        "published": "2025-06-03T10:09:03",
        "deadline": "2025-11-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29476672",
        "title": "Supplier Quality Engineer with experience in Software",
        "employer": "Qamcom Research And Technology AB",
        "location": "Göteborg",
        "description": "You now have the chance to join us, the Standards & Methods team at Qamcom! \nWe are a central team of highly skilled and motivated persons driving multiple aspects for multiple technologies for the complete life cycle of our global range of products. Competences of the team include System Safety, Quality and Security and typical industries are automotive, medical, aero and rail. \nAbout the role: As an SQE, you will have a full end-to-end ownership of your portfolio. Your input is key to selecting the most suitable supplier for a sourcing award. In this role you will work mainly in the field of connectivity and the suppliers you will assess will mainly come from software and electronics. Your work continues throughout the project to secure a quality assured project launch. Risk management skills will be important through all steps: sourcing, project and running production. The job requires frequent travels during certain periods. \n \nYour Background In this recruitment, we will have a high focus on the mindset and personality. We are looking for someone that embraces problems and sees it as learning opportunities. You have a collaborational mindset and willingness to share ideas.\nFurther you have a great interest in the quality area with a good knowledge of automotive quality standards. Customer satisfaction is important for you while remaining structured and organized. \nQualifications \n  MSc or BSc in Engineering or equivalent, and 6 years of work experience needed \n Good knowledge and practice of automotive quality standards and tools, such as IATF 16949, VDA, APQP, PPAP, ISO 9001.\n Knowledge in ASPCE and ISO 26262\n Experience in assessing suppliers in the software and hardware domains\n Experience from supplier quality work\n Good English communication skills, both orally and in writing\n Drivers licence\n Meriting with engineering work\n Qamcom offers\nWe are proud to offer a work environment with highly competent and experienced colleagues. We create teams with a unique blend of high academic competence and rich industry experience. In our in-house projects we often create cutting-edge system solutions that encompass hardware, software, and algorithms tailored for industrial and medtech applications. Hence, we provide the possibility to apply advanced technology in various product development projects focusing on a variety of business segments like medtech, industry 4.0 and Industrial IoT and AI. \nAdditionally, a sample of general benefits are listed below:\n Competitive insurance and pension program.\n Generous parental leave (90% of the salary).\n Wellness policy (up to 5000 SEK/year).\n Leasing of a bicycle and option for an employee car (electric or hybrid).\n \nJoin us at Qamcom, where your expertise will contribute to shaping the future of technology and innovation.",
        "url": "https://career.qamcom.com/jobs/5358781-supplier-quality-engineer-with-experience-in-software?promotion=1348393-arbetsformedlingen",
        "published": "2025-02-18T15:11:38",
        "deadline": "2025-08-07T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]