[
    {
        "id": "30596880",
        "title": "ServiceNow-utvecklare",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Vilka är vi?\nUnibase är ett växande IT-företag med passion för att skapa värde för våra kunder genom smarta tekniska lösningar. Vi arbetar med spännande projekt och samarbetar med kunniga kollegor. Nu söker vi dig som vill vara med och göra skillnad genom att utveckla och förvalta lösningar i ServiceNow-plattformen.\nOm rollen\nVi söker en erfaren ServiceNow-utvecklare till Unibase!\nSom ServiceNow-utvecklare kommer du bland annat att:\nUtveckla, konfigurera och anpassa lösningar i ServiceNow-plattformen\nArbeta med moduler som Incident, Problem, Change, CMDB och Service Catalog\nSäkerställa att lösningarna följer best practice och kundens behov\nDelta i projekt för implementation, integration och vidareutveckling av plattformen\nSamarbeta med kollegor inom ITSM, utveckling och arkitektur\n\nDu blir en viktig del av vårt och kundens team och bidrar till att leverera effektiva och framtidssäkra ITSM-lösningar.\nDina arbetsuppgifter kan bestå av följande (beroende på uppdrag):\nUtveckling och konfiguration:\nSkapa och anpassa workflows, business rules, UI policies och script\nImplementera integrationer med externa system via API:er\nUtveckla rapporter och dashboards för uppföljning och analys\n\nFörvaltning och optimering:\nUnderhålla befintliga lösningar och säkerställa hög tillgänglighet\nFelsöka och åtgärda problem i plattformen\nDokumentera konfigurationer och förändringar\n\nProjekt och innovation:\nDelta i design och implementation av nya moduler och funktioner\nBidra med idéer kring automatisering och effektivisering\nArbeta med uppgraderingar och nya versioner av ServiceNow\n\nMeriterande erfarenheter\nDet är positivt om du har erfarenhet av:\nCertifieringar inom ServiceNow (t.ex. Certified System Administrator, Application Developer)\nITIL v4 eller liknande ramverk för IT-styrning\nScriptning i JavaScript och kunskap om REST API\nIntegrationer mot andra ITSM-verktyg eller affärssystem\n\nDin bakgrund\nVi söker dig som har:\nMinst 5 års relevant arbetslivserfarenhet inom ServiceNow-utveckling\nGod förståelse för ITSM-processer och ServiceNow-arkitektur\nEftergymnasial utbildning inom IT eller motsvarande erfarenhet\nMycket goda kunskaper i svenska och engelska, både muntligt och skriftligt\n\nVarför ska du bli en del av vår familj?\nVårt engagemang för mångfald och inkludering\nVi värdesätter mångfald och strävar efter att skapa en inkluderande arbetsmiljö. Alla kvalificerade sökande uppmuntras att ansöka, oavsett kön, ålder, etnicitet, religion, funktionsvariation eller sexuell läggning. Vi tror att olika perspektiv berikar vårt team och vår verksamhet.",
        "url": "https://unibase.se/jobs/servicenow-utvecklare/",
        "published": "2026-02-11T11:35:15",
        "deadline": "2026-03-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30528575",
        "title": "Android Software Developer till Innovativt Bolag",
        "employer": "Friday Väst AB",
        "location": "Göteborg",
        "description": "Har du erfarenhet av androidutveckling och söker en ny utmaning i kundnära projekt? Då ska du läsa vidare.\n\nOM TJÄNSTEN:\nI rollen som Android Software Developer kommer du att arbeta med plattformsnära komponenter och system som driver moderna infotainmentsystem för fordon. Du bidrar till Androids systemtjänster, ramverk och plattformsfunktioner och säkerställer prestanda, tillförlitlighet och smidig integration mellan hårdvara och applikationslager.\nDu kommer vidare att utveckla ny plattformsfunktionalitet i Java/Kotlin med integrerade inbyggda C++-komponenter. Du kommer även få delta i design- och kodgranskningar samt stötta CI/CD-pipelines. Samarbetet sker i kundprojekt och tvärfunktionella ingenjörsteam som bidrar både till funktionsutveckling och den långsiktiga utvecklingen av plattformen.\nDu kommer till exempel att:\nUtveckla och underhålla Android-funktioner för infotainment i fordon.\nImplementera samt utveckla funktioner i Java/Kotlin och integrera med inbyggda C++-lager.\nGenomföra design- och kodgranskningar av plattformskomponenter.\nStötta CI/CD-pipelines med Jenkins och upprätthålla tydlig dokumentation.\nBidra till Android OS-uppgraderingsprojekt och säkerställa kompatibilitet med hårdvara och applikationer.\nVI SÖKER DIG SOM:Har en högskole- eller universitetsutbildning inom datateknik, elektronik, mekatronik eller motsvarande.\nHar erfarenhet av Androidutveckling, gärna inom infotainmentsystem eller likvärdigt.\nBesitter kunskaper i Java och Kotlin.\nHar kunskaper inom Python för scripting och automation.\nÄr flytande i svenska och engelska då språken kommuniceras internt och externt.\n\nDet är meriterande om du har:\nErfarenhet av C++ för inbyggd integration.\nKunskap om infotainmentsystem för fordon och hybrida utvecklingsmiljöer.\nDokumenterad erfarenhet av Android-versionsuppgraderingar, API-förändringar, plattforms­migreringar och validering i fordons- eller inbyggda miljöer\n\n\nVidare kommer stor vikt att läggas vid personlig lämplighet där vi som person tror att du ser komplexa system som fulla av möjligheter och trivs med att arbeta praktiskt för att förstå hur varje del hänger ihop. Du håller dig uppdaterad inom ditt område och delar gärna med dig av din kunskap. Du uppskattar ansvar från start till mål och är bekväm med att ifrågasätta antaganden för att hitta smartare och mer effektiva lösningar. Vi tror även att du är kommunikativ och trivs i agilt projektarbete.\n\nÖ",
        "url": "https://pnty-apply.ponty-system.se/friday?id=4165&pnty_src=arbetsformedlingen",
        "published": "2026-01-27T16:48:15",
        "deadline": "2026-03-31T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30387039",
        "title": "Engineering Tools Specialist – COMOS",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Företagsbeskrivning\nAFRY erbjuder tjänster inom teknik, design, digitalisering och rådgivning. Vi är hängivna experter inom industri, energi- och infrastruktur, som skapar värde för kommande generationer. AFRY har en global räckvidd med djupa rötter i Norden. Tillsammans accelererar vi omställningen till ett mer hållbart samhälle.\n\nJobbeskrivning\nVill du arbeta med avancerade ingenjörsverktyg och vara med och driva digitaliseringen av industrin? AFRY stärker nu sitt team och söker en Engineering Tools Specialist – COMOS till våra industri- och anläggningsprojekt.\n \nOm rollen\nI rollen som Engineering Tools Specialist – COMOS hos AFRY arbetar du med Siemens COMOS, ett ingenjörs- och informationshanteringsverktyg för strukturerad hantering av tekniska anläggningsdata genom hela livscykeln, från design och projektering till drift och underhåll. COMOS används som central plattform inom branscher såsom processindustri, energi, kemi, pharma, olja & gas samt tillverkningsindustri och fungerar ofta som navet i ett integrerat systemlandskap.\n\nRollen har ett tydligt utvecklingsfokus och omfattar implementering, konfiguration och vidareutveckling av COMOS, inklusive datamodeller, systemintegrationer och informationsflöden, där du fungerar som teknisk expert och super user och stöttar projektteam och kunder genom hela anläggningens livscykel.\n \nDu kommer att:\nArbeta med COMOS-modellering, databasstruktur och objekthantering\nDelta i och driva COMOS-implementationer i projekt\nVidareutveckla COMOS genom konfiguration, anpassningar och tekniska lösningar\nArbeta med systemintegrationer mot andra verktyg och system (E3D, EPLAN, PCS7/PAA m.fl.)\nStötta discipliner såsom process, el, instrument och automation\n\n\nKvalifikationer\nVi söker dig som\nHar flerårig erfarenhet av arbete med COMOS (Siemens)\nHar bakgrund inom processindustri, energi, pharma, kemi eller liknande\nFörstår ingenjörsdata och dess användning genom hela anläggningens livscykel\nHar ett starkt tekniskt intresse och trivs i en utvecklingsnära roll\nHar programmeringskunskaper i C++, C#, .NET\nHar erfarenhet av systemintegrationer och arbete med XML-filer\nHar goda kunskaper i SQL och databashantering\nÄr strukturerad, lösningsorienterad och kommunikativ\nTalar och skriver svenska och engelska obehindrat\n\n\nYtterligare information\nVi erbjuder\nHos AFRY får du möjlighet att arbeta i tekniskt avancerade och multidisciplinära projekt med starkt fokus på innovation, digitalisering och hållbarhet. Vi erbjuder:\nSpännande uppdrag hos ledande industrikunder\nEn central specialistroll inom Engineering Tools och digitala plattformar\nGoda möjligheter till teknisk och professionell utveckling\nEn inkluderande företagskultur med engagerade och kunniga kollegor\nFlexibla arbetsformer och god balans mellan arbete och fritid\n \n\nVälkommen med din ansökan, sista ansökningsdag är 2026-02-23\n\n\n\n \nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen\n \n \n\nPå AFRY driver vi förändring i allt vi gör. Vi anser att förändring sker när modiga idéer möts, när vi samarbetar, skapar innovation och omfamnar kreativa lösningar, det är så vi skapar framtiden. Vi söker konstant kvalificerade kandidater som vill ansluta sig till våra inkluderande  team runt om i världen. Bli en del av oss och påskynda den gröna omställningen",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000104632075-engineering-tools-specialist-comos?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2025-12-17T09:30:34",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30605110",
        "title": "AI Engineer Internship ",
        "employer": "Cyber Instincts AB",
        "location": "Göteborg",
        "description": "AI Engineer Internship \nEmpower Your Future in AI Technology\nAre you passionate about harnessing the power of AI to revolutionize business operations? Our AI Engineer Internship offers you the opportunity to be at the forefront of innovation, creating AI agents that address critical challenges and streamline processes for businesses worldwide.\nAbout the Internship\nOur AI Engineer Internship is designed for ambitious individuals who want to explore the exciting world of AI development and gain hands-on experience. This program offers the chance to work on challenging projects, develop advanced AI solutions, and collaborate with industry experts.\nWhat You'll Learn\nAs an intern, you will:\n\nDevelop AI agents capable of automating complex business processes and operations.\n\n\nCollaborate with a team of experts to identify pain points faced by businesses and design AI-driven solutions.\n\n\nGain hands-on experience with cutting-edge technologies and methodologies in AI development.\n\n\nContribute to projects that have real-world impact and drive efficiency in diverse industries.\n\n\nThis internship is designed for individuals eager to dive deep into AI technology and apply their skills to solve meaningful problems. Whether it's streamlining workflows, enhancing decision-making, or unlocking new possibilities for businesses, your contributions will shape the future of AI-powered solutions.\nWhy Join Us?\n\nHands-on experience with state-of-the-art AI tools and technologies.\n\n\nGuidance and mentorship from seasoned AI professionals.\n\n\nOpportunity to work on real-world projects that make an impact.\n\n\nA collaborative and innovative environment that nurtures creativity.\n\n\nWho We're Looking For\nWe welcome interns who:\n\nHave a strong interest in artificial intelligence and technology.\n\n\nSome understanding of prompt engineering.\n\n\nSome knowledge about one or more AI workflow automation tools - N8n, Make, Voiceflow, Relevance, etc\n\n\nUnderstanding of APIs, web services, web hooks, etc\n\n\nAre eager to learn and solve complex problems.\n\n\nAre ready to contribute ideas and collaborate with a dynamic team.\n\n\nHow to Apply\nSend your resume and a cover letter explaining why you're excited about AI Agents and why you are an ideal candidate for the role.\nIt is recommended to include any personal tech projects you have previously worked on or hackathons you have participated in.\nApplications are open until 23rd March 2026. Don't miss this chance to kickstart your journey in AI technology!\nDon't miss this chance to make an impact and grow your expertise in a dynamic and supportive environment. Join us in advancing the potential of AI, one innovative solution at a time and let's shape the future of AI together! \n Please note: This is an unpaid, full-time, 6-month onsite internship starting April 2026 at our offices in Lindholmen, Gothenburg.",
        "url": "https://careers.cyberinstincts.com/jobs/7221988-ai-engineer-internship/applications/new?promotion=1839533-arbetsformedlingen",
        "published": "2026-02-12T16:16:55",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30605041",
        "title": "AI Developer Internship",
        "employer": "Cyber Instincts AB",
        "location": "Göteborg",
        "description": "AI Developer Internship\nEmpower Your Future in AI Technology\nAre you passionate about artificial intelligence and eager to develop cutting-edge skills that will shape the future of technology? Do you dream of building AI solutions that drive innovation and enhance user experiences? If so, we have the perfect opportunity for you!\nAbout the Internship\nOur AI Developer Internship is designed for ambitious individuals who want to explore the exciting world of AI development and gain hands-on experience. This program offers the chance to work on challenging projects, develop advanced AI solutions, and collaborate with industry experts.\nWhat You'll Learn\n\nGaining expertise in designing and using code/no-code platforms for scalable AI applications.\n\n\nCreating and optimizing AI-powered SaaS platforms that redefine the way businesses operate.\n\n\nDeveloping and integrating AI Agents for dynamic and adaptive systems.\n\n\n\nWhy Join Us?\n\nHands-on experience with state-of-the-art AI tools and technologies.\n\n\nGuidance and mentorship from seasoned AI professionals.\n\n\nOpportunity to work on real-world projects that make an impact.\n\n\nA collaborative and innovative environment that nurtures creativity.\n\n\nWho We're Looking For\nWe welcome interns who:\n\nHave a strong interest in artificial intelligence and technology.\n\n\nPossess a reasonable level of knowledge and skills in one or more programming languages: TypeScript, Python, JavaScript, etc and a willingness to explore no-code platforms. You don’t need to have expert programming skills, but we expect you to be comfortable writing and understanding code.\n\n\nSome knowledge and skills using one or more frameworks such as React, Tailwind CSS, Supabase, Node.js, etc and database management systems such as PostgreSQL.\n\n\nPossess knowledge and skills using Git, GitHub, etc\n\n\nAre eager to learn and solve complex problems.\n\n\nAre ready to contribute ideas and collaborate with a dynamic team.\n\n\nHow to Apply\nSend your resume and a cover letter explaining why you're excited about AI development and why you are an ideal candidate for the role.\nIt is recommended to include any personal tech projects you have previously worked on or hackathons you have participated in.\nApplications are open until 23rd March 2026. Don't miss this chance to kickstart your journey in AI technology!\nJoin us, and let's shape the future of AI together! \nPlease note: This is an unpaid, full-time, 6-month onsite internship starting April 2026 at our offices in Lindholmen, Gothenburg.",
        "url": "https://careers.cyberinstincts.com/jobs/7221904-ai-developer-internship/applications/new?promotion=1839502-arbetsformedlingen",
        "published": "2026-02-12T16:07:43",
        "deadline": "2026-02-23T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30596429",
        "title": "Software Release Engineer",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for a Software Release Engineer with a strong background in software release and configuration management within the automotive industry. In this role, you will work in a cross-functional environment with many stakeholders, contributing to improved release quality, structured deliveries, and continuous process improvements across the software release flow.\nJob DescriptionManage software release activities such as signing and releases towards key milestones\nProduce and maintain software part numbers and release documentation for each milestone\nCreate and maintain SW package manifests, loadfile manifests, and compliance reports\nEnsure alignment between diagnostic signal databases (e.g., Carcom and SDB)\nFacilitate release approvals, deviations, and related follow-ups\nPlan and coordinate supplier software releases\nManage supplier software backlog and follow up deliveries\nFollow up QOP/finance-related topics connected to supplier deliveries\nCoordinate and run supplier joint reviews\nSupport factory and aftermarket processes, including deviation handling and release support\nSupport new project work such as sourcing documentation and software requirement specifications (SWRS)\nRequirementsBSc degree in Software Engineering or similar\nExperience from Volvo Cars\nStrong competence in software release and configuration management in the automotive industry\nFamiliarity with CI/CD (Continuous Integration/Continuous Delivery)\nExperience with software variants management and branch management\nExperience producing and maintaining software release documentation\nGood understanding of vehicle product development processes\nHands-on experience with tools such as Jenkins, ConfigHub, Victoria, Artifactory\nExperience with KDP, TCPLM, Teamcenter, and Carweaver\nExperience with Carcom and SDB\nExperience with TPDE, TPDS, and DESD\nExperience with QOP/VPC, Pecca Procost, and Lotus Notes\nExperience with Jira and Confluence\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7211236-software-release-engineer/applications/new?promotion=1836007-arbetsformedlingen",
        "published": "2026-02-11T10:46:26",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30592945",
        "title": "Software Engineer Embedded Base Software & SW Architecture",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nYou will join an in-house embedded software team within the automotive industry, working with active chassis and suspension functions. The team is cross-functional and develops across the full software stack—control algorithms, middleware, and the toolchain required to deliver high-performing, safety-focused vehicle functions.\nYou will collaborate closely with developers, test engineers, system engineers, and safety engineers, and may take on cross-functional tasks depending on project needs.\nJob DescriptionDevelop application software in C++ for suspension-related functions\nDevelop middleware/base software in C for embedded ECUs\nWork with real-time embedded systems and HIL/real-time simulation environments\nIntegrate and troubleshoot communication and diagnostic solutions (e.g., CAN, Automotive Ethernet, UDS)\nUse Vector tools (e.g., CANoe, CANalyzer, VTEST) to support development and verification activities\nContribute to system safety implementation aligned with ISO 26262\nRequirementsMaster’s degree in electrical/electronics engineering, software engineering (embedded systems & software development), or equivalent\nAt least 5 years of experience with C programming (C90/C99)\nAt least 5 years of experience in real-time embedded system development\nAutomotive industry experience\nExperience working with AUTOSAR\nKnowledge of automotive communication protocols: CAN and Automotive Ethernet\nKnowledge of UDS (Unified Diagnostic Services)\nExperience with Vector tools: CANoe, CANalyzer, VTEST\nKnowledge of low-level protocol/firmware development: SPI, UART, PWM, DIO, PSI5\nExperience with HIL systems and real-time simulation\nKnowledge of system safety implementation compliant with ISO 26262\nFamiliarity with cybersecurity standards in automotive\nAbility to work effectively in a multi-cultural environment\nNice to haveExperience in C++ (C++11/C++14)\nExperience working with Agile software development\nSuspension/domain knowledge\nOpen-source contributions or side projects you can share\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7205150-software-engineer-embedded-base-software-sw-architecture/applications/new?promotion=1834430-arbetsformedlingen",
        "published": "2026-02-10T15:02:16",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30588423",
        "title": "Systems Engineer",
        "employer": "Goismo AB",
        "location": "Göteborg",
        "description": "Are you an experienced and curious Electrical & Electronics, System engineer with a passion for technical solutions? Do you like understanding and exploring new domains in product development and sharing your passion with your colleagues? Good, then continue reading, we have a great opportunity for you.\nREQUIREMENTS\n- Be the expert of the assigned End User Functions and related use cases.\n- Knowledge of the writing high level requirements.\n- Automotive domain knowledge.\n- Knowledge about vehicle feature roadmaps.\n- Ability to develop and manage requirements using requirement management tools.\n- Ability to analyze and solve complex problems.\n- General knowledge of vehicle development and verification.\n- ISO26262 (FuSa/ HARA), Cyber security (TARA) knowledge is a must, as you will be working closely with our FuSa and CS teams to drive these for your functions.\n- SystemWeaver knowledge is a must\n- Preferably knowledge of the Vector tools. \n- Worked in Jira, and been part of Agile WoW.\nThis role further require you to work with non end user functions, such as system functionality.\nRESPONSIBILITIES\n- Develop, manage and own the End User Function Requirements for all variants, use-cases and applicable regulations. All phases of the function life cycle should be considered.\n- Global responsibility for commonality and reusability of the functionality between products, brands and markets.\n- Participate in balancing and handshake of the high level and feature requirements related to the End User Function.\n- Responsible for breaking down feature requirements into End User Function requirements.\n- Review, handshake and secure commitment with all stakeholders for the End User Function Requirements. \n- Communicating all changes regarding scope and functional variants of the End User Function with the End User Function architect for approval.\n- Evaluate and review applicable function concepts.\n- Plan and participate in quality and safety ensuring activities, including screening\nLead the work with Hazard Analysis, Functional safety Concept, and Safety Case including associated reviews and independent assessments.",
        "url": null,
        "published": "2026-02-10T07:39:40",
        "deadline": "2026-03-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30578559",
        "title": "Senior Software Engineer",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for a Senior Software Engineer to help build and evolve cloud-native services for customers in the automotive-tech space. You will work with modern technologies such as AWS and microservices, in a team that owns the full service lifecycle—from idea and requirements to deployment, maintenance, and continuous improvement.\nYou are curious and analytical, enjoy collaborating in a team setting, and like solving problems in a structured and innovative way.\nJob DescriptionDesign, develop, test, deploy, and maintain cloud-based services and APIs\nWork end-to-end with your team across the full service lifecycle\nContribute to continuous improvements, new capabilities, and innovation\nApply DevOps ways of working to improve flow, quality, and reliability\nCollaborate in an agile setup (e.g., Scrum/SAFe) with a focus on delivering customer value\nRequirementsAcademic degree in Computer Science, Mathematics, Engineering, or a related field\nMinimum 5 years of relevant professional experience\nStrong Java experience\nExperience with AWS, including services such as Lambda, SQS, CloudFormation, EC2, ECS, API Gateway, DynamoDB, and IAM\nPython experience\nExperience working with microservice architecture\nExperience working with DevOps as a way of working\nExperience working with agile methodologies such as SAFe and/or Scrum\nFluent in English (written and spoken)\nNice to haveSwedish language skills\nAzure\nKubernetes\nGolang\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7188035-senior-software-engineer/applications/new?promotion=1829570-arbetsformedlingen",
        "published": "2026-02-06T15:32:02",
        "deadline": "2026-02-27T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30558813",
        "title": "Lab Automation Developer",
        "employer": "Tataa Biocenter AB",
        "location": "Göteborg",
        "description": "Who we are at TATAA\nTATAA Biocenter is a growing, specialized CRO at the forefront of molecular analysis services, supporting pharmaceutical and biotech clients. With expertise in genomics, transcriptomics, and proteomics, we provide method development, assay validation, and sample analysis using cutting-edge technologies such as qPCR, dPCR, NGS, and Olink. Our laboratory is GCLP-compliant and accredited under both GLP and ISO 17025:2017, ensuring the highest standards of quality and reliability.\n We are now seeking an experienced and innovative individual to join our team as Lab Automation Developer. This is an exciting opportunity to contribute to shaping the future of our data strategy, ensuring that our technological infrastructure supports our cutting-edge laboratory services and scientific excellence, all while maintaining rigorous compliance. If you value teamwork, innovation, quality, and continuous improvement? Join us and make an impact as part of our dedicated team!\n \nAbout The Role \nAs a Lab Automation Developer at TATAA, you will maintain laboratory software, including in-house solutions. You will work cross-functionally with scientific and technical teams to optimize workflows, manage data, and ensure compliance with regulatory standards as well as leading implementation of protocol automation. You will also be instrumental in the company’s active data strategy investment, outlining how AI and automation can improve data QC evaluations, report generation, internal knowledge database usage and more.\n\n\nPreferred Qualifications and Potential Scope\nA large part of our data analysis pipelines coordinate third party software, analyzing and interpreting data produced by the Laboratory Service team to deliver high end analyses for a wide range of NGS applications. This is an opportunity to be part of TATAAs bioinformatics team working with customer focused analysis solutions, hands-on data analysis and consultation.\n \nYour Essential Responsibilities Includes:\nPlan, implement, and manage software applications that support laboratory operations and data management.\nMonitor and ensure data security, privacy, and compliance with industry regulations and best practices (e.g. GLP/GCLP and ISO 17025:2017)\nOptimize and manage automation solutions for laboratory processes, including integration of lab instruments with automated data transfers.\nCollaborate with lab staff to program lab automation software for pipetting robots and other instruments to ensure efficient workflows.\nManage end-to-end data workflows, including data ingestion, verification, formatting, and reporting.\nImplement database management systems, contributing to AI-based data analysis and offering solutions for deriving key scientific insights from lab data.\nStay informed about emerging technologies, trends, and best practices relevant to laboratory automation, incorporating them into the company's infrastructure when appropriate.\nDevelop and maintain new bioinformatic solutions for NGS and affinity-based proteomics and q/dPCR assays.\nValidate and update computational methods in internal analysis pipelines.\nIntegration and automation of analyses on cloud.\nData review and processing, incl. pre-/clinical data.\nDrive the execution and delivery of data and analysis by collaborating closely with project managers, laboratory scientists, quality assurance and other internal teams.\n\n \nRequirements – Who You Are: \nHold a master’s degree in information technology, computer science, biology, bioinformatics or a related field, with more advanced degrees being a plus. The ideal candidate should have experience and expertise in software engineering and programming for relevant lab automation.\nPossess strong knowledge of software applications within laboratories and scientific environments.\nDemonstrate an understanding of laboratory workflows and data management.\nProficiency in programming languages (pref. Python and SQL). Experience with liquid handling programming is beneficial.\nUnderstand cloud solutions and implementations.\nDemonstrate expertise in data security and privacy regulations and other relevant compliance standards such as GLP/GCLP and ISO 17025:2017.\nPossess excellent communication and interpersonal skills, with the ability to collaborate effectively with IT team members, lab team members, vendors, and other stakeholders.\nHave a strategic mindset and show proficiency in project management, with a track record of leading projects from initiation to delivery and meeting project deadlines.\nStrong analytical and problem-solving abilities to troubleshoot issues, design innovative solutions, and implement them effectively.\nCapacity to assess technology trends and make informed recommendations, as well as commit to continuous learning and staying updated on the latest advancements relevant to our laboratory operations.\nPossess a strong self-motivational drive for shared success within the team and the company.\n\nJoin TATAA and become a part of our vision of accelerating innovations in precision medicine to improve lives! \n\n\nPlease note that we will screen the applications continuously and close the process when we have found the right candidate. \n\n\nContacts: jobs@tataa.com\nPosition: Fulltime\nPlacement: On-site, Gothenburg, Sweden\nStart date: Upon agreement",
        "url": null,
        "published": "2026-02-05T09:35:50",
        "deadline": "2026-03-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30565459",
        "title": "Application Integration Specialist (Temporary)",
        "employer": "Benifex Sweden AB",
        "location": "Göteborg",
        "description": "Who are Benifex? 💚💜\nWe are a fast-moving technology company, and one of the most successful providers of online reward and benefits solutions in the world. We believe that everyone deserves an exceptional experience at work, every day, and build workplace technology that makes this happen. Benifex’s mission is to build remarkable experiences that employees love. Today Benifex supports more than five million employees in over 3,000 organisations across more than 100 countries. To help us on our quest to be the best, we need brilliant people on board and that’s where you come in. 🚀\n\nWhy should you apply? 🌟\n\nDevelop your skills: In this role, you will have the opportunity to become familiar with our system and further develop your technical competencies.\n\n\nCollaboration:  You will work with ambitious and talented colleagues in an international environment.\n\n\nSunday Times Best Place to Work 2025 and Best Large Tech Company to Work for 2025\n\n\nWork for a profitable, fast-growing market leader in the online reward and benefits space.\n\n\nWe value your drive and structured approach, as well as your proactive ability to identify and address potential issues, ensuring defects never reach production. You take full ownership of your responsibilities and deliverables, and you thrive on working closely with others and fostering collaboration. \nRole Overview 🚀\nAs an Application Integrations Specialist, you are responsible for the seamless integration of systems, applications, and processes within the organisation. By designing, implementing, and maintaining integrations between different software systems, you ensure data consistency, accuracy, and reliability.\nThe position is a 12-month temporary contract with the possibility of extension, starting as soon as possible. \nResponsibilities 🤘\n\nConfigure, customize, and develop integrations using our platform, APIs, web services, and other relevant technologies.\n\n\nCollaborate with developers, system administrators, and third-party vendors to ensure smooth integration and deployment.\n\n\nData transfer scoping and implementation.\n\n\nTesting and troubleshooting of solutions you build.\n\n\nDocumentation and knowledge sharing.\n\n\n Personal attributes\nTo succeed in this role, we see that you got strong analytical and problem-solving skills, with the ability to diagnose and resolve complex integration issues. To ensure our clients systems communicate with ours, excellent communication skills is key. You will work in collaboration with cross-functional teams, including technical and non-technical stakeholders, to maintain integrations between different software systems. We will have a strong focus on the personal attributes in this recruitment. \nWhat are we looking for? 🔎\n\nBachelor's degree in computer science, Information Technology, or a related field\n\n\nSome understanding of Object-Oriented Programming, such as Java, C++ and/or .NET\n\n\nProficiency in integration technologies, APIs, web services, and messaging protocols (e.g., SOAP, REST)\n\n\nProfessional language proficiency in English, written and spoken.\n\n\n It's a ⭐, thus not a requirement if you also got...\n\nKnowledge of Single Sign-On (SSO) protocols and standards, such as SAML (Security Assertion Markup Language) or OAuth, and the ability to integrate applications with SSO solutions\n\n\nFamiliarity with data formats like XML, JSON, and CSV\n\n\nEven if you don't meet all of the requirements for this role, we encourage you to apply! We are looking for talented and passionate individuals who are eager to learn and grow. We also offer a variety of other roles, so please check out our careers page to see if there is something else that might be a good fit for you. \nGreat benefits:\n⚖️ Guaranteed work-life balance with a hybrid working model\n🧠 ITP1 pension\n❤️ Lifeplan - a leading financial advisory service that offers personalized advice for maximizing your pension savings\n📝 Collective agreement\n💸 Access to our comprehensive benefits portal.\n🤸 Generous wellness allowance\n✈️ 30 vacation days / year\n💰 Referral bonuses\n🌟 Enhanced parental pay\n🙂 Volunteer Days – two paid days annually to give back to the community.\n\nOur interview process\n✌ Benifex understands the need to have a fast and efficient process, the below will all be completed in the shortest time possible.\n📞 Initial informal call with the Talent team\n🧪 Online tests in numeracy and logical reasoning\n⏳ Interview with the hiring manager and a member of the team\n🤩 Final interview with the Director \nPractical information\nStart: As soon as we find the right fit! 🧐\nExtent: Full-time, 100% - this is a 12-month temporary contract\nLocation: Gothenburg, Sweden\nPlease let us know if you need any reasonable adjustments for interviews by replying to the email you will receive after you apply.\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://careers.benifex.com/jobs/7168434-application-integration-specialist-temporary/applications/new?promotion=1824245-arbetsformedlingen",
        "published": "2026-02-04T14:50:10",
        "deadline": "2026-08-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30548109",
        "title": "Senior Solution & Technical Delivery Experts – Crew Tracking Implementation",
        "employer": "Pigs Fly AI AB",
        "location": "Göteborg",
        "description": "About Optimen \nOptimen is a certified \"Great Place to Work\" and a strategic delivery partner for Jeppesen ForeFlight. We specialize in aeronautical technology and resource optimization for the global airline industry. \nWith 19 years of experience, with operations in Mexico, USA and Canada, we operate as an extension of our clients' IT departments. We are entrusted with the configuration, development, and delivery of Jeppesen’s Crew and Fleet Portfolio. \nCarriers such as Aeromexico, Volaris, LATAM, Avianca and TAP Air Portugal rely on Optimen to solve their most complex operational challenges. We are now establishing a Center of Excellence in Sweden to lead critical implementation projects around the world, bridging the gap between client stakeholders and our engineering hubs. \nThe Role \nWe are recruiting a foundational team of Senior and Expert professionals (6–12+ years of experience) to lead the delivery of Jeppesen Crew Tracking solutions. \nOperational Transformation through Technology This is more than an implementation role; it is a digital transformation initiative. You will help major airlines modernize their mission-critical operations by replacing legacy, manual processes with advanced optimization technology. Your mandate is to: \nLeverage Optimization: Configure Jeppesen’s powerful solvers to automate complex decision-making, shifting the client from reactive manual tracking to proactive, data-driven recovery. \nEngineer Efficiency: Use technology to encode complex labor agreements (CLA) into automated logic, eliminating human error and unlocking tangible cost savings. \nConnect the Ecosystem: Design robust integration architectures that break down data silos, ensuring the crew system acts as the intelligent digital backbone of the airline’s operation. \n\nYou will work in a distributed Agile environment, acting as the primary link between European client stakeholders and our engineering teams in Americas. \nCore Responsibilities \n 1. Agile Product Ownership & Value Realization \nBacklog Management: You will own or heavily influence the product backlog. You must translate high-level business goals into well-defined User Stories and Acceptance Criteria for the engineering team. \nFocus on Business Outcome: You will challenge the client’s assumptions. Instead of simply implementing a rule, you will define the operational value (e.g., \"How does this configuration improve operational compliance?\", \"How does this automation reduce manual intervention?\", or \"Does this cost function accurately reflect disruption costs?\"). \nSprint Execution: Participate in and facilitate Agile ceremonies (Sprint Planning, Reviews). You will be responsible for validating that the delivered increments meet the business objectives before they reach the client. \n\n2. Solution Design & Complexity Management \nFunctional Modelling (CLA Rules): Lead the definition of complex logic for Collective Labour Agreements (Union Contracts). You must be able to translate legal texts into functional specifications that determine legality, counters, and compensation. \nTracking Optimization: Configure and tune optimization strategies. You will adjust parameters to reflect operational priorities—balancing strict efficiency against robustness during disruption scenarios. \nArchitecture & Integration: Design the end-to-end integration landscape. You will ensure the Crew Tracking solution communicates reliably with the airline’s ecosystem (HR, Flight Ops, Payroll), defining Interface Control Documents (ICDs) and guiding data flow strategy. \n\n3. Collaborative Leadership \nDistributed Team Lead: Act as the technical and functional anchor for our development teams in Americas. You will ensure requirements are understood, remove blockers, and maintain quality standards across the Atlantic. \nStakeholder Advisory: Guide VP-level stakeholders (Flight Ops, IT), SMEs, and Business Function Owners through complex trade-offs. You must be able to distinguish between \"must-have\" regulatory compliance and \"nice-to-have\" process preferences to protect the implementation scope. \n\nRequired Qualifications \nExperience: More than 6 years of experience in software implementation, solution architecture, or technical business analysis within the aviation sector. \nAgile Mindset: Proven experience working in Agile/Scrum environments. You must be comfortable managing backlogs, writing user stories, and focusing on iterative value delivery rather than waterfall specifications. \nAirline Domain Mastery: Deep understanding of Crew Management (Pairing, Rostering, Tracking) or Operations Control (OCC). You must understand the operational mechanics of counters, compensation logic, and disruption management. \nConsultative Approach: You are not an order taker. You have a proven ability to guide clients through complex operational changes and focus on customer outcomes. \nCommunication: Fluent in English (written and verbal), with the ability to explain complex technical concepts to non-technical business leaders. \n\nPreferred Qualifications \nJeppesen Ecosystem: Prior experience with Jeppesen products (Crew Tracking, Carmen Systems legacy) or familiarity with the RAVE modeling language is a distinct advantage. \nTechnical Stack: For architecture-focused candidates, proficiency in Python, SQL, and AWS is highly valued. \nOptimization: Familiarity with Operations Research concepts, solver tuning, or defining penalty/cost functions for automated planning systems. \nLanguage Skills: Fluency in Spanish is a strong asset to facilitate collaboration with our engineering centers in Latin America.",
        "url": null,
        "published": "2026-02-04T06:08:15",
        "deadline": "2026-04-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30551123",
        "title": "Experienced Software Engineer",
        "employer": "L&T Technology Services Sverige Filial",
        "location": "Göteborg",
        "description": "L&T Technology Services Limited (LTTS) is a global leader in Engineering and R&D (ER&D) services.\nWe are hiring in Solna, Sweden!\nWould you like to join a team with innovation, teamwork and entrepreneurship as the fundamental platform?\nWe are looking for experienced Software Engineers for the Automotive Industry\nRole Overview:\nThe Software Engineer is responsible for designing, implementing, and testing software components for the Tachography system. Engineers should have development skills in CAN, Diagnostics, language embedded C. This role ensures compliance with safety-critical standards, coding guidelines, and project requirements while contributing to high-quality, maintainable software\nKey Responsibilities\n1. Design & Implementation\nTranslate software requirements into detailed design and code.\nImplement new features and enhancements on the commonized code base.\nFollow SRE coding guidelines, best practices, and MISRA compliance for safety-critical software.\nMaintain clean, modular, and reusable code adhering to industry standards.\n\n2. Static Code Analysis\nPerform static code analysis.\nAddress all code quality issues and ensure compliance with coding standards.\n\n3. Unit Testing & Coverage\nDevelop and execute unit test cases for individual software components.\nGenerate and review MC/DC coverage reports to ensure completeness.\nAutomate unit tests where possible.\n\n4. Integration Support\nCollaborate with Integration Test Engineers to ensure smooth module integration.\nResolve defects identified during integration and qualification testing.\n\n5. Documentation & Traceability\nMaintain traceability between requirements, design, implementation, and test artifacts.\nUpdate design documents and code comments for clarity and maintainability.\n\n6. Collaboration\nWork closely with Software Architect, System Engineers, and Test Teams.\nParticipate in design reviews and provide feedback for improvements.\n\nRequired Skills & Qualifications\nBachelor of Engineering\n4+ years of experience in embedded software development or safety-critical systems.\nStrong programming skills in C.\nKnowledge of real-time operating systems, embedded systems, and safety-critical standards.\nFamiliarity with static analysis tools, unit testing frameworks, and CI/CD pipelines.\nExcellent problem-solving, documentation, and communication skills.\n\nAdditional Skills:\n MCAL layer embedded C developer\nwith detailed understanding of serial, UART and IO code and debugging\nhands on with clear understanding of HW-SW interface including electrical aspects and debugging.\nUnderstanding of code flow from FreeRTOS to lower layers.",
        "url": null,
        "published": "2026-02-02T12:45:45",
        "deadline": "2026-03-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30540107",
        "title": "Senior Embedded Software Engineer",
        "employer": "SkillHuset Sweden AB",
        "location": "Göteborg",
        "description": "Mid- Senior Embedded Software Engineer with Android, C++ and Python as their main language as well us an understanding of system architecture.\nTeam works with Build configuration, Android version bring up and SW complexity reduction\nTo be successful in this role, your experience must include: \n\t•\tEmbedded Software Development of complex software products using C++ and Python.\n\t•\tEmbedded OS or Linux experience.\n\t•\tDevelopment within android platform\n\t•\tWorking experience in a CI environment.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n\t•\tCoordinate and communicate with the CI teams to enable the new hardware support quickly and smoothly.\n\t•\tDevelopment, improvement, test and maintenance of the new hardware platform.\n \nWe'd also prefer if you have: \n\t•\tA Driver’s license (B-level) will also be ideal.\n\t•\tExperience from Automotive Infotainment domain\n\t•\tTest automation experience using Pytest\n\t•\tPrevious working experience with android uplift",
        "url": null,
        "published": "2026-01-29T16:57:00",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30537509",
        "title": "Senior DevOps Engineer",
        "employer": "Goismo AB",
        "location": "Göteborg",
        "description": "DevOps Engineer\nWe are hiring a DevOps Engineer to build, automate, and manage scalable cloud infrastructure and CI/CD pipelines for modern applications.\nResponsibilities:\nDesign and maintain CI/CD pipelines\nManage cloud infrastructure and deployments\nAutomate provisioning using IaC tools\nMonitor system performance and reliability\n\nRequirements:\nExperience with AWS/Azure/GCP\nStrong knowledge of Docker and Kubernetes\nCI/CD tools (GitHub Actions, GitLab CI, Jenkins)\nScripting with Bash/Python",
        "url": "http://www.goismo.com",
        "published": "2026-01-29T12:44:30",
        "deadline": "2026-06-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511370",
        "title": "AI Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced AI Engineer to join our team.\nKey Responsibilities:\nBuild and deploy LLM-powered agents for business process automation (e.g., using LangChain, AutoGen, OpenAI).\nImplement Retrieval-Augmented Generation (RAG) pipelines integrating with internal knowledge sources (e.g., Confluence, Google Drive).\nDevelop multi-step reasoning chains, function calling, and agent memory for complex workflows.\nIntegrate agents with third-party APIs (Salesforce, GitHub, Jira, Slack, etc.).\nDefine best practices around prompt engineering, tool usage, and secure API communication.\nCollaborate with cross-functional teams to understand and prioritize automation opportunities.\nTrack AI reliability, hallucination risks, and ethical use across deployed solutions.\nDesign evaluation strategies for agent performance, reliability, and business impact.\nSupport fine-tuning or embedding optimization to improve agent accuracy and task alignment.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\nStrong software engineering background- Python a must; experience with Bash, JavaScript or Golang is a plus.\nHands-on experience with LLM frameworks (LangChain, LlamaIndex) and APIs (OpenAI, Gemini, Claude).\nProficient in integrating external APIs using REST/GraphQL and managing agent workflows.\nComfortable with cloud platforms (preferably GCP/Vertex AI or Azure OpenAI) and containerized environments.\nExperience with RAG, semantic search, vector databases (e.g., Pinecone, FAISS), and prompt templating.\nStrong understanding of security, privacy, and responsible AI practices.\nCurious, experimental, and fast learner with excellent communication skills in English. \nFamiliarity with orchestration frameworks (e.g., CrewAI, MetaGPT, AutoGen) is a strong advantage.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2026-01-23T11:18:10",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511336",
        "title": "Machine Learning Engineer",
        "employer": "Baronit AB",
        "location": "Göteborg",
        "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Airline, Fintech, Healthcare, Retail, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Machine Learning Engineer to join our team.\nKey Responsibilities:\nEstablish MLOps best practices and patterns for scalable ML deployment.\nDesign and build reproducible ML pipelines and model-serving infrastructure.\nManage and automate CI/CD for ML using GitHub Actions or Azure DevOps.\nOperate in cloud-first environments (GCP, Azure, AWS), using tools like Vertex AI, DBT, Airflow, or Kubeflow.\nImplement observability (model monitoring, drift detection) and infrastructure-as-code (Terraform, Helm).\nCollaborate with Data Scientists, Engineers, and Analysts to move models from notebooks to production.\nEnsure ML workflows align with data governance, security, and compliance standards.\nContribute to LLM-based model serving and fine-tuning pipelines where applicable.\n\nIdeal candidate profile:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in Software Development/DevOps or related field.\n4+ years of experience in ML engineering or MLOps in production settings.\nProficient in Python (OOP, testing, clean code, package management).\nExperienced in cloud platforms - GCP, Azure, AWS.\nExperienced with AWS services for ML deployment and infrastructure management, including SageMaker, CloudWatch, and IAM.\nExperience developing RESTful APIs using FastAPI for model serving and inference endpoints, including integration with CI/CD and auth middleware.\nHands-on with CI/CD pipelines, Containerization (Docker, Kubernetes), Infrastructure as Code (Terraform, ArgoCD, etc.), MLFlow, DBT, and Airflow.\nExperience in monitoring/observability strategies for production ML systems, including latency tracking, drift detection, and model version health using Prometheus, Grafana, or Vertex AI Model Monitoring.\nStrong skills in SQL, data modeling, and scalable data pipelines.\nAble to work in agile, cross-functional teams with clear communication and ownership mindset.\nStrong analytical problem-solving skills and love for clean, maintainable systems.\nCurious, experimental, and fast learner with excellent communication skills in English.\nExperience with large language models and LLMOps pipelines is a plus.\nWorking knowledge aligned with GCP/AWS ML certification standards (Vertex AI, IAM, Dataflow) is a plus.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
        "url": "baronit.se",
        "published": "2026-01-23T11:17:30",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30448408",
        "title": "Senior Mainframe Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Senior Mainframe Developer – \nWe are looking for a Senior Mainframe Developer to work with Umeå Order & Logistics legacy solutions. The role focuses on maintaining, optimizing, and modernizing mainframe systems as part of our digitalization journey.\nRole Description\nAs a Senior Mainframe Developer, you will:\nManage, maintain, and optimize mainframe computer systems to ensure efficient, stable, and reliable operations.\n\n\nWork closely with a team of IT professionals to support business-critical applications and provide technical expertise in mainframe technologies.\n\n\nMaintain and enhance legacy applications and actively contribute to the organization’s digitalization and modernization initiatives.\n\n\nCollaborate with cross-functional teams to understand requirements and provide technical input for mainframe-based solutions, influencing solution design both within and beyond stable teams.\n\n\nAnalyze application performance and identify opportunities for optimization and improvement.\n\n\nEnsure adherence to coding standards, best practices, and security guidelines in application development and maintenance.\n\n\nModernize legacy applications by integrating mainframe systems with other IT infrastructure components.\n\n\nStay up to date with industry trends and emerging mainframe technologies.\n\n\nContribute to the Chapter team by sharing best practices, mentoring colleagues, and actively participating in knowledge-sharing initiatives.\n\nRequired Skills & Experience\nStrong proficiency in mainframe programming languages and tools such as:\nCOBOL, JCL, VSAM, ISPF, SDSF, MQ, CICS, PL/I, OPCE, Assembler, or equivalent\nExperience with mainframe databases and data management systems such as DB2 or IMS\n\n\nProven experience in modernizing legacy mainframe environments using relevant tools and techniques\n\n\nStrong analytical and problem-solving skills with the ability to diagnose and resolve complex technical issues\n\n\nStrong communication and interpersonal skills, with the ability to collaborate effectively with stakeholders at all levels",
        "url": null,
        "published": "2026-01-09T00:53:50",
        "deadline": "2026-06-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30418080",
        "title": "ServiceNow Developer",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Key Responsibilities\nDesign, develop, and implement solutions on the ServiceNow platform, with a primary focus on the CSM module.\n\n\nCustomize and configure ServiceNow components including forms, workflows, business rules, client scripts, UI policies, UI actions, and notifications.\n\n\nDevelop and manage REST and SOAP integrations with external systems.\n\n\nAnalyze business requirements and translate them into effective technical solutions.\n\n\nTroubleshoot issues, perform root-cause analysis, and deliver timely fixes.\n\n\nCollaborate with cross-functional teams to ensure smooth implementation and continuous improvement of ServiceNow applications.\n\n\nFollow best practices for ServiceNow development, documentation, and version control.\n\nRequired Experience & Skills\n3–6+ years of hands-on experience in ServiceNow development.\n\n\nStrong expertise in the CSM (Customer Service Management) module – configuration, case management, workflows, portals, and integrations.\n\n\nPractical experience with REST and SOAP APIs and building integrations with ServiceNow.\n\n\nStrong understanding of JavaScript, Glide APIs, Flow Designer, IntegrationHub, and ServiceNow platform capabilities.\n\n\nAbility to work independently as well as in collaborative team environments.\n\n\nGood communication and problem-solving skills.\n\nNice-to-Have\nServiceNow certifications such as CSA, CAD, CIS-CSM, or relevant module certifications.\n\n\nExperience working in Agile/Scrum environments.\n\n\nKnowledge of ITIL processes.",
        "url": null,
        "published": "2025-12-22T21:56:00",
        "deadline": "2026-06-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357035",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a System Developer to join our Automotive team in Gothenburg.\nIn this role you will play a key role in:\n•  Developing a system fulfilling the agreed cross-functional solution.\n•  Making sure that our solutions comply with all agreed requirements.\n•  Breaking down and distribute functional requirements to the execution environment, functional and non-functional realization in Car Weaver (System Weaver) in cooperation with the team and relevant stakeholders.\nYour profile\n•  University degree in Electronics, Software, Mechatronics or equivalent\n•  Minimum 2 years of experience from System Engineering or having gained good electrical system knowledge working with SW testing\n•  Previous experience from system development would give you additional advantage to excel in this position\n•  Fluency in English\n•  Driving license \"B\" or ambition to take it in the near future\nMeritorious skills:\nIt's beneficial and would bring additional impact and contribution to our team if you have experiences in Simulation and Model-Based Design using MATLAB/ Simulink, System Weaver, Elektra, Vehicle communication protocols (CAN, LIN, Flexray, Ethernet). Knowledge of automotive standards Functional Safety ISO26262 and Cyber security ISO21434.\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/3185-en_US+sap_btp/",
        "published": "2025-12-09T21:47:50",
        "deadline": "2026-05-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30306504",
        "title": "Junior AI Systems Engineer",
        "employer": "Mindark Pe AB (Publ)",
        "location": "Göteborg",
        "description": "Join Our AI Team as a Systems Engineer for Entropia Universe! Are you passionate about integrating advanced AI technologies into immersive gaming experiences? Are you interested in building the next generation of MMORPG games?\nMindark is seeking Systems Engineers to join our team in revolutionizing the virtual universe of Entropia. As a leading developer in the gaming industry, we are committed to pushing boundaries and delivering cutting-edge experiences to our dedicated community of players.\nAbout Us:\nBased in Gothenburg, we're a compact, high-caliber team evolving Entropia Universe, a long-standing MMO built around a real-cash economy. We care about end-to-end ownership, fast execution, and ego-free collaboration, and we're looking for someone who wants to build seriously, move quickly, and help define the future of MMO games.\nWe value diversity and strive to create an inclusive workplace where everyone's contributions are recognized and appreciated.\nRole Overview: \nAs a Junior AI Systems Engineer, you will:\nBuild and integrate intelligent systems into Entropia Universe\nWork with automation, AI, and agentic frameworks to create new in-game behaviors and tools\nHelp optimize our CI/CD and runtime pipelines for performance and quality\nContribute to core systems engineering (C++ and related infrastructure)\nUse AI heavily in your own workflow to move faster and smarter\nTake pride and ownership of your work all the way through to the end user\nThis is a general engineering role, not tied to a single fixed team.\nYou: \nMaster's degree in Computer Science or a similar field, with strong grades preferred\nHuge interest in AI is crucial: you follow new models, tools, and trends and ideally build with them in your spare time\nComfortable with C++ 20; Python is a strong plus.\nStrong interest in:\nAI and agentic frameworks\nSystems engineering and creating great games\nAutomation and building intelligent systems\nProblem solving\nDatabases (SQL and NoSQL) and data-intensive systems\nBasic networking concepts and distributed systems\nContainerization and tooling such as Docker\nPassion for games and how AI can change the video game industry\nLow ego, end-to-end ownership, clear communication.\nWhat we value:\nBachelor’s degree in Computer Science, Game Development, or a related field\nA few years of experience within the field\nCreative thinker with a passion for games and a drive to innovate within the gaming space\nProficiency in C++\nProficiency in Python is a strong plus\nStrong interest or knowledge in Transformer tech, large language models, and agentic frameworks\nKnowledge of game development principles and methodologies\nProblem-solving and communication skills\nBeing flexible and able to work with a larger technical ecosystem.\n\nWhy Join Mindark: \nWork on a live, large-scale MMO with a real-cash economy\nWork with cutting-edge systems and AI tooling that are still rare in the MMO space\nHigh-impact role in a small, focused team\nCompetitive compensation and plenty of room to grow in the new era of AI\nStrong support and mentorship from highly talented colleagues.\n\nThe opportunities are endless.\nIf you're passionate about pushing the boundaries of gaming and AI technologies and want to be part of a team shaping the future of virtual worlds, we'd love to hear from you! Join us on our quest to create unforgettable experiences within the Entropia Universe.\nLocation: Gothenburg, Sweden (hybrid, ~2 days/week in office)",
        "url": "https://career.mindark.com/?_gl=1*16vi2so*_ga*Nzk2ODkxMjAwLjE3NDQzMDA4NzE.*_ga_7CLV8P4CHW*czE3NTA5NDY5NDkkbzEwJGcwJHQxNzUwOTQ2OTQ5JGo2MCRsMCRoMA..",
        "published": "2025-11-26T09:09:10",
        "deadline": "2026-03-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30200139",
        "title": "Senior Software / Networks / Devops / Cybersecurity Engineer",
        "employer": "SATCUBE AB",
        "location": "Göteborg",
        "description": "Hurricane in the Bahamas, a flooding in Germany, forest fire in Värmland or an important interview in a refugee camp in Syria. The telecommunication infrastructure is vulnerable to natural disasters, governmental intervention or simply limited due to inadequate coverage. This is where Satcube comes in to enable doctors, journalists and first response to establish a satellite internet connection in under a minute.\nSatcube's goal is to provide highly portable satellite communication devices that can be used by anyone, anywhere. In order to make our products and service offerings even easier to use we are looking for an experienced engineer to join us.\nWhat is the job about?As an engineer in our managed service team you’ll be working with development of our subscription services for critical communications services. \nWe are looking for the right person to fit our team and our development plans forward. The team is recruiting to expand broadly and with an engineer with a breadth of abilities but that primarily can fit well into the team. Therefore, we are looking for someone who can work in multiple of the following domains:\n Networking SD-WAN\n Fiber\n DNS\n IPsec\n \n Virtualisation Kubernetes\n Proxmox\n \n Engineering for Critical services \n Software applications (Python & Rust)\n GitOps\n Software & Networks operations\n Databases Relational\n Time-series\n Victoria Metrics\n \n Cybersecurity Hardening\n Process implemenation\n \n Nobody knows everything in depth, but you should have an edge in at least one of the domains listed above. In this role you’ll be responsible for: Architecture\n Design for robustness\n Design with a cybersecurity mindset\n Delivery\n Contribute to the planning and prioritization of work\n Why work with us?\nWe value our coworkers! At Satcube we offer max 'friskvårdsbidrag', private health insurance, maxed out sick insurance and better pensions than standard.\n Be part of a fast-growing company in the space industry.\n Whilst working in a team you’ll be getting responsibility from day one.\n Work with clients all over the world to solve their connectivity needs.\n An opportunity to shape your work environment and how we develop technically.\n Who should apply?\nSomeone who also wants to make communication easy!\n Required experience:A relevant bachelor or master's degree.\n 5 years previous experience.\n A team player.\n Questions?\nAll applications are considered in an ongoing manner, meaning that the position could be filled before the set deadline. If you have any questions regarding the position, please don’t hesitate to reach out. We are looking forward to hearing from you!\nWho we areSatcube AB is a scaleup working in the SATCOM industry, based in Gothenburg and with production in Karlstad. Consisting of a small but helpful and kind team that is revolutionizing the satellite communications industry. The core of the company is our lightweight satellite terminals, capable of providing high speed internet to any location on earth. This is done by sending radio waves 36000 km into space, aimed at a satellite that is only a couple of meters wide, before retransmitting the signal back down. Our advanced terminal then interprets this signal - an internet connection has been established!\nJoin us in ending the communication gap during crises and in remote locations!",
        "url": "https://careers.satcube.com/jobs/6441597-senior-software-networks-devops-cybersecurity-engineer?promotion=1690256-arbetsformedlingen",
        "published": "2025-10-29T08:47:52",
        "deadline": "2026-04-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30115024",
        "title": "Lead/Senior Android Automotive Engineer",
        "employer": "Orientalent AB",
        "location": "Göteborg",
        "description": "Role Summary\n \nAs a Senior Android Automotive Engineer, based in Gothenburg, you will lead the development and implementation of complex Android software solutions for automotive applications. This senior role entails significant responsibilities, including high-level decision-making, mentoring junior staff, and steering the direction of projects, ensuring alignment with company goals and client needs.\n \nKey Qualifications\n \n \nBachelor’s or Master’s degree in Computer Science, Software Engineering, or a related field.\n\n \nOver 5 years of extensive experience in Android development, embedded systems, and automotive software.\n\n \nExpertise in Android SDK, Java, Kotlin, and a deep understanding of advanced automotive systems and technologies.\n\n \nProven leadership skills with the ability to mentor and guide junior engineers.\n\n \nStrong problem-solving, communication, and project management skills.\n\n \nIn-depth knowledge of international automotive regulations and cybersecurity principles in automotive systems.\n\n \nA strategic thinker with a proven track record of delivering successful projects.\n\n \n \nResponsibilities\n \n \nLead the design, development, and management of complex Android applications for automotive systems.\n\n \nMentor and support junior engineers, fostering a collaborative and productive work environment.\n\n \nMake strategic decisions regarding software design and architecture.\n\n \nInterface with clients and stakeholders, understanding their needs and ensuring that projects meet their requirements.\n\n \nStay abreast of the latest industry trends and technological advancements, integrating them into projects and processes.",
        "url": "https://careers.ultragroup.se/jobs/6556202-lead-senior-android-automotive-engineer?promotion=1655441-arbetsformedlingen",
        "published": "2025-10-07T11:31:32",
        "deadline": "2026-03-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30602665",
        "title": "Senior IaC Developer",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for an Infrastructure as Code (IaC) Developer to help design, implement, and maintain automated infrastructure using modern IaC practices. You will collaborate with cross-functional teams to improve scalability, reliability, and security across a primarily Azure-based environment spanning both cloud and on-prem infrastructure.\nYou will work with technologies such as Azure, Ansible, VMware, Linux distributions (RHEL/SUSE), and CI/CD tooling to support a robust and highly available platform.\nJob DescriptionDesign, develop, and maintain infrastructure as code solutions using tools such as Crossplane and Ansible in an Azure-centric setup.\nIntegrate infrastructure provisioning into CI/CD pipelines.\nAutomate deployment, scaling, and lifecycle management of cloud resources.\nEnsure security and compliance requirements are met in infrastructure configurations.\nMonitor, troubleshoot, and optimize infrastructure to ensure high availability and performance.\nContinuously evaluate emerging IaC and cloud practices to improve ways of working.\nRequirementsProven experience working as an Infrastructure as Code (IaC) developer/engineer.\nHands-on experience with Crossplane, Azure, and Ansible.\nStrong scripting/programming skills in Python and experience with Bash and/or PowerShell.\nStrong infrastructure domain knowledge across both cloud and on-prem environments.\nExperience working with Azure as the primary cloud platform.\nKnowledge of container technologies such as Docker and Kubernetes.\nExperience working with DevOps principles and CI/CD pipelines.\nNice to haveKnowledge of Golang and/or Java.\nExperience with Azure DevOps, GitHub, and GitHub Actions.\nExperience with RHEL and SUSE.\nExperience with VMware, vRealize, ServiceNow, and Red Hat Automation Platform.\nExperience working in mixed Windows and Linux environments.\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7218737-senior-iac-developer/applications/new?promotion=1838600-arbetsformedlingen",
        "published": "2026-02-12T11:31:16",
        "deadline": "2026-02-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30601913",
        "title": "Android Automotive Software Developer",
        "employer": "AFRY AB",
        "location": "Göteborg",
        "description": "Company Description\nAFRY offers services in engineering, design, digitalization, and advisory. We are dedicated experts in industry, energy, and infrastructure, creating value for future generations. AFRY has Nordic roots with a global reach. Our shared principles – Result driven, Client centric, Empowering, and Accountable – guide how we work, develop, and succeed together. Join us in accelerating the transition to a sustainable society.\n\nJob Description\nAt AFRY, we develop and deliver cutting-edge solutions for vehicles, systems, functions, and attributes to clients in the automotive industry. Our customers include both established OEMs, innovative startups, and Tier 1 system suppliers.\nWe are currently seeking experienced software developers who are passionate about shaping the next generation of infotainment systems based on Google’s Android Automotive OS.\nAs an Android Automotive Software Developer, you will work on software development across both application and native layers of the Android stack for infotainment systems. You will collaborate closely with UX designers and other stakeholders to define a seamless, end-to-end user experience. You’ll be part of a team with full responsibility—from design and architecture to documentation, development, verification, and validation. At AFRY, you’ll also have the opportunity to contribute actively to innovation by generating new ideas and solutions.\n\nQualifications\n\nWe are looking for candidates with the following background and skills:\n\nM.Sc. in Software Engineering or equivalent experience gained through years of professional practice\nSolid experience in Android application and platform development, including work with AOSP and the AOSP build system\nFamiliarity with modern app architectural patterns such as MVP, MVVM, and layered architecture\nExperience working with automotive communication buses\nStrong programming skills in Android, Kotlin, C++, and Python\nGood knowledge of Android testing frameworks such as JUnit, Espresso, and Mockito\n\nExcellent command of English, both written and spoken\nMandatory qualifications:\nProven experience working with a Swedish OEM within the automotive industry\nCurrently residing in Sweden today\nPossession of a Swedish B-class driving license\n\nMeritorious qualifications:\nExperience in Embedded Linux development\nFamiliarity with Continuous Integration (CI) tools and workflows\nDevOps\n\n\nAdditional Information\nAt AFRY, you are given the opportunity to grow in an inspiring and innovative environment where you can develop both professionally and personally. We value our employees’ well-being and offer secure employment with competitive benefits. AFRY places strong emphasis on competence development, and we provide both internal and external training opportunities to help you continue growing within your field.\nWe are flexible regarding your start date. You are welcome to contact us even if you have just started considering a job change and are not quite there yet. We would be happy to tell you more about our operations and future opportunities, as we continuously seek new colleagues.\nFor all recruitments at AFRY, an ID check, reference check, and verification of education are always conducted as a standard procedure. Please feel free to read more about our recruitment process here.\nWelcome with your application! Last date to apply: 2026-03-12\nDaniel Sletteberg Loveryd - Service Area Manager, daniel.slettebergloveryd@afry.com\nWe kindly ask not to be contacted by external providers regarding recruitment solutions or similar services, as these are managed according to company-level agreements.  \n\nAt AFRY, we engineer change in everything we do. Change happens when brave ideas come together. When we collaborate, innovate technology, and embrace challenging points of view. That’s how we're making future. We are actively looking for qualified candidates to join our inclusive and diverse teams across the globe. Join us in accelerating the transition towards a sustainable future.",
        "url": "https://jobs.smartrecruiters.com/AFRY/744000108940741-android-automotive-software-developer?oga=true&trid=4de896fd-3759-406c-8d07-8a7da8844ce0",
        "published": "2026-02-12T10:07:45",
        "deadline": "2026-03-15T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30566257",
        "title": "QA Developer",
        "employer": "Icomera AB",
        "location": "Göteborg",
        "description": "Icomera is a leading global innovator in connectivity solutions within the transportation sector. We are at the forefront of transforming public transport, making it smarter, safer, greener, and more connected than ever before. At Icomera you work with products used by many users around the world, including passengers on some of the world's largest train and bus operators.\n\n\nJob type: Full-time                         \nWorkplace conditions: Hybrid                   \nLocation: Gothenburg\n \nAbout the Role:\nAs QA Developer at Icomera you will be a part of a team that develops software for the next generation of network routers for vehicles. The embedded team is responsible for analysis, design, implementation and test of the software as well as router-OS and router applications. Modifications are done on OS level in both user and kernel space and development is also done on the SW running on router Microcontrollers.\nIn this role, you will conduct testing related to Icomera’s products to ensure product quality according to target. You will also track and report issues found to the product development team to aid the development process. \n \nKey responsibilities:\n—     Contribute to defining, developing, and documenting test processes in line with product requirements and industry standards\n—     Design, develop, and maintain manual and automated test cases and test suites\n—     Develop and improve test automation frameworks and tools\n—     Execute tests according to established test processes and plans\n—     Document and communicate test results to relevant stakeholders\n—     Collaborate with development teams, product management, and regional test engineers\n—     Continuously improve test methods, processes, and ways of working\n \nRequirements:\n—     B.sc / M.sc degree, in computer science, physics or equivalent.\n—     Experience in working with software or test development in a Linux environment developing in Python.\n—     Deep knowledge of computer networking.\n—     Have an Interest and passion for Linux platform and software development.\n—     Proficient in English, written and spoken. If you also speak Swedish, it’s highly desirable.\n \nWho You Are:\nTo thrive in this role, you enjoy working with people and you are excited to be part of a constantly evolving international company. As an QA Developer, you are honest, driven, and solution-oriented, and you enjoy tackling technical challenges as part of a team.\n \nOur Offer:\n— The opportunity to work with cutting-edge technology in a market leader where we design and build everything in-house—from hardware to software\n— Health is important – we offer a comprehensive health benefit program to our employees\n— Flexible work arrangements – work from our modern and central office locations, or work from home up to two days a week\n— Electrical bike lease agreement via net salary deduction\n— ITP Pension and collective bargaining agreement\n— A social work environment – board game nights, after works, seasonal parties… The list goes on!\n \nReady to be part of something exciting and make a real difference in the connected future of transport? We’d love to hear from you!\n \nMore about the position:\nWe will be reviewing applicants ongoing. Icomera welcomes candidates from all backgrounds, and we value a diverse and inclusive work environment. Background checks will be performed at the final stage of the recruitment process.\n\n\n About Icomera:\nIcomera is the world’s leading provider of integrated connectivity solutions for trains, trams, buses, and coaches, serving millions of passengers and tens of thousands of vehicles on a daily basis. The IcoCrew now consist of 300+ employees globally. Icomera is headquartered in Gothenburg, Sweden, with main offices in the United States, Canada, the United Kingdom, Germany, France, Ireland, and Italy.\n \nIcomera’s vision for green mobility within the public transport industry perfectly complements the wider mission of our parent company, Equans. As the global leader in multi-technical services with 74,000 employees working across 17 country hubs, Equans delivers customised solutions which connect, protect and energise territories, cities, buildings, industries and transport infrastructures, empowering their energy, industrial and digital transitions. Visit www.icomera.com for further information.",
        "url": "https://enfrench-equans.icims.com/jobs/81123/qa-developer/login",
        "published": "2026-02-04T15:56:40",
        "deadline": "2026-03-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30595701",
        "title": "Embedded Systems Engineer - Motor Control",
        "employer": "Aros Electronics AB",
        "location": "Göteborg",
        "description": "Brinner du för avancerad teknik och vill se din kod få verklig betydelse? Hos oss på Aros får du chansen att forma framtidens motorstyrning. Vi söker dig som är analytisk, nyfiken och vill arbeta i teknikens absoluta framkant. Hos Aros får du följa din lösning hela vägen – från första kodraden till färdig produkt i användarens händer.\nVarför Aros Electronics\nVi erbjuder en modern arbetsplats där teknisk innovation möter en högt automatiserad produktionsmiljö. Våra kundanpassade lösningar – som spänner över elmotorer, mekanik och styrsystem – driver applikationer inom allt från industriell automation till tunga fordon och textilmaskiner. På Aros blir du en del av ett framåtblickande team med passion för att skapa lösningar i världsklass. Vi främjar en kultur där dina idéer och din expertis värdesätts, och där du får möjlighet att växa i en stöttande och inspirerande miljö.\nDin roll\nSom Embedded Systems Engineer inom Motor Control är du en nyckelperson i att utveckla regleralgoritmer och embeddedmjukvara för avancerade motorstyrningar. Ditt arbete spänner från simulering till verifiering, i nära samarbete med kollegor inom HW, motorkonstruktion och projektledning, samt med kunder och externa experter.\nDu kommer också vara med och förvalta och vidareutveckla Aros plattform inom området, inklusive utvärdering av nya algoritmer och datorarkitekturer.\nDitt fokus\n\nUtveckling av embeddedmjukvara i C för kraftelektroniska tillämpningar\n\n\nSimulering och testning av motorstyrning i samverkan med HW och verkliga driftsmiljöer\n\n\nPlattformutveckling och utvärdering av nya lösningar\n\n\nSamverkan internt och externt med kunder, universitet och partners\n\nVi söker dig som har\nCivilingenjörsexamen inom Elektroteknik, Mekatronik eller Datateknik\n\n\nGedigna kunskaper i reglerteknik, elektronik och elektriska motorer\n\n\nErfarenhet av embeddedprogrammering i C\n\n\nMeriterande är också om du har\n\nErfarenhet av vektorstyrning av 3-fas elmaskiner\n\n\nKunskap i Matlab/Simulink\n\n\nVana av Python\n\n\nFör att trivas hos oss tror vi att du är en nyfiken och analytisk person som gillar att förstå komplex teknik på djupet. Du har ett brett teknikintresse, tar gärna initiativ och tycker om att kommunicera och samarbeta med andra. Du delar med dig av din kunskap, är öppen för nya perspektiv och har ett naturligt intresse för hur andra löser liknande utmaningar – både internt i teamet och externt i branschen. Då kommunikation sker både på svenska och engelska behöver du kunna uttrycka dig obehindrat på båda språk.\nBli en del av Aros Electronics\nPå Aros är du mer än bara en medarbetare – du är en del av ett team som formar framtidens teknik. Hos oss får du möjlighet att växa, vara innovativ och arbeta med lösningar som gör verklig skillnad. Var med och utveckla banbrytande teknologi, bidra till hållbarhet och ta nästa steg i din karriär i en inspirerande miljö.\nHar du frågor? Kontakta gärna ansvarig rekryterare Malin Nyberg på malin.nyberg@zoey.se eller Mikael Hedén, Software Team Manager på mikael.heden@aros.se\nLåt oss forma framtiden tillsammans – sök idag!",
        "url": "https://aroselectronicsab-1732263598.teamtailor.com/jobs/7169186-embedded-systems-engineer-motor-control/applications/new?promotion=1826358-arbetsformedlingen",
        "published": "2026-02-11T09:34:02",
        "deadline": "2026-08-04T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30605244",
        "title": "Test & Calibration Engineer",
        "employer": "L&T Technology Services Sverige Filial",
        "location": "Göteborg",
        "description": "About the Role\nWe are hiring in Södertälje, Sweden!\nL&T Technology Services (LTTS) is seeking a skilled Test & Calibration Engineer to support our global commercial vehicle customer.\nThe role involves vehicle-level testing, software calibration, and configuration of advanced after-treatment systems for heavy-duty engines.\nYou will be part of the onsite LTTS delivery team, working closely with OEM engineers to achieve emission, performance, and reliability targets.\nThis position involves operating and testing heavy trucks — therefore, a valid Swedish Class C driving licence.  \nKey Responsibilities \nPlan and execute vehicle-level after-treatment system tests (DOC, DPF, SCR, thermal management, and regeneration).\nPerform software calibration, configuration, and validation using OEM-standard tools (ETAS INCA, CANape, MATLAB, Concerto).\nConduct on-road and test-cell evaluations for performance, emission, and OBD compliance.\nSet up and instrument test vehicles; ensure accuracy, safety, and readiness for validation.\nPerform data logging, analysis, and reporting for emissions and system parameters.\nCollaborate with engine control, diagnostic, and hardware teams for function verification.\nLead technical reporting: test plans, reports, issue lists, and validation records.\nSupport calibration reviews, software release readiness, and emission compliance verification.\nDrive continuous improvement initiatives in test methodology, tools, and vehicle setup.\n\n Required Skills & Qualifications: \nEducation: Bachelor’s or Master’s degree in Mechanical, Automotive, or Mechatronics Engineering.\nExperience: 3–8 years in after-treatment calibration, vehicle testing, or powertrain validation (preferably for heavy-duty vehicles).\nHands-on proficiency with ETAS INCA, Vector CANape, MATLAB/Simulink, Concerto, and other calibration tools.\nKnowledge of engine control systems, after-treatment architecture (DOC, DPF, SCR, DEF dosing), and OBD functionality.\nFamiliarity with Euro VI/VIe/VII emission legislation and validation processes.\nStrong analytical and problem-solving mindset with attention to detail.\nExcellent verbal and written communication skills in English.\nValid Swedish Class C truck driving licence – COMPULSORY.\n (Applicants without this licence will not be considered, as the role involves driving test trucks on public roads.)\n\nDesirable Skills: \nExperience with PEMS (Portable Emission Measurement Systems) and RDE testing.\nExposure to hybrid or alternative-fuel powertrains (HVO, LNG, biogas).\nUnderstanding of CAN, LIN, and XCP communication protocols.\nFamiliarity with onsite-offshore delivery models in automotive R&D.\n\n Work Environment: \nOnsite assignment at customer’s R&D center in Södertälje, Sweden.\nWork in a collaborative and dynamic environment alongside OEM engineering teams.\nClose coordination with LTTS’s offshore calibration and data analysis teams.\nAccess to advanced emission labs, test tracks, and vehicle proving grounds.\n\n Why Join LTTS: \n Be part of LTTS’s Global Powertrain Engineering Center of Excellence delivering next-generation emission technologies.\nOpportunity to contribute directly to commercial vehicle emission and performance development.\nExposure to full lifecycle testing – from calibration and validation to release.\nClear growth path within LTTS’s global delivery framework.\nCompetitive Swedish compensation and benefits.\n\n\n\nEligibility: \n✅ Swedish Work Permit / EU Work Authorization\n✅ Valid Swedish Class C Driving Licence (Mandatory)\n✅ Heavy Vehicle Testing Experience",
        "url": null,
        "published": "2026-02-12T16:38:55",
        "deadline": "2026-03-14T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 80
    },
    {
        "id": "30603966",
        "title": "Spontaneous Application Consat Digital Solutions",
        "employer": "Consat Engineering AB",
        "location": "Göteborg",
        "description": "Are you looking for a bright future? Do you want to work with cutting-edge technology — alongside colleagues who could easily belong in your favorite sitcom?\nWhat a fortunate coincidence. We might be looking for you.\nAt Consat Digital Solutions, we operate at the intersection of software, hardware, and intelligent systems. We develop smart, sustainable digital solutions — from advanced embedded systems and connected products to AI-driven applications and scalable digital platforms.\nEven if we don’t have the perfect position advertised right now, we are always interested in connecting with talented and driven professionals who want to shape the future with us.\nWe would love to hear from:\n\nSoftware developers (C/C++, Python, .NET, etc.)\n\n\nEmbedded engineers\n\n\nAI / ML engineers\n\n\nTest & verification engineers\n\n\nSystem architects\n\n\nTechnical project managers\n\n\nDigitalization specialists\n\n\nCurious problem-solvers who enjoy turning complexity into clarity\n\n\nWe believe great technology is built through collaboration — from concept and architecture to implementation, verification, and delivery. That means strong engineering, structured testing, and confident project leadership working seamlessly together.\nAt Consat, you’ll work with modern tools, challenging projects, and skilled colleagues who value knowledge-sharing, innovation, and continuous improvement. We take our work seriously — but not ourselves.\nIf you are driven by technology, motivated by real-world impact, and ready to grow in a dynamic and supportive environment, we would love to hear from you.\nLet’s build intelligent systems that make a difference — together.",
        "url": "https://careers.consat.se/jobs/7220130-spontaneous-application-consat-digital-solutions/applications/new?promotion=1839031-arbetsformedlingen",
        "published": "2026-02-12T14:11:44",
        "deadline": "2026-08-11T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30599163",
        "title": "Software Engineer, Integration Automation",
        "employer": "Avaron AB",
        "location": "Göteborg",
        "description": "About the Company\nAvaron AB is a growing consultancy focused on technology, finance, and business support. We match your expertise with the market's most interesting assignments, offering a platform where your professional development is central.\nAbout the Assignment\nWe are looking for a Software Engineer to join an Integration Automation team focused on optimizing, developing, and automating integration and release processes. The goal is to improve delivery speed and reliability by streamlining workflows, enhancing tooling, and raising the quality of software deliveries in an embedded environment.\nYou will work closely with stakeholders and engineers to identify bottlenecks and implement automation through tools and scripts, with a strong emphasis on robust and repeatable outcomes.\nJob DescriptionOptimize and automate integration and release processes and related tasks\nDevelop and maintain scripts and tooling to improve efficiency and reliability\nIdentify improvement areas in current workflows and drive automation initiatives\nSupport troubleshooting through fault tracing and debugging in an embedded software context\nCollaborate with the team to ensure high-quality, stable deliveries\nRequirementsProficiency in scripting (e.g., Python, Make)\nSolid understanding of embedded software development\nStrong understanding of AUTOSAR Classic\nGood knowledge of AUTOSAR Basic Software (BSW) configuration and related tools\nStrong skills in fault tracing and debugging\nFluent in spoken and written English\nNice to haveExperience with Lauterbach/Trace32 for debugging and analysis\nHands-on experience with DaVinci Configurator/Developer\nExperience from automotive software development\nTesting and debugging experience on HIL/SIL and vehicles\nApplication\nSelections are made on an ongoing basis, so we recommend that you apply as soon as possible.",
        "url": "https://jobs.avaron.se/jobs/7214083-software-engineer-integration-automation/applications/new?promotion=1837108-arbetsformedlingen",
        "published": "2026-02-11T15:33:09",
        "deadline": "2026-02-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30590395",
        "title": "Senior Machine Learning Research Engineer",
        "employer": "Lindholmen Science Park AB",
        "location": "Göteborg",
        "description": "AI Sweden is the national center for applied artificial intelligence, funded jointly by the public and private sectors. Our mission is to accelerate the use of AI to strengthen society, enhance competitiveness, and benefit everyone living in Sweden. A key part of this mission is tackling major research and innovation challenges together with our partners.\nWe are now looking for a Senior Machine Learning Research Engineer to join our team in Gothenburg. The team works broadly within AI security and advanced machine learning, including privacy-preserving ML, AI Security, computer vision, multimodal learning, and the interplay between algorithms and infrastructure.\nAbout the position\nAs a Senior ML Research Engineer at AI Sweden, you will contribute to research, experimentation, and development at the intersection of safe, trustworthy, and high-performance AI.\nOne of our flagship initiatives is LeakPro, an open-source project aimed at detecting and mitigating information leakage in machine learning models. Read more: https://www.ai.se/en/project/leakpro-leakage-profiling-and-risk-oversight-machine-learning-models\nThrough LeakPro and related efforts, we explore questions such as:\n\nHow can we systematically measure and reduce unintended information leakage in ML models?\n\n\nHow do we build open, reproducible tools for evaluating model vulnerabilities and attack vectors?\n\n\nHow can we design and train generative and multimodal models with privacy, integrity, and security at their core?\n\n\nWhile privacy-preserving machine learning is an important initial focus, the role can be broader. We seek candidates who want to contribute across several of our current and future research and innovation projects in ML.\nTypical tasks may include:\n\nReviewing and implementing cutting-edge ML research\n\n\nDeveloping and evaluating ML models, attacks, privacy enhanching technologies and defenses.\n\n\nDesigning and maintaining open-source tools, benchmarking frameworks, and pipelines\n\n\nSupervising MSc thesis students and collaborating closely with partner organizations\n\n\nContributing to new project proposals and research/innovation initiatives\n\nTechnical qualities\nFast Experimenter – adept at prototyping and evaluating new ML methods.\n\n\nML Systems Thinker – experienced in building reproducible, robust, and scalable ML pipelines.\n\n\nData Versatile – hands-on experience with at least two data modalities, e.g., images, text, tabular, or time-series.\n\n\nEthics- and Security-Aware – strong interest in privacy, model safety, and secure deployment practices\n\n\nStrong debugging and refactoring skills in large research codebases.\n\n\nFamiliarity with differential privacy is a plus.\n\n\nRequirements\nPhD in Machine Learning, Computer Science, Data Science, Engineering, or a related field, with a proven applied or research-driven focus OR at least 4+ years of industry experience in machine learning development and research engineering.\nAbility to work independently on complex ML projects and contribute to research-driven development. Comfortable reading, understanding, and implementing ideas from research papers. Experience working in collaborative codebases and contributing to shared tools or open-source projects. Strong written and spoken English, highly desirable is also fluency in Swedish\nTechnical Expertise\nProficiency in Python and deep learning frameworks (PyTorch preferred; TensorFlow also relevant).\nExperience with generative models (e.g., Transformers/LLMs, diffusion models)\nStrong understanding of optimization and training dynamics\nAbility to implement ML research papers from scratch\nExperience building reproducible ML pipelines and benchmarking frameworks\nExperience writing scientific papers, technical documentation, or white papers is an advantage\nWhy work for AI Sweden?\nAt AI Sweden, you will join a national initiative supported by over 170 partners across industry, academia, and the public sector. Here, you will:\nCollaborate with top AI researchers, industry leaders, and innovators\nWork in an agile, diverse, and inclusive environment\nInvest in your personal and technical development while building a strong professional network\nBe part of a mission-driven organization where your ideas can shape the future\nAn equal and fair working environment\nAI Sweden is committed to building a diverse and equitable work environment. We value perspectives from different backgrounds, genders, ages, and experiences.\nThe position is located at Lindholmen Science Park, Gothenburg, and begins with a two-year contract with the possibility of extension. We are covered by a Swedish collective agreement, offering benefits such as pension, paid leave, wellness allowance, and more.\nEmployment: Full-time, onsite  Workplace: Kuggen, Lindholmen, Gothenburg\nStart date: Early 2026. Applications are evaluated continuously (deadline 31 jan)\nFor questions, feel free to reach out to Fazeleh Hoseini, Research Scientist: fazeleh.hoseini@ai.se\nAI Sweden does not accept unsolicited support and kindly ask not to be contacted by any advertisement agents, recruitment agencies or manning companies.",
        "url": "https://careers.ai.se/jobs/6927657-senior-machine-learning-research-engineer/applications/new?promotion=1832591-arbetsformedlingen",
        "published": "2026-02-10T10:59:37",
        "deadline": "2026-02-20T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30576013",
        "title": "Embedded Software Developer",
        "employer": "Academic Work Sweden AB",
        "location": "Göteborg",
        "description": "Take the chance to step into a role where embedded development meets real products. If you have experience in embedded C, enjoy working close to the hardware, and want to take true ownership of your work, this is a place where your ideas quickly make a difference.\n\nOM TJÄNSTEN \nOur client develops control systems for marine and industrial applications, with a focus on making advanced technology easy to use. It has long experience in the field, a broad patent portfolio, and delivers products on a large scale. They are now seeking a embedded developer who wants to work with hardware‑near C programming for distributed, safety‑critical control systems and contribute to projects within electrification and automation. The work involves close cooperation with colleagues, customers, and suppliers, and participation throughout the product lifecycle.\n\nThe role suits you who enjoy practical embedded development and like working close to the product, where decisions are made quickly and collaboration is straightforward. It also suits you who feel confident taking initiative, staying up to date in your field, and contributing with your knowledge in a self‑driven way.\n\nARBETSUPPGIFTER \n\nWork tasks\n\n\n* Develop and improve hardware‑near C software for distributed control systems\n* Contribute from early concept to final product\n* Collaborate with customers, suppliers, and internal teams\n* Explore new technologies within electrification and automation\n* Support development of future safety‑critical systems\n\n\nVI SÖKER DIG SOM \n- At least 2 years of professional experience in embedded development in C\n- Knowledge of distributed control systems\n- Knowledge of Functional Safety\n- Knowledge of control theory\n- Experience with CAN, I/O, GNSS/IMU and TargetLink is beneficial\n\nIt is meritorious if you have knowledge within \n\n\n* Trucks\n* Python\n* E‑mobility\n* Electric motor control\n* Cyber security\n\n\nTo succeed in the role, your personal skills are:\n\n\n* Driven\n* Proactive\n* Solution‑oriented\n* Communicative\n\n\nOur recruitment process\n\nThis recruitment process is handled by Academic Work and it is our client’s wish that all questions regarding the position is directed to Academic Work.\n\nOur selection process is continuous and the advert may close before the recruitment process is completed if we have moved forward to the next phase. The process includes two tests: one personality test and one cognitive test. The tests are tools to find the right talent for the right position, to enable equality, diversity, and a fair process.\n\nINFORMATION OM FÖRETAGET \nN/A",
        "url": "http://www.academicwork.se/jobad/embedded-software-developer/15117290?apply=1",
        "published": "2026-02-06T12:01:09",
        "deadline": "2026-03-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30466704",
        "title": "Software Flow Developer",
        "employer": "SiNIX Flow AB",
        "location": "Göteborg",
        "description": "We are now looking for more colleagues who has previously taken an active part in building and improving CI/CD systems and are familiar with some related practices such as provisioning, delivery flows, build systems, repository management, data management and data visualization. We learn, share knowledge and always strive to create and deliver the best solutions to our customer.\nAs we have a great range of customers demanding our skills it gives a good opportunity for you to discover many different solutions and technologies. Most of the time, you will be working together with colleagues from SiNIX, at the customer or in one of our teams.\nOur customers trust in us and we work very closely with them. In the partnership, we guide them to the solutions that supports them in the best possible way.\nOur mission in SiNIX Flow -  is to make software development smooth and efficient. An environment where you as a developer get fast feedback through intuitive built pipelines and continuous integration.\nWe are looking for persons with a few years of year's experience in CI/CD, DevOps etc BUT most importantly - are interested in making software development smooth and efficient.\nIt´s good if you have:\nA Bachelor or Master's degree in Computer Science or equivalent.\nExperience in CI/CD pipeline design.\nExperience in IaC.\nExperience in working with Docker and Kubernetes.\nExperience with different cloud providers.\nScripting/coding in for example Python, but good to have C++, Golang etc.\nWe offer:\nInteresting assignments\nGreat and skilled colleagues\nLots of fun and learning\nWe are a Göteborg based company, but have customers outside the region.\nAt SiNIX, we prioritize the value of our colleagues by creating memorable experiences and sharing skills. We empower our employees with choices in training, vacation time, and flexible salaries, fostering a supportive and thriving work environment. Our aim is to inspire ongoing growth and development, making success a shared journey.",
        "url": "https://jobs.sinix.se/",
        "published": "2026-02-01T00:00:00",
        "deadline": "2026-07-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30545273",
        "title": "Firmware Engineer",
        "employer": "Elektron Music Machines Mav AB",
        "location": "Göteborg",
        "description": "Elektron builds state-of-the-art electronic music instruments with deep functionality and exceptional sonic capabilities. With a track record of iconic products such as the Machinedrum, Octatrack and Digitakt, Elektron has become uniquely positioned in the artist and producer community.\nWe’re now expanding our team, to push the boundaries of music creation and meet customer demand!\nWith small teams, flat hierarchy, and high emphasis on creativity, Elektron gives room for every idea to be heard! Joining the Elektron team means being trusted in your abilities.\nDo you want to be a part of the team that creates the best electronic music instruments in the world?\nRole Description\nWe are currently looking for a full-time Firmware Engineer to expand the R&D team. As a firmware engineer at Elektron you will work with the complete software design chain; from product ideas, through prototype stages, to released firmwares and updates in future releases.\nThe embedded software team is responsible for all the programmable aspects of the instruments, ranging from digital logic to high level data management. We develop software for products to come, and we continue to improve the software long after they have been released.\nOur instruments have multi-threading real-time operating systems, and may be composed of multiple micro-controllers and digital signal processors. You will be working at the application level, but you are required to interface the operating system at a lower level.\nYou are passionate about writing code which is reliable as well as efficient. You are comfortable working with a large existing codebase. You are self-motivated and have strong problem solving capabilities.\nThis is an on-site position based in Gothenburg, Sweden.\nRequired skills & experience\nMaster of Science in Computer Science, Electrical Engineering, or similar experience.\nSeveral years of experience with C++.\nSome experience with Python.\nExtensive embedded systems design knowledge.\nGood knowledge about multi-threaded real-time systems.\nGreat problem-solving skills.\nExperience with software architecture and knows how to write maintainable systems.\nKnows Git inside-out and is well familiar with code review.\nGood knowledge of algorithms and data structures.\nA structured way of working, using version control, issue trackers and similar tools.\nSeveral years of working experience in a similar field.\nFluent spoken and written English.\n\nValued skills\nKnowledge in Rust, Digital Signal Processing, USB communication.\nExperience with production testing and a drive for testability.\nExperience with major real-time operating systems such as FreeRTOS, Zephyr etc.\nLow level ARM A/M architecture and ISA knowledge.\nInterest in music instruments (preferably making music).\n\nWhat we offer\nA dynamic and multicultural workplace where you have the opportunity to make a real impact and take ownership. At Elektron, you’ll experience great team spirit and a warm atmosphere, with music at the heart of everything we do. You’ll work closely with all departments and gain a broad understanding of the company, opening doors for professional development and long-term growth. Along the way, you’ll enjoy regular social events, fresh fruit, free parking, a wellness benefit, and more — all backed by the security of a collective agreement.\nStart: As soon as possible, by agreement\nScope: Full-time, permanent position\nLocation: Banehagsliden 5, Gothenburg\nWe usually get back to applicants within 14 days, but due to a high volume of applications, the response time may sometimes be longer — but rest assured, you haven’t been forgotten, and we promise to reach out as soon as we can.\nGreetings from Elektron!",
        "url": "https://careers.elektron.se/jobs/6147177-firmware-engineer",
        "published": "2026-01-30T14:58:35",
        "deadline": "2026-05-01T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30534097",
        "title": "ADAS Embedded Developer",
        "employer": "Nexer Engineering AB",
        "location": "Göteborg",
        "description": "The future of mobility is evolving, and so are we at Nexer Engineering in Gothenburg.\nAre you motivated by tackling complex technical challenges and eager to contribute to the future of intelligent and safe vehicles? We are strengthening our embedded community, and we’re looking for someone who wants to be part of it. Together, we stay at the forefront, create innovative solutions for our clients, grow our skills, and have a lot of fun along the way!\nAbout Nexer Engineering in Gothenburg\nWithin Nexer Engineering, we collaborate with industry‑leading companies and specialize in product development and advanced engineering. Many of our assignments are within the automotive industry, where ADAS and future mobility play a central role. We cover competence areas ranging from embedded systems to low‑level, hardware‑near software development and sensor‑based technologies.\nAbout the role\nWe hire for the long term, and we’re looking for someone who wants to grow with us. And while we’re particularly interested in someone with a strong interest in ADAS, you will also, over time, have the flexibility to take on other embedded assignments - such as connectivity, platform and middleware development, or classic embedded programming in other industries.\nIn embedded development and ADAS‑related assignments, you will contribute to the development of next‑generation vehicle technologies. Depending on your background and ambitions, your work may involve areas such as:\nsoftware development for ADAS and sensor‑based systems\nembedded C/C++ development\nworking with radar, lidar, cameras, or other perception technologies\nreal‑time environments and safety‑critical systems\nalgorithmic functions, platform development, or low‑level hardware‑near software\n\nWe believe you have:\nExperience in ADAS and AUTOSAR\nExperience in embedded systems\nStrong programming skills in Embedded C (C++ is meritorious)\nExperience from automotive or similar technical domains\nAt least a B.Sc. in Computer Science, Electrical Engineering or a related field\n\nApplication\nDo you recognize yourself in the description above and feel that Nexer sounds like the right place for you? Then we’re really looking forward to reading your application!\nPlease note that we do not accept applications via e‑mail due to GDPR regulations.\nNexer as an employer\nIf you work at Nexer, you get a bold and entrepreneurial employer with an international presence. We take pride in leading the digital revolution and being at the forefront of technology, always with an agile and forward-looking approach. With us, you get unique opportunities to dream big, act smart and develop. As a family-owned company, we own our strategy and invest in long-term goals, and we encourage employee involvement and ideas. In addition, we offer a flexible work policy, where it’s possible to work remotely when it suits you and your assignment.\nOur culture\nOur vision is Promising future – it’s important for us to make a difference and contribute to a better future. We are committed to our customers and have a sincere concern for each other. We embrace diversity and believe that people with different backgrounds and experiences make our work and our company better. We value innovation and the will to develop and take the next step, onwards and upwards. And most importantly – we have fun at work!",
        "url": "https://nexergroup.teamtailor.com/jobs/7128006-adas-embedded-developer",
        "published": "2026-01-29T16:50:50",
        "deadline": "2026-03-29T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30508840",
        "title": "Lead Engineer",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "Stakeholder Relationship\nPython, dSpace AutomationDesk\nHIL systems, real-time simulation, dSPACE toolchain (AutomationDesk)\nCI/CD, software testing, CAN & Automotive Ethernet\nKnowledge of Electric Motors, Power Electronics, Traction Batteries\nMiddleware & SW platform development\nElectric propulsion simulation\nVehicle-level verification & test automation\nCore/Domain development & testing",
        "url": null,
        "published": "2026-01-22T17:28:10",
        "deadline": "2026-02-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30508683",
        "title": "Technical Lead",
        "employer": "HCL Technologies Sweden AB",
        "location": "Göteborg",
        "description": "B.Sc. or M.Sc. in Electronics, Software, Mechatronics or other equivalent education\nExperience of developing software algorithms and specifications\nExperience of Unit testing, HIL or SIL (Boxcar) testing, \nKnowledge in AUTOSAR\nFluent in English (written and spoken)\nProgramming skills in C, C++ and Python are meritorious\nStrong knowledge of Diagnostics and Software Download. (ISO 14229)\nKnowledge of Automotive Communication Protocols (CAN/LIN/ETH)\nKnowledge in Automotive Functional Safety Standard ISO26262 is meritorious",
        "url": null,
        "published": "2026-01-22T16:47:20",
        "deadline": "2026-02-21T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30469653",
        "title": "Senior Embedded Rust Engineer",
        "employer": "Knowit AB (Publ)",
        "location": "Göteborg",
        "description": "Are you passionate about building high-performance embedded systems using Rust? Do you enjoy solving complex technical challenges and influencing both architecture and implementation? If so, you might be exactly who we’re looking for.\nAt Knowit Connectivity, you will work with skilled engineers on advanced automotive, mobility and connected-system projects. Together with our clients’ R&D teams, we create next-generation solutions that enable safer, smarter and more sustainable technology.\nWhat You’ll Do\nAs a Senior Embedded Rust Engineer, you will play a key role in designing and developing software for performance-critical and safety-critical embedded systems. You will contribute to architectural decisions, drive technical improvements, and ensure high-quality deliveries together with your team.\nYour responsibilities include:\n\nDeveloping robust and efficient embedded software, primarily in Rust (occasionally C/C++)\n\n\nWorking close to hardware, performing debugging, measurement and analysis using oscilloscopes, analyzers, and similar tools\n\n\nContributing to next-generation automotive platforms such as ADAS, connectivity, infotainment or electrification\n\n\nApplying automotive standards (ASPICE, AUTOSAR) and working with communication protocols such as CAN, J1939, and other serial interfaces\n\n\nDesigning for safety, reliability, and long-term maintainability\n\n\nCollaborating in cross-functional agile teams with engineers, architects, and stakeholders\n\n\nChallenging technical solutions and driving continuous improvement\n\nWhat We’re Looking For\nWe are looking for an experienced embedded engineer with strong technical depth and a passion for modern, safe system development.\nYou have:\n\nA degree in computer science, electrical engineering or similar\n\n\nSeveral years of experience in embedded systems development\n\n\nProven experience with Rust, or deep C/C++ experience and a strong drive to work primarily in Rust\n\n\nUnderstanding of low-level programming, RTOS/Linux/QNX environments, memory management and performance optimization\n\n\nExperience with automotive or other safety-critical products\n\n\nSkills in Python or similar scripting languages\n\n\nCuriosity, initiative and a willingness to learn and challenge assumptions\n\n\nExperience with Vector tools and other automotive lab equipment is a strong plus.\nFluency in English is required; Swedish is meritorious.\nWhy Knowit?\nAt Knowit, you will join a team that values technical excellence, collaboration and continuous learning. We offer an environment where you can influence, grow and work on impactful projects.\nWhat we offer:\n\nChallenging and meaningful projects shaping the future of mobility and connectivity\n\n\nA culture where engineering, knowledge sharing and teamwork are central\n\n\nContinuous learning through training, mentorship and internal competence networks\n\n\nA healthy work-life balance and a supportive, open culture\n\n\nStrong sustainability values and a long-term commitment to society\n\n\nCollective agreement and competitive benefits\n\nReady to Join Us?\nIf you want to work with advanced embedded technology and modern Rust-based development — and contribute to solutions used in millions of vehicles worldwide — we’d love to hear from you.\nSend us your application and tell us why you’d be a great fit for the role.",
        "url": "https://careersweden.knowit.se/jobs/7049288-senior-embedded-rust-engineer/applications/new?promotion=1788688-arbetsformedlingen",
        "published": "2026-01-14T11:53:41",
        "deadline": "2026-07-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465837",
        "title": "Senior Java Developer for Team Air Content-Dynamic Content (AC-DC)",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Senior Java Developer in the AC-DC team!\nThe Role\nOur work is driven by integration with a multitude of provider systems, ranging from traditional Global Distribution Systems (GDSs) like Sabre and Amadeus to Low-Cost Carriers (LCCs) and the cutting-edge New Distribution Capability (NDC). With NDC, we are at the forefront of an industry transformation, where airlines are offering their content directly through the NDC protocol, bypassing third-party systems.\nIn essence, the Air Content domain is both vast and diverse, encompassing everything from customer searches on price comparison sites to the intricacies of pricing, booking, ticketing, and post-booking functionalities. We consider Air Content to be the engine that propels our business forward.\nAs a Senior Java Developer on our Air Content team, you will be an integral part of a dynamic and forward-thinking group that powers the core of our business. You will have the opportunity to work on challenging projects, collaborate with cross-functional teams, and shape the future of our Air Content offerings. If you're passionate about Java development, and thrive in a collaborative, innovative environment, this role is perfect for you.\nKey Responsibilities\n\nDesign, develop, and maintain Java-based applications that are central to our Air Content platform.\n\n\nCollaborate with cross-functional teams to implement new features and enhancements.\n\n\nOptimize and improve the performance, reliability, and scalability of our Air Content systems.\n\n\nTroubleshoot and resolve complex technical issues related to our flight booking and management processes.\n\n\nContribute to the integration efforts with a variety of provider systems, including GDSs, LCCs, and NDC.\n\n\nEnsure code quality and adherence to best practices, standards, and guidelines.\n\nRequirements\nBachelor's degree in Computer Science or related field (or equivalent work experience).\n\n\nProven experience as a Java Developer, with a strong grasp of Java.\n\n\nFamiliarity with RESTful web services and API development.\n\n\nExperience with integration technologies and protocols, including GDSs, LCCs, and NDC, is a plus.\n\n\nStrong problem-solving skills and the ability to work independently and collaboratively.\n\n\nExcellent communication skills to interact effectively with team members and stakeholders.\n\n\nPassion for the travel industry and a keen interest in keeping up with industry trends\n\nOur Stack\nJava, MySQL, MemSQL, Artemis, Kafka, as well as Atlassian tools, Git Jenkins, Docker Kubernetes, Linux, Mac OS, IntelliJ.\nOf course, you don't have to be familiar with all of our tech stack. We will support you in your journey with us and help you grow.\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\n\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.\n\nA note from the Hiring Team\nDue to the upcoming Christmas holidays, our Hiring Team will be taking a short break. We will begin reviewing applications and reaching out to candidates for the first steps in the new year, starting around week 2 (January 7th).\nWe look forward to connecting with you then!",
        "url": "https://etraveligroup.teamtailor.com/jobs/6917181-senior-java-developer-for-team-air-content-dynamic-content-ac-dc/applications/new?promotion=1786946-arbetsformedlingen",
        "published": "2026-01-13T15:29:11",
        "deadline": "2026-07-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30461764",
        "title": "Developer",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Synteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking talented developers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\n\n\nResponsibilities\nDevelop efficient applications that meet our quality standards.\nConduct system testing to ensure accurate results and optimal performance.\nDetermine most efficient and accurate way to accomplish tasks.\nDeployment of quality products.\nAdopt best practices and share them across the team.\n\nRequired skills and qualifications\nStrong knowledge and experience in C#/.NET/Java.\nPrevious experience in Python, C/C++/R/Matlab/Scala.\nWorking proficiency in databases, e.g. SQL, MySQL.\nExperience in cloud services, e.g. Azure, AWS, Go Cloud.\nKnowledge of Javascript/Typescript and HTML5/CSS.\nReact (or Angular or Vue.js with the ability to adapt).\nKnowledge of systems analysis, system design and database architecture.\nStrong analytical and problem-solving.\nAbility to work independently and as a team member.\nExperience of agile development methodologies.\nFluent in English, both spoken and written is required.\nAdvantage with Swedish.",
        "url": "https://synteda.com/jobs/developer/",
        "published": "2026-01-13T08:58:50",
        "deadline": "2026-03-13T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30403197",
        "title": "Software Developer",
        "employer": "ZENSEACT AB",
        "location": "Göteborg",
        "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
        "url": "https://career.zenseact.com",
        "published": "2025-12-19T10:34:15",
        "deadline": "2026-06-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30343343",
        "title": "Technical Developer - Machine Learning",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are looking for a number of new Technical Developers who want to join our team of highly skilled and passionate engineers.\n\nCOME JOIN US - We are looking for a number of curious people!\n\nSmart Eye’s algorithm teams are looking for experienced Machine Learning Engineers who are interested in developing our computer vision and machine learning solutions.\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-center of Gothenburg, with convenient access by bus, bike, tram, boat, and car. And on top of that; the best coffee in town! \n\nWork description\n\nYou will be part of one of Smart Eye's algorithm development teams responsible for development in key areas such as head- and eye-tracking, attentiveness and drowsiness, face identification and interior sensing for our Automotive Cabin and Driving Monitoring product. We work in an international environment with colleagues in Boston (US) and Cairo (Egypt). \n\nWe are building safety features in novel technology that will significantly improve road safety and will transform our transportation experiences. Safety features such as determining people’s seating locations in a vehicle, if they are wearing seat belts, and detection of left-behind children, as well as features that enhance comfort, wellness, and entertainment by detecting occupants’ emotions and gestures. \n\nDevelopment activities range from early-stage prototyping to porting and deployment to a wide set of automotive embedded platforms. And you will be responsible for the complete chain of development activities including protocols for data collection, network architecture, training of networks, exploratory data analysis and visualization, but also integration into and validation of the model in the production software.\n\nWe solve these challenging problems utilizing state-of-the-art algorithms in the fields of image processing, the latest machine learning techniques, mathematics and accelerated computing.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance. \n\n\n\n\n\n\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg) \n\n\r\n​ Must-have-skills:\n\n\n - \nUniversity degree within Engineering context preferably Physics, Mathematics, Computer Science, Software Engineering or similar.\n\n\n - \n3+ years of software development experience.\n\n\n - \nExperience using end-to-end development (design, planning, evaluation, deployment) of a machine learning based system.\n\n\n - \n2+ year of work experience in C++ and Python development.\n\n\n - \nStrong communication and team collaboration skills.\n\n\nGood-to-have-skills:\n\n\n - Experience with optimizing Deep Learning model architectures and inference runtimes (ex. Tensorflow, Tensorflow Lite, PyTorch).\n\n - Experience in one or more fields of image processing or graphics programming.\n\n - Experience with CI/CD (Continuous Integration and Deployment).\n\n - Experience with developing software for the Automotive industry.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment. \n\n\n - You're able to work independently in an environment that changes rapidly.\n\n - Exhibit a positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers or other teams within Smart Eye.\n\n - Possess strong analytical, creative skills with a strong interest in new technologies.\n\n\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/290562/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-12-05T13:03:13",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30333490",
        "title": "Software Configuration and Release Manager",
        "employer": "Danda AB",
        "location": "Göteborg",
        "description": "We are looking for a skilled and proactive Software Configuration and Release Manager to join our core software platforms, a centre of excellence teams, developing the next generation products solutions with cutting edge technology within the automotive domain.\nThis position plays a key role in managing the end-to-end software integration, configuration, and release process for our core systems central physical ECU, which integrates three logical ECU stacks: Linux and Adaptive AUTOSAR deployed onto service-oriented SoC, and the Classic AUTOSAR onto signal-oriented SoC.\nBeneath service-oriented platforms, a QNX Host OS is deployed on top of hypervised HW resources. At the base, we run our boot software and HW near software components and configurations.\nAs part of our software delivery organization, you will work closely with domain architects, system engineers, software developers, and test teams to ensure stable, documented, traceable, and repeatable software builds and releases across different variants and platforms.\nWho are we?\nThe mission of Software Platforms within Computational Software Infrastructure (CSI) is to provide best in class embedded software platform & technologies, that enable’s software-driven transport solutions for Volvo. We believe in “Software-Defined Everything” and strive to be in the forefront. We foster teamwork and collaboration with continuous improvement mind-set.\nWe are responsible for the complete life cycle, from strategy to maintenance of the on-board SW platforms.\nWho are you?\nYou are a structured, detail-oriented engineer who thrives in complex embedded software environments. You understand the importance of consistency, traceability, and automation in the software development lifecycle, and you are driven by building reliable release pipelines and configuration baselines. You enjoy working collaboratively in cross-functional teams, and you take ownership of processes that ensure quality and compliance in every software release.\nYou’re aware of multi-layered software stacks and understand the nuances of integrating software components across Boot Software, Hypervisor, Software Download and Deployment orchestration, Linux, Adaptive AUTOSAR, Classic AUTOSAR platforms in safety-critical systems.\nYou are an Experienced Software Leader with a passion for automotive software development and baseline management and a deep understanding of dependencies between people and diligence, when it comes to time tracking and revision management. Your expertise lies in software configuration and CI/CD development, and you have a track record of successfully designing and implementing software solutions for automotive ECUs.\nYou thrive in a collaborative environment where you can improve development teams, by monitoring and drive regression testing, and govern bug fixes, and create and maintain the department release baseline. You will be a person that takes pride in proper release documentation and being an interface for information sharing of what content different software releases support.\nYour strong analytical and problem-solving skills enable you to make critical decisions and drive collaboration with other trains, to align time plans, and branch outs. software platform development processes.\nResponsibilities:\n Own and manage the software configuration and release management process for the core central ECU, consisting of Linux, Adaptive AUTOSAR, and Classic AUTOSAR logical ECUs.\n Define and maintain software versioning schemes, configuration baselines, and release strategies.\n Drive automation in build, integration, and packaging processes using industry-standard CI/CD tools.\n Coordinate and manage software branching, merging, and integration strategies across multiple software domains and suppliers.\n Ensure traceability of all software artifacts in accordance with automotive safety and cybersecurity standards (e.g., ASPICE, ISO 26262, ISO/SAE 21434).\n Maintain and manage configuration management tools (e.g., Git, GitLab, Jenkins, Artifactory).\n Ensure proper tagging, documentation, and release notes for all software deliveries.\n Facilitate regular release readiness reviews with cross-functional teams.\n Troubleshoot and resolve build/integration issues together with development and system teams.\n Collaborate with Product Owners and Product Managers to align release schedules with program milestones and vehicle development timelines.\n \nRequirements\n Bachelor’s or Master’s degree in Software Engineering, Computer Science, Electrical Engineering, or related field.\n 5+ years of experience in software configuration and release management within the automotive or embedded systems domain.\n Solid experience with Linux, Adaptive AUTOSAR, and Classic AUTOSAR software stacks.\n Deep understanding of Git-based workflows, CI/CD pipelines, and software version control principles.\n Hands-on experience with tools like Jenkins, Artifactory, GitLab, Bitbucket, and Yocto (preferred).\n Strong grasp of embedded build systems and toolchains for cross-compilation.\n Familiarity with ASPICE, ISO 26262, and software compliance requirements in the automotive industry.\n Excellent communication and organizational skills, with the ability to collaborate effectively across international and interdisciplinary teams.\n Experience working in agile software development environments.",
        "url": "https://jobb.danda.se/jobs/6875171-software-configuration-and-release-manager?promotion=1739752-arbetsformedlingen",
        "published": "2025-12-03T11:46:52",
        "deadline": "2026-05-22T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30312056",
        "title": "Cyber Security Engineer",
        "employer": "Mission Consultancy Assistance Sweden AB",
        "location": "Göteborg",
        "description": "About the job\nAre you a skilled Cyber Security Engineer with a talent for finding gaps in the most secure systems? We’re looking for someone to perform in-depth penetration testing across various technologies, including Windows and Linux environments, Citrix Workspaces, Cloud infrastructures, and APIs. You will use the latest tools and techniques to uncover vulnerabilities and work alongside our development and security teams to address and fix them. If you're ready to tackle complex security challenges, we want to hear from you!\nThe ideal profile\nThe perfect candidate is a highly skilled and detail-oriented Cyber Security Engineer with genuine hands-on experience in penetration testing and vulnerability analysis. You have excellent written and verbal communication skills and are a strong problem-solver. You thrive both working independently and collaborating within a team, always ready to tackle challenges with analytical precision.\nQualifications:\nYou have a strong understanding of network protocols, both Windows and Linux operating systems, application architectures and Red Hat\nIn-depth knowledge of common vulnerabilities and exploits (CVEs)\nProficiency in using various penetration testing tools such as Metasploit, Nmap, Burp Suite and/or Nessus\n\nAdditional skills:\nExperience with cloud security, particularly AWS.\nKnowledge of scripting languages (e.g., Python, PowerShell).\nFamiliarity with source code review techniques.\nUnderstanding of frameworks like ISO 27001, NIST, CIS\nSecurity certifications such as OSCP, CEH, PEN TEST+",
        "url": null,
        "published": "2025-11-27T10:17:25",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30226941",
        "title": "Embedded Software Developer / Engineer / C++ / Linux",
        "employer": "Combine Control Systems AB",
        "location": "Göteborg",
        "description": "We are building a team of skilled embedded software developers to complement our current services within control systems, data science, and AI, and we are looking for you who want to be part of this journey! About Combine Control Systems Combine Control Systems is at the forefront of engineering and technology, delivering high-quality solutions within embedded systems, control engineering, and software development. We support our clients in taking their products from idea to market with efficiency and quality. As we continue to grow, we seek new colleagues who are passionate about technological innovation and professional development. We offer a stimulating and supportive environment where all team members are encouraged to challenge themselves and each other, working together to solve complex problems. Who are we? Combine Control Systems is a leading supplier of high-quality engineering services within Software Development, Data Science and AI, and Control Systems. We help our customers bring their products to the market on time, at a predictable cost, and high quality. We offer varied challenges at the bleeding edge of technology, an inspiring working environment, and enthusiastic colleagues. We are now looking to strengthen our capabilities within embedded development and take on even more fun and challenging projects, both in-house and at customer sites. We have offices in Lund, Gothenburg, and Linköping.\nWhat can we offer you?\n Exciting assignments, within, for example, the automotive industry or defense.\n The possibility of taking on projects together with, and learning from, our colleagues who are enthusiastic about Control Systems, Data Science and AI.\n The flexibility and familiar atmosphere of a smaller company.\n \nOur employees describe their work as dynamic and highly mentally stimulating. They say that they appreciate the opportunity to work with new inspiring tasks and projects and expand their knowledge in a supportive and helpful way.\n \nWhich skills do you need to join the team? We are looking for you who have some experience working hands-on with development on embedded targets. We believe that you are eager to learn new methods and tools and appreciate working with new technologies. You like having fun and respect and trust your team as much as your own knowledge. Qualifications\n Bachelor’s or Master’s degree in Computer Science, Software Engineering, Electronics, or related technical field\n Professional experience developing software for embedded Linux environments using modern C++\n Familiarity with version control (e.g., Git), CI/CD pipelines, and agile development\n Proficient in English (both written and spoken), Swedish language skills beneficial but not required\n  Desirable Skills Experience with real-time systems, safety-critical applications, or functional safety standards\n Knowledge of scripting languages (such as Python)\n Exposure to build systems (CMake, Make), Docker, or container technologies \n \nWho are you? We belive that you are self-driven and enjoy working in collaborative, multidisciplinary teams. You are a problem-solver with a proactive mindset and a strong eagerness to learn and develop professionally. You value quality, innovation, and continuous improvement in your work, and are committed to fostering a respectful, inclusive, and engaging workplace for all. \n  \nIf you are passionate about embedded software development and want to be part of a company that supports growth, innovation, and teamwork, we look forward to your application! \n Welcome to Combine Control Systems!",
        "url": "https://combine.teamtailor.com/jobs/6712542-embedded-software-developer-engineer-c-linux?promotion=1700265-arbetsformedlingen",
        "published": "2025-11-05T10:59:32",
        "deadline": "2026-04-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "29952795",
        "title": "Technical Developer - Project Team",
        "employer": "Smart Eye AB (publ)",
        "location": "Göteborg",
        "description": "Smart Eye is leading the global market for Driver Monitoring Systems, which will soon be a standard component in every car. Monitoring the driver behavior is safety critical both for normal driving as well as for autonomous driving. We are constantly growing and are looking for a number of new Software Developers who want to join our team of highly skilled and passionate engineers.\n\nWe are looking for experienced developers!\n\nWe provide a high tech working environment in an exciting and expanding business and depending on your skills and interest you can work within a wide range of fields.\n\nYou will have great opportunities to personal development, challenges and great fun. You will work with highly talented people and join our spirit of an open, inclusive and creative culture. We believe in true teamwork where everyone is important. You find us in modern premises at Järntorget, in the city-centre of Gothenburg, with great access by bus, bike, tram, boat, and car. And on top of that the yummiest coffee in Gothenburg!\n\nWork description\n\nOur project team is responsible for delivering our products to our customers. Work involves development of product customizations, project validation, product integration support as well as other technical customer support.\n\nThe customer support is typically towards a customer's engineering team and ranges from questions about how something works to analyses or investigations of how our product behaves given certain data.\n\nThe project team develops various tools to facilitate troubleshooting or data analysis for the customer. The team also actively improves different CI pipelines, especially the product release pipeline. It is a friendly and international team where collaboration with our Customer Program Owners, as well as with other development teams within the company, is essential.\n\nTypical product customization would be development of new features, optimizing the software for specific target platforms and environments. The work also involves testing and verification for specific vehicle programs as well as working with our customers to create the best possible user experience.\n\nYou will have an active impact of the processes and projects and will work in close cooperation with the other talented team members. Your contribution to how we can meet our customers needs with tomorrow's technology will be of crucial importance.\n\nReporting to: Group Manager in Automotive Solutions Development\nLocation: Smart Eye AB, Headquarters (Gothenburg)\r\n​Must-have-skills:\n\n\n - University degree within Engineering context preferably Computer Science or similar.\n\n - Good knowledge in C/C++, Python and Linux.\n\n - Background in software development, preferably within embedded systems.\n\nGood-to-have-skills:\n\n\n - Experience in one or more fields of image processing, graphics programming, real time operating systems such as QNX, Integrity or Autosar.\n\n - Experience of software development and/or system engineering within automotive industry (Tier 1/OEM).\n\n - Experience of developing software for products related to functional safety and ISO-26262.\n - Experience of customer support.\n\nWho are you?\n\nWe welcome all types of personalities and believe in a true mix of people to create a dynamic work environment.\n\n\n - Ability to work independently in an environment that changes rapidly.\n\n - A positive, enthusiastic, open, entrepreneurial attitude and a willingness to work closely with customers.\n\n - Strong analytical, creative skills. Independent, Self-driven, Thorough, Curious and with a strong interest in new technologies.\n\n - Communication skills with fluency in both Swedish and English. Other languages are a merit.\n\nSince we are working on a global market there might be opportunities to travel and meet with customers.\n\nInterviews are held on a continuous basis, so we highly recommend that you submit your application at your earliest convenience. Welcome with your application.\n\nSmart Eye is the global leader in Human Insight AI, technology that understands, supports and predicts human behavior in complex environments. Together with our subsidiaries Affectiva and iMotions, we are bridging the gap between humans and machines for a safe and sustainable future. \n\nToday, our technology is embedded in next-generation vehicles, leading the way towards human-centric mobility through Driver Monitoring Systems and Interior Sensing solutions. Our Research Instruments offer unparalleled insights into automotive, aviation, assistive technology, behavioral science and many more fields. \n\nOur subsidiary Affectiva is humanizing technology by pioneering Emotion AI, helping companies gain a deeper understanding of how consumers engage with their content, products and services, in automotive, media & entertainment, market research and beyond. \n\nOur subsidiary iMotions provides the world’s leading biosensor software platform, that synchronizes data streams in real time from multiple sensors. \n\nSmart Eye was founded in 1999 and is headquartered in Sweden with offices in the US, UK, Germany, Denmark, Egypt, Japan, Singapore and China. A publicly traded company since 2016, our customers include NASA, Nissan, Boeing, Honeywell, Volvo, GM, BMW, Geely, Harvard University, over 1,300 research organizations around the world, 70% of the world’s largest advertisers and 28% of the Fortune Global 500 companies. \n\nVisit www.smarteye.ai for more information.",
        "url": "https://emp.jobylon.com/applications/jobs/306877/create/?utm_source=ams&utm_medium=promotionserializer",
        "published": "2025-08-26T16:20:45",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30591440",
        "title": "Lead archtiect - Container & Edge",
        "employer": "SAAB AB",
        "location": "Göteborg",
        "description": "Drivs du av att se dina idéer bli verklighet? Välkommen till vår spännande och teknikintensiva värld. \n\nDin roll\n\nVi söker en Lead Architect inom Container & Edge som vill ta tekniskt helhetsansvar för hur moderna, molnbaserade plattformar sträcks hela vägen ut till edge - även i krävande och delvis uppkopplade miljöer.\n\nI rollen driver du arkitektur och teknisk riktning för containerbaserade och cloud-first-lösningar med fokus på edge compute med AI-förmåga, där publika moln (AWS/Azure) är navet och edge-plattformar som Azure Local / Azure Arc och AWS Outposts utgör en naturlig förlängning.\n\nDu arbetar nära produkt, plattform, säkerhet och utvecklingsteam och säkerställer att lösningarna är skalbara, säkra, automatiserade och opererbara - från core cloud till edge. \n\nDina arbetsuppgifter innefattar att:\n\n * Äga och utveckla målarkitektur för container- och edge-plattformar baserade på AWS och Azure.\n * Designa lösningar för edge compute, inklusive AI/ML-förmågor nära datakällan (sensorer, system, plattformar).\n * Definiera arkitekturprinciper, golden paths och paved roads för team som bygger på plattformen.\n * Säkerställa cloud-first-tänk med tydliga mönster för när och hur edge används.\n * Arbeta med Kubernetes-baserade plattformar i både core cloud och edge-miljöer.\n * Driva infrastruktur som kod, CI/CD och automatiserad livscykelhantering för hybrid- och edge-lösningar.\n * Säkerställa att säkerhet, identitet, policy och compliance är inbyggt från start (\"security by design\").\n * Fungera som teknisk ledare och mentor för arkitekter och seniora utvecklare.\n\nDin profil\n\nVi söker dig med:\n\n * Gedigen erfarenhet som arkitekt eller senior teknisk ledare inom molnplattformar.\n * Djup kunskap i AWS och/eller Azure med ett tydligt cloud-first-mindset.\n * Stark erfarenhet av containers och Kubernetes i produktionsmiljöer.\n * Erfarenhet av hybrid- och edge-arkitekturer, exempelvis Azure Local, Azure Arc, AWS Outposts eller liknande.\n * God förståelse för distribuerade system, NFR:er och \"operate what you build\".\n * Förmåga att översätta verksamhetsbehov till robusta tekniska lösningar och långsiktiga arkitekturval.\n\nMeriterande erfarenhet:\n\n * Edge-lösningar med AI/ML-workloads (GPU, inferens nära datakällan, MLOps).\n * Disconnected eller intermittently connected environments.\n * IoT-, sensor- eller OT-nära arkitektur.\n * Erfarenhet från reglerad eller säkerhetskritisk miljö (ISO, NIST, policy as code).\n * Observability-strategier över cloud + edge (OpenTelemetry, Prometheus, Grafana).\n\nBefattningen kräver att du genomgår och godkänns enligt vid var tid gällande bestämmelser för säkerhetsskydd. För befattningar där Saab har krav på säkerhetsklassinplacering kan, i förekommande fall, medföra krav på visst medborgarskap.\n\nVad du erbjuds i rollen:\n\n * Möjlighet att sätta arkitekturen för framtidens cloud- och edge-plattformar.\n * Arbeta med modern teknik i lösningar som har verklig samhällsnytta.\n * Kort väg från idé till implementation - du påverkar både roadmap och tekniska beslut.\n * Kompetensdelning, certifieringsstöd och tid för lärande.\n\nVad du blir en del av\n\nUpptäck oändliga möjligheter. Anta utmaningar, skapa smarta innovationer och uppgradera dina förmågor. Det här är en plats för kluriga tänkare, modiga pionjärer och alla däremellan. Tillsammans uppnår vi det extraordinära, var och en tar med sitt unika perspektiv. Varje bidrag räknas.\n\nSaab är ett ledande försvars- och säkerhetsföretag med uppdrag att hjälpa nationer att skydda sin befolkning och bidrar till trygghet för människor och samhällen. Med 26,100 talangfulla medarbetare utvecklar Saab teknik och lösningar för en säkrare och mer hållbar värld.\n\nSaab utvecklar, tillverkar och underhåller avancerade system inom flygteknik, vapen, ledningssystem, sensorer och undervattenssystem. Saab har sitt huvudkontor i Sverige men en global verksamhet där Saab är en del av många nationers försvarsförmåga. Läs mer om oss här",
        "url": "https://www.aplitrak.com/?adid=cC5zdmVuc3Nvbi42MDgwNS4zMTAxQHNhYWIuYXBsaXRyYWsuY29t",
        "published": "2026-02-10T12:57:05",
        "deadline": "2026-03-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30492694",
        "title": "SoMe-specialist",
        "employer": "Mild Media AB",
        "location": "Göteborg",
        "description": "SoMe-specialist med helhetsansvar\n– strategi, paid och innehåll som driver affär\nÄr du den som testar nya redigeringseffekter innan de ens börjar trenda? Som gillar att kombinera kreativt innehåll med tydliga mål, data och affärsresultat? Som vill äga hela kundresan i sociala medier – från idé till analys?\nDå tror vi att du kan vara helt rätt för oss.\nPå Mild söker vi nu en SoMe-specialist som vill äga och utveckla våra kunders närvaro i sociala medier. Det här är en bred roll för dig som gillar kombinationen av strategi, paid och hands on-produktion – och som förstår hur sociala medier bidrar till tillväxt, varumärke och affär.\n\n\nRollen i korthet\nDet här är inte en roll med ett smalt fokus. Vi söker dig som vill:\n- Ta ett tydligt helhetsansvar för kunders sociala kanaler.\n- Arbeta både med paid social och organiskt innehåll.\n- Själv komma på, skapa och optimera innehåll.\n- Förstå hur sociala medier samspelar med övrig digital marknadsföring.\n- Vara rådgivande, proaktiv och nära kunden\n\n\nDet här kommer du att göra\nSociala medier – helheten\n- Ansvara för flera kunders sociala kanaler, från strategi till publicering.\n- Ta fram SoMe-strategier, contentplaner och taktiker.\n- Vara kundens naturliga kontakt i frågor som rör sociala medier.\n\n\nInnehåll & organiskt\nTa fram idéer, format och vinklar som fungerar i flödet.\nSkapa och redigera innehåll själv – främst foto och video anpassat för mobil.\nJobba med tempo, storytelling, hooks och formatval.\nPublicera, schemalägga och optimera innehåll löpande.\n\n\nPaid social (och gärna lite mer)\n- Arbeta hands on med paid social (exempelvis Meta Ads och TikTok Ads).\n- Testa, analysera, optimera och skala det som fungerar.\n- Förstå samspelet mellan kreativt material och annonsering.\n- Stort plus om du även har erfarenhet av SEM / Google Ads och vill jobba kanalöverskridande.\n\n\nAnalys & utveckling\n- Följa upp resultat och dra insikter som leder arbetet framåt.\n- Tänka i målgrupper, beteenden och communities – inte bara räckvidd.\n- Bidra till att utveckla vårt erbjudande och arbetssätt inom SoMe.\n\n\nDet här tror vi att du har med dig\n- Erfarenhet av att arbeta med sociala medier i en professionell kontext, gärna från byrå.\n- Stark förståelse för paid social och hur innehåll driver effekt.\n- Förmåga och vilja att själv skapa content – idé, produktion och redigering.\n- Vana att jobba i relevanta verktyg för redigering, publicering och annonsering.\n- God känsla för foto, video, copy, tempo och storytelling.\n- Förståelse för hur sociala medier kopplas till affärsmål och tillväxt.\n- Ett strukturerat arbetssätt kombinerat med kreativ höjd.\n- Nyfikenhet på nya format, trender, verktyg och AI.\n- B-körkort\n\n\nExtra plus om du även:\n- Har erfarenhet av SEM / Google Ads.\n- Har haft kundansvar eller arbetat nära kunder tidigare.\n\n\nVarför Mild?\nHos oss jobbar du i ett team med spets inom SEO, SEM, SoMe, CRO, content och strategi. Vi tror på samarbete, transparens och att göra saker ordentligt – utan att göra dem krångliga.\nHär får du:\n- En roll med stort förtroende och mycket eget ansvar.\n- Kollegor som delar med sig, utmanar och vill framåt.\n- Kunder som vill framåt och uppskattar proaktiv rådgivning.\n- Möjlighet att påverka både kundresultat och hur vi jobbar.\n- En vardag där kreativitet och affär går hand i hand.\nVår ambition är enkel:\nDu ska ha kul, utvecklas och känna att det du gör faktiskt spelar roll.\n\n\nÄr det dig vi beskriver? \nSkicka in ditt CV och några rader om dig själv. Har du exempel på konton, kampanjer eller innehåll du jobbat med, dela gärna det också. \nVi intervjuar löpande.\nVälkommen med din ansökan!",
        "url": "https://jobb.mild.se/jobs/7067281-some-specialist-med-helhetsansvar",
        "published": "2026-01-20T08:41:55",
        "deadline": "2026-02-26T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30396942",
        "title": "Data Engineer - AWS, Data Warehousing & Analytics",
        "employer": "Creditsafe i Sverige AB",
        "location": "Göteborg",
        "description": "Om tjänsten:\nI rollen som Data Engineer kommer du att arbeta med att utveckla och optimera affärskritiska SQL-queries samt bygga och förbättra våra dbt-modeller, inklusive mart-, staging-, core- och snapshot-modeller. Du får möjlighet att designa datamodeller som hanterar både historisk och aktuell data, samt implementera och optimera Airflow-DAGs för schemalagda jobb.\nDu kommer att ansvara för hantering av releaser, migreringar och rollback-skript samt felsöka dataproblem och utföra root cause analysis. En viktig del av arbetet är att samarbeta nära verksamheten för att översätta krav till lösningar.\nVidare kommer du att utveckla och implementera ETL-processer från skandinaviska dataleverantörer, vilket innebär att du får en central roll i att säkerställa att våra datalösningar är både tillförlitliga och effektiva.\nVi söker dig som har:\n\n·         Mycket goda kunskaper i avancerad SQL: CTEs (WITH), Window functions (ROW_NUMBER, RANK, LAG, LEAD m.fl.), Komplexa JOINs, subqueries och aggregeringar\n\n\n·         Praktisk erfarenhet av dbt (Data Build Tool): Models, tests, snapshots och materializations\n\n\n·         God förståelse för datamodellering: Data Vault (Hub/Link/Satellite), Star/Snowflake schema, hantering av historik (SCD Type 2)\n\n\n·         Vana att arbeta med Git\n\n\n·         Stark problemlösningsförmåga och god analytisk förmåga\n\n\n·         Mycket goda kunskaper i Python\n\n\n·         Erfarenhet av release- och versionshantering i databasmiljö\n\n\n·         Kunskap om verktyg för kodkvalitet (SQLFluff, Ruff)\n\n\n·         Flytande svenska och engelska i tal och skrift krävs. Vårt arbete sker tvärs över koncernen med internationella kollegor och engelska fungerar som det dagliga koncernspråket.\n\n\nMeriterande:\n\n·         Fördjupad kunskap inom AWS (S3, Glue, IAM, VPC)\n\n\n·         Avancerad dbt-användning (macros, custom tests, packages)\n\n\n·         Erfarenhet av prestandaoptimering i stora datamängder\n\n\n·         Bakgrund inom kredit-, risk- eller inkasso branschen\n\n\n·         Vana att arbeta med Cursor som verktyg\n\n\n·         Erfarenhet av xslt-stylesheets\n\n\n·         Erfarenhet av jq  \n\n\n·         Erfarenhet av Apache Airflow\n\n\n·         Erfarenhet av Amazon Redshift:\n\n\nCreditsafe gör just nu en stor satsning inom AI för att både effektivisera vårt arbete och höja datakvaliteten. Därför är det meriterande om du har erfarenhet av eller intresse för AI inom databashantering och dataanalys.\nVi erbjuder dig\nCreditsafe är ett globalt kreditupplysningsföretag som ger dig en tydlig bild över det ekonomiska läget och vilken risk ditt företag ställs inför. Vi samlar information från en mängd officiella källor, däribland skandinaviska myndigheter.\nCreditsafe är så mycket mer än bara en vanlig arbetsplats. Vi kan skryta om träning på arbetstid, kortare arbetsdagar under sommaren, fina kontorslokaler i Gårda, flexibilitet och spännande konferensresor. Men det vi är allra mest stolta över hos oss på Creditsafe är vår personal! Vi är otroligt stolta över energin och gemenskapen som finns bland våra kollegor - det är något att skryta om! \nÖvrig information:\n\n·         Tillsvidareanställning som föregås av sex månaders provanställning\n\n\n·         Arbetet är på heltid\n\n\n·         Hybrid arbetsplats\n\n\n·         Fast månadslön\n\n\n·         Start enligt överenskommelse\n\n\n \nEftersom intervjuer sker löpande hoppas vi att du skickar in din ansökan så snart som möjligt!",
        "url": "https://jobb.creditsafe.se/jobs/6944932-data-engineer-aws-data-warehousing-analytics?promotion=1759757-arbetsformedlingen",
        "published": "2025-12-18T13:40:54",
        "deadline": "2026-06-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30609327",
        "title": "Product Manager",
        "employer": "Zeekr Technology Europe AB",
        "location": "Göteborg",
        "description": "We are Zeekr Technology Europe. Powered by engineers and creative minds from all over the world. Located in Gothenburg, Sweden, one of the leading mobility innovation grounds worldwide. Established in 2013 as CEVT and began with the mission to create a revolutionary modular vehicle architecture, CMA. As of 2024, CEVT is now Zeekr Technology Europe, signaling our belonging within Zeekr. Delivering intelligent, sustainable, and user centric technology and software for tomorrow's\nAre you passionate about turning insights, innovation, and cross‑functional collaboration into products that move the world forward? Join us as a Product Manager and help define the next generation of intelligent, customer‑centric vehicles.\nAs part of our global product organization, you’ll collaborate with teams, uniting diverse perspectives into one coherent product direction. Your work will transform market signals, user needs, technical feasibility, and regulatory requirements into a compelling product definition that guides each program from concept to launch.\nYou will play a central role in aligning domains such as Smart Cockpit, ADAS, EE, AI, and Vehicle Architecture, ensuring every product is strategically positioned, technically robust, and future‑ready.\nWhat You'll Do\n\nLead and orchestrate cross-functional activities across MSS, R&D, Strategy, and Design to deliver a unified Product Definition Report for each program.\n\n\nIntegrate inputs from market insights, user research, regulatory requirements, and technical feasibility to shape the overall product concept and positioning.\n\n\nEnsure alignment across domains—Smart Cockpit, ADAS, EE, AI, and Vehicle Architecture—to secure coherent product direction and product readiness.\n\n\nConduct structured analysis and data-driven evaluation of customer needs, segment trends, and competitor strategies to guide product decisions.\n\n\nSupport portfolio and lifecycle strategy through coordination of feature definition, content selection, and profitability assessment.\n\n\nPrepare and present clear proposals and documentation to management and project steering teams for milestone approvals and business reviews.\n\n\nCore Activities and Deliverables\n\nInterface with program teams and MSS to secure requirement alignment and milestone readiness.\n\n\nCoordinate contributions across Market, Customer, and Product Evaluation streams.\n\n\nManage the governance structure, templates, and quality standards for all PDR deliverables.\n\n\nFacilitate cross‑functional reviews and consolidate feedback for efficient decision‑making.\n\n\nProvide consistent and outcome‑oriented reporting to PMC and HQ.\n\n\nKey deliverables: Product definition reports, governance decks & decision logs, roadmaps & milestone trackers, final product definition report\n\n\nWho You are\n\nExperienced Product Manager or Product Definition Lead within the automotive industry, ideally with exposure to European and global markets.\n\n\nSkilled at coordinating multi‑domain teams and translating diverse technical, business, and market signals into a unified product narrative.\n\n\nStrong understanding of product planning principles: market analysis, benchmarking, competitive assessment, and content‑to‑cost structuring.\n\n\nProficient with analytical tools such as Excel, BI platforms, and quantitative modeling to support data‑driven recommendations.\n\n\nExcellent communicator able to synthesize complex topics and influence senior stakeholders across multiple regions.\n\n\nBachelor’s or Master’s degree in Engineering, Business, or similar field.\n\n\n\nDo you want to join us on our journey? Welcome, to contact us for more information:\nSofie Martinsson, Recruiter, sofie.martinsson@zeekrtech.eu for questions regarding the recruitment process.\nLast Application date: 2026-03-05\nApply today, we will perform ongoing selection during the application period. We look forward to hearing from you.\nTo ensure a fair and objective recruitment process, we have chosen not to request a personal letter, though you are welcome to include one if you wish. Instead, we rely on selection questions and assessment tests, allowing us to focus on your experience and competence for a more efficient and unbiased recruitment process.\nA background check will also be conducted on the final candidate, including verification of personal details, employment history, financial standing, and any criminal records.\nTo find out more about Zeekr Tech EU, visit our website. Read more about our recruitment process here.\nPlease note that due to GDPR, we can only accept applications sent through the recruitment system, not via email or other channels.",
        "url": "https://career.zeekrtech.eu/jobs/7067653-product-manager/applications/new?promotion=1841321-arbetsformedlingen",
        "published": "2026-02-13T12:55:43",
        "deadline": "2026-03-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30563301",
        "title": "Project Manager",
        "employer": "Synteda AB",
        "location": "Göteborg",
        "description": "Are you passionate about innovation, emerging trends, and technology?\nAbout us\nSynteda AB specializes in helping companies effectively embrace the era of artificial intelligence and computer vision. By delivering innovative solutions, we empower businesses to take full advantage of the vast possibilities presented by these cutting-edge technologies. We firmly believe in the potential of AI and computer vision to benefit society, and we’re committed to leveraging our expertise to facilitate businesses in their journey towards this exciting new era. Our close collaboration with top universities in Sweden enables us to work with clients across a broad range of industry fields.\nWe’re actively engaged in developing several unique products and solutions, using a work process that we call “dream-innovate-create.” This approach involves subjecting our ideas to rigorous scrutiny and feasibility testing, using agile methodologies to refine our solutions until we’ve achieved a full-scale product.\nWe’re proud to have a core team of highly qualified experts who excel at providing assessment services to identify business challenges and develop customized algorithms to overcome them. We’re guided by our commitment to ethical awareness, curiosity, transparency, respect, participation and science.\nAs we continue to grow, we’re actively seeking innovation managers to join our team of experts. If you’re passionate about advanced technologies and want to be part of an exciting and dynamic organization, we encourage you to apply today.\nWhat are we looking for?\nWe’re looking for an IT Project Manager with a passion for emerging trends and technology, combined with a solid technical background. The ideal candidate will have exceptional communication skills, relevant certifications and a dedication for leadership.\nResponsibilities\nPlan, execute, and oversee IT projects from start to finish.\nCollaborate with cross-functional teams to ensure seamless project delivery.\nManage budgets, timelines, and risks effectively.\nCommunicate project progress to stakeholders and leadership.\nEnsure IT solutions align with business goals and best practices.\n\nRequired skills\nPassion for emerging trends, technologies and digital transformation.\nSolid knowledge of lean processes and agile methodologies.\nStrong leadership, relationship-building, and team management skills.\nExperience with testing and requirement management.\nExceptional communication and presentation skills, with the ability to effectively convey complex ideas to diverse audiences.\nFluency in English and Swedish, both spoken and written, is required.\n\nCertification in one or more of the following is a plus:\nSAFe, Product Manager/Product Owner, PMPO.\nProfessional Scrum Master Certification.\nProfessional Agile Certification.\nDigital Transformation.\nScrum, Lean, or Kanban.\nPMI, PMP Project Management.",
        "url": "https://synteda.com/jobs/innovation-manager/",
        "published": "2026-02-04T11:00:35",
        "deadline": "2026-03-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30555529",
        "title": "Doctoral student in physics-guided foundation model for time-series data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Join us to develop physics-guided, data-driven foundation models for multivariate time-series in safety-critical systems, with a primary focus on automotive applications. You will design predictive and generative models, scale training on real data, and validate in simulation and with industry partners to advance safe, reliable automation.\n\nAbout us \nThe Department of Computer Science and Engineering, a joint department of Chalmers and the University of Gothenburg. Our internationally visible research, strong industry links and diverse environment create a collaborative setting where ideas grow into real impact. \n\nAt the Division of Computing Science, we advance secure and trustworthy software and systems, spanning foundations, programming languages, tools and practical methods that help shape dependable digital infrastructures. \n\nThis project is a collaboration between AIXLab@Chalmers and Volvo Group. You will join us at AIXLab, where we focus on developing usable AI solutions that are applicable in real-world settings. You will work closely with engineers and researchers at Volvo Group, with direct access to industrial datasets, simulation environments, and real validation workflows.\n\nAbout the research project  \nThis project advances physics-aware foundation models for time-series data. Here, foundation models refer to reusable, pretrained time-series models that can be adapted across vehicles, driving conditions, and tasks. The primary use case is automotive: predicting vehicle behavior, simulating rare safety-critical scenarios and generating test cases to strengthen validation and reduce physical trials. The techniques are designed to transfer to other safety-critical domains such as healthcare. \n\nConcretely, the research will focus on multivariate vehicle time series such as CAN signals, sensor streams, and simulated state trajectories, with models that integrate physical structure (e.g. dynamics, constraints, conservation laws) into large neural architectures. Physics guidance may include explicit system constraints, inductive biases in model architectures, hybrid simulation learning loops, or loss formulations that encode physical consistency. The work combines forecasting, representation learning, and scenario generation under safety and reliability constraints. The results will support safer automation, fewer failure modes, more efficient testing, and lower energy use.\n\nWho we are looking for\nWe are particularly interested in candidates who enjoy working at the intersection of theory, data, and real-world systems, and who are comfortable with imperfect, noisy, and safety-constrained data.\n\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have a Master's degree (masterexamen) of 120 credits or a Master’s degree (magisterexamen) of 60 credits* in Computer Science, Electrical engineering, or equivalent\n• Strong written and verbal communication skills in English\n• Strong machine learning fundamentals (probability, statistics, optimization) and strong interest in time-series modeling and physics-guided machine learning\n• Proficiency in Python and modern deep learning frameworks (e.g., PyTorch)\n• Strong engineering maturity, including experience with large-scale GPU or cluster-based training, reproducible experiment pipelines, versioned datasets, and systematic evaluation\n• Ability to formulate research questions, run empirical studies at scale\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Physics-informed machine learning\n• Background in foundation models for time-series (forecasting, representation learning)\n• Exposure to safety-critical systems, scenario generation, or test coverage for edge cases\n• Academic research and publications\n\nWhat you will do\n\n• Take advanced courses within the Graduate school of Computer Science and Engineering\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing\n• By the end of the PhD, the candidate is expected to have developed reusable modeling frameworks for safety-critical time-series data. The work should result in publications in top-tier machine learning or applied AI venues and contributions that influence industrial validation pipelines\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start\n• The position is limited to four years, with the possibility to teach up to 20%, which extends the position to five years\n• A starting salary of 34,550 SEK per month (valid from May 25, 2025)\n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn\n\nWhat we offer \nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about working at Chalmers, benefits  for employees, Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg and doctoral studies at Chalmers here.  \n\nApplication procedure\nThe application should be written in English and attached as PDF-files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself\n• A brief motivation as to why you are interested in this position\n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than March 3rd 2026\n\nFor questions, please contact:  \nYinan Yu (about the research project)\nyinan@chalmers.se\n\nCarl-Johan Seger (about the application process)\nsecarl@chalmers.se\n\nWe look forward to your application! \nChalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position.",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14579&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2026-02-03T09:17:35",
        "deadline": "2026-03-03T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30550460",
        "title": "Product Cybersecurity Engineer",
        "employer": "Coretura AB",
        "location": "Göteborg",
        "description": "Join the Revolution in Commercial Vehicle Tech at Coretura!\nWe’re redefining how automotive software is built. As a joint venture between Volvo Group and Daimler Truck, Coretura blends startup speed with industry strength—and we’re all-in on AI.\nAs a Product Cybersecurity Engineer, you’ll play a critical role in securing next-generation commercial vehicle platforms. You’ll work across embedded systems, automotive hardware, and software layers to ensure robust protection against evolving threats. From cryptography and secure boot to system-level security, your expertise will help us deliver safe, reliable, and future-ready solutions. \n What you’ll do\nYou’ll be at the forefront of implementing security measures across the product lifecycle. Your work will span multiple domains, ensuring compliance with industry standards and enabling secure innovation.\nYou will:\n\nDefine and implement embedded security solutions for automotive systems \n\n\nEstablish Secure Boot and Root of Trust mechanisms \n\n\nIntegrate HSM/TPM and cryptographic accelerators for secure key storage\n\n\nApply best practices for physical tamper detection and secure diagnostics \n\n\nEnsure OTA update security and manage secure debug interfaces (e.g., JTAG lock/authentication)\n\n\nSupport system-level security controls for hypervisors and OS in embedded environments \n\n\nCollaborate across teams to embed security in ECU/BSP-level engineering workflows\n\n\n What you bring\nWe’re looking for someone who thrives in hands-on engineering, enjoys collaboration, and is passionate about cybersecurity.\nYou have:\n\nAt least 4 years of experience in embedded security or related fields\n\n\nBachelor’s degree in a relevant engineering discipline (Master’s degree preferred)\n\n\nStrong programming skills in C/C++ with secure coding best practices\n\n\nPractical experience with symmetric/asymmetric cryptography, digital signatures, hashing, and encryption\n\n\nKnowledge of automotive communication protocols (CAN, LIN, Ethernet) and secure stacks like Autosar SecOC, TLS, IPsec, MACsec\n\n\nExperience with threat modeling, TARA, and integrating security throughout the product lifecycle\n\n\nIt’s a plus if you also bring:\n\nExposure to cloud integration and modern security monitoring tools\n\n\nFamiliarity with ISO-26262 functional safety standards\n\n\nUnderstanding of incident response and vulnerability management\n\n\nExperience with QNX, Linux, or Android-based platforms\n\n\n \nWhy Coretura? \nAt Coretura, you’ll be empowered to make a real impact. We value initiative, ownership, and a proactive mindset. You’ll have the freedom to drive projects forward, contribute ideas, and help shape the future of commercial vehicle technology. Our lean, innovative team is always learning and adapting—your contributions will truly matter. \n Next steps \nReady to build the future of commercial vehicles?  We review applications on a continuous basis—so don’t wait to submit yours! \n Questions? \nDon’t hesitate to reach out to frida.greve@coretura.com if you have any questions.\nPlease note we do not accept any applications via email.",
        "url": "https://career.coretura.com/jobs/6879950-product-cybersecurity-engineer/applications/new?promotion=1818598-arbetsformedlingen",
        "published": "2026-02-02T11:27:54",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30511893",
        "title": "Automation Engineer to Rebl Industries",
        "employer": "Mpya Sci & Tech AB",
        "location": "Göteborg",
        "description": "Rebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries\r\n\r\nAre you an automation engineer who loves robotics, thrives in hands-on problem solving and wants to help scale the next generation of AI-powered automation? \n\nJoin the team that’s redefining industrial automation\nRebl Industries builds robotic workmates that companies subscribe to instead of buying. Our robots deploy in weeks, learn continuously and take over repetitive, heavy and precision-demanding tasks. With a unique Robot-as-a-Service model, we make automation flexible, scalable and accessible for businesses that want results without the traditional complexity and investment costs of automation projects. We’re a fast-growing, ambitious scale-up working at the intersection of robotics, AI, software and real-world production. Read more about us at www.rebl.industries\n\nWhat you will do\nAs an Automation Engineer at Rebl, you turn cutting-edge technology into reliable automation. You’ll build and integrate control systems, tune robot performance, test and validate installations, as well as ensure our solutions run smoothly in demanding operational environments. You’ll collaborate closely with mechanical, electrical and software engineers – from early concepts to deployment and continuous improvement as systems scale across customer sites.\n\nWhat we’re looking for\n\n• Post-secondary education in Automation, Mechatronics, Robotics, or a related engineering field (university degree or vocational/technical school)\n• Minimum 5+ years of professional experience in automation, mechatronics or similar engineering roles\n• Proven experience designing, implementing and commissioning automation systems in real-world environments\n• Strong PLC programming skills (Siemens TIA Portal preferred) and hands-on control system knowledge\n• Experience integrating sensors, actuators and mechatronic components into cohesive systems\n• Proficiency in Python for automation, data communication, or system integration\n• Familiarity with CAD and simulation tools to support mechanical and system design\n• Ability to troubleshoot complex systems, optimize performance, and ensure reliable operation in production\n• A proactive problem-solving mentality with the ability to work independently and drive projects forward\n\nYour mindset\nYou’re pragmatic, curious and energized by solving real-world automation challenges. You move fluidly between design, implementation and hands-on testing. You take ownership, communicate clearly and enjoy collaborating across disciplines. You thrive in a scaling environment where speed matters, structure evolves and every engineer has real influence. Most importantly, you want to build things that work – in production, at scale, with measurable impact.\n\nWhy Rebl Industries\nAt Rebl Industries, you join a sharp, driven and supportive team where your work has immediate effect. You help define the future of robotic automation — not in theory, but in real industrial use. Your ideas shape both the product and the company as we scale to new markets and new levels of performance.\n\nApply now!\nIn this recruitment process Rebl Industries collaborates with Mpya Sci & Tech. For questions about the position, you are welcome to contact Talent Advisor Marcus Hultberg at +46 723 66 49 43 or marcus.hultberg@mpyascitech.com. We work with ongoing selection so don´t hesitate to apply via www.mpyascitech.com as the position may be filled before last day of application.",
        "url": "https://mpyascitech.com/jobba-hos-oss?jobid=307549&ref=platsbanken",
        "published": "2026-01-23T12:03:45",
        "deadline": "2026-02-28T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30361762",
        "title": "Senior Data Architect",
        "employer": "Click to Hire AB",
        "location": "Göteborg",
        "description": "Description:\n\n\nWe are looking for a senior data architect who will work in a BI & Analytics area called Parts Sales within Volvo Trucks.\n\n\nThis person should be able to understand business stakeholders and translate their needs into technical solutions.\n\n\nCandidate must have\n\n\n• Demonstrated experience as a Data Architect handling architectural responsibilities on large-scale implementations.\n• Deep expertise in Azure Data Services, Databricks, and related cloud technologies & tool ecosystem.\n• Advanced proficiency in data modeling techniques, including relational, dimensional, NoSQL & GraphDB models.\n• Strong knowledge of API design, event-driven architectures, and streaming platforms (e.g., Kafka).\n• Familiarity with AI/ML integration, enabling seamless incorporation of AI models into enterprise workflows.\n• Hands-on experience with CI/CD pipelines, Azure DevOps, and infrastructure automation.\n• Skilled in SQL, Python, and PySpark for data engineering and architectural validation.\n• Solid understanding of data governance frameworks, GDPR compliance, and cloud security best practices.\n• Excellent stakeholder management and communication skills.\n• Ability to produce wireframes, architectural diagrams, and comprehensive documentation for governance and review processes.",
        "url": "https://www.clicktohire.se/",
        "published": "2025-12-10T21:46:10",
        "deadline": "2026-05-24T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357030",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for a Function Developer to work within Vehicle Dynamics towards our clients in Gothenburg. As a Function Developer you will be involved in all phases of development and maintenance of our interesting, and highly complex end user functions connected to suspension control. You will be a part of a team that innovate new features, implement them and verify them on unit level and complete vehicle level.\nIn this role you will play a key role in:\n•  Requirement specification & logic design breakdown\n•  Implementation of new features & software updates (C-code and Matlab/Simulink)\n•  At the truck; tuning of functionality, troubleshooting and hands on testing of features and functionality\n•  You will also be a part advanced engineering projects where we test new technology concepts within our area\n•  Supporting functional safety work\nYour profile\n•  M.Sc. degree in Mechatronics, Control engineering, Computer Science, Electronics or similar\n•  Minimum 3+ years' work experience\n•  Good knowledge in Mechatronics, Mechanical engineering, Control engineering\n•  Familiar with tools such as CANalyzer, Simulink, Matlab as well as rapid prototyping and systems development principles\n•  Tools used, GIT, Vector DaVinci, CANoe & CANalyzer, SystemWeaver(SE-TOOL) Knowledge in Volvo Tools, architecture, ISO26262 and C-driving license are beneficial\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7472-en_US+sap_btp/",
        "published": "2025-12-09T21:47:00",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30357033",
        "title": "Product, System & PLM Engineer",
        "employer": "Capgemini Engineering Sverige AB",
        "location": "Göteborg",
        "description": "The world leader in engineering services, we bring together a global team of engineers, scientists, and architects to help the world’s most innovative companies unleash their potential. From autonomous cars to life-saving robots, our digital and software technology experts think outside the box as they provide unique R&D and engineering services across all industries. Join us for a career full of opportunities. Where you can make a difference. Where no two days are the same.\nYour role\nWe are looking for an engineer for complex and advanced system design. You will use your expertise and technical knowledges to help our clients to develop, systemize, integrate, verify, and launch new systems. In this position you will collaborate with many different stakeholders and teams.\nIn this role you will play a key role in:\n•  An agile team with vast competence in function design, systemization, function realization and integration, requirements management and decomposition as well as function Verification and Validation (V&V) in both virtual physical test environments.\n•  The collaboration with colleagues from different teams, who all share the same passion for their work.\nYour profile\n•  Relevant educational background\n•  Minimum 4+ years of work experience in relevant domain\n•  The ability to understand and apply architectural principles to SW system design\n•  Understands and applies UML to represent the SW system design\n•  Safety thinking and experience in applying safety requirements during the SW system design process\n•  Experience in SE-Tool or System Weaver\n•  Awareness about the SW development processes\n•  Awareness about the ISO26262 functional safety processes\n•  Awareness about the R155 cyber security processes\n•  Swedish driving license or soon to get\nMeritorious skills:\n•  Software integration\n•  Function integration and testing in HIL and SIL environments\n•  Work experience from Autonomous functions\nWhat we believe you will enjoy about working here \n•  We recognize the significance of flexible work arrangements to provide support. Be it remote work, or flexible work hours, you will get an environment to maintain healthy work life balance. \n•  At the heart of our mission is your career growth. Our array of career growth programs and diverse professions are crafted to support you in exploring a world of opportunities. \n•  We support your personal development and offer an education library with more than 250 000 (!) courses and educations and certifications.\nAbout Capgemini \nCapgemini is a global business and technology transformation partner, helping organizations to accelerate their dual transition to a digital and sustainable world, while creating tangible impact for enterprises and society. It is a responsible and diverse group of 340,000 team members in more than 50 countries. With its strong over 55-year heritage, Capgemini is trusted by its clients to unlock the value of technology to address the entire breadth of their business needs. It delivers end-to-end services and solutions leveraging strengths from strategy and design to engineering, all fueled by its market leading capabilities in AI, generative AI, cloud and data, combined with its deep industry expertise and partner ecosystem. The Group reported 2024 global revenues of €22.1 billion. \nGet The Future You Want | www.capgemini.com",
        "url": "https://www.capgemini.com/se-en/jobs/7035-en_US+sap_btp/",
        "published": "2025-12-09T21:46:15",
        "deadline": "2026-04-30T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30611967",
        "title": "Chef Systemutvärdering och cybersäkerhet",
        "employer": "RISE Research Institutes of Sweden AB",
        "location": "Borås",
        "description": "Drivs du av att leda utvecklingen inom områden som AI, cybersäkerhet och avancerad systemutveckling? Vill du spela en central roll i att stärka svensk industris konkurrenskraft och bidra till lösningar som formar ett tryggare och mer resilient samhälle? Då erbjuder vi en möjlighet där du får kombinera strategiskt ledarskap med forskning, innovation och affärsutveckling – i en miljö som strävar efter att ligga steget före.\nOm oss\nVi söker nu en chef till enheten Systemutvärdering och cybersäkerhet som är en del av avdelningen System- och produktsäkerhet. Enheten befinner sig i en spännande utvecklingsfas för att ännu bättre möta den stora efterfrågan inom området. Enheten erbjuder viktiga tjänster för både nya och befintliga tekniska lösningar och säkerställer att de är säkra, robusta och uppfyller gällande lagkrav vilket är avgörande för industrin, samhället och svensk konkurrenskraft.\nVi säkerställer att framtidens teknik är trygg och robust genom certifiering, validering av system, maskiner, produkter och infrastruktur. Med specialistkompetens inom funktionssäkerhet, AI och cybersäkerhet erbjuder vi även rådgivning och utbildning som gör komplexa regelverk begripliga och användbara.\nMed djup specialistkompetens inom funktionssäkerhet för inbyggda system och maskiner, cybersäkerhet samt avancerad test- och utvärderingsverksamhet arbetar vi med att kvalitetssäkra allt från mätinstrument och datainsamlingssystem till taxametrar, larmsystem, betalsystem och redovisningscentraler för taxi.\nAvdelningen System- och produktsäkerhet inom division Säkerhet och transport bedriver verksamhet inom forskning, utbildning provning och certifiering som stödjer utvecklingen av säkra system och produkter. Vi arbetar bland annat med elsäkerhet, miljötålighet, funktionssäkerhet, cybersäkerhet, AI, maskinsäkerhet, robusta och resilienta energisystem samt totalförsvar.\nSom chef för Systemutvärdering och cybersäkerhet blir du en del av en expansiv och dynamisk avdelning med stor utvecklingspotential, där samarbete står i centrum. Vi är ett engagerat team med högt i tak, och du kommer att få möjlighet att växa, lära och bidra till samhällsviktig innovation varje dag.\nOm rollen\nSom Enhetschef leder och utvecklar du enheten Systemutvärdering och cybersäkerhet och har personalansvar för ca 13 medarbetare. Du arbetar nära våra kunder och partners och bidrar aktivt till att vidareutveckla våra erbjudanden. I samverkan med kollegor inom RISE har du ett tydligt ansvar för att stärka vår affär, innovationsförmåga och utveckling. Vidare leder du enheten med ett kommunikativt och förtroendeingivande ledarskap, där du coachar medarbetarna och är en viktig ambassadör för RISE:s kultur och värderingar.\nSom medlem i avdelningens ledningsgrupp är du med och driver det strategiska arbetet inom System- och produktsäkerhet i linje med RISE:s vision. Du har en central roll i att forma enhetens riktning och bidra till hela avdelningens utveckling och innovationskraft. Du rapporterar till Avdelningschefen för System- och produktsäkerhet.\nBefattningen är placerad i säkerhetsklass, vilket innebär att du behöver genomgå en säkerhetsprövning, i enlighet med kraven i Säkerhetsskyddslagen. Godkänd säkerhetsprövning är ett krav för anställningen.\nPlaceringsort är Göteborg eller Borås, och vi arbetar idag utifrån ett hybridupplägg. Resor förekommer i tjänsten. Eftersom våra medarbetare finns på RISE:s siter i både Göteborg och Borås är fysisk närvaro i labb och på kontor en viktig del av arbetet.\nVem är du?\nDu är en affärsmässig och förtroendeingivande ledare som med trygghet och engagemang coachar dina medarbetare mot gemensamma mål. Genom ett kommunikativt och lyhört ledarskap skapar du en arbetsmiljö präglad av tillit, samverkan och utveckling. Du har god samarbetsförmåga och förstår att de bästa resultaten uppnås när vi arbetar tillsammans.\nTillsammans med dina medarbetare formulerar du tydliga och konkreta mål, samtidigt som du på ett kommunikativt och förtroendeingivande sätt förmedlar RISE:s vision och roll som innovationspartner, både internt och externt. Du arbetar nära våra kunder och bidrar aktivt till att vidareutveckla våra erbjudanden, med målet att leverera goda resultat, såväl kvalitativa som kvantitativa.\nVidare har du förmågan att bygga engagerade och produktiva team genom att utveckla och möjliggöra för dina medarbetare att nå sin fulla potential. Genom att skapa förutsättningar för samverkan, delegera ansvar och främja en kultur där feedback är en naturlig del av vardagen, stärker du både individens och gruppens utveckling. Du arbetar aktivt med att effektivisera processer och fokuserar på det som skapar verkligt värde och lönsamhet. Med god förmåga att prioritera och skapa balans i det dagliga arbetet, bidrar du till en hållbar och framgångsrik arbetsmiljö.\nKrav\n• En för området relevant akademisk examen på magister/masternivå eller mer avancerad nivå\n• Dokumenterad erfarenhet av ledande roller med personal-, budget och resultatansvar, samt vana att leda och coacha medarbetare till goda resultat\n• Erfarenhet av ledande roller med fokus på innovation, forskning och kommersiell verksamhet.\n• Erfarenhet av att strategiskt leda inom något/några av avdelningens viktiga områden så som utveckling av certifiering, provning och verifiering, AI och Cybersäkerhet\n• Domänkunskap inom ett eller flera av följande områden: cybersäkerhet, funktionssäkerhet och AI.\n• God förmåga att analysera omvärlden, identifiera framtida behov och utmaningar, och omsätta insikterna till proaktiva åtgärder.\n• Öppenhet för nya teknologier och agila arbetssätt\n• Förmåga att främja tvärfunktionellt samarbete och erfarenheter från arbete med organisationer i förändringar\n• Dokumenterad förmåga att driva affärsutveckling som leder till god lönsamhet\n• Ett för området starkt nätverk inom näringsliv, offentlig sektor samt universitet och högskolor\n• B-körkort\n• Flytande svenska och engelska i tal och skrift\nMeriterande\n• Erfarenhet av att leda forsknings- och/eller utvecklingsprojekt.\n• Erfarenhet av säkerhetskänslig verksamhet\n• God kunskap om maskinförordningen\nVälkommen med din ansökan!\nLåter detta spännande och du vill veta mer är du välkommen att kontakta Avdelningschef Elenor Bernelow Loyd, +46 10 516 50 16. Sista ansökningsdag är 8 mars, 2026. Urval och intervjuer sker löpande under och efter ansökningsperioden.\nFackliga representanter är Linda Ikatti, Unionen, 010-516 51 61 och Ingemar Pettermann, SACO, 010-228 41 22.",
        "url": "https://career.ri.se/jobs/7229239-enhetschef-systemutvardering-och-cybersakerhet/35abfde1-1020-44ab-a8e9-e91414be66dd",
        "published": "2026-02-13T16:14:50",
        "deadline": "2026-03-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 90
    },
    {
        "id": "30574430",
        "title": "Doctoral student in satellite observations: deriving climate data",
        "employer": "Chalmers Tekniska Högskola AB",
        "location": "Göteborg",
        "description": "Helps us to derive novel climate data by combining two of Europe's new satellite sensors. If you have interests in physics, climate and machine learning, this is the Doctoral student position for you!\n\nAbout us \nOur team is part of the Division of Geoscience and Remote Sensing. The division's overall aim is to develop advanced methods and instruments to observe and understand the Earth system. Combining satellite, airborne and ground-based measurements with modelling and machine learning, we collaborate globally to monitor environmental change and support a sustainable future. The division is found within the Department of Space, Earth and Environment.\nAbout the research project  \nThe satellite carrying the ground-breaking MicroWave Imager (MWI) and Ice Cloud Imager (ICI) will be launched this summer. Our team plays a leading role in preparing for ICI, and we will derive much-needed climate data on ice clouds from it. This project is about extending the data extraction to use measurements from MWI and ICI jointly as input and, in this way, derive geophysical data on all forms of water in the atmosphere (gas, liquid, and ice). These data will allow unprecedented studies of the atmospheric water cycle.\n\nThe data extraction will be based on existing machine learning development made by the team, in particular the use of quantile regression neural networks. There exists no other measurements that can be used as \"ground-truth\", and to obtain training data the MWI and ICI observations must be simulated. Accordingly, the foundation of the project is to perform detailed physical simulations that involving atmospheric science, radiative transfer, and the sensor's characteristics. To make full use of the possibilities offered by machine learning, we are pushed to perform better and more large-scale physical simulations than done before.\n\nThe work will form the basis for official data products (distributed by EUMETSAT) and for research products produced and disseminated by the team itself. Possible additional tasks include to improve our main simulation tool (Atmospheric Radiative Transfer Simulator, https://www.radiativetransfer.org/), to apply the derived geophysical data for verifying climate models and to apply the development on the Arctic Weather Satellite and Sterna missions.\n\nWho we are looking for\nThe following requirements are mandatory:\n\n• To qualify as a Doctoral student, you must have (when starting the position) a Master's degree (*masterexamen*) of 120 credits or a Master’s degree (*magisterexamen*) of 60 credits*. A range of educational backgrounds are possible, but strong skills and interest in physics and computing must be proven. \n• You must be able to start at the latest Aug 1.\n• Strong written and verbal communication skills in English.\n• Being meticulous, have logical thinking and good problem-solving skills.\n\n*for students with an education earned outside of Sweden, a 4-year Bachelor’s degree is accepted. \n\nThe following experience will strengthen your application: \n\n• Knowledge in atmospheric science, radiative transfer and remote sensing.\n• Proficiency in Python and deep learning frameworks (e.g., PyTorch).  \n\nWhat you will do\n\n• Take courses at an advanced level within our Graduate school.\n• Develop your own scientific concepts and communicate the results of your research verbally and in writing.\n• The position generally also includes teaching on Chalmers' undergraduate level or performing other duties corresponding to 20 percent of working hour\n\nThe research team is lead by Prof. Patrick Eriksson. For an overview of the research articles produced by the team, see https://orcid.org/0000-0002-8475-0479\nAn introduction to the datasets offered, so far, is found here: https://clouds-and-precip.group\n\nContract terms  \n\n• The Doctoral student positions are fully funded from start. \n• The position is a fixed-term appointment of four years, with the possibility to teach up to 20%, which extends the position up to five years. \n• A starting salary of 34,550 SEK per month (valid from May 25, 2025). \n• Doctoral studies require physical presence throughout the entire study period. A valid residence permit must be presented by the study start date; otherwise the admission may be withdrawn. \n\nWhat we offer \n\n• As a Doctoral student at Chalmers, you are an employee and enjoy all employee benefits. Read more about  working at Chalmers  and our benefits for employees. \n• A dynamic and inspiring working environment in the coastal city of Gothenburg. \n• Read more about Sweden’s generous parental leave, subsidized day care, free schools, healthcare etc at Move To Gothenburg. \n\nChalmers is dedicated to improving gender balance and actively works with equality projects, such as the GENIE Initiative for gender equality and excellence. We celebrate diversity and consider equality and inclusion as fundamental aspects of all our activities. \n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nFind more general information about doctoral studies at Chalmers here.  \n\nApplication procedure \nThe application should be written in English and attached as PDF-files, as below. Maximum size for each file is 40 MB. Please note that the system does not support Zip files. \n\nCV \n\nPersonal letter \n\n\n• A brief introduction about yourself. \n• A brief motivation as to why you are interested in this position. \n\nBachelor’s and, if available, master’s thesis together with the transcripts. \n\nUse the button at the foot of the page to reach the application form.  \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered. Contact details to references will be requested after the interview. \n\nWe welcome your application no later than March 8   \n\nFor questions, please contact:  \nGeneral questions:\nAnqi Li, anqi.li@chalmers.se\n\nResearch-related questions:\nPatrick Eriksson, patrick.eriksson@chalmers.se\n\nWe look forward to your application! \n*** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. ***",
        "url": "https://www.chalmers.se/om-chalmers/arbeta-hos-oss/lediga-tjanster/?rmpage=apply&rmjob=14597&ref=arbetsformedlingen.se%2Fplatsbanken%2F&utm_medium=talentech_publishing&utm_source=platsbanken",
        "published": "2026-02-06T09:52:06",
        "deadline": "2026-03-08T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30558953",
        "title": "Senior Software engineer, Scientific Informatics",
        "employer": "EPAM Systems (Nordic) AB",
        "location": "Göteborg",
        "description": "EPAM is seeking a highly skilled and motivated Scientific Informatics Engineer (Bioinformatics Scientist) to join us in Sweden. In this role, you will work with our leading global pharmaceutical client as part of their international research organization, driving innovation across multiple therapeutic areas. You will design, evaluate and optimize computational methods for large-scale next-generation sequencing (NGS) analysis, contributing directly to discovery and development programs. You will build robust production-grade bioinformatics workflows for high-performance computing (HPC) clusters and cloud environments, collaborating closely with biologists, data scientists and domain experts across Oncology, Immunology, Infectious Diseases & Vaccines, Neuroscience and Pharmacokinetics.\nResponsibilities\nDevelop, benchmark, and optimize computational methods to analyze diverse NGS datasets\nBuild and maintain scalable, automated bioinformatics pipelines for HPC and cloud-based execution\nPartner with interdisciplinary scientific teams to translate research needs into reproducible analytical workflows\nEvaluate and implement new algorithms, tools, and computational strategies to enhance data processing capabilities\nProduce clear technical documentation, reports, and scientific deliverables\n\nRequirements\nPhD with 1+ year of experience in bioinformatics, or MSc with 5+ years of relevant experience\nHands-on experience in processing NGS datasets (WGS, WES, RNA-seq, ChIP-seq, ATAC-seq, single-cell, etc.)\nPractical experience with workflow/pipeline scripting languages (e.g., Nextflow)\nStrong understanding of computational methods for alignment, assembly, variant detection, enrichment, or related genomics applications\nFamiliarity with common bioinformatics file formats (FASTA, FASTQ, BAM, VCF, etc.)\nProficiency in Python, R, or C++ within a Unix/Linux environment\nExperience with high-performance computing clusters and cloud computing platforms\nAbility to independently troubleshoot using documentation, GitHub, and online resources\nProven scientific publication record\nStrong collaboration, communication, and interpersonal skills\nExcellent written and spoken English (B2 level or higher)\n\nNice to have\nExperience with containerization technologies, such as Docker or Singularity\nExperience in applying or optimizing machine learning tools within a bioinformatics context\n\nWe offer/Benefits\nEPAM Employee Stock Purchase Plan (ESPP)\nCompany’s pension plan\nPrivate healthcare insurance\nSafety & life insurance\nGym discounts\nWellness Grant (SEK 2000)\nCorporate Programs including Employee Referral Program with rewards\nLearning and development opportunities including in-house training and coaching, professional certifications, over 22,000 courses on LinkedIn Learning Solutions and much more\n*All benefits and perks are subject to certain eligibility requirements\n\n\n\nÖppen för alla\nVi fokuserar på din kompetens, inte dina övriga förutsättningar. Vi är öppna för att anpassa rollen eller arbetsplatsen efter dina behov.",
        "url": "https://careers.epam.com/en/vacancy/python-scientific-informatics-engineer-bltbh398gs8jn562v94_en",
        "published": "2026-02-03T14:23:15",
        "deadline": "2026-02-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    },
    {
        "id": "30465971",
        "title": "Data Scientist",
        "employer": "Etraveli Group AB",
        "location": "Göteborg",
        "description": "Etraveli Group is the globally leading company for tech solutions and fulfillment capabilities for online sales of flights. We are here to solve complexity, by connecting millions of flights and travelers across the globe, from search and selection to trip and beyond. We hold consumer online travel agency brands like Mytrip, GoToGate & Flight Network and serve Booking.com with flights. Etraveli Group has also established strategic partnerships with companies like Skyscanner, Google Flights, TUI, etc.\nEvery day we strive to make the world smaller for our customers and bigger for our people. Our diverse team of more than 3000 passionate professionals is what makes us the industry’s tech wonder and the best in the world at what we do. Our major offices are in Sweden (HQ), Greece, India, Canada, Poland and Uruguay.\nJoin us and start as a Data Scientist in the Data, Science & Research team!\nThe Role\nOur Data Science and Research (DSR) team creates and delivers data pipelines and machine learning based solutions towards internal stakeholders. We process billions of requests daily to enable sophisticated prediction pipelines within revenue estimation, conversion analysis and pricing automation. We develop and maintain advanced data-processing and training pipelines to improve the speed and precision of our solutions and deliver them in a highly scalable and resilient environment. You will be joining an experienced team of 14 Data Scientists, Machine Learning Engineers, Data Engineers and Operations Engineers building our products from end to end.\nWe are in search of a Data Scientist with the ability to work in an energetic and interactive environment. You must be a self-starter with a strong foundation in statistics and machine learning and as part of our team work closely with our machine learning engineers, data engineers and business stakeholders.\nMain tasks\nWork closely with stakeholders to understand business problems, define clear objectives and translate their concerns, suggestions and ideas into testable hypotheses and quantifiable metrics.\nPerforming statistical analyses and visualizations to understand the structure, patterns, anomalies and quality of data.\nClean, transform and prepare large and complex datasets for model training. You'll also identify and engineer relevant features to improve model accuracy and efficiency.\nDesign, build and train robust machine learning models using appropriate algorithms and techniques. This includes experimenting with different architectures and hyperparameters to optimize performance for specific business needs.\nWork with Machine Learning, Data and Operations Engineers to deploy the final model into production. This includes performing AB tests to measure and evaluate the models performance on real world data.\nExplain model results and statistical findings clearly to both technical and non-technical stakeholders deriving actionable insights.\n\n\n\nLearning Curve\nIn this role you will be using the best selection of tools and processes in the Data Science domain. You will be working within our ML platform providing automation and standardisation for analytical and exploratory work but also productionising and providing inference to business users and systems. Further, the role will enable you to learn even more about creating, developing and implementing standards for ML modelling and deepen your knowledge about ML concepts and frameworks. \nRequirements\nUniversity degree in a STEM discipline\n2 years of professional or other comparable exceptional experience like a PhD in a related field\nStrong analytical and quantitative skills\nProficiency in python including numerical and visualisation libraries like pandas or polars and matplotlib\nExperience in data analytics, exploration and modelling using jupyter or marimo\nExpertise in writing complex and optimised SQL queries for data extraction and manipulation\nFamiliarity with version control (git) and the ability to navigate and work in larger code bases\nUnderstanding and experience in working with ML modelling and tuning frameworks like sklearn, lightgbm, pytorch\nFamiliarity with LLM based solutions like RAG systems including orchestration and evaluation tooling like langchain or langfuse\nExposure to implementing orchestrated training pipelines using model management using airflow and mflow\nExposure to prediction service technologies, development practices like CI/CD and model monitoring and alerting practices will be a meritorious\n\n\n\nBenefits\nAt the Etraveli Group Gothenburg office, you will be part of +200 people, all with different cutting-edge skills and personalities. We believe that it is precisely the differences that make us a good team because we share the same ambition - we strive for the same goals, are passionate about what we do and work hard. With us you can enjoy:\nOur brand new office is located in Merkurhuset in Gothenburg, a stone's throw from public transport and lunch restaurants.\n\n\nWe have a hybrid working model so once you are onboarded you have the flexibility to work from home two days a week.\n\n\nWe love gaming and after work activities.\n\n\nWe know the value of personal development and continuous training.\n\n\nHackathons and Dev Weeks - We believe in promoting creativity and trying new things.\n\n\nHealthcare allowance – Each employee receives a maximum allowable amount each year according to the Swedish Tax Agency to spend on health-promoting activities such as a gym card, massage etc.\n\n\nPension and health insurance – Through partners we offer a comprehensive pension and health insurance so that you can get help quickly in case of an accident.\n\n\nDaily breakfast – To kick the day off just right, breakfast is available at the office every morning.\n\n\n\nAs part of this recruitment process, we will be conducting background checks. You will be able to read more information and give your consent to this process in the application form.\nDiversity disclaimer\nAt Etraveli Group we value diversity; we pride ourselves on being a company represented by people of all different backgrounds. During hiring, we are committed to ensure equality and promote diversity in the workplace at every selection stage. As such, we provide the same opportunities for all candidates regardless of race, religion or belief, gender, nationality, ethnicity, sexual orientation, age, marital status, disability, or any other characteristic protected under any anti-discrimination law or regulation.",
        "url": "https://etraveligroup.teamtailor.com/jobs/6894374-data-scientist",
        "published": "2026-01-13T15:42:25",
        "deadline": "2026-03-12T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "IT",
        "relevance_score": 100
    }
]