[
    {
        "id": "29806007",
        "title": "Digitalization Driver",
        "employer": "Volvo Business Services AB",
        "location": "Göteborg",
        "description": "Who are you?\nOur digitalization journey transforms the way we develop the competence of our co-workers, how we work internally and how we interface with our dealers across Europe and customers worldwide. The aim of your role is to boost and accelerate this digitalization journey.    \n \nKey responsibilities include: \nBuild, govern and execute the digitalization roadmap, in line with our strategic ambitions of 2030. \nEnergize digital competence development and future-readiness of all co-workers in our organization.  \nDrive office automation through process standardization, RPA’s, AI-solutions and orchestration of all our digital assets. \nSecure accessibility of necessary data through collaboration with Digitalization & IT, in SML and on Group level. \nContinuously explore emerging technology that might support next leaps forward. \n\n \nHow you will be doing it: \nReach out to all teams and co-workers to secure engagement and change management for new solutions. \nWork together with the management to help set the direction of digitalization. \nYou feel at ease with not knowing everything, but you are a quick learner. \n\nRequired knowledge/experience \nA MSc in Engineering, Economics, Computer Sciences, Management or Logistics or equivalent through proven experience \nProcess design, information analysis, Robotic Process Automation, Agentic Automation & AI, Python, cloud technology and data management. \nYou are passionate about inspiring colleagues how digitalization can support the team’s and people’s success. \nYou are a communicative team player that values the full diversity of the team. \n\n \nWhat’s in it for you?\nYou have a keen interest in technology, and you get energized having the opportunity to transform our processes by collaborating with your colleagues and our dealers. Maybe you don’t know everything yet about process automation, AI and management of big data, but you are a curious and fast learner with a positive mindset, who is eager to share knowledge and put theory into practice. You enjoy delivering results and having an impact. You don’t give up, you have an analytical and pragmatic can-do attitude.",
        "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=19609&company=volvoinfor&st=0B7755562F4F9466CE7DDDD837F81922ABDF9D07",
        "published": "2025-07-02T09:17:25",
        "deadline": "2025-07-17T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 60
    }
]