[
  {
    "id": "29766198",
    "title": "Laboratory Automation Specialist (Data & Workflows)",
    "employer": "Astrazeneca AB",
    "location": "Göteborg",
    "description": "We are looking for an experienced Laboratory Automation Specialist (Data & Workflows) to join our team. In this key role, you will contribute to the advancement of our automated compound synthesis platform. If you are enthusiastic about enhancing laboratory workflows through automation and data-driven approaches, this is a unique opportunity to make a meaningful difference in accelerating drug discovery.\n\nIn this exciting role, you will be joining our Chemistry Automation team (iLAB) at AstraZeneca's state-of-the-art facility in Gothenburg, Sweden, where scientific excellence meets technological innovation. As part of the Compound Synthesis & Management department, we are dedicated to pushing the boundaries of drug discovery by harnessing advanced automation, data-driven solutions, and pioneering AI.\n\nHere, you'll be immersed in an environment that thrives on collaboration and creativity, focused on accelerating the synthesis and processing of chemical compounds for biological testing. Our bold ambition is to set new industry standards, leading the way in laboratory automation and seamlessly integrating cutting-edge technologies into every step of the drug discovery journey.\n\nIn this team, your expertise will directly shape how we transform automated workflows and intelligent data handling - driving efficient, high-impact research that brings breakthrough medicines closer to patients around the world.\n\n \n\nAbout the Role\n\nAs a Laboratory Automation Specialist (Data & Workflows), you will play a crucial part in developing, scripting, and managing automated laboratory workflows. Your expertise will empower our scientists to generate high-quality data more efficiently, supporting our mission to deliver life-changing medicines faster.\n\n \n\nKey Responsibilities: \n\n * \n\nCollaborate with scientists, automation engineers, and IT professionals to design, implement, and optimize automated laboratory workflows.\n * \n\nWrite, maintain, and troubleshoot scripts and scheduling routines for laboratory automation platforms.\n * \n\nEvaluate, integrate, and optimize laboratory scheduling and orchestration software within scientific workflows.\n * \n\nApply data science principles to analyse laboratory data, generate insights, and enhance process efficiency.\n * \n\nTrain users and provide technical support for automation software and workflow solutions.\n * \n\nDocument automation protocols, workflows, and data pipelines clearly and comprehensively.\n * \n\nStay up to date with advances in laboratory automation, data science tools, and workflow management practices.​\n\n \n\nEssential Skills/Experience: \n\n * \n\nDegree in a natural science (e.g., chemistry, biology, pharmacology) or a closely related field.\n * \n\nPractical experience with data science concepts and methods.\n * \n\nProven experience scripting for laboratory automation workflows (e.g., Python, R, C#, SQL, or relevant automation languages).\n * \n\nHands-on knowledge of laboratory scheduling/orchestration software (such as HighRes Cellario, Biosero Green Button Go, Automata LINQ, or equivalent).\n * \n\nStrong analytical skills with the ability to translate scientific requirements into automated solutions.\n * \n\nExcellent problem-solving and communication skills; able to work effectively within a multidisciplinary team.\n * \n\nExperience in laboratory automation or informatics is highly desirable.\n\n \n\nWhat We Offer \n\n * \n\nCompetitive salary and benefits package. \n * \n\nOpportunity to work in a multinational environment with a diverse team. \n * \n\nA culture that promotes work-life balance and employee well-being. \n * \n\nCareer development opportunities across AstraZeneca. \n * \n\nThe chance to contribute to the development of life-changing medicines. \n\n \n\nWhy AstraZeneca? \n\nJoin a team unlocking the power of science to treat, prevent, and potentially cure some of the world's most complex diseases. Grow your career in an inclusive environment where curiosity, collaboration, and scientific excellence are valued every day. \n\n \n\nSo, what's next?  \n\nIf this sounds like your next challenge, apply today! \nApplications are welcomed until June 26th, 2025. \n\nPlease note that applications must include your current CV, and a covering letter which presents your key areas of strength and why you should be considered for the role.",
    "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy41MTYwNi4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
    "published": "2025-06-12T11:07:20",
    "deadline": "2025-06-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7999999999999999,
    "category": "RPA"
  },
  {
    "id": "29738830",
    "title": "Heat Management  söker Projektledare inom automation",
    "employer": "Brapersonal Sverige AB",
    "location": "Göteborg",
    "description": "Idag utmanar vi befintliga teknologier för att kunna bidra till en mer hållbar planet och optimera energiförsörjningen för ett stort antal förbränningsanläggningar runt om i världen. Vi har hundratals installationer av patenterade lösningar över hela världen för kunder inom områden som kraftverk, massa- och pappersbruk.\nProjektledare inom automation – Heat Management\n Vill du leda innovativa automationsprojekt som bidrar till en mer hållbar värld? Heat Management är ett svenskt greentech-företag med patenterade lösningar för kraftverk och processindustri. Vi hjälper kunder över hela världen att öka energieffektiviteten och minska miljöpåverkan med vår unika teknik. Nu söker vi en engagerad Projektledare inom automation, med övergripande ansvar för projektleveranser, som vill vara med och driva våra projekt från projektöverlämning till uppfyllandet av utlovade garantier – och samtidigt göra skillnad globalt.\n \nOm rollen I rollen som Projektledare hos Heat Management får du helhetsansvar för att driva tekniska automationsprojekt för kraftverk och industriella anläggningar. Du leder projekten från start till mål – från design och konstruktion till installation och driftsättning. Projekten innefattar förutom automation även discipliner som mekanik och process. Du arbetar tätt ihop med våra kunder och med kollegor inom olika teknikområden för att säkerställa framgångsrika leveranser. \nDina huvudsakliga arbetsuppgifter kommer att vara: \n Projektledare för produkten HISS (optimeringsteknik av ångsotsblåsare).\n Planera, leda och följa upp projekt från design till installation, test och driftsättning. \n Säkerställa att vi i våra kundprojekt uppfyller kundernas krav, standarder och kvalitetsmål.\n Koordinera interna team samt externa leverantörer och partners för att leverera projekt i tid och inom budget. \n Besöka kundanläggningar både i Sverige och internationellt för möten, installation och driftsättning (ca 1-5 resdagar per månad).\n \n Placeringsort för tjänsten är Stockholm (Sundbyberg) eller Göteborg, Internationella resor om ca 1-5 dagar per månad ingår i tjänsten.\n \n\n Vem vi söker\n Vi tror att du har en bra kombination av teknisk kompetens och naturliga ledaregenskaper – och att du trivs i rollen som drivande kraft i komplexa projekt. Du har flera års erfarenhet av projektledning inom industriell automation. Din bakgrund får gärna vara från energisektorn eller processindustrin, och du känner dig hemma i miljöer där teknik och struktur går hand i hand. \nDu har:\n Flera års erfarenhet av att driva tekniska projekt med koppling till industrin.\n Relevant teknisk högre utbildning.\n God kännedom om automations- och styrsystem. (DCS- eller PLC-system). Erfarenhet av styrsystem som ABB 800xA, Siemens Simatic PCS7 är meriterande.\n En tydlig och strukturerad ledarstil, med förmågan att engagera team och skapa förtroende hos kunder.\n En självgående, lösningsorienterad inställning och förmågan att hantera flera parallella projekt.\n Vilja och möjlighet att resa internationellt ca 1-5 dagar per månad.\n Förmåga att uttrycka dig obehindrat i tal och skrift på svenska och engelska. Meriterande är om du har kunskaper i andra språk såsom portugisiska, spanska, tyska eller finska.\n B-körkort då resor ingår i tjänsten.\n \n\n \n Utvecklingsmöjligheter och arbetsmiljö\n Hos Heat Management blir du en del av ett mindre, innovativt företag där dina idéer och ditt engagemang verkligen räknas. Vi erbjuder en dynamisk arbetsmiljö med breda roller och korta beslutsvägar – du får stor frihet att forma din tjänst och påverka hur vi arbetar. Vi satsar på din långsiktiga utveckling. \nDu kommer att samarbeta med ett kompetent och passionerat team som brinner för ny teknik och hållbara lösningar. Tillsammans strävar vi efter att förbättra industrins miljöpåverkan globalt. I denna roll får du en unik chans att bidra till en mer hållbar framtid samtidigt som du utvecklas med oss.  \nKontakt\nLena Brantberg, Rekryterare, BraPersonal, 0703-508909, lena.brantberg@brapersonal.nu. \nAnsökan\nEftersom vi tillämpar löpande urval och intervjuer sker löpande vill vi därför gärna att du inte väntar med att skicka in din ansökan. \nVi ser fram emot din ansökan!\nI rekryteringen samarbetar Wave Impact Heat Management AB med BraPersonal Sverige AB. Anställning sker direkt på Wave Impact Heat Management AB.",
    "url": "https://jobb.brapersonal.nu/jobs/5833169-heat-management-soker-projektledare-inom-automation?promotion=1446249-arbetsformedlingen",
    "published": "2025-05-28T18:52:34",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6,
    "category": "RPA"
  },
  {
    "id": "29736157",
    "title": "Head of Discipline - Electrical & Automation",
    "employer": "Cowi AB",
    "location": "Göteborg",
    "description": "Head of Discipline – Electrical & Automation Gothenburg\nDo you want to help shape the industrial solutions of tomorrow? Are you a dedicated leader with technical expertise in electrical engineering and automation? If so, this could be your next career step. We are now looking for a Head of Discipline for Electrical & Automation – someone who wants to combine inspiring leadership with cutting-edge engineering within Swedish industry.\nWelcome to Electrical & Automation in Gothenburg\nOur Electrical & Automation department consists of around 30 dedicated colleagues. We frequently work in multidisciplinary projects where we are responsible for delivering comprehensive solutions – from low voltage to high voltage and advanced automation systems. Our clients include companies in the process industry, the automotive sector, municipal utilities, and infrastructure. Together, we contribute to the green transition and a more sustainable future.\nLead the Way in Electrical and Automation Engineering\nAs Team Manager, you will play a key role in our continued growth. You will lead, coach, and develop a group of skilled engineers specialising in electrical and automation systems. Together, you will work on exciting industrial projects, supporting our clients in their digital transformation and sustainability journeys.\nYou are a natural leader who thrives on building strong teams, developing people, and delivering high-quality results. The role combines strategic responsibility with hands-on project involvement, where you contribute directly to our client projects through your own assignments.\nYour Key Responsibilities:\nLead and coach employees in their day-to-day work and long-term professional development\nEnsure team engagement, high utilisation, and ongoing competence development\nRecruit new team members as the team continues to grow\nDrive and contribute to client projects with a focus on technical excellence\nAct as a technical role model and contribute to methodology and quality assurance\nDevelop team goals and strategies in close collaboration with the business development organisation\nParticipate in strategic marketing initiatives and contribute to the overall success of the department\n\nWho We Believe You Are\nYou are a confident and attentive leader with a passion for both technology and people. You have the ability to identify and nurture potential, and you foster a culture where performance, wellbeing, and development go hand in hand. You are eager to contribute to the business while building strong, long-term relationships – both internally and with clients.\nTo Succeed in This Role, We Believe You Have:\nA relevant technical degree (minimum BSc) in electrical engineering, automation, or a related field\nAt least five years of industry experience in electrical and/or automation engineering – preferably from consultancy, plant operations, or contracting\nProven leadership experience, either as a team manager, project manager, or technical lead\nA strong interest in and motivation for developing and leading others\nFluency in both spoken and written Swedish and English\n\nWhat Can We Offer You?\nAt COWI, our people are our most valuable asset. We offer a working environment where you can grow as a leader alongside some of the most skilled professionals in the industry. You will benefit from:\nA clear personal development plan, defined together with your manager\nOpportunities to work on both local and international projects\nA collaborative culture focused on knowledge sharing and openness\nAccess to a strong internal network within electrical and automation engineering\nThe opportunity to influence both technical direction and business development\n\nReady to Take the Next Step?\nWe look forward to hearing from you. This is your opportunity to make a real difference – as a leader, technical expert, and colleague. Welcome to COWI.\nDo You Have Any Questions?\nFeel free to contact:\nJennica Lindén, Head of Engineering Industry and Energy – jeiv@cowi.com\nGoce Kostovski, Global Talent Acquisition Specialist – goko@cowi.com\nGet to Know Us Better\nVisit www.cowi.com to explore our projects, our global strategy, and what it’s like to work at COWI.\nWe look forward to your application!",
    "url": "https://www.cowi.com/your-career/open-vacancies/?country=Sweden&page=0",
    "published": "2025-05-28T09:46:33",
    "deadline": "2025-07-04T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.6,
    "category": "RPA"
  },
  {
    "id": "29429861",
    "title": "Domain Test Automation Engineer",
    "employer": "Techster Solutions AB",
    "location": "Göteborg",
    "description": "Techster Solutions befinner i dagsläget sig i en spännande tillväxtfas och söker nu fler kollegor, inledningsvis dig med minst 2+ års erfarenhet och som kan stärka teamet.\nDu kan förvänta dig en omväxlande miljö, dagarna kan se väldigt olika ut - men en sak är säkert, här får du använda dina kompetenser och sätter själv gränsen för hur mycket du vill utvecklas. Som ett kunskapsbolag är det viktigt för oss att våra specialister delar med sig av sin kompetens och får kollegorna att växa.\nRollbeskrivning:As part of the domain test team, you are working with testing in rigs and HILs (and sometimes you help out also in test cars).\nDo you fit the profile?• Pytest and Python programming• Test Automation• Genuine interest in cars and infotainment• At least have a Bachelor of Science in Computer Science, Electrical Engineering or equivalent.• Ethernet• CAN and experience working with CANoe/CANalyzer and Wireshark when you are troubleshooting.Meritorious qualifications• Automotive Basetech competence in Diagnostic, Power Management and SW download• Experience from Continuous Integration• Robot Framework\n\nAnsökan Tror du att du är Techster Solutions nästa stjärna? Tveka då inte att skicka in din ansökan redan nu. Urval sker löpande och tillträde sker enligt överenskommelse.\nArbetsplats och kulturVi är ett entreprenördrivet IT företag, med både produktkunskap och försäljning (Techster AB) och konsultativa tjänster (Techster Solutions AB). Det innebär att vi är mycket öppna för nya tekniska lösningar, kunskapsutbyte och ständigt lärande. Att ha roligt och samtidigt behålla den familjära andan utan hierarkier är lika viktigt.\nVi vill skapa det konsultbolag som du alltid velat jobba för, men kanske inte hittat ännu. Redan idag har vi en blandning av seniora och yngre medarbetare, såväl som män och kvinnor. Det vill vi fortsätta att bygga på. Så välkommen med din ansökan!",
    "url": "https://www.techstersolutions.se/jobs/5504121-domain-test-automation-engineer?promotion=1324187-arbetsformedlingen",
    "published": "2025-01-31T15:13:56",
    "deadline": "2025-07-20T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.7,
    "category": "RPA"
  }
]