[
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30305970",
        "title": "Analytical Automation Scientist",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Do you have expertise in, and passion for analytical science and automation? Would you like to apply your expertise and be part of the transformation of our labs in a company that follows the science and turns ideas into life changing medicines? Then this role might be the one for you!\n\nAt AstraZeneca we're dedicated to being a Great Place to Work. Where you are empowered to push the boundaries of science and unleash your entrepreneurial spirit. There's no better place to make a difference to medicine, patients and society. An inclusive culture that champions diversity and collaboration. Always committed to lifelong learning, growth and development\n\nIn Pharmaceutical Technology and Development (PT&D), we are the bridge between forward-thinking science and innovative medicines that help millions of people. We work across the entire value chain, designing and delivering active ingredients, formulations and devices required to support new medicines - from supplies for use in early toxicology studies and clinical trials to developing the technology to ensure drugs can be scaled up for commercial manufacture.\n\nWe are currently looking for a Senior Scientist - Analytical Automation in Global Product Development (GPD). Our vision is to transform product design, development and characterization to enable us to deliver new medicines to patients. The role holder will primarily focus on oral solid dosage forms, a key growth area for AstraZeneca, covering a wide range of projects including small molecule immediate release, modified release and complex formulations.\n\nWe're looking for a skilled and motivated analytical automation scientist to join one of our analytical teams in Gothenburg, Sweden. This is an exciting opportunity where you will be key in developing our laboratories and automated workflows, taking the next step into the future.\n\nWhat you'll do\n\nIn this role you will be responsible for identifying and evaluating new technologies for end-to-end automation as well as implementing and maintaining GMP-status on automation instrumentation. You will be accountable for developing, validating and executing automated analytical methods. \n\nYou will join a highly collaborative team developing and implementing automation to take analytical science and product development to the next level of efficiency, quality and innovation. You will be an important, enabling link between our skilled technical automation team (implementing autonomous mobile robots and collaborative robots for analytical use) and our development projects utilizing the automated workflows. You will work globally across the GPD organisation and with our key partners in PT&D and commercial manufacturing sites.\n\nYou will get the opportunity to use your professional skills in a highly advanced research environment and contribute to the progression of drug projects at AstraZeneca.\n\nEssential for the role\n\nTo be successful in this role you will need expertise in analytical chemistry and an interest in implementation of automation in a laboratory setting. Excellent skills in written and verbal communication and the ability to lead, engage and collaborate across boundaries with a positive problem-solving attitude and delivery focus.\n\n * University degree (BSc, MSc, PhD) in relevant subject area, with industry experience\n * Experience from working with chromatography e.g. UPLC and HPLC and techniques for dissolution, both in a GxP and a non GxP environments\n * Experience from working with automated analytical procedures\n * Experience of the analytical area such as method development and method validation.\n * Excellent communication skills and a proven track record of working collaboratively to develop innovative solutions\n\nDesired for the role\n\n * Knowledge of solutions available for automation with awareness of global automation suppliers and a record of leading supplier selection for automated systems and services\n * Experience from working with IT solutions for automated analytical systems\n * Ability to identify use cases for lab automation and AI/ML to improve analytical efficiency and data handling.\n\nWhen we put unexpected teams in the same room, we unleash bold thinking with the power to inspire life-changing medicines. In-person working gives us the platform we need to connect, work at pace and challenge perceptions. That's why we work, on average, a minimum of three days per week from the office. We balance the expectation of being in the office while respecting individual flexibility. Join us in our unique and ambitious world. \n\nWe welcome your application, CV and covering letter presenting your areas of strength/development related to the scope of the role, no later than December 9th, 2025.",
        "url": "https://www.aplitrak.com/?adid=Z2FsaWEubnlzdHJvbS42NDQ3OC4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2025-11-25T18:18:32",
        "deadline": "2025-12-05T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 100
    }
]