[
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30549555",
        "title": "Scientist - Automation, Assay, Profiling & Cell Sciences",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "Are you excited about science, technology, and learning new lab skills? Do you enjoy solving problems, working with innovative equipment, and making a real impact in drug discovery? \n\n \n\nJoin us as a Scientist in the Assay, Profiling & Cell Sciences team within Discovery Sciences, based at the AstraZeneca R&D site in Gothenburg, Sweden. This is a fantastic opportunity to grow your career in a supportive environment while working with cutting-edge laboratory automation. \n\n \n\nWhat you'll do? \n\nIn this hands-on lab role, you'll work closely with experienced scientists and automation specialists who will help you grow your technical expertise. You'll contribute to generating high quality in vitro pharmacology data and help keep our automated systems running smoothly. \n\n \n\nYou'll be involved in: \n\n * \n\nRunning and supporting lab automation - helping operate robotic systems, liquid handlers, and plate readers that drive high throughput experiments\n\n * \n\nLearning and applying workflow execution - following established protocols to set up assays, handle samples, and collect data\n\n * \n\nDeveloping practical coding skills - assisting with simple scripts for instruments and data handling \n\n * \n\nImproving how we work - sharing observations, helping troubleshoot day-to-day issues, and contributing to a culture of continuous improvement \n\n * \n\nCollaborating across teams - working with colleagues across Discovery Sciences, CVRM, and R&I to support a wide range of drug discovery projects\n\n \n\nThis role is perfect if you are curious, hands-on, and eager to expand your technical skills while contributing directly to scientific progress. \n\n \n\nEssential requirements for the role:\n\n * \n\nA BSc or MSc in engineering, biotechnology, molecular biology, or a related field \n\n * \n\nExperience in working with laboratory automation and liquid handling systems (from studies, internships, or industry) \n\n * \n\nExperience in programming/scripting for lab tools \n\n * \n\nA collaborative mindset and strong communication skills \n\n * \n\nEnthusiasm for solving problems and developing new skills \n\n \n\nDesirable requirements for the role:\n\n * \n\nExperience in cell biology, biochemistry, molecular biology or in vitro pharmacology \n\n * \n\nExperience with automated systems, robotics, or scheduling software \n\n * \n\nExperience with LIMS/ELN systems \n\n * \n\nInterest in AI/ML for workflow or data optimisation \n\n \n\nWhy AstraZeneca? \n\nAt AstraZeneca, you'll join a community that celebrates curiosity and encourages bold thinking. We use digital tools, automation, and AI to accelerate our discoveries and push boundaries. You'll have opportunities to learn, grow, and contribute to lifechanging medicines. \n\n \n\nWhat's next? \n\nIf you're ready to kickstart your automation and discovery sciences career - apply today! The last application date is February 15, 2026. \n\nFor more information, contact hiring manager Cecilia Boreström at cecilia.borestrom1@astrazeneca.com.",
        "url": "https://www.aplitrak.com/?adid=a2Fyb2xpbmEuemluZ21hcmsuODM2OTkuMzEwMUBhc3RyYXplbmVjYS5hcGxpdHJhay5jb20",
        "published": "2026-02-02T10:12:35",
        "deadline": "2026-02-16T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 100
    }
]