[
    {
        "id": "30083683",
        "title": "Lexly söker en senior familjerättsjurist med processerfarenhet",
        "employer": "Lexly AB",
        "location": "Göteborg",
        "description": "Senior familjerättsjurist med spetskompetens inom process\n\nPlaceringsort: Mölndal eller Stockholm\nVill du göra skillnad och utveckla juristbranschen genom att förena juridisk expertis med smart teknik? Då är det dig vi söker!\nPå Lexly är vår vision att förändra upplevelsen av juridik – att göra juridiken enkel, trygg och tillgänglig för alla. Nu söker vi en senior familjerättsjurist med gedigen erfarenhet av process för att bredda och fördjupa vårt erbjudande inom familjejuridik. Ditt bidrag kommer att göra skillnad i vår snabba men ständigt utvecklande miljö, där vi levererar en kundupplevelse i världsklass och bidrar till social hållbarhet med färre konflikter och mer förutsägbarhet.\nDu behöver tycka om att möta människor i olika livssituationer och vilja arbeta i ett engagerat team med högt tempo och höga krav. I teamet uppskattas prestation och förmågan att ha roligt på arbetet. För att trivas hos oss behöver du vara driven, resultatinriktad och ansvarstagande. Det är också viktigt att du är utåtriktad, initiativtagande och har god samarbetsförmåga, samtidigt som du värdesätter effektivitet i arbetet.\nRollbeskrivning och huvudsakliga ansvarsområden\nSom senior familjerättsjurist blir ditt uppdrag att ta ansvar för att kundernas juridiska behov tillgodoses genom kvalificerad rådgivning och avtalsskrivning, med särskilt fokus på medling och tvistelösning inom familjerättens område. \nDu kommer att:\n Hantera komplexa familjejuridiska ärenden där en del går till process i domstol.\n Arbeta med kunder både via telefon, video och fysiskt möte. \n Använda AI-assisterade verktyg för att effektivisera arbetet.\n Bidra till vår \"human-in-the-loop-juridik\" där vi värnar om den mänskliga kontakten och det sunda förnuftet i samverkan med ny teknik.\n Vara delaktig i att överföra kompetens vid interna utbildningar samt lansera vårt erbjudande inom familjejuridik.\n Bidra till vår affärs- och produktutveckling, kommunikation, marknadsföring samt närvara på våra partnerevents.\n \nKvalifikationer\n Fullständig juristexamen\n Minst 3 års arbetserfarenhet\n Dokumenterad erfarenhet av process i domstol inom segmentet familjerätt\n Flytande svenska och engelska i tal och skrift\n Erfarenhet av service och/eller försäljning.\n \nFör att lyckas hos oss behöver du:\n Vara utåtriktad, förtroendeingivande och ha förmåga att skapa goda relationer.\n Ha förmågan att uttrycka komplexa saker på ett enkelt och begripligt sätt i såväl tal som skrift.\n Ha initiativförmåga och förmågan att arbeta självständigt med kunden i fokus.\n Ha hög arbetskapacitet, prestigelöshet och ett stort ansvarstagande, trivas med att arbeta i högt tempo och att snabbt skifta fokus.\n Drivas av att arbeta mot tydliga mål och motiveras av siffror.\n  \nVad kan Lexly erbjuda dig?\nHos oss får du ta ett stort ansvar i en dynamisk organisation med korta beslutsvägar och stort fokus på kundbemötande i världsklass, professionalitet och försäljning. Söker du en dynamisk miljö präglad av service, glädje och tillväxt är Lexly rätt för dig.\nLexly ger dig:\n En möjlighet att vara en del av Lexly och forma framtidens juridiska tjänster genom digitalisering och AI-integration.\n Ansvar och frihet i din arbetsroll.\n En rolig, omtänksam men ändå professionell arbetsmiljö.\n Ett varierande och utvecklande arbete i din juristroll, där vi strävar efter att automatisera delar av kundresan för att effektivisera rådgivningen, samtidigt som vi behåller den höga kvalitet och empati som krävs inom familjejuridik.\n Du kommer att arbeta i gränssnittet mellan juridisk expertis och den senaste tekniken inom AI, med fokus på att skapa trygga och effektiva lösningar för våra kunder.\n \nPraktisk information:\n Placering: Mölndal (Göteborg) eller Stockholm\n Startdatum: Enligt överenskommelse\n Omfattning: Heltid\n Anställningsform: Tillsvidareanställning\n Lön: Efter överenskommelse\n \nFör frågor om denna roll vänligen kontakta:\nTeresa Doré (teresa.dore@lexly.com) \nIntervjuer pågår löpande.\nLivet på Lexly\nVi är en avslappnad arbetsplats med ett tight team av kunniga, drivna och engagerade människor. Hos oss arbetar inte bara jurister utan också IT-utvecklare, säljare, produktutvecklare och partneransvariga. Våra kontor finns i centrala Stockholm och Mölndal, Göteborg.\nVi utvecklar en plattform för digitala juridiska tjänster, ett juristnätverk för juridisk rådgivning och satsar på att bli the go to brand. Vi är nyfikna doers, som tillsammans får saker att hända. Vi är kreativa, orädda och framför allt engagerade i att skapa en fantastisk kundupplevelse och vi är stolta över att sätta våra kunder först i allt vi gör.\nMellan hårt och hängivet arbete tar vi oss tid att umgås över gemensam frukost, ta gemensamma promenader eller andra friskvårdsaktiviteter eller anordna AW tillsammans efter jobbet. Vi värderar balans mellan jobb och fritid högt och gillar att ha kul tillsammans!\nSom arbetsgivare ser vi positivt på mångfald och är engagerade i att skapa en inkluderande miljö för alla anställda och kandidater. Om du vill vara med och förändra en hel bransch och vara en del av en dynamisk organisation där dina färdigheter verkligen kan göra skillnad, är Lexly platsen att börja på.\nVarmt välkommen med din ansökan!\nLAW MADE EASY\nLexly grundades 2004 och är ledande aktör inom juridiska digitala tjänster och rådgivning i Sverige. Lexlys vision är att göra juridik tillgängligt för alla och var det första företaget i Europa som skapade en skalbar plattform för juridiska tjänster. Lexly samarbetar med banker, försäkringsbolag och redovisningsföretag som erbjuder en sömlös kundupplevelse",
        "url": "https://lexly1.teamtailor.com/jobs/6413928-lexly-soker-en-senior-familjerattsjurist-med-processerfarenhet?promotion=1617135-arbetsformedlingen",
        "published": "2025-09-29T14:36:52",
        "deadline": "2026-03-18T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    },
    {
        "id": "30405183",
        "title": "Lärare inom automation och elektronik till Yrgo",
        "employer": "GÖTEBORGS KOMMUN",
        "location": "Göteborg",
        "description": "Vill du vara med och göra skillnad?\n\nBli en av oss och bidra till att våra engagerade studerande får eftertraktad kompetens!\nYrgo är en yrkeshögskola i Göteborg som i nära samarbete med näringslivet utbildar framtidens praktiska ingenjörer, arbetsledare och andra kvalificerade yrkesroller inom teknik, bygg och IT.\r\n\r\nInom teknikområdet samarbetar vi med Göteborgsregionens mest framgångsrika företag. Tillsammans säkerställer vi att våra utbildningar är aktuella, relevanta och anpassade till dagens och morgondagens arbetsmarknad.\n\n \n\nOm tjänsten\n\nYrgo söker nu dig som har goda kunskaper inom automation, elektronik och/eller processteknik, kombinerat med relevant arbetslivserfarenhet. Som lärare hos oss ansvarar du för att omsätta branschens kompetensbehov till praktisk, yrkesnära undervisning för våra studerande.\n\nDu kommer att arbeta med yrkeshögskoleutbildningar för automationsingenjörer och elektronikingenjörer, som innehåller både teoretiska och praktiska moment. En viktig del av rollen är samverkan med arbetslivet, bland annat genom LIA (praktik). Tillsammans med kollegor och näringsliv deltar du aktivt i det kontinuerliga utvecklingsarbetet av våra kurser och utbildningar, samt håller dig uppdaterad om utvecklingen inom ditt område.\n\nArbetsuppgifter\nI rollen som lärare ingår att:\n\n - undervisa inom automation och/eller elektronik, med fokus på yrkesroll och tillämpning\n - planera, genomföra och följa upp undervisning enligt fastställda kursplaner\n - genomföra examination, betygsättning och kursutvärderingar\n - ansvara för och arbeta med LIA (praktik) i nära samverkan med företag\n - handleda studerande vid examensarbeten\n - delta i utveckling och revidering av kurser och utbildningar tillsammans med kollegor och arbetsliv\n - omvärldsbevaka ditt område och bidra till utbildningarnas långsiktiga kvalitet och relevans\n\nKvalifikationer\nVi söker dig som har goda yrkesmässiga kunskaper och pedagogisk förmåga. Du ska vara högskole- eller civilingenjör, alternativt ha en yrkeshögskoleutbildning inom automation, elektronik, data eller elektroteknik, samt ha dokumenterad arbetslivserfarenhet inom relevant område.\n\nDu har kunskaper inom ett par eller flera av följande områden:\n\n - automation och industriella styrsystem\n - processteknik\n - inbyggda system och hårdvarunära programmering\n - Python, C, C++, Linux, VHDL\n - digital konstruktion\n - elektronik- och PCB-design\n - analog elektronik\n - signaler och sensorer\n - autonoma system\n - maskininlärning\n - projektmetodik\n\nMeriterande är erfarenhet av undervisning samt arbete med hård- och mjukvaruutveckling för inbyggda system, inklusive tillhörande tekniker, kommunikationsprotokoll och arbetssätt.\n\nPersonliga egenskaper\n\nDu tycker om att undervisa och att dela med dig av dina kunskaper. För att trivas och lyckas i rollen är du prestigelös, drivande och social, samtidigt som du är strukturerad, noggrann och målinriktad. Tjänsten förutsätter att du kan arbeta självständigt, fatta egna beslut och samarbeta väl med andra. Du har god kommunikationsförmåga, är flexibel och har ett stort intresse för vuxnas lärande.\n\nNaturligtvis delar du Yrgos värdeord: personlig, engagemang, dignitet och modernitet. Vi eftersträvar mångfald och lägger stor vikt vid personlig lämplighet.\n\nLäs mer om våra utbildningar inom IT och teknik här.\n\nOm oss\n\nVår vision är att Göteborg ska vara en internationellt ledande utbildnings- och kunskapsstad. Utbildningsförvaltningen i Göteborg bedriver verksamhet inom kommunal gymnasieskola, vuxenutbildning, yrkeshögskola, anpassad gymnasieskola, komvux som anpassad utbildning, studie- och yrkesvägledning, modersmål samt skolutveckling.\n\n\n\nI vårt arbete har vi ett tydligt elevfokus som sätter kunskap och färdigheter i ett sammanhang där inre motivation, medskapande och lust att lära är viktiga ingredienser. Vi arbetar utifrån alla människors lika värde och rättigheter. Tillsammans skapar vi en arbetsmiljö där både elever och medarbetare är delaktiga och verkar för varandras framgång.",
        "url": "https://goteborgsstad.varbi.com/what:job/jobID:888760/type:job/where:1/apply:1",
        "published": "2025-12-19T12:39:54",
        "deadline": "2026-01-02T23:59:59",
        "is_consultant": false,
        "is_meaningful": true,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    }
]