[
  {
    "id": "29718852",
    "title": "Automation and AI Architect",
    "employer": "Aleido Sweden AB",
    "location": "Göteborg",
    "description": "We are looking for an innovative and visionary Automation and AI Architect to help shape the future of intelligent solutions at Aleido. This is a role for someone who thrives on solving complex problems through thoughtful design and deep technical expertise - and wants to lead from the front in transforming how our business leverages automation and AI.\nAbout the role\nAs an Automation and AI Architect, you’ll play a critical role in setting the direction for how we design, implement, and scale smart systems across the organization. You’ll be responsible for crafting the architectural blueprint for AI and automation initiatives, aligning cutting-edge technology with real business needs.\n Define and own the architecture for automation and AI solutions across business units.\n Guide the selection, integration, and orchestration of tools, frameworks, and platform - balancing innovation with maintainability and scalability.\n Collaborate with stakeholders to translate strategic business goals into technical designs and long-term roadmaps.\n Establish best practices and governance around the development and deployment of AI/automation solutions.\n Lead technical reviews, mentor engineers, and contribute to fostering a strong engineering and innovation culture.\n Stay ahead of the curve with emerging trends in AI, automation, and software architecture - and apply that insight to continuously evolve our capabilities.\n \nWho you are\nWe believe that you have:\n Proven experience designing and implementing enterprise-level automation and AI architectures.\n Deep understanding of scripting languages (e.g. Python, PowerShell), orchestration tools, and modern AI/ML platforms.\n Strong analytical and systems-thinking mindset, especially for breaking down complexity into elegant, scalable solutions.\n Excellent stakeholder management and communication skills - you can speak the language of both business and technology.\n A proactive, forward-thinking approach to problem solving and continuous improvement.\n \nNice to have:\n Experience with Azure cloud services and AI offerings.\n Familiarity with tools like OpenAI, Azure Cognitive Services, or other LLM providers.\n Knowledge of business process analysis, RPA, or systems integration.\n \nWho we are\nAleido is a Swedish international company with a long heritage of driving the development of aftermarket information and learning solutions. Our customers develop complex products or systems, or seek knowledge and confidence to create lasting change, within a wide range of industries including automotive, telecom, advanced machinery, rail and medtech. We are almost a thousand colleagues in five countries. Together we bridge the gap between technology and the people who depend on it – by making the advanced simply understood.\nYou’ll be joining a passionate, forward-thinking team that’s actively shaping the future of AI and automation at Aleido. If you’re excited about designing impactful solutions and influencing strategic tech direction, we’d love to hear from you.",
    "url": "https://work-sv.aleido.com/jobs/5930620-automation-and-ai-architect?promotion=1479483-arbetsformedlingen",
    "published": "2025-05-21T09:18:43",
    "deadline": "2025-11-07T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29538199",
    "title": "Projektledare inom processindustri - NEVITA",
    "employer": "Nevita AB",
    "location": "Göteborg",
    "description": "Vilka är vi? Vi är ett ingenjörsbolag beläget i centrala Göteborg, i takt med omvandlingen mot ett hållbart samhälle levererar vi spetskompetens till globala och välkända kunder inom processindustrin. Här blir du del av ett härligt gäng som gärna delar med sig av sin kunskap och stöttar varandra. Samtidigt erbjuder vi mycket internt ansvar, i och med tillväxten av vår interna projektavdelning. Vi jobbar ofta i långsiktiga och avancerade projekt inom processindustri, marine/offshore och hållbarhet. Att utvecklas inom sitt område är viktigt för både dig och NEVITA - redan vid start sätter vi en plan för dina karriärsmål så att dessa går i linje med dina uppdrag och åtaganden. \nDin roll Du blir del av NEVITAs team som jobbar med projektledning och delprojektledning för disciplinerna process, automation, civil, rör och mek. Som projektledare får du möjlighet att arbeta tillsammans med de främsta kundföretagen inom svensk processindustri. Vi har en uttalad strategi att driva egna EPC-projekt inhouse. Majoriteten av projekten är långa och utförs tillsammans med våra övriga discipliner. I rollen ges du också möjlighet att delta i avdelningens förbättringsarbete och utveckla NEVITAs affärsrelationer.\nVem är du? För denna roll är det viktigt att du har tidigare erfarenheter från processindustrin, vi ser gärna också att du har dokumenterad erfarenhet av projektledning från större projekt. Som person har du goda ledaregenskaper samt trivs i en miljö där man leder, coachar och utvecklar grupper. Du är social, prestigelös och har ett stort intresse för att skapa affärer. Erfarenhet av procurement eller contracting är starkt meriterande.\nSom arbetsgivare\n Friskvårdsbidrag, tjänstepension och generös kompetensutveckling.\n Flexibla tillvalsförmåner.\n Friskvårdsaktiviteter under arbetstid.\n Stående interndagar med gemensam frukost och valfri sportaktivitet.\n \nIntresserad? Intervjuer och urval sker löpande! Vid frågor om tjänsten är du välkommen att kontakta HR Sanela Filipovic, sanela.filipovic@nevita.se",
    "url": "https://nevita.teamtailor.com/jobs/309951-projektledare-inom-processindustri-nevita?promotion=1380793-arbetsformedlingen",
    "published": "2025-03-12T16:19:31",
    "deadline": "2025-08-29T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29732788",
    "title": "Engineer Director Infotainment",
    "employer": "Luxoft Sweden AB",
    "location": "Göteborg",
    "description": "Project Description\nAre you passionate about creating new opportunities and driving the development of cutting-edge In-Vehicle Infotainment (IVI) systems?\n Join us in shaping the future of infotainment in the automotive industry.\nWe’re looking for an exceptional Engineering Director to lead innovation in IVI, drive business growth with one of our key customers, and strengthen relationships with a wide range of stakeholders across the automotive sector.\nIn this role, you will lead critical aspects of an IVI solution for a major client. You'll play a key role in evolving and inspiring a high-performing team of engineers, helping them reach their full potential.\nYou bring excellent project management skills, with a proven ability to maximize project efficiency while maintaining strong team morale. You know how to deliver results—while keeping people motivated and engaged.\nResponsibilities\nSuccessfully managing and enabling software development teams in the automotive industry with a high focus on in vehicle infotainment systems\nContinuously adopt your project organization in line with market development and Luxofts strategic targets\nDrive joint and disruptive innovation with leading customers to ensure Luxofts competitiveness in the future\nDrive Luxoft business to maximize future growth by having a holistic view on the industry, focusing on the complete portfolio\nAlign with all stakeholders on their projects to maximize efficiency and growth\nManage the engagements and resource allocation with the expected return of investment in mind (entrepreneurial mindset)\nManage expectations and responsibilities with all stakeholders inside and outside of Luxoft organization \n\n\n\n \nMandatory Skills\nA university degree in Electrical Engineering or comparable\nAt least 15 years of professional experience within automotive industry especially with development of infotainment systems\n15+ years’ experience as team leader , ability to identify and attract talents\nAnalytical skills for identification and assessment of unique value propositions / selling points / product competitiveness in order to prioritize Go-to-Market activities\nAbility to drive alignment with key stakeholders and to manage multiple, multilevel interfaces\nStrategic thinking, business sense, entrepreneurial view, as well as a good understanding of process management, digitalization, and change management\nProject Management skills best proven by successful development of infotainment systems\nExcellent English communication and presentation skills\n\nNice to have skills\nStrong understanding of testing processes\nAgile methodology\nVector/Canoe\nMentoring experience\nExperience in the truck business\nMock server implementation\nAndroid automotive experience\nAutomotive testing experience\nExperience with embedded development\nPractical experience requirements elicitation and test design\nPractical experience in automation test framework implementation\n\nLanguages\nEnglish: C2 Proficient\n Working at Luxoft:\n- Flexible working hours\n- International teamwork\n- Cellphone usage\n- Fitness/wellness policy\nhttp://www.luxoft.com",
    "url": null,
    "published": "2025-05-27T11:27:43",
    "deadline": "2025-06-12T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29736157",
    "title": "Head of Discipline - Electrical & Automation",
    "employer": "Cowi AB",
    "location": "Göteborg",
    "description": "Head of Discipline – Electrical & Automation Gothenburg\nDo you want to help shape the industrial solutions of tomorrow? Are you a dedicated leader with technical expertise in electrical engineering and automation? If so, this could be your next career step. We are now looking for a Head of Discipline for Electrical & Automation – someone who wants to combine inspiring leadership with cutting-edge engineering within Swedish industry.\nWelcome to Electrical & Automation in Gothenburg\nOur Electrical & Automation department consists of around 30 dedicated colleagues. We frequently work in multidisciplinary projects where we are responsible for delivering comprehensive solutions – from low voltage to high voltage and advanced automation systems. Our clients include companies in the process industry, the automotive sector, municipal utilities, and infrastructure. Together, we contribute to the green transition and a more sustainable future.\nLead the Way in Electrical and Automation Engineering\nAs Team Manager, you will play a key role in our continued growth. You will lead, coach, and develop a group of skilled engineers specialising in electrical and automation systems. Together, you will work on exciting industrial projects, supporting our clients in their digital transformation and sustainability journeys.\nYou are a natural leader who thrives on building strong teams, developing people, and delivering high-quality results. The role combines strategic responsibility with hands-on project involvement, where you contribute directly to our client projects through your own assignments.\nYour Key Responsibilities:\nLead and coach employees in their day-to-day work and long-term professional development\nEnsure team engagement, high utilisation, and ongoing competence development\nRecruit new team members as the team continues to grow\nDrive and contribute to client projects with a focus on technical excellence\nAct as a technical role model and contribute to methodology and quality assurance\nDevelop team goals and strategies in close collaboration with the business development organisation\nParticipate in strategic marketing initiatives and contribute to the overall success of the department\n\nWho We Believe You Are\nYou are a confident and attentive leader with a passion for both technology and people. You have the ability to identify and nurture potential, and you foster a culture where performance, wellbeing, and development go hand in hand. You are eager to contribute to the business while building strong, long-term relationships – both internally and with clients.\nTo Succeed in This Role, We Believe You Have:\nA relevant technical degree (minimum BSc) in electrical engineering, automation, or a related field\nAt least five years of industry experience in electrical and/or automation engineering – preferably from consultancy, plant operations, or contracting\nProven leadership experience, either as a team manager, project manager, or technical lead\nA strong interest in and motivation for developing and leading others\nFluency in both spoken and written Swedish and English\n\nWhat Can We Offer You?\nAt COWI, our people are our most valuable asset. We offer a working environment where you can grow as a leader alongside some of the most skilled professionals in the industry. You will benefit from:\nA clear personal development plan, defined together with your manager\nOpportunities to work on both local and international projects\nA collaborative culture focused on knowledge sharing and openness\nAccess to a strong internal network within electrical and automation engineering\nThe opportunity to influence both technical direction and business development\n\nReady to Take the Next Step?\nWe look forward to hearing from you. This is your opportunity to make a real difference – as a leader, technical expert, and colleague. Welcome to COWI.\nDo You Have Any Questions?\nFeel free to contact:\nJennica Lindén, Head of Engineering Industry and Energy – jeiv@cowi.com\nGoce Kostovski, Global Talent Acquisition Specialist – goko@cowi.com\nGet to Know Us Better\nVisit www.cowi.com to explore our projects, our global strategy, and what it’s like to work at COWI.\nWe look forward to your application!",
    "url": "https://www.cowi.com/your-career/open-vacancies/?country=Sweden&page=0",
    "published": "2025-05-28T09:46:33",
    "deadline": "2025-07-04T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29759105",
    "title": "Senior Software Engineer, Fullstack",
    "employer": "Bokio Group AB",
    "location": "Göteborg",
    "description": "Bokio is on a mission to make the world a better place for small businesses. We want to make it super easy for everyone to run a business through automation of financial services, accounting, payments, and taxes. At Bokio, we believe in the power of diversity and creative freedom to foster innovation.\nWe are now looking for a Senior Software Engineer to join our product teams. Product teams are empowered to shape the product direction, guided by clear company-wide objectives, and supported by everyone. We focus on building a user-friendly, reliable, and secure product that helps our users to manage their finances more efficiently, impacting user satisfaction, retention, and acquiring new customers. \nAs a Senior Software Engineer at Bokio, you will be providing technical leadership within the team, fostering a culture of continuous learning and improvement, promoting software craftsmanship for code quality, design, and testing. More details can be found below, but in a nutshell:\n  \nYou will be part of a small, cross-functional team that has full responsibility and accountability for their product area.\n\n \nYour main playground will be: C#, .NET, and React/TypeScript/CSS.\n\n \nYou will be expected to collaborate with other seniors to solve complex problems.\n\n \nYou'll play a vital role in mentoring and guiding other engineers. \n\n \nYou will be expected to communicate across the organization in spoken and written English.\n\n \n Sounds exciting? Join the team and help us make an already awesome product even better! \n Who you are \nYou really care about users and improving their experience when using a product. We use data and analytics to learn and adapt, and you'll play a crucial role in that process.\n\n \nYou bring energy and ideas to your work, ideating with project managers and designers, shaping the product direction and exploring technical approaches to solve user problems.\n\n \nYou are curious and are looking for ways to improve and grow.\n\n \nYou are a proactive communicator, comfortable sharing your ideas and challenging the status quo.\n\n \nYou promote close collaboration and mentorship with all of your colleagues.\n\n \nYou care about and use sound engineering practices to develop stable and maintainable software that can be relied on by others.\n\n What’s in your backpack You are knowledgeable and have experience of: \n.NET, C#\n\n \nReact, HTML, CSS, and TypeScript/JavaScript\n\n \nCI/CD\n\n \nMicrosoft Azure or similar infrastructure.\n\n \n It would be considered a bonus if: \nYou have/had your own company and understand the perils of running a small business.\n\n \nYou are familiar with accounting or fintech.\n\n \nYou have worked with single-page applications (SPA).\n\n \nYou have worked with applications where information security was critical.\n\n \nYou have experience of working with AI tools such as Windsurf or Cursor.\n\n \n \n \nWhat's in it for you \nAn opportunity to grow and learn from knowledgeable colleagues.\n\n \nA diverse workplace, with skilled and kind people from all over the world.\n\n \nA community of 5000+ Product Development professionals in fellow companies of Visma Group with active guilds in Software Engineering & Architecture, AI/ML, Cyber Security, Product Design, Product Management, etc.\n\n \nWe invest in your growth and learning by weekly dedicated learning time, training budget, learning platforms, etc.\n\n \nFlexible working hours and freedom to work in a hybrid-remote setup.\n\n \nAwesome offices in central Gothenburg & Stockholm.\n\n \n30 days vacation, comprehensive wellness grant, pension according to ITP levels, and other benefits.\n\n Location\nWe have a Hybrid work model with central offices in Gothenburg and Stockholm. This position is located in Gothenburg with the possibility to work hybrid remote.\nFinallyYou are welcome at Bokio for who you are, no matter where you come from or what you look like. Our platform is for everyone, and so is our workplace! We are creating a culture at Bokio where empathy, diversity, respect, and courage are front and center. Get a glimpse of what we are up to on our Linkedin or Instagram: Life at Bokio and Bokio App. \nAre you the one we are looking for? Apply now!\n Please note that Bokio conducts background screenings as a final part of all employment processes; detailed information will be shared closer upon or per request.",
    "url": "https://jobs.bokio.se/jobs/6028304-senior-software-engineer-fullstack?promotion=1505736-arbetsformedlingen",
    "published": "2025-06-09T18:08:03",
    "deadline": "2025-11-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29748451",
    "title": "Senior Software Engineer",
    "employer": "Qliktech International AB",
    "location": "Göteborg",
    "description": "What makes us Qlik?\nA Gartner® Magic Quadrant™ Leader for 15 years in a row, Qlik transforms complex data landscapes into actionable insights, driving strategic business outcomes. Serving over 40,000 global customers, our portfolio leverages pervasive data quality and advanced AI/ML capabilities that lead to better decisions, faster.\nWe excel in integration and governance solutions that work with diverse data sources, and our real-time analytics uncover hidden patterns, empowering teams to address complex challenges and seize new opportunities.\nThe Senior Software Engineer  \nJoin Qlik as a Senior Software Engineer and be at the forefront of shaping the future of AI in the data and analytics field. Contribute to developing innovative AI products, solving complex challenges, and pioneering the responsible and ethical implementation of AI.   \nWhat makes this role interesting? \nDiverse Use Cases: Design, develop, and maintain software systems that support a variety of AI applications, such as predictive, generative, and classification tasks.\nCollaborative Innovation: Work closely with AI engineers and software developers to build scalable solutions for AI-driven products. While your primary focus will be software development, you’ll have the opportunity to contribute to AI-related work and innovations as part of the team.\nEnd-to-End Ownership: Take full responsibility for the development, deployment, and monitoring of microservices. Ensure performance, reliability, and the real-world impact of the solutions you create for large global customers.\nMulticultural Environment: Join a diverse, dynamic team that fosters creativity, collaboration, and open communication.\nHere’s how you’ll be making an impact: \n• Collaborative Partnership: Work closely with colleagues across Development, Architecture, Data Science, Site Reliability Engineering (SRE), and Product Management throughout the software development lifecycle. Contribute to the analysis, design, and implementation of AI-powered tools and services.\n• Shaping Technology: Help define the architecture and infrastructure of AI-driven products by evaluating and implementing technologies that enhance scalability, maintainability, and reliability. Rapidly prototype and assess ideas to explore feasibility and drive innovation.\n• Software Development: Design, implement, test, troubleshoot, and debug software. Play an active role in defining and implementing test strategies with your team.\n• Best Practices & Quality: Drive high standards in performance, security, automation, and CI/CD to ensure robust and maintainable solutions.\nWe’re looking for a teammate with: \n• Education: Degree in Computer Science, Software Engineering, or a related field.\n• Experience: 7+ years in software development with a proven track record of delivering impactful solutions.\n• Programming Skills: Proficiency in Go, TypeScript, or Python, with the ability to adapt to new technologies.\n• Software Architecture: Experience with microservice development, writing clean, well-documented, and tested code.\n• Cloud & Infrastructure: Familiarity with cloud-native environments, container orchestration, and monitoring frameworks.\nThe location for this role is: \nGothenburg, Sweden   \n More about Qlik and who we are: \nFind out more about life at Qlik on social: Instagram, LinkedIn, YouTube, and X/Twitter, and to see all other opportunities to join us + our values, check out our Careers Page.\nWhat else do we offer?\nGenuine career progression pathways and mentoring programs\nCulture of innovation, technology, collaboration, and openness\nFlexible, diverse, and international work environment\n\n\n\nGiving back is a huge part of our culture. Alongside an extra “change the world” day plus another for personal development, we also highly encourage participation in our Corporate Responsibility Employee Programs \nQlik is an Equal Opportunity/Affirmative ActionEmployer, and we value the diversity of our workforce. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Click here to review the US Department of Labor’s Equal Employment Opportunity Posters, including the EEO is The Law notice and the Pay TransparencyNondiscrimination Provision.\nIf you need assistance due to disability during the application and/or recruiting process, please contact us via theAccessibility Request Form.\nQlik is not accepting unsolicited assistance from search firms for this employment opportunity. Please, no phone calls or emails. All resumes submitted by search firms to any employee at Qlik via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Qlik. No fee will be paid in the event the candidate is hired by Qlik as a result of the referral or through other means.",
    "url": "https://jobs.jobvite.com/qlik/job/oHdEvfwN",
    "published": "2025-06-05T10:26:08",
    "deadline": "2025-06-16T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29657095",
    "title": "Postdoc position logistics impacts of right-to-repair",
    "employer": "Chalmers Tekniska Högskola AB",
    "location": "Göteborg",
    "description": "The new Right-to-Repair directive will push manufacturers to enable repairs, empowering consumers and promoting circular economy. Yet, the logistics implications of this new directive, as well as other initiatives around repairability, is unclear. The postdoc will explore impacts and challenges for different actors involved, including ensuring a steady supply of spare parts, the complexities of managing reverse logistics for returned products, and the potential disruptions to existing distribution networks.\n\nAbout us and the research project\nThe division of Supply & Operations Management (SOM) conducts research, education and outreach activities related to logistics, operations management, and industrial marketing and purchasing. All of these areas relate to the broader field of supply chain management. Our research is problem-oriented and empirical, with strong emphasis on industry and societal relevance. Sustainability needs , digitalization, information technology developments and automation are focused drivers and enablers in our work. Our goal is to perform high quality research and education at bachelor, master and doctoral levels. \n\n The postdoc is expected to conduct high-quality research in a collaborative manner. Conducting interviews, workshops, and collecting case study data, translating the case observations into analytical representations, writing and presenting high quality papers, and being involved in teaching activities. Additionally, you will engage with our local networks, such as Northern Lead and Chalmers Transport Area of Advance as well as various international networks.\n\nWho we are looking for\nWe seek candidates with the following qualifications:\n\n\n\n• To qualify for the position of postdoc, you must hold a doctoral degree awarded no more than three years prior to the application deadline.\n• PhD in a relevant field (e.g., logistics, supply chain management, operations management, engineering, or related disciplines).\n• Experience with case study methodology and the ability to translate qualitative data into quantitative models.\n• A track record of high-quality publications.\n\nThe position requires sound verbal and written communication skills in English. Swedish is not a requirement but Chalmers offers Swedish courses.\n\nYou are expected to be somewhat accustomed to teaching, and to demonstrate good potential within research and education.\n\n* The date shown in your doctoral degree certificate is the date we use, as this is the date you have met all requirements for the doctoral degree. Exceptions from the 3-year limit can be made for longer periods resulting from parental leave, sick leave or military service.\n\nWhat you will do\nYour major responsibility as a postdoc is to perform your own research in a research group:\n\n\n• Conduct in-depth case studies on repairability and the \"right-to-repair\".\n• Analyze and interpret data to develop analytical models and representations.\n• Collaborate with interdisciplinary teams to integrate findings into broader research contexts.\n• Publish research findings in high-ranked journals and present at conferences.\n\nThe position may also include up to 20% teaching on undergraduate and master's levels as well as supervising master's and/or PhD students to a certain extent. Another important aspect involves collaboration within academia and with society at large. The position is meritorious for future research duties within academia as well as industry/the public sector.\n\nWhat we offer\nChalmers provides a cultivating and inspiring working environment in the coastal city of Gothenburg. \nRead more about working at Chalmers and our benefits for employees.\n\nChalmers aims to actively improve our gender balance. We work broadly with equality projects, for example the GENIE Initiative on gender equality for excellence. Equality and diversity are substantial foundations in all activities at Chalmers.\n\nIf Swedish is not your native language, Chalmers offers Swedish courses to help you settle in.\n\nContract terms\nThis postdoc position is a full-time temporary employment for two years, running from early 2026 towards the end of 2027.\n\nApplication Procedure\nPlease submit your application in English as PDF files according to the instructions below. Each file should not exceed 40 MB. Note: The system does not support Zip files.\n\n1. CV\nName the document as: CV, [Your Surname]. Include the following:\n\n\n• A comprehensive CV, including a complete list of publications.\n• Details of previous teaching and pedagogical experience.\n• Contact information for two references.\n\n2. Personal Letter\nName the document as: Personal Letter, [Your Surname]. Limit the letter to 1–3 pages and include:\n\n\n• A brief introduction about yourself.\n• A summary of your previous research fields and key research outcomes.\n• An outline of your future goals and research focus.\n\nUse the button at the foot of the page to reach the application form. \n\nPlease note: The applicant is responsible for ensuring that the application is complete. Incomplete applications and applications sent by email will not be considered.\n\nApplication deadline:  August 25, 2025\n\nFor questions please contact:\nPatricia van Loon, Associate Professor, Supply and Operations Management\nEmail: patricia.van.loon@chalmers.se\nPhone +46 31 772 18 75\n\nAla Arvidsson, Associate Professor, Supply and Operations Management \nEmail: ala.arvidsson@chalmers.se\nPhone +46 31 772 13 72\n\n\nWe look forward to your application!\n \n *** Chalmers declines to consider all offers of further announcement publishing or other types of support for the recruiting process in connection with this position. *** \n\nChalmers University of Technology in Gothenburg conducts research and education in technology and natural sciences at a high international level. The university has 3100 employees and 10,000 students, and offers education in engineering, science, shipping and architecture. With scientific excellence as a basis, Chalmers promotes knowledge and technical solutions for a sustainable world. Through global commitment and entrepreneurship, we foster an innovative spirit, in close collaboration with wider society.\n Chalmers was founded in 1829 and has the same motto today as it did then: Avancez – forward.",
    "url": "https://go.talentech.io/kSYiI",
    "published": "2025-04-25T12:44:55",
    "deadline": "2025-08-25T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29760353",
    "title": "Teknikintresserad? Gör din hobby till ett yrke - Tekniker",
    "employer": "MW Group AB",
    "location": "Göteborg",
    "description": "MW Group är ett modernt nordiskt totalförsvarsbolag som levererar teknik, tjänster och personal för Nordens samhällskritiska infrastruktur, totalförsvar samt privata företag och myndigheter. MW Group levererar tjänster till samhällsviktiga funktioner på den nordiska hemmamarknaden och utomlands om behovet är globalt. MW Group är partner med den svenska, finska och danska försvarsmakten.\t\t\t    \r\n\r\nHar du ett brinnande intresse för teknik, datorer eller programmering – även på fritiden? Då kan detta vara din nästa utmaning.\n\nVi söker nu en teknikintresserad person till en spännande tjänst som tekniker inom avancerade tekniska system hos en ledande aktör inom försvarsindustrin. Det här är en möjlighet att kombinera ditt tekniska intresse med ett arbete som verkligen gör skillnad.\n\nOm rollen som tekniker\n\nVi söker nu flera tekniker till en spännande och utmanande roll hos vår kund inom försvarsindustrin. Du kommer att arbeta i en dynamisk och tekniskt driven miljö där precision, säkerhet och innovation är av yttersta vikt. Arbetet innebär att du både kommer att vara involverad i teknisk installation och löpande underhåll, samt vara med och bidra till utvecklingen och optimeringen av system och lösningar.\n\nOm dig\n\nFör att trivas och lyckas i rollen bör du tycka om att skruva, bygga eller programmera även på din fritid. Som person har du ett genuint intresse för teknik, datorer, elektronik eller automation samt gillar att lösa problem och jobba praktiskt.\n\nFormella krav\n\n • Du har ett stort intresse för tekniska installationer och teknik.\n • Goda kunskaper i svenska och engelska, både tal och skrift.\n • Godkänd bakgrundskontroll.\n\nMeriterande\n\n • Bakgrund ifrån Försvarsmakten eller försvarsindustrin.\n • Erfarenhet och kunskap av programmering.\n • Teknisk utbildning ex. el- och energiprogrammet.\n\nOm MW Group\n\nMW Group är ett modernt nordiskt totalförsvarsbolag som levererar teknik, tjänster och personal för Nordens samhällskritiska infrastruktur, totalförsvar samt privata företag och myndigheter. MW Group levererar tjänster till samhällsviktiga funktioner på den nordiska hemmamarknaden och utomlands om behovet är globalt. MW Group är partner med den svenska, finska och danska försvarsmakten.",
    "url": "https://mwgroup.zerolime.se/show.aspx?src=AMS&id=77407DC0-A735-43EA-94C1-8E5BB356C92B",
    "published": "2025-06-10T12:09:10",
    "deadline": "2025-08-09T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29758385",
    "title": "High Performance Compute (HPC) Engineer",
    "employer": "Astrazeneca AB",
    "location": "Göteborg",
    "description": "HPC engineer Embark on a significant journey where your expertise in high-performance computing accelerates scientific discovery and impacts patient outcomes worldwide. \n\nWe are currently seeking a passionate, HPC engineer to join AstraZeneca's vibrant site in Gothenburg, Sweden. The ideal candidate will have extensive hands-on experience making an impact with HPC technology, delivering HPC services to a high quality, and able to relate to the scientific community and work closely with users to make the best use of research computing services. \n\nAbout the Role:  \n\nAt AstraZeneca, our Research Data & Analytics Team is at the cutting edge of transforming how we discover and develop medicine. As an HPC Engineer within the Scientific Computing Platform, you'll be crucial in delivering HPC services and solutions that drive progress in computational chemistry, imaging, multi-OMICs, AI and more. We're combining modern HPC with leading DevOps and cloud-native technologies to push the boundaries of biopharmaceutical research. \n\nThe HPC landscape is continually evolving. You will need the skills to help build and operate industry-leading capabilities, including application build frameworks, containerized applications and cloud software-as-a-service. Automated deployment is a key feature and you will need to be comfortable with DevOps processes and delivering consistency through automation and infrastructure-as-code. \n\nYour Impact:  \n\nBe part of a global team where your skills in high-performance computing empower innovative scientific solutions. Engage and collaborate with researchers and engineers to optimize workflows and deploy HPC capabilities that facilitate new discoveries. Your contribution will directly enhance the development of innovative medicines, improving patient outcomes globally. \n\nKey Responsibilities: \n\n * \n\nDevelop and operate cutting-edge research computing services and applications \n\n * \n\nAdopt Site Reliability Engineering principles to manage end-to-end HPC service operations, monitoring, and incident response \n\n * \n\nOptimize and solve complex technical problems in the HPC infrastructure and the cloud, collaborating closely with scientific users to enhance system utilization \n\nWhat You Bring: \n\n * \n\nProficiency in Linux environments for administration and programming \n\n * \n\nSolid skills in Python programming and bash scripting \n\n * \n\nHighly customer-focused, with the ability to communicate complex IT concepts to non-experts \n\n * \n\nExperience in working within a DevOps team using agile methodologies \n\n * \n\nExperience of building and operating services in the cloud \n\n Desired Skills and Expertise: \n \n\n * \n\nBackground in a scientific field or experience with computationally intensive scientific data analysis \n\n * \n\nExperience in large-scale HPC environments, parallel filesystems, and with tools such as SLURM and OpenStack \n\n * \n\nFamiliarity with configuration automation, software distribution frameworks, and cloud deployment, especially AWS \n\n * \n\nExpertise in AI/ML tools, parallel programming, and containerization technologies \n\n * \n\nUnderstanding of domain-specific applications like bioinformatics tools, simulation software, or high-performance data visualisation packages \n\nJoin AstraZeneca and play a pivotal role in advancing HPC technology to accelerate scientific breakthroughs. \n\nApply now to be a leader in HPC innovation at AstraZeneca! \n\n \n\nABOUT ASTRAZENECA \n\nAstraZeneca is a global, innovation-driven biopharmaceutical business that focuses on the discovery, development, and commercialisation of prescription medicines for some of the world's most serious diseases. But we're more than one of the world's leading pharmaceutical companies. At AstraZeneca, we're proud to have a unique workplace culture that inspires innovation and collaboration. Here, employees are empowered to express diverse perspectives and are made to feel valued, energised and rewarded for their ideas and creativity. \n\nWhere can I find out more? \n\nAstraZeneca Gothenburg site: https://www.astrazeneca.com/our-company/our-locations/gothenburg.html \n\nLife in Gothenburg: https://www.astrazeneca.se/om-oss/verksamheten-i-sverige/goteborg/relocate-to-gothenburg.htm",
    "url": "https://www.aplitrak.com/?adid=aGFubmEuc3RyYW5kYmVyZy40NTU4NC4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
    "published": "2025-06-09T14:55:24",
    "deadline": "2025-06-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29758233",
    "title": "Styr- och Reglertekniker Göteborg",
    "employer": "Iss Facility Services AB",
    "location": "Göteborg",
    "description": "Var 660:e person som går till arbetet i Sverige är en ISS-medarbetare och det är vi stolta över. Vi är ett av Sveriges och Nordens största tjänsteföretag samt har över 450 000 medarbetare världen över. Det är våra medarbetare som är kärnan i vår verksamhet och förutsättningen för att kunna leva upp till vårt syfte, Connecting people and places to make the world work better. På ISS Facility Services skapar vi platser och miljöer som bidrar till bättre prestationer och en enklare, mer effektiv och trivsam tillvaro - levererade med omtanke och hög kvalitet av engagerade medarbetare. Vill du också bli en del i vår globala organisation där ditt jobb verkligen gör skillnad?\r\n\r\nISS Facility Services har ett spännande samarbete med en kund inom fordonsindustrin med flertalet siter i Sverige. Vi söker nu en Drifttekniker inom Styr- och Reglerteknik till kundens site i Tuve. Är du en driven Tekniker med känsla för att utveckla fastigheter och liksom vi, känner passion för kund och service? Då har vi jobbet för dig!\n\nOm oss\nVi tar hand om våra kunders fastigheter, medarbetare och besökare. Vi är experter på fastighetstjänster och vi levererar servicelösningar till företag och offentlig verksamhet i hela Sverige. Vi säkerställer att fastigheter och arbetsplatser är så effektiva och inspirerande som möjligt. Med våra tekniska tjänster skapar vi förutsättningar för produktivitet samtidigt som vi minimerar risker.\n\nRollen\nSom Drifttekniker Styr- och Reglerteknik, ansvarar du för tillsyn, skötsel, optimering och felavhjälpande underhåll av fastigheter och dess tekniska systems styr- och reglerfunktioner. Du har i din roll daglig kommunikation med kund, medarbetare och leverantörer. Du kommer vara en viktig och värdefull del av ett dedikerat team av Tekniker som bidrar till att vår kunds lokaler och fastigheter förmedlar en helhetsupplevelse av en säker, attraktiv, modern och hållbar arbetsplats att vistas på för anställda och besökare. Jour och beredskap kan ingå. Tjänsten är en tillsvidareanställning med en inledande 6-månaders provanställning.\n\nExempel på arbetsuppgifter: \n\n• Injustering av styr- och reglerfunktioner för optimal drift av värme, kyla och ventilation. \n• Driftövervakning, larmhantering och optimering via styr-, regler- och övervakningssystem. \n• Kontroll och ändring av drifttider, drifttillstånd, börvärden och andra viktiga parametrar. \n• Felsökning, service och underhåll. \n• Ta fram och föreslå förbättringsåtgärder och alternativa lösningar inom fastighetsautomation. \n• Larmhantering. \n• Behjälplig vid analyser kring energi- och mediauppföljning. \n• Installation. \n\nDin bakgrund\nVi söker dig som har ECY-certifikat och erfarenhet inom automation/styr- och reglerteknik samt gärna minst 5 års erfarenhet inom området. Du har god kunskap om energioptimering samt styr- och övervakningssystem och olika typer av reglerfunktioners påverkan på inomhusklimat och driftstrategier. Förståelse för styrsystems uppbyggnad och nivåer, systemtillgänglighet, modern/smart teknik, skillnaden mellan traditionella och öppna system. Du har även processförståelse för värme, kyla, ventilation och styr- och reglersystems klimatpåverkan och funktionalitet. Du har B-kort.\n\nVi ser det som meriterande med kunskap inom HVAC, PLC-programmering och SCADA. Det är även meriterande om du har Heta arbeten och Truckkort.\n\nPersonliga egenskaper\nVi ser att du är en driven person som söker förbättringsmöjligheter och för dialog kring dessa med berörda personer. Du ser nyttan av att arbeta planerat och strukturerat, där du har förmåga att arbeta förebyggande. Du är serviceinriktad och har en positiv och tillmötesgående karaktär. Du är även duktig på att kommunicera med olika människor där du inser vikten av att ha god dialog kring pågående arbeten. Vi värderar ditt personliga och prestigelösa engagemang högt samt din förmåga att lösa hastigt uppkomna situationer. Din kommunikativa förmåga, som du anpassar efter situation och individ, är mycket god. Du talar och skriver svenska obehindrat samt har goda IT-kunskaper.\n\nVi erbjuder \nSjälvklart erbjuder vi dig en trygg anställning hos ISS. Du kommer att arbeta nära kompetenta medarbetare som du kommer få stort utbyte av, då vi värnar om att hjälpa och utveckla varandra. ISS storlek och breda tjänsteutbud bidrar till att det finns goda utvecklingsmöjligheter såväl nationellt som globalt. Vårt fokus ligger i att ta hand om och utveckla våra medarbetare, för vi tror på att ”People make places”. ISS erbjuder bland annat utbildningar och talangprogram – allt för att du ska engageras och utvecklas på jobbet. \n\nISS värderingar är kvalitet, ansvar, ärlighet och entreprenörskap. Dessa värderingar kommer att vara fundamentala i hur vi arbetar. Därför är det viktigt att du känner att du står för ett arbetssätt och ett förhållningssätt som är i enlighet med dessa. \n\nDin ansökan \nVi hoppas att vi väckt ditt intresse och vi ser fram emot din ansökan!\nOBS! Med anledning av GDPR, hanterar vi inte ansökningar inkomna via mail.\n\nAnsvarig rekryterare: Pernilla Dahlbäck - pernilla.dahlback@se.issworld.com\n\nVarmt välkommen med din ansökan!",
    "url": "https://iss.onecruiter.com/jobs/296398-styr-och-reglertekniker-goteborg?ref=platsbanken",
    "published": "2025-06-09T14:37:25",
    "deadline": "2025-07-04T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29758170",
    "title": "DevOps Engineer",
    "employer": "Visit Group International AB",
    "location": "Göteborg",
    "description": "Are you a problem-solver who thrives on improving systems, streamlining workflows, and building reliable infrastructure? We’re looking for a skilled DevOps Engineer to help shape the foundation of our platform. At Visit Group, you'll be part of a curious and collaborative team solving real-world problems for thousands of users in the travel and tourism industry. \nIf you're excited about building the backbone that powers seamless deployments and scalable platforms and want to work where experimentation is encouraged and success is shared, you’ll feel right at home. \nKey Responsibilities  As a DevOps Engineer, you’ll play a vital role in modernizing our platform infrastructure, accelerating developer workflows, and enhancing service reliability. You will: \n Design, maintain, and scale our hybrid cloud infrastructure (public/private). \n  Champion Infrastructure as Code and CI/CD using tools like Ansible and Terraform. \n  Operate and improve Kubernetes clusters for workload orchestration and scalability. \n  Build tools and frameworks to boost developer productivity and enable self-service deployments. \n  Collaborate closely with development teams to automate provisioning, configuration, and deployments. \n  Contribute to disaster recovery planning and high availability strategies. \n \n Your Profile \n 5+ years of experience \n  Experience working with Kubernetes for orchestration and scalability \n  Experience managing both Windows and Linux environments \n  Experience with virtualization technologies (e.g., VMware, Hyper-V) \n  Experience working with cloud technologies (Azure, AWS) \n  Experience with IaC (e.g Terraform) \n  Automation using Python, Bash, or PowerShell. \n  Experience working with networking, DNS, AD, certificates, and security best practices. \n  Experience working with both relational and non-relational databases, including SQL Server and MongoDB \n  Experience working with observability and monitoring (Grafana, Prometheus or similar). \n  Knowledge about message brokers (e.g., RabbitMQ, ServiceBus) would be advantageous \n  Are passionate about DevOps culture, automation, and making life easier for developers. \n  Enjoy knowledge sharing, experimenting, and learning by doing. \n \n Why Visit Group?  At Visit Group, we value a unique blend of professionalism, personality, and passion. We seek individuals who bring self-confidence, problem-solving skills, and an interest in sustainable development practices. Our office culture emphasizes collaboration, learning, and creating enjoyable experiences for our team and our clients. \nInterested? - We’d love to hear from you! Apply now and let’s build the future of payment technology together. \nAbout Visit Group  Visit Group is a leading European software provider specializing in technology solutions for the tourism industry. Founded in 1999 and headquartered in Gothenburg, Sweden, the company has grown to become a leader in the travel technology sector. We offer a comprehensive digital ecosystem that includes property management systems, booking systems, ticketing and e-commerce platforms, and travel switches for various segments of the tourism industry. Our product portfolio includes Citybreak, BookVisit, iTicket, VisBook, and WebX. \nWith over 20 years of experience, we serve more than 3,000 customers across 25 countries, including tourism organizations, accommodations, tours, and activity vendors worldwide. Our solutions enable inbound tourism businesses, such as hotels, ski resorts, tour operators, and destination marketing companies, to sell, combine, and distribute tourism products sourced from hundreds of external inventory platforms.",
    "url": "https://superstar.visitgroup.com/jobs/6027637-devops-engineer?promotion=1505352-arbetsformedlingen",
    "published": "2025-06-09T14:23:03",
    "deadline": "2025-11-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29756824",
    "title": "Senior DevSecOps Engineer",
    "employer": "Volvo Business Services AB",
    "location": "Göteborg",
    "description": "Transport is at the core of modern society. Imagine using your expertise to shape sustainable transport and infrastructure solutions for the future? If you seek to make a difference on a global scale, working with next-gen technologies and the sharpest collaborative teams, then we could be a perfect match. \n \nEmbark on an exciting journey with Volvo Group and uncover your IT prowess. Our DevSecOps team is eager to welcome you into a vibrant, multicultural setting where innovation and collaboration flourish. \nWhat you will do\nAs a DevSecOps Engineer, you play a pivotal role in shaping the future of digital initiatives centered around Aftermarket solutions on the Azure platform. Your mission involves identifying requirements and implementing the Software Development Life Cycle (SDLC), crafting CI/CD strategies, and ensuring the highest standards of code quality and security. \nWho are you?\nYour expertise in the Azure Cloud platform, vulnerability management, and security automation will be crucial. You’ll delve into Docker Container platforms (OpenShift, AKS or ECS), navigate code repositories, and contribute to the security of operating systems. Alongside Solution Architects, Data Engineers, and Software Engineers, you'll co-create highly scalable and high-performance software, engaging closely with stakeholders to define requirements and deliverables.\nYour background\nYour expertise in the Azure Cloud platform, vulnerability management, and security automation will be crucial. You’ll delve into Docker Container platforms (OpenShift, AKS or ECS), navigate code repositories, and contribute to the security of operating systems. Alongside Solution Architects, Data Engineers, and Software Engineers, you'll co-create highly scalable and high-performance software, engaging closely with stakeholders to define requirements and deliverables.\n \nYou should have:\n \nExperience in Azure Cloud platform including Azure CEP, certificate is a plus \nExperience and knowledge around vulnerability management and security automation (SAST, SCA, DAST, container vulnerability) \nKnowledge and hands on experience on monitoring, measuring operational effectiveness \nHands on experience in code repository/ CI&CD including Github Actions, Azure DevOps Pipelines, Gitlab and other \nExperience with OS security involving Active Directory, Windows networking, Group policies, DNS, PKI and Certificates \nHas familiarity with Linux, Database and Application server’s administration in production environment \nExperience in scripting languages like Powershell, Bash \n\n \nAn Ops background, knowledge of code quality and security tools, and familiarity with network configuration are valuable assets and are nice to have for this position. A strong merit would be if you're well-versed in Azure tools and services and have a knack for technologies like Databricks, Nginx, and Helm, we want to hear from you. \nWhat’s in it for you?\nWe offer a solid package of compensation and benefits, plus you will enjoy: \n \n A company that supports diversity, equity & inclusion \nA new organization with highly skilled professionals from diverse backgrounds \nColleagues with innovative mindset, always ready to support and share information \nA supportive Manager enabling your professional growth \nOpportunities to develop, build a career and work globally or cross-functionally \n\n \nThis opportunity is based in the vibrant city of Gothenburg, Sweden. If you see yourself in this narrative and bring a bachelor's or master's degree with experience as a DevSecOps engineer, seize the moment and join us at Volvo Group! Be part of an extraordinary team, shaping the future of technology and innovation. Apply now. \n \nWe value your data privacy and therefore do not accept applications via mail. \n \nWho we are and what we believe in \nOur focus on Inclusion, Diversity, and Equity allows each of us the opportunity to bring our full authentic self to work and thrive by providing a safe and supportive environment, free of harassment and discrimination. We are committed to removing the barriers to entry, which is why we ask that even if you feel you may not meet every qualification on the job description, please apply and let us decide.\n \nApplying to this job offers you the opportunity to join Volvo Group.Every day, across the globe, our trucks, buses, engines, construction equipment, financial services, and solutions make modern life possible. We are almost 100,000 people empowered to shape the future landscape of efficient, safe and sustainable transport solutions. Fulfilling our mission creates countless career opportunities for talents with sharp minds and passion across the group’s leading brands and entities. \n \nGroup Digital & IT is the hub for digital development within Volvo Group. Imagine yourself working with cutting-edge technologies in a global team, represented in more than 30 countries. We are dedicated to leading the way of tomorrow’s transport solutions, guided by a strong customer mindset and high level of curiosity, both as individuals and as a team. Here, you will thrive in your career in an environment where your voice is heard and your ideas matter.",
    "url": "https://career55.sapsf.eu/sfcareer/jobreqcareerpvt?jobId=20767&company=volvoinfor&st=02D9DFCC4FC1EBB0CE9DE3A9AF3795D46F8DEFD0",
    "published": "2025-06-09T10:21:58",
    "deadline": "2025-06-24T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29751132",
    "title": "Senior Software Engineer",
    "employer": "Baronit AB",
    "location": "Göteborg",
    "description": "About Baronit:\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Automotive, Fintech, Healthcare, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Fullstack Engineer to join our dynamic team. This role requires a strong foundation in both backend and frontend development, coupled with extensive experience in cloud platforms and DevOps practices. You will collaborate closely with cross-functional teams to deliver scalable, reliable solutions that align with our clients’ goals.\nKey Responsibilities:\nDesign, build, and maintain robust backend and frontend applications, ensuring high performance and scalability.\nDevelop and manage scalable CI/CD pipelines to automate software delivery and deployment processes using tools like Jenkins, Git, and Azure DevOps.\nOptimize and manage cloud infrastructure on AWS, ensuring high availability, performance, and cost-efficiency.\nContainerization & Orchestration: Deploy, manage, and monitor containerized applications using Docker and Kubernetes.\nUtilize Infrastructure as Code (IaC) tools like Terraform, Biceps, and Ansible for cloud resource provisioning and automation.\nImplement and maintain observability solutions using Grafana, Prometheus to ensure system health and performance.\nWork within Agile/Scrum environments, closely collaborating with cross-functional teams to deliver high-quality products.\n\nRequirements:\nAcademic degree in Computer Science, Engineering, or a related field.\n7+ years of experience in full-stack development or similar.\nProficiency in backend languages such as Java (Spring Framework, Spring Boot), JavaScript, Go, NodeJS and Python.\nFrontend frameworks like React or Angular.\nCloud technologies primary Azure or AWS but also Google Cloud\nDevOps methodologies e.g. Continuous Integration (CI) and Continuous Delivery (CD) like Jenkins, GitLab, GI, pipelines, Kubernetes or similar\nMicroservice architecture, e.g. AWS cloud services\nREST and RESTFUL API\nContainer runtime and orchestration e.g. Kubernetes and Docker in AWS and/or Azure\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSocial activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
    "url": "baronit.se",
    "published": "2025-06-04T15:33:13",
    "deadline": "2025-11-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29738651",
    "title": "R&D Manager",
    "employer": "Cpac Systems AB",
    "location": "Göteborg",
    "description": "We’re looking for an R&D Manager to co-lead one of our development departments at CPAC Systems. If you’re excited by technology, comfortable with complexity and genuinely enjoy helping both people and ideas grow this could be your next step. \nCPAC Systems develops advanced control systems for marine and industrial applications. Since 1999, we’ve been turning complex operations into intuitive experiences. From drive-by-wire to intelligent automation, we work at the intersection of safety, efficiency and user experience. We are proudly part of Volvo Group where our role is to lead advanced technology development and explore the next generation of smart control systems.\nThe RoleYou’ll lead a group of highly skilled engineers working on cutting-edge product development. This is a hands-on leadership role where you’ll work both strategically and operationally: coaching people, managing projects, solving technical problems and shaping how we work.\nResponsibilities Leading a cross-functional development team and being part of their daily work\n Driving product development within both software and hardware, from idea to delivery in customer projects\n Coaching engineers and building a team that thrives\n Taking ownership of delivery, quality and budget\n Making sure we work smart, continuously improving our methods and processes\n Collaborating with other leaders to align tech, organization and business goals\n Being part of a project team yourself to stay close to the technology\n Key Qualifications\nYou probably have a background in software, embedded systems or systems engineering. You’ve worked in product development and you’ve led people in a technical environment. You like digging into the details but never lose sight of the bigger picture.\n Has experience in product development, ideally within embedded or software-heavy systems\n Enjoys technical problem-solving and isn't afraid to challenge the status quo\n Is confident in your leadership: listens, supports, drives motivation\n Communicates clearly and builds trust across teams\n Thinks long-term and makes decisions with both people and product in mind\n Why CPAC Systems? You’ll work on real tech that makes a real difference for real users\n You’ll be part of a collaborative, curious and driven team\n You’ll get the freedom to explore, question, build and improve\n You’ll join a company that combines the agility of a tech firm with the muscle of a world-leading industry group\n Curious?\nIf you're excited to make a significant impact and want to be a part of our innovative team, we'd love to learn more about you. Submit your application today and don't hesitate to reach out to Malin Lindebjörn with any questions you may have.",
    "url": "https://careers.cpacsystems.se/jobs/5987800-r-d-manager?promotion=1491722-arbetsformedlingen",
    "published": "2025-05-28T16:53:53",
    "deadline": "2025-11-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29738599",
    "title": "Mjukvarutestare med fokus på systemintegration och DevOps",
    "employer": "Consat Engineering AB",
    "location": "Göteborg",
    "description": "Sedan 1986 har vi haft möjligheten att hålla på med det vi älskar – att göra skillnad för många människor världen över genom teknik. Consat är ett av Sveriges ledande ingenjörsbolag som skapar förutsättningar för att samhället ska kunna utvecklas i jämn takt med digitaliseringen. Nu letar vi efter nya medarbetare som vill jobba med spetsteknik, och göra Consat ännu bättre.\n \nInformation om rollen\nSom testingenjör arbetar du med att bygga, testa och leverera komplexa mjukvarusystem i både fysiska och virtuella miljöer. Du ansvarar för integration, konfigurationshantering och kontinuerlig förbättring av CI/CD-flöden, med fokus på kvalitet och automation. Rollen kräver en bred teknisk förståelse, erfarenhet av DevOps-verktyg, nätverkskonfiguration och scriptbaserad automation. Du trivs med att samarbeta, men är också självgående och initiativtagande. Genom ditt arbete skapar du förutsättningar för effektiva och tillförlitliga leveranser i tekniskt avancerade utvecklingsmiljöer.\n \nVad vi kan erbjuda dig:\n En kreativ och stimulerande arbetsmiljö med möjlighet att arbeta med ledande teknologier\n Möjlighet att utveckla dina kunskaper och ta ansvar i spännande projekt\n Stimulerande testuppdrag där du utvecklas som testare och får kravställa, automatisera eller tom ibland utföra manuella tester. I bästa fall en blandning!\n \n \n \nVi letar efter dig som har:\n Kunskap inom tekniker som scriptad testning och/eller exploratory testing\n Erfarenhet av testexekvering i komplexa systemmiljöer\n  Förståelse för programmeringsspråk såsom C, C++, Python och Java\n  Erfarenhet av DevOps-verktyg såsom Git, Jenkins, Docker, Ansible och Kubernetes\n Praktisk erfarenhet av CI/CD-processer och verktyg för automatiserad test- och leveranspipeline\n Certifiering inom test, t.ex. ISTQB \n  Erfarenhet av kravhanteringsverktyg detta med? \n En teknisk högskole- eller civilingenjörsexamen\n God kommunikationsförmåga i svenska och engelska, både i tal och skrift\n \n \n \nVi ser gärna att du också:\n Har ett par års erfarenhet av arbete med elektronikbaserade system\n  Har en hög grad av noggrannhet och strävar efter hög kvalitet i arbetet\n  Har tidigare erfarenhet från försvarsindustrin (meriterande)\n \nÖvrigt:\nEftersom tjänsten kan innebära arbete med försvarssekretess krävs:\n Svenskt medborgarskap\n  Att du genomför och godkänns i en säkerhetsprövning med registerkontroll\n \n \n \nKontakt:\nFör frågor om tjänsten kontakta: Taimaz Begdjani, taimaz.begdjani@consat.se\nVår långsiktiga syn på våra medarbetare har bidragit till att Consat för trettonde året i rad har utsetts till ett av Sveriges 100 Karriärsföretag! Läs mer på: www.consat.se  & Din karriär börjar här - Consat (teamtailor.com)",
    "url": "https://careers.consat.se/jobs/5988075-mjukvarutestare-med-fokus-pa-systemintegration-och-devops?promotion=1491692-arbetsformedlingen",
    "published": "2025-05-28T16:42:43",
    "deadline": "2025-11-14T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29738097",
    "title": "CI/CD Engineer",
    "employer": "Tata Technologies Nordics AB",
    "location": "Göteborg",
    "description": "At Tata Technologies we make product development dreams a reality by designing, engineering and validating the products of tomorrow for the world’s leading manufacturers. Due to our continuous grow Tata Technologies Nordics AB is now looking to recruit a CI/CD Engineer to join our team in Gothenburg, Sweden.\nThe role\nWe’re looking for a CI/CD Engineer to support software development in the automotive embedded systems space. Your main job is to build and improve automated pipelines for software build, test, and deployment. You'll work closely with developers and testers to make sure everything runs smoothly and efficiently.\nKey Responsibilities\nDesign and maintain CI/CD pipelines to automate software builds, testing, and deployment.\nTroubleshoot and fix issues in the CI environment (e.g., Jenkins, Docker).\nCollaborate with development and QA teams to ensure effective integration and delivery processes.\nWrite scripts and tools (mainly in Python and Groovy) to improve automation and reduce manual work.\nContinuously optimize build and test workflows for speed and reliability.\nHelp maintain and manage tools like Jenkins, Gerrit, Artifactory, and Docker.\n\nRequirements\nStrong experience in CI/CD, especially for embedded software.\nHands-on knowledge of:\nJenkins, Docker,\nGerrit\nArtifactory\nLinux and WSL (Windows Subsystem for Linux)\nScripting skills in Python and Groovy.\nExperience with automated build systems and software deployment workflows.\nGood problem-solving and communication skills.\nBachelor’s degree in computer science, Engineering, or related field.\n\nMeritourius \nExperience with safety-critical systems or AUTOSAR Classic.\nBackground in C programming.\nKnowledge-sharing mindset and team spirit.\nProactive, self-driven, and quality-focused attitude.\n\nIf you are passionate about bringing innovation to the projects you work on and want to join a global company, then this is the place for you.\nTata Technologies: Engineering a better world.\nTata Technologies would like to thank all applicants for their interest, each application will be reviewed against the set criteria for the role. We would like to advise that only candidates under consideration will be contacted. If you do not hear from us within 10 working days following the closing date it will mean that unfortunately your application has not been successful. We will however retain your details for any suitable future opportunities.",
    "url": null,
    "published": "2025-05-28T15:19:38",
    "deadline": "2025-06-27T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29709322",
    "title": "Head of IT",
    "employer": "Garantigruppen i Norden AB",
    "location": "Göteborg",
    "description": "Location: Gothenburg, Sweden (Hybrid)\nCompany: Garantigruppen AB – A Leading Car Warranty Provider\nSalary: Competitive\nAbout Garantigruppen AB\nGarantigruppen AB is a trusted and fast-growing name in the Nordic automotive sector. We specialize in delivering transparent, reliable car warranty solutions that give both customers and dealers peace of mind. From our headquarters in Gothenburg, we are driving digital transformation in a traditionally slow-moving industry — and we’re just getting started.\nWe are now looking for a strategic, hands-on Head of IT to lead our technology vision and scale our platform to new heights.\nThe Role\nAs CTO, Head of IT, you’ll be part of the executive leadership team and will play a key role in shaping and executing our technology strategy. You’ll have end-to-end responsibility for our digital products, platform development, infrastructure, and tech team. If you're excited by building scalable solutions and leading through both vision and action, this is your chance to make a real impact.\nKey Responsibilities\nDefine and drive a long-term technology roadmap aligned with our business goals\n\n\nLead the development and scaling of our warranty platform and digital ecosystem\n\n\nBuild and manage a high-performing engineering team (in-house and/or outsourced)\n\n\nEnsure secure, reliable, and compliant infrastructure and data handling\n\n\nCollaborate cross-functionally to turn user needs into technical solutions\n\n\nChampion innovation, including automation and AI-driven tools\n\n\nManage technology budgets, timelines, and vendor relationships\n\n\n\nWhat We’re Looking For\nProven experience as CTO or senior technology leader in a product-oriented company\n\n\nSolid foundation in software engineering, architecture, and cloud platforms (AWS, Azure, etc.)\n\n\nStrong leadership skills with experience building and mentoring teams\n\n\nFluent in English (Swedish is a plus)\n\n\nStrategic mindset with a willingness to dive into technical details\n\n\nExperience with platform integrations, APIs, and customer-facing systems\n\n\n\nBonus\nBackground in automotive, warranty services, insurance, or other regulated sectors\n\n\nKnowledge of cybersecurity standards and data protection practices\n\n\nScale-up or startup experience with a focus on rapid growth\n\n\n\nWhat We Offer\nA key leadership role in a fast-growing company with strong market traction\n\n\nCompetitive salary: Competitive salary\n\n\nReal influence over an industry undergoing digital change\n\n\nA collaborative, open-minded team that values innovation\n\n\nModern office in central Gothenburg + flexible working arrangements\n\n\n\nIf you’re a visionary tech leader eager to build something meaningful in a high-potential market — we want to hear from you.\nApply now or reach out directly to learn more!",
    "url": null,
    "published": "2025-05-16T14:03:09",
    "deadline": "2025-06-15T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29704294",
    "title": "Business Application Specialist",
    "employer": "Telavox AB",
    "location": "Göteborg",
    "description": "Join Billiant as Business Application Specialist  \nAre you passionate about solving real business problems with smart system configurations and a customer-first mindset? At Billiant – a Telavox company, we are looking for a Business Application Specialist who loves diving into SQL, understanding how systems tick, and working closely with both customers and developers to drive product excellence. This is your opportunity to be part of a smaller, agile team where your contributions have a real impact. You’ll be supporting and implementing our powerful business system for customers and partners, becoming a key player in how our clients succeed. \n\nAbout the job  \nAs a Business Application Specialist at Billiant, you’ll work at the heart of our product and customer ecosystem. Your mission: to ensure our customers get the most out of our system by configuring solutions, solving complex issues, and supporting technical back-office needs. You’ll act as the bridge between customer requirements and product functionality. Your work will be hands-on and varied, from troubleshooting urgent invoice or subscription issues to planning and implementing long-term improvements. You’ll also participate in system upgrades and implementation projects, occasionally during evenings or nights, ensuring smooth transitions for our customers. \nYour day-to-day work may include:\n \nSupporting customers with advanced system configurations and database queries using SQL. \n\n \nLeading the configuration and implementation of our business system for new and existing customers. \n\n \nCollaborating closely with developers to refine our product based on real user needs. \n\n \nHandling both quick-turnaround customer cases and more strategic, large-scale system enhancements.\n\n \nParticipating in major system upgrades and onboarding projects, ensuring technical accuracy and customer satisfaction.\n\n  About you \nYou’re an experienced system professional who thrives on solving technical puzzles and making systems work smarter. You have strong SQL skills, a passion for IT systems, and a keen understanding of how to automate and optimize business processes. You enjoy helping others, and you're driven by accountability, service, and quality.You love collaborating across roles, support, development, and customers. \nKey skills and experience we’re looking for: \nSolid SQL skills and strong system knowledge \n\n \nA background in systems science or equivalent IT education \n\n \nExperience with web services and integrations (REST/SOAP over HTTP) \n\n \nAnalytical thinking and a proactive, problem-solving mindset \n\n \nStrong communication skills in Swedish and English \n\n \nA genuine interest in improving how businesses use software \n\n Good-to-have: \nExperience in implementation projects or system upgrades \n\n \nKnowledge of business systems or back-office processes \n\n \nFamiliarity with automation of business logic and reporting tools \n\n \nYour ability to combine technical understanding with a customer-first approach makes you a great fit for this role. At Billiant, you’ll be empowered to shape how our system delivers value, while growing alongside a talented, tight-knit team. \nJoin us at Billiant \nAt Billiant, we have been working with BSS solutions and developing our own BSS platform since early 2000—for more than twenty years! Today, the product is an extensive and advanced framework for creating solutions for telecom operators in several countries throughout Europe. We are constantly developing new and enhanced features based on our customers’ needs and market trends, where quick time to market and flexibility are our guiding principles.\nToday, Billiant is part of the Telavox group, which is fast-growing and profitable. The group has +1.9b in revenue, +500 Telavoxers in nine countries. We pride ourselves on creating an inclusive, supportive culture where everyone can thrive. By joining us, you will not only contribute to our technology but also be part of a company that values work-life balance, continuous learning, and community. Plus, you will enjoy our legendary company events, personal development opportunities, and much more  \nHow to apply! At Biiliant, we don't focus on fitting in; we focus on making room for everyone. We’re always on the lookout for great talent, so applications are reviewed continuously. If you're ready to be part of an innovative, AI-driven telecom company, apply today with your CV and cover letter in English.  \nFor any questions, feel free to reach out to Talent Acquisition Partner Ami Faraguna at ann-marie.faraguna@telavox.com    Learn more about what we do!",
    "url": "https://career.telavox.com/jobs/5931638-business-application-specialist?promotion=1470412-arbetsformedlingen",
    "published": "2025-05-15T08:49:55",
    "deadline": "2025-11-01T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29681265",
    "title": "Technical Project Manager",
    "employer": "Cpac Systems AB",
    "location": "Göteborg",
    "description": "Are you passionate about technology and eager to lead projects that push the boundaries of innovation? Do you excel in fast-paced environments where new ideas are not just welcomed, but actively embraced? We’re looking for a talented Project Manager to join our team and leverage your diverse skill set to drive impactful solutions. \nAt CPAC, we believe that innovation thrives on diverse perspectives. Whether you're a basketball coach, a photography enthusiast, or a gourmet chef, we value the unique experiences and approaches you bring. When a gardening enthusiast collaborates with a hard rocker or a yoga fan we see new ideas flourish, delivering cutting-edge solutions for trucks, excavators, boats, and more.\nReady to lead the development of breakthrough products in automation, control, and autonomous vehicles? Join us in shaping the future of the automotive industry!\nResponsibilities\n Demonstrating a deep understanding of technical aspects and shouldering responsibility for the project's technical scope.\n Staying ahead of industry developments, rallying the team, and effectively addressing challenges and ideas.\n Efficiently managing project budgets, allocating resources, and maintaining strong relationships with customers and suppliers.\n Immersing yourself in an industry characterized by rapid progress, ensuring that you're always engaged where significant developments are taking place.\n \nKey qualifications \n Communicative leadership: Lead the team effectively through clear and concise communication while fostering collaboration among team members.\n Advanced technical product development: Lead projects involving cutting-edge technical solutions and innovations.\n Expertise in integrated systems: Demonstrate a understanding of integrated systems and their complexities.\n Educational background in relevant fields: Ideally in mechatronics, electrical engineering, or data science.\n Thriving in a fast-paced environment: Excel in a dynamic workplace where challenges are met with enthusiasm and agility.\n \nHow to apply\nIf you're excited to make a significant impact and want to be a part of our innovative team, we'd love to learn more about you. Submit your application today and don't hesitate to reach out to recruiter William Lindh with any questions you may have.",
    "url": "https://careers.cpacsystems.se/jobs/5895754-technical-project-manager?promotion=1458251-arbetsformedlingen",
    "published": "2025-05-06T14:38:55",
    "deadline": "2025-10-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29608970",
    "title": "Senior Network Engineer",
    "employer": "Danda AB",
    "location": "Göteborg",
    "description": "Automotive customer develops and produces world-class hybrid engines and transmissions. With factories on two continents - Sweden and China - we're a pioneering global supplier of propulsion technology, development services and contract manufacturing. The brand brings together over 9,000 dedicated and determined people that design, develop, and manufacture next-generation powertrain solutions for a global market.\nCustomer is part of HORSE Powertrain Limited, a global leader in powertrain solutions. The Group has 19,000 employees, 17 plants and 5 R&D centers across three continents. We partner with OEM customers around the world and offer innovative solutions that can cater to up to 80% of the growing hybrid and combustion powertrain market, enabling a faster transition toward cleaner mobility.\n \nAt Customer, we are committed to diversity and inclusion. We welcome applicants from all backgrounds and believe that different perspectives and experiences make for a stronger, more innovative company.\n\nAssignment description\nFor Customer We are seeking highly skilled Senior Network Engineers to join the Global Team responsible for designing, implementing, and managing the organization’s network infrastructure. As part of this collaborative and dynamic team, you will contribute to ensuring the security, reliability, and performance of both wired and wireless network systems.\nAdditionally, you will play a critical role in optimizing solutions such as Cisco ISE, Catalyst Center, and PRTG, leveraging your expertise with these tools - or equivalent technologies - to drive operational excellence. There is a rotating on-call schedule which is required in this position.\n\n\nRequired skills:\n Bachelor's degree in Computer Science, Information Technology, or a related field.\n Professional certifications such as CCNA, CCNP, or their equivalent.\n Proficiency in network protocols and technologies—especially 802.1X.\n Hands-on monitoring and automation experience.\n Solid experience managing firewalls (e.g., Fortigate, Palo Alto).\n In-depth knowledge of technologies like SD-WAN and MPLS.\n \n\nDesired skills:\n Comprehensive understanding of network security principles and best practices.\n Proficiency with network monitoring and management tools.\n Solid experience in wireless networking technologies, including:\n 802.11 standards\n WiFi security protocols (e.g., WPA2, WPA3)\n WiFi deployment best practices\n Hands on experience with Infrastructure as Code e.g., Terraform\n Experience with Software-Defined Networking (SDN)",
    "url": "https://jobb.danda.se/jobs/5780193-senior-network-engineer?promotion=1416958-arbetsformedlingen",
    "published": "2025-04-07T10:49:46",
    "deadline": "2025-09-24T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29558508",
    "title": "Accountant",
    "employer": "Danda AB",
    "location": "Göteborg",
    "description": "Based in Gothenburg, you will collaborate with a colleague to manage the accounting and reporting for one of our sales companies within the Automotive customer. Your responsibilities will include preparing and performing various accounting services, reporting financial figures, and contributing to a wide range of projects.\n\nQualifications\nExtensive experience working with large international manufacturing companies\nProficiency in SAP and Hyperion FM\nStrong understanding of finance processes and systems, with the ability to implement and drive them efficiently and effectively\nInterest in data analysis, automation, and digitalization, which is advantageous for this position\nDegree in Business Administration or a related field.\n\nYou will also play an active role in improving and standardizing current processes. Your role will involve working with our Global Accounting Centre in Madrid, local country-specific contacts, stakeholders at headquarters, auditors, and tax advisors. During monthly closings, you will take a leading role to ensure high-quality reporting within the area.\n\nTo succeed in this role, you should have a strong desire and drive for change, be comfortable with complex accounting questions in IFRS, and manage accounting differences with local market GAAP. Your analytical skills and computer proficiency should be strong, and you should be able to grasp the big picture. Experience with SAP R/3 and Hyperion FM is advantageous. Additionally, you should have a university degree in Finance, relevant work experience, and fluency in Swedish and English, both verbally and in writing.\n\nA high level of integrity, a positive attitude, flexibility, and excellent communication skills are essential for success in this role.",
    "url": "https://jobb.danda.se/jobs/5702277-accountant?promotion=1390795-arbetsformedlingen",
    "published": "2025-03-19T15:56:41",
    "deadline": "2025-09-05T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29522482",
    "title": "Network & Datacenter Engineer",
    "employer": "Consilium Safety Group AB",
    "location": "Göteborg",
    "description": "About Consilium Safety Group Consilium Safety Group is a global leader in fire, flame, and gas safety solutions for marine, energy, rolling stock, and buildings. With over 55 offices worldwide and 1,000 employees, we combine innovation with intelligent detection to protect lives, values, and the planet.\nAbout Consilium Digital Core Our mission is to build a secure, cloud-driven IT organization that supports our global operations. The Digital Core team drives cloud-first strategies, automation, and AI-powered operations, ensuring a scalable and secure digital infrastructure.\nThe Role Network & Datacenter Engineer Join our Platform Team and play a key role in managing our global datacenter, network, and Azure cloud environment. You'll ensure optimal performance, security, and connectivity across our infrastructure.\nYour Key Responsibilities\n Design, implement, and maintain global network infrastructure (LAN, WAN, SD-WAN, VPN, wireless).\n Configure and troubleshoot enterprise networking equipment (Cisco, Juniper, Fortinet, Palo Alto).\n Oversee firewalls, IDS/IPS, VPN solutions, and Azure networking (VNet, ExpressRoute, NSG, Load Balancers).\n Manage datacenter infrastructure, virtualization (Hyper-V, VMware, Azure Stack HCI), and cloud migration.\n Automate provisioning using Terraform, Bicep, and PowerShell.\n Monitor network and cloud performance using Azure Monitor and AI-driven analytics.\n Collaborate with Cloud Architects, Security Engineers, and DevOps teams.\n \nWhat You Bring\n 5+ years in network engineering, cloud networking, and datacenter operations.\n Proficiency in network protocols (TCP/IP, BGP, OSPF, VLAN, VXLAN, MPLS).\n Expertise in Azure networking and security best practices.\n Experience with automation tools (Terraform, Bicep, PowerShell).\n Understanding of Zero Trust Security principles.\n \nBonus Certifications (Not Required)\n Azure Network Engineer Associate, Cisco CCNP/CCIE, Fortinet NSE4, Palo Alto PCNSE, VMware VCP.\n \nWhy Join Us?\n  Strategic Impact – Drive cloud adoption and network transformation.\n  Hybrid/Remote Work – Enjoy flexibility.\n  Career Growth – Access training, certifications, and development opportunities.\n  Tech Leadership – Work with AI-driven automation and security-first architectures.\n  Competitive Package – Strong salary, benefits, and incentives.\n \nApply Now \nIf this sounds like the opportunity you’ve been waiting for, we’d love to hear from you. Apply today and take the first step in joining a team that’s committed to making a difference. Applications are reviewed on a rolling basis, so don’t delay—your next adventure awaits!\nReady to learn more about our journey? Click to hear from our CEO!\nPhilip Isell Lind af Hageby, Consilium, en mästare på turnarounds - Värdeskaparna | En podd om riskkapital av OPX Partners | Podcast on Spotify",
    "url": "https://careers.consiliumsafety.com/jobs/5645903-network-datacenter-engineer?promotion=1371523-arbetsformedlingen",
    "published": "2025-03-06T14:26:38",
    "deadline": "2025-08-23T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29360115",
    "title": "Industrial Engineer - Automation, Simulation, Material",
    "employer": "Sebratec AB",
    "location": "Göteborg",
    "description": "Sebratec is a Software and Engineering company specializing in services for the tech industry. Our mission is to transform companies through software and embedded systems solutions, supporting customers with consultancy in the development of their products, as well as training for teams and individuals interested in technology.\nAre you a team player with a passion for optimization, ready to collaborate with multiple stakeholders and make a difference? Sebratec is looking for Automation, Simulation, Material Flow, and other similar Engineer titles, to join our international team in Sweden.\nKey Skills:\nProject management, timeline tracking, and progress monitoring in material flow and handling engineering.\nDesigning and implementing automation systems for advanced factories and warehouses, including new technology integration.\nCoordinating engineers, project leaders, and vendors to create material flow solutions.\nDefining and contributing to cross-functional Blueprint areas for scalable factory solutions.\nFacilitating cross-functional collaboration with the Company in the battery industry's Digital and Factory Automation teams.\nCollaborating with the Company in the battery industry's final customers on material handling engineering projects, including blueprints.\n\n \nSoft Skills: Show ownership in your tasks, lend an attentive ear to others, and lead by setting a positive example\nYears of Experience: +4\nIf you're a driven and dedicated Engineer ready to take your career to the next level and open to relocation, Sebratec is the place for you\nNext step?\nIf this position sounds interesting to you, click the link to apply, and let's talk! 😊\n #MaterialFlowEngineer #Relocation",
    "url": "https://jobs.sebratec.com/jobs/3220807-material-flow-engineers-for-sebratec",
    "published": "2025-01-07T08:51:02",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29340347",
    "title": "Software Developer",
    "employer": "ZENSEACT AB",
    "location": "Göteborg",
    "description": "Zenseact is an applied automotive AI company developing world-leading safety software for AD and ADAS. Our technology encompasses every aspect of automation, from sensor fusion, computer vision, and object detection to positioning and actuation, using a combination of rule-based code and deep learning algorithms.\nOur software makes a difference.\nUsing AI-based technology to create the ultimate driver support, we’re fighting to end car accidents and make roads safe for everyone. Every year, around 1,4 million people die in traffic while approximately 50 million people get injured. Many get disabled as a result of their injury. We can do better. And we could use your help.\nOne purpose, one product.\nWe’re a software company dedicated to revolutionizing car safety. By designing the complete software stack for autonomous driving and advanced driver-assistance systems, we’re fighting to end car accidents and make roads safe for everyone. That's summarized in our purpose statement: Towards zero. Faster. \nCulture with people at heart\nTo achieve our mission of saving lives and ending traffic accidents is to go where nobody has before. It requires us to venture into the unknown, pioneering new technology and pushing the frontier of autonomous driving. While there’s no denying our determination and expertise, we must stand united to succeed. By fostering a culture of support and enablement – a place of psychological safety where all of us can thrive – everything else will follow. We call this a people-at-heart culture. \nWho are you? \nStrong programming skills within C++, Python, \nAI/Machine Learning/Deep Learning experience.  \nExceptional programming skills with Unity3d, Qt \nKnowledge and experience with OpenCV or OpenGL\nKnowledge of Deep Learning Frameworks like PyTorch or TensorFlow is a plus \nSoftware development experience in one or more general purpose programming languages \nInsight in the automotive industry and knowledge of MISRA C++, ISO26262 and ASIL \nExperience of developing embedded real time applications  \nSolid knowledge of systems engineering/architecture  \nSecure knowledge within continuous integration and deployment \nExperience from defining, building and testing automated toolchains \nExpert in any ADAS/AD feature \nAn enthusiastic person who thrives in an agile working culture \n\nWith the skillset and mindset described you have the chance to contribute to our purpose, to go towards zero. Faster.\nWe are really excited to welcome candidates with these skills so don't hesitate to take the chance of a lifetime! \nWhy join \nWhen we aim for zero accidents faster, we strive to speed up the transition to safe automation. This is essentially achieved by making cars updatable – like a computer or a phone. With regular software updates, a vehicle can be made safer long after its production. By accelerating improvement loops, shortening development cycles, and deploying high-capacity software quickly, we can make cars safer, faster.",
    "url": "https://career.zenseact.com",
    "published": "2024-12-20T10:10:12",
    "deadline": "2025-06-17T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29192430",
    "title": "Senior Software/DevOps Engineer",
    "employer": "Baronit AB",
    "location": "Göteborg",
    "description": "Shaping the Future with Brilliant Minds\nAt Baronit, we connect brilliant minds to shape the future of technology. As a passionate team of tech experts, we lead with innovation, expertise, and curiosity to help businesses grow and adapt to new opportunities. Our experts blend technical excellence, industry insight, and a strong commitment to delivering exceptional results across sectors such as Airline, Fintech, Healthcare, Telecom, E-commerce, and more.\nWe are an IT consultancy company based in Gothenburg looking for an experienced Senior DevOps Engineer to join our client’s team. This role requires a strong foundation in in cloud platforms and DevOps practices. You will collaborate closely with cross-functional teams to deliver scalable, reliable solutions that align with our client’s goals.\nHere's what we’re looking for in an ideal candidate:\nAcademic degree in Computer Science, Engineering, or a related field.\n6+ years of experience in a DevOps, or/and Software Engineering role.\nProven expertise in CI/CD automation using tools like Jenkins, Git, GitOps, Github , GitLab and Gerrit.\nStrong hands-on experience with AWS\nProficiency in Python, Bash/Shell scripting\nExperience with containerization and orchestration tools like Docker and Kubernetes.\nDeep understanding of monitoring and observability using Grafana, Prometheus, ElasticStack\nSolid background in Infrastructure as Code (IaC) with tools like Terraform.\nKnowledge of backend development with Java, JavaScript, and frameworks such as Spring Boot.\nExperience with database technologies such as PostgreSQL, MongoDB, and Redis.\nExpertise in security aspects, especially in CI/CD pipelines and cloud deployments.\nExperience with Agile/Scrum methodologies and working in a fast-paced, collaborative environment.\nExcellent communication and problem-solving skills, with a focus on continuous improvement and innovation.\n\nPreferred Qualifications:\nExposure to Site Reliability Engineering (SRE) principles.\n\nIn addition to exciting projects, we also offer:\nFlexible salary model – choose between a fixed salary or a revenue-based model where you receive X% of your client rate, with full transparency\nTechnical forums for continuous learning and knowledge sharing\nSports and social activities to stay connected and engaged\nAnnual offsite conference for team bonding and inspiration\nAnd above all – a great team spirit and a focus on enjoying the journey together",
    "url": null,
    "published": "2024-10-20T18:16:33",
    "deadline": "2025-06-28T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29746926",
    "title": "Teamlead för affärssystem",
    "employer": "Göteborg Energi AB",
    "location": "Göteborg",
    "description": "Teamlead för affärssystem – ta ägandeskap i en spännande tid! \n\nVill du vara med och forma framtidens energilösningar? Är du en strukturerad ledare med teknisk bredd och vana av att driva IT-förvaltning i nära samarbete med verksamheten? Då kan det här vara rollen för dig! \n\nGöteborg Energi söker nu en teamlead för affärskritiska system inom kundrelation (CRM) och kundinformationssystem (KIS).\r\n\r\nHos oss får du möjlighet att kombinera operativ ledning med strategiskt ansvar i en samhällsviktig och föränderlig bransch.\n\nDin uppgift\nSom teamlead leder och planerar du det dagliga arbetet i ett engagerat team som förvaltar och utvecklar våra kund- och affärssystem. Du är navet mellan IT, verksamhet och externa leverantörer – och ansvarar för att våra lösningar håller hög kvalitet, är långsiktigt hållbara och utvecklas i takt med nya krav. \n\nRollen kombinerar operativ ledning, tekniskt samordningsansvar och administrativa uppgifter. Du säkerställer att systemuppgraderingar, tester och driftsättningar sker på ett tryggt och strukturerat sätt, och du har en nyckelroll i att omsätta verksamhetens behov till effektiva IT-leveranser. \n\nDina huvudsakliga arbetsuppgifter:\n\n - Leda och planera teamets arbete inom CRM och KIS \n - Säkerställa att IT-leveranser möter verksamhetens krav – från behov till driftsättning\n - Samordna systemuppgraderingar, tester och förändringsaktiviteter\n - Vara en beställarkompetent kontaktperson gentemot externa leverantörer\n - Hantera leverantörsfakturor och följa upp pågående avtal och leveranser\n - Starta och delta i projekt, sidouppdrag och förvaltningsarbeten  \n\nDitt team\nGöteborg Energis IT- avdelning levererar och förvaltar IT-tjänster inom koncernen. Avdelningen har ett brett ansvarsområde och är uppdelad i fem enheter som samarbetar med verksamheten för att identifiera behov och leverera systemstöd. Vi deltar i nyutvecklingsprojekt och ansvarar för drift och förvaltning av våra befintliga system. Vi stödjer många olika verksamhetsområden och jobbar med allt från redovisningssystem till GIS och CAD tillämpningar.\n\nDin kompetens\nVi söker dig som har \n\n - Minst 5 års erfarenhet av arbete med CRM och KIS, gärna i energibranschen eller annan komplex miljö\n - Stark teknisk och funktionell förståelse för affärssystem och kunddata\n - Erfarenhet av att leda IT-förvaltning enligt etablerade modeller\n - Beställarkompetens och vana av samarbete med externa leverantörer\n - God förmåga att planera, följa upp och rapportera kring budget, resurser och leveranser\n - Relevant akademisk utbildning, exempelvis inom systemvetenskap, datavetenskap eller motsvarande arbetslivserfarenhet \n\nMeriterande \n\n - Branscherfarenhet från energi, offentlig sektor eller annan reglerad verksamhet\n - Kunskap inom DevOps och automatisering\n - Certifiering inom ITIL och/eller Agila metoder\n - Erfarenhet av arbete med informationssäkerhet och dataskydd, t.ex. GDPR\n - Mycket god förmåga att kommunicera på svenska, både muntligt och skriftligt \n\nDina personliga egenskaper \n\nDu är en ansvarstagande och strukturerad person med god samarbetsförmåga. Du har lätt för att lyssna, förstå och omsätta behov till lösningar – och du trivs i en roll där du får vara både strateg och doer.\n\nDu: \n\n - Är kommunikativ, prestigelös och engagerad\n - Har ett helhetstänk och gillar att driva förbättring\n - Trivs med att leda, skapa förtroende och bygga relationer\n - Har förmågan att få andra att växa och jobba mot gemensamma mål  \n\nUrval kommer att ske löpande och tjänsten kan komma att tillsättas innan sista ansökningsdag, ansök idag och bli en del av vår resa mot ett mer hållbart Göteborg! \n\nGöteborg Energi är en del av Sveriges kritiska infrastruktur och många av våra tjänster är säkerhetsklassade. Är denna tjänst säkerhetsklassad kommer säkerhetsprövning genomföras innan anställning, i enlighet med säkerhetsskyddslagen.\n\n\nVår arbetsplats\n\nGöteborg Energi är ett energibolag som ägs av Göteborgs Stad. Det innebär att vi arbetar för alla göteborgare och med hela staden. Förutom att leverera och utveckla nya lösningar inom energi och stadsfiber för boende, företag och transporter, jobbar vi också för ett större mål – ett hållbart Göteborg. Delar du vår vision och vill vara med oss på resan för att skapa en mer hållbar vardag för göteborgarna? Välkommen till Göteborg Energi!\n\n\nSom anställd hos oss kan du räkna med en arbetsplats som är både spännande och utvecklande. Vi har förmåner som uppmuntrar till ett hållbart arbetsliv. Det ska vara tryggt att jobba med oss. Men det ska kännas roligt också. Hos oss har du goda möjligheter att växa på jobbet och utvecklas inom organisationen. Läs mer om vårt erbjudande på https://www.goteborgenergi.se/om-oss/jobba-med-oss .\n\n\nVi tror på en arbetsplats med mångfald och jämställdhet. Medarbetare med olika erfarenheter utvecklar vår verksamhet! Styrkan i olikheter skapar framgång. Delar du våra värderingar och vill vara med och bidra till en inkluderande arbetsplats? Vi ser fram emot din ansökan!",
    "url": "https://goteborgenergi.varbi.com/what:job/jobID:825712/type:job/where:1/apply:1",
    "published": "2025-06-03T11:09:15",
    "deadline": "2025-06-24T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29740874",
    "title": "Fullstack Engineer",
    "employer": "Ecareer AB",
    "location": null,
    "description": "Har du erfarenhet av modern webbutveckling och trivs i team där samarbete, transparens och ständiga förbättringar står i fokus? Vi på Aveer söker nu en Fullstack Engineer till ett tekniktungt uppdrag inom en internationell produktmiljö.\n\nOm rollenDu kommer att arbeta i ett utvecklingsteam som ansvarar för två produkter – en som hanterar dokumentation av uppkopplade tjänster, och en nyutvecklad lösning för att möta regelverk kopplade till mjukvaruuppdateringar.\nTeamet jobbar agilt och tvärfunktionellt, med gemensamt ansvar för hela livscykeln: från design och utveckling till test, leverans och support. Du får bidra med teknisk kompetens, samtidigt som du är med och formar arbetssätt och tekniska lösningar framåt – inklusive hur AI och automatisering används för att effektivisera utvecklingsflöden.\n\nI rollen kommer du bland annat att: Arbeta med fullstackutveckling i .NET (.NET Core/.NET Framework) och moderna frontendramverk som Angular, React eller Vue\n Bygga och underhålla lösningar i en Azure-miljö, inklusive DevOps-pipelines\n Säkerställa kvalitet och testbarhet genom TDD och kodgranskning\n Samarbeta med arkitekter, produktägare och intressenter i planering och prioritering\n Dela kunskap, bidra till förbättringar och stötta teamets 3rd line-supportansvar\n \n\nVi söker dig som har: Gedigen erfarenhet av webbutveckling och .NET\n Goda kunskaper i JavaScript och något eller flera av Angular, React eller Vue\n Erfarenhet av DevOps och molnlösningar, gärna i Azure\n Intresse för AI och automatisering kopplat till utveckling\n Van att arbeta i agila, tvärfunktionella team\n Engagemang för kvalitet, säkerhet och lärande\n \n\nMeriterande erfarenheter: Testdriven utveckling (TDD)\n Kunskap om AI-ramverk eller automatiseringsverktyg\n Erfarenhet av komplexa eller reglerade systemmiljöer\n \n\nÖvrig information:Placeringsort: Göteborg (delvis distans)",
    "url": "https://jobb.ecareer.se/jobs/5994832-fullstack-engineer?promotion=1493503-arbetsformedlingen",
    "published": "2025-05-30T13:28:13",
    "deadline": "2025-06-30T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  },
  {
    "id": "29653497",
    "title": "People & Culture Administrator",
    "employer": "Piab AB",
    "location": "Kungsbacka",
    "description": "About Piab Group:\nAt Piab Group, we enhance our customers' productivity, sustainability, and safety through evolving industrial automation and have done so since 1951. We believe in an automated world where no resources are wasted, and no humans are injured. With annual sales of ~3 billion SEK and more than 1200 employees, Piab Group is a global organization, serving customers in more than 100 countries from a vast network of subsidiaries and channel partners. Since 2018, Piab Group has been owned by Patricia Industries, part of Investor AB.\nWhat Awaits You at Our Company:\nInnovative Culture: Be part of a team that thrives on entrepreneurship and innovation.\nGlobal Impact: Work with a company that is a world leader in industrial automation.\nGlobal Presence: You will work in a truly global company with employees in more than 27 countries.\nSustainable Vision: Contribute to an automated world, reducing resource waste and promoting safety.\nDiverse and Inclusive: Join a workplace that values diversity and fosters an inclusive environment.\nStable Fast-Growing Employer: As part of Patricia Industries and connected to the Wallenberg family, Piab Group benefits from strong support and a commitment to long-term growth and sustainability.\n\nJob Mission:\nAs a People & Culture Administrator become an integral part of our vibrant team. You'll be instrumental in managing payroll, providing vital administrative support, and maintaining our HR systems, all contributing to our innovative journey in automation.\nKey Responsibilities:\nPayroll management\nAdministrative support in People & Culture processes\nHR system administration and maintenance\nEmployee assistance in employment-related questions\nWork environment coordination\n\nPreferred Competencies:\nBasic HR knowledge\nStrong administration skills - organized and detail-oriented\nGood communication in English and Swedish and relationship-building skills\n\nExperience and Education:\nMinimum 3 years in an HR admin role\n\nThis is what our employees say about us:\n\"Working in a collaborative environment where everyone's voice is valued, that's the #PiabDifference. #Inclusivity #Teamwork\"\n\"At Piab, I have the chance to leave my own footprint. The low hierarchy means my ideas are heard and valued. #LoveWhereIWork\"\nHow to Apply:\nIf you are passionate about innovation and want to make a difference in the world of automation, we would love to hear from you! Click the following link to upload your CV in English. Please be advised that a valid work permit for the country we offer the open vacancy is required for non-EU citizens. Unfortunately, applications without a valid work permit cannot be considered.",
    "url": "https://web103.reachmee.com/ext/I021/1762/job?site=16&lang=UK&validator=e5d372102dedc577725a9256bcd44045&job_id=p511",
    "published": "2025-04-24T12:07:30",
    "deadline": "2025-07-31T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "category": "RPA"
  }
]