[
  {
    "id": "29718852",
    "title": "Automation and AI Architect",
    "employer": "Aleido Sweden AB",
    "location": "Göteborg",
    "description": "We are looking for an innovative and visionary Automation and AI Architect to help shape the future of intelligent solutions at Aleido. This is a role for someone who thrives on solving complex problems through thoughtful design and deep technical expertise - and wants to lead from the front in transforming how our business leverages automation and AI.\nAbout the role\nAs an Automation and AI Architect, you’ll play a critical role in setting the direction for how we design, implement, and scale smart systems across the organization. You’ll be responsible for crafting the architectural blueprint for AI and automation initiatives, aligning cutting-edge technology with real business needs.\n Define and own the architecture for automation and AI solutions across business units.\n Guide the selection, integration, and orchestration of tools, frameworks, and platform - balancing innovation with maintainability and scalability.\n Collaborate with stakeholders to translate strategic business goals into technical designs and long-term roadmaps.\n Establish best practices and governance around the development and deployment of AI/automation solutions.\n Lead technical reviews, mentor engineers, and contribute to fostering a strong engineering and innovation culture.\n Stay ahead of the curve with emerging trends in AI, automation, and software architecture - and apply that insight to continuously evolve our capabilities.\n \nWho you are\nWe believe that you have:\n Proven experience designing and implementing enterprise-level automation and AI architectures.\n Deep understanding of scripting languages (e.g. Python, PowerShell), orchestration tools, and modern AI/ML platforms.\n Strong analytical and systems-thinking mindset, especially for breaking down complexity into elegant, scalable solutions.\n Excellent stakeholder management and communication skills - you can speak the language of both business and technology.\n A proactive, forward-thinking approach to problem solving and continuous improvement.\n \nNice to have:\n Experience with Azure cloud services and AI offerings.\n Familiarity with tools like OpenAI, Azure Cognitive Services, or other LLM providers.\n Knowledge of business process analysis, RPA, or systems integration.\n \nWho we are\nAleido is a Swedish international company with a long heritage of driving the development of aftermarket information and learning solutions. Our customers develop complex products or systems, or seek knowledge and confidence to create lasting change, within a wide range of industries including automotive, telecom, advanced machinery, rail and medtech. We are almost a thousand colleagues in five countries. Together we bridge the gap between technology and the people who depend on it – by making the advanced simply understood.\nYou’ll be joining a passionate, forward-thinking team that’s actively shaping the future of AI and automation at Aleido. If you’re excited about designing impactful solutions and influencing strategic tech direction, we’d love to hear from you.",
    "url": "https://work-sv.aleido.com/jobs/5930620-automation-and-ai-architect?promotion=1479483-arbetsformedlingen",
    "published": "2025-05-21T09:18:43",
    "deadline": "2025-11-07T23:59:59",
    "is_consultant": false,
    "is_meaningful": true,
    "source": "JobTech",
    "relevance_score": 0.5068181818181818,
    "category": "RPA"
  },
  {
    "id": "29736157",
    "title": "Head of Discipline - Electrical & Automation",
    "employer": "Cowi AB",
    "location": "Göteborg",
    "description": "Head of Discipline – Electrical & Automation Gothenburg\nDo you want to help shape the industrial solutions of tomorrow? Are you a dedicated leader with technical expertise in electrical engineering and automation? If so, this could be your next career step. We are now looking for a Head of Discipline for Electrical & Automation – someone who wants to combine inspiring leadership with cutting-edge engineering within Swedish industry.\nWelcome to Electrical & Automation in Gothenburg\nOur Electrical & Automation department consists of around 30 dedicated colleagues. We frequently work in multidisciplinary projects where we are responsible for delivering comprehensive solutions – from low voltage to high voltage and advanced automation systems. Our clients include companies in the process industry, the automotive sector, municipal utilities, and infrastructure. Together, we contribute to the green transition and a more sustainable future.\nLead the Way in Electrical and Automation Engineering\nAs Team Manager, you will play a key role in our continued growth. You will lead, coach, and develop a group of skilled engineers specialising in electrical and automation systems. Together, you will work on exciting industrial projects, supporting our clients in their digital transformation and sustainability journeys.\nYou are a natural leader who thrives on building strong teams, developing people, and delivering high-quality results. The role combines strategic responsibility with hands-on project involvement, where you contribute directly to our client projects through your own assignments.\nYour Key Responsibilities:\nLead and coach employees in their day-to-day work and long-term professional development\nEnsure team engagement, high utilisation, and ongoing competence development\nRecruit new team members as the team continues to grow\nDrive and contribute to client projects with a focus on technical excellence\nAct as a technical role model and contribute to methodology and quality assurance\nDevelop team goals and strategies in close collaboration with the business development organisation\nParticipate in strategic marketing initiatives and contribute to the overall success of the department\n\nWho We Believe You Are\nYou are a confident and attentive leader with a passion for both technology and people. You have the ability to identify and nurture potential, and you foster a culture where performance, wellbeing, and development go hand in hand. You are eager to contribute to the business while building strong, long-term relationships – both internally and with clients.\nTo Succeed in This Role, We Believe You Have:\nA relevant technical degree (minimum BSc) in electrical engineering, automation, or a related field\nAt least five years of industry experience in electrical and/or automation engineering – preferably from consultancy, plant operations, or contracting\nProven leadership experience, either as a team manager, project manager, or technical lead\nA strong interest in and motivation for developing and leading others\nFluency in both spoken and written Swedish and English\n\nWhat Can We Offer You?\nAt COWI, our people are our most valuable asset. We offer a working environment where you can grow as a leader alongside some of the most skilled professionals in the industry. You will benefit from:\nA clear personal development plan, defined together with your manager\nOpportunities to work on both local and international projects\nA collaborative culture focused on knowledge sharing and openness\nAccess to a strong internal network within electrical and automation engineering\nThe opportunity to influence both technical direction and business development\n\nReady to Take the Next Step?\nWe look forward to hearing from you. This is your opportunity to make a real difference – as a leader, technical expert, and colleague. Welcome to COWI.\nDo You Have Any Questions?\nFeel free to contact:\nJennica Lindén, Head of Engineering Industry and Energy – jeiv@cowi.com\nGoce Kostovski, Global Talent Acquisition Specialist – goko@cowi.com\nGet to Know Us Better\nVisit www.cowi.com to explore our projects, our global strategy, and what it’s like to work at COWI.\nWe look forward to your application!",
    "url": "https://www.cowi.com/your-career/open-vacancies/?country=Sweden&page=0",
    "published": "2025-05-28T09:46:33",
    "deadline": "2025-07-04T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.5068181818181818,
    "category": "RPA"
  },
  {
    "id": "29538199",
    "title": "Projektledare inom processindustri - NEVITA",
    "employer": "Nevita AB",
    "location": "Göteborg",
    "description": "Vilka är vi? Vi är ett ingenjörsbolag beläget i centrala Göteborg, i takt med omvandlingen mot ett hållbart samhälle levererar vi spetskompetens till globala och välkända kunder inom processindustrin. Här blir du del av ett härligt gäng som gärna delar med sig av sin kunskap och stöttar varandra. Samtidigt erbjuder vi mycket internt ansvar, i och med tillväxten av vår interna projektavdelning. Vi jobbar ofta i långsiktiga och avancerade projekt inom processindustri, marine/offshore och hållbarhet. Att utvecklas inom sitt område är viktigt för både dig och NEVITA - redan vid start sätter vi en plan för dina karriärsmål så att dessa går i linje med dina uppdrag och åtaganden. \nDin roll Du blir del av NEVITAs team som jobbar med projektledning och delprojektledning för disciplinerna process, automation, civil, rör och mek. Som projektledare får du möjlighet att arbeta tillsammans med de främsta kundföretagen inom svensk processindustri. Vi har en uttalad strategi att driva egna EPC-projekt inhouse. Majoriteten av projekten är långa och utförs tillsammans med våra övriga discipliner. I rollen ges du också möjlighet att delta i avdelningens förbättringsarbete och utveckla NEVITAs affärsrelationer.\nVem är du? För denna roll är det viktigt att du har tidigare erfarenheter från processindustrin, vi ser gärna också att du har dokumenterad erfarenhet av projektledning från större projekt. Som person har du goda ledaregenskaper samt trivs i en miljö där man leder, coachar och utvecklar grupper. Du är social, prestigelös och har ett stort intresse för att skapa affärer. Erfarenhet av procurement eller contracting är starkt meriterande.\nSom arbetsgivare\n Friskvårdsbidrag, tjänstepension och generös kompetensutveckling.\n Flexibla tillvalsförmåner.\n Friskvårdsaktiviteter under arbetstid.\n Stående interndagar med gemensam frukost och valfri sportaktivitet.\n \nIntresserad? Intervjuer och urval sker löpande! Vid frågor om tjänsten är du välkommen att kontakta HR Sanela Filipovic, sanela.filipovic@nevita.se",
    "url": "https://nevita.teamtailor.com/jobs/309951-projektledare-inom-processindustri-nevita?promotion=1380793-arbetsformedlingen",
    "published": "2025-03-12T16:19:31",
    "deadline": "2025-08-29T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.5,
    "category": "RPA"
  },
  {
    "id": "29766198",
    "title": "Laboratory Automation Specialist (Data & Workflows)",
    "employer": "Astrazeneca AB",
    "location": "Göteborg",
    "description": "We are looking for an experienced Laboratory Automation Specialist (Data & Workflows) to join our team. In this key role, you will contribute to the advancement of our automated compound synthesis platform. If you are enthusiastic about enhancing laboratory workflows through automation and data-driven approaches, this is a unique opportunity to make a meaningful difference in accelerating drug discovery.\n\nIn this exciting role, you will be joining our Chemistry Automation team (iLAB) at AstraZeneca's state-of-the-art facility in Gothenburg, Sweden, where scientific excellence meets technological innovation. As part of the Compound Synthesis & Management department, we are dedicated to pushing the boundaries of drug discovery by harnessing advanced automation, data-driven solutions, and pioneering AI.\n\nHere, you'll be immersed in an environment that thrives on collaboration and creativity, focused on accelerating the synthesis and processing of chemical compounds for biological testing. Our bold ambition is to set new industry standards, leading the way in laboratory automation and seamlessly integrating cutting-edge technologies into every step of the drug discovery journey.\n\nIn this team, your expertise will directly shape how we transform automated workflows and intelligent data handling - driving efficient, high-impact research that brings breakthrough medicines closer to patients around the world.\n\n \n\nAbout the Role\n\nAs a Laboratory Automation Specialist (Data & Workflows), you will play a crucial part in developing, scripting, and managing automated laboratory workflows. Your expertise will empower our scientists to generate high-quality data more efficiently, supporting our mission to deliver life-changing medicines faster.\n\n \n\nKey Responsibilities: \n\n * \n\nCollaborate with scientists, automation engineers, and IT professionals to design, implement, and optimize automated laboratory workflows.\n * \n\nWrite, maintain, and troubleshoot scripts and scheduling routines for laboratory automation platforms.\n * \n\nEvaluate, integrate, and optimize laboratory scheduling and orchestration software within scientific workflows.\n * \n\nApply data science principles to analyse laboratory data, generate insights, and enhance process efficiency.\n * \n\nTrain users and provide technical support for automation software and workflow solutions.\n * \n\nDocument automation protocols, workflows, and data pipelines clearly and comprehensively.\n * \n\nStay up to date with advances in laboratory automation, data science tools, and workflow management practices.​\n\n \n\nEssential Skills/Experience: \n\n * \n\nDegree in a natural science (e.g., chemistry, biology, pharmacology) or a closely related field.\n * \n\nPractical experience with data science concepts and methods.\n * \n\nProven experience scripting for laboratory automation workflows (e.g., Python, R, C#, SQL, or relevant automation languages).\n * \n\nHands-on knowledge of laboratory scheduling/orchestration software (such as HighRes Cellario, Biosero Green Button Go, Automata LINQ, or equivalent).\n * \n\nStrong analytical skills with the ability to translate scientific requirements into automated solutions.\n * \n\nExcellent problem-solving and communication skills; able to work effectively within a multidisciplinary team.\n * \n\nExperience in laboratory automation or informatics is highly desirable.\n\n \n\nWhat We Offer \n\n * \n\nCompetitive salary and benefits package. \n * \n\nOpportunity to work in a multinational environment with a diverse team. \n * \n\nA culture that promotes work-life balance and employee well-being. \n * \n\nCareer development opportunities across AstraZeneca. \n * \n\nThe chance to contribute to the development of life-changing medicines. \n\n \n\nWhy AstraZeneca? \n\nJoin a team unlocking the power of science to treat, prevent, and potentially cure some of the world's most complex diseases. Grow your career in an inclusive environment where curiosity, collaboration, and scientific excellence are valued every day. \n\n \n\nSo, what's next?  \n\nIf this sounds like your next challenge, apply today! \nApplications are welcomed until June 26th, 2025. \n\nPlease note that applications must include your current CV, and a covering letter which presents your key areas of strength and why you should be considered for the role.",
    "url": "https://www.aplitrak.com/?adid=bWFyaWEuZWxtYmVyZy41MTYwNi4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
    "published": "2025-06-12T11:07:20",
    "deadline": "2025-06-26T23:59:59",
    "is_consultant": false,
    "is_meaningful": false,
    "source": "JobTech",
    "relevance_score": 0.5,
    "category": "RPA"
  }
]