[
    {
        "id": "29958114",
        "title": "Assoc. Principal Scientist Process Modeling & Model Governance",
        "employer": "Astrazeneca AB",
        "location": "Göteborg",
        "description": "At AstraZeneca, we are committed to leading the way in turning scientific innovations into medicines that transform lives.\n\n \n\nPharmaceutical Technology and Development (PT&D) is the organization that turns brilliant science into actual medicines that help millions of people. We work across the entire value chain, designing and delivering active ingredients, formulations and devices for new medicines and providing expert technical support to all AstraZeneca's commercial drug substances and products to ensure we successfully supply medicines to patients.\n\n \n\nOur Digital Science team, a part of Pharmaceutical Technology and Development, is at the forefront of digital strategy and innovation. We are seeking an Associate Principal Scientist with expertise process modeling and an interest in model governance to join our strategic global team.\n\n \n\nResponsibilities\nIn this dual-focused role, you will combine your expertise in process modeling with model governance to ensure that our modeling frameworks meet the required quality standards. You will work with project teams, process engineers, mathematicians, chemists, pharmacists, materials and data scientists as well as analytical and artificial intelligence experts, to ensure that models are being correctly applied in drug projects.\n\n \n\nYour responsibilities include:\n\n * Supporting development and deployment of modeling and simulation tools and championing digital transformation by integrating advanced modeling tools and governance practices.\n * Overseeing model lifecycle management to ensure models are maintained, updated, and retired in accordance with evolving business needs and compliance standards.\n * Supporting the development and implementation of model governance frameworks to ensure consistency with internal and external quality standards.\n * Collaborating with subject matter experts and cross-functional teams to establish best practices for governance protocols, adopt governance protocols and providing necessary support for implementation.\n * Designing and delivering training programs to equip model developers and users with the understanding and practical skills for implementing model governance frameworks effectively.\n * Keeping abreast with global developments in your area by attending conferences, workshops, webinars and being an active member of relevant networks and working groups.\n\n \n\nEssential Requirements\n\n * A robust scientific background with a PhD or MSc or equivalent experience in chemical engineering, physics, mathematics or related subject area.\n * Experience in developing mechanistic modeling and simulation tools for problem solving and deploying those to a wider community of users.\n * Skills in programming or scripting languages such as Python or Matlab for developing modeling solutions.\n * Understanding and interest in developing and implementing standards and governance frameworks that ensure model quality and consistency.\n * Excellent interpersonal and communication skills, with a proven ability to collaborate with cross-functional teams\n * Cultural awareness\n\n \n\nDesirable Requirements\n\n * Understanding of regulatory standards related to model governance in the pharmaceutical or other regulated industry and experience in model governance.\n * Familiarity with advanced simulation tools like gPROMS, Aspen, or ANSYS Fluent/CFX and their application in process modeling.\n\n \n\nAt AstraZeneca, we're dedicated to being a Great Place to Work. We are united by our shared purpose - to push the boundaries of science to deliver life-changing medicines. We come to work each day to make a difference - to patients, society, and our company. Our workforce reflects the people we serve - diversity is embedded in everything we do. We're at our best when drawing on our different views, experiences, and strengths. We are forever connecting, collaborating, innovating, and learning. \n\n \n\nWhen we put unexpected teams in the same room, we unleash bold thinking with the power to inspire life-changing medicines. In-person working gives us the platform we need to connect, work at pace and challenge perceptions. That's why we work, on average, a minimum of three days per week from the office. We balance the expectation of being in the office while respecting individual flexibility. \n\n \n\nJoin us in this exciting opportunity! Apply with your CV and cover letter no later than September 8th 2025.",
        "url": "https://www.aplitrak.com/?adid=Z2FsaWEubnlzdHJvbS41NDAyMy4zMTAxQGFzdHJhemVuZWNhLmFwbGl0cmFrLmNvbQ",
        "published": "2025-08-27T18:12:55",
        "deadline": "2025-09-06T23:59:59",
        "is_consultant": false,
        "is_meaningful": false,
        "source": "JobTech",
        "category": "RPA",
        "relevance_score": 80
    }
]